#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Отказ = ЕстьУпаковка();
	КонецЕсли;
	
	Если Отказ Тогда
		ТекстСообщения = СтрШаблон("Упаковка номенклатуры с единицей <%1> и коэффициентом <%2> уже существует
						 |Необходимо выбрать другую единицу измерения или коэффициент", ЕдиницаИзмерения, Коэффициент); 
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Функция ЕстьУпаковка() 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпаковкиНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|ГДЕ
	|	УпаковкиНоменклатуры.Владелец = &Владелец
	|	И УпаковкиНоменклатуры.ЕдиницаИзмерения = &ЕдиницаИзмерения
	|	И УпаковкиНоменклатуры.Коэффициент = &Коэффициент";
	Запрос.УстановитьПараметр("Владелец"		, Владелец);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("Коэффициент"		, Коэффициент);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции  

#КонецЕсли