
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтавкаНДС = УчетНДСКлиентСервер.ОбщаяСтавкаНДС(Параметры.КонецПериода);
	
	НДСПоОстаткам.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресНДСПоОстаткам));
	
	СписокДействий = СписокДействий();
	Для Каждого ЭлементСписка Из СписокДействий Цикл 
		ЗаполнитьЗначенияСвойств(Элементы.ЧтоСделать.СписокВыбора.Добавить(), ЭлементСписка);
	КонецЦикла;
	
	ЧтоСделать = Элементы.ЧтоСделать.СписокВыбора[0].Значение;
	ОтображениеПолейЧтоСделать();
	ЗаполнитьСписокиВыбора();
	ЗаполнитьПартии(); 
	УстановитьСвойстваПолей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если БылиИзменения Тогда 
		Оповестить("ПодготовкаКВычетуНДСГрупповоеИзменениеРеквизитов", АдресНДСПоОстаткамВоВовременномХранилище());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	ЗаполнитьПартии();
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	ЗаполнитьПартии();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ЗаполнитьПартии();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ЗаполнитьПартии();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	
	ЗаполнитьПартии();
	
КонецПроцедуры

&НаКлиенте
Процедура ЧтоСделатьПриИзменении(Элемент)
	
	ОтображениеПолейЧтоСделать();
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	ОтображениеПолейЧтоСделать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьГрупповоеИзменение(Команда)
	
	ВыполнитьГрупповоеИзменениеНаСервере(); 
	Элементы.Выполнить.Доступность	= Ложь;
	ЗаполнитьПартии();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидимостьПодсказок(Команда)
	
	ИзменитьВидимостьПодсказокНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьВидимостьПодсказокНаСервере()
	
	НаименованиеРаздела = УправлениеПанельюПодсказкиКлиентСервер.НаименованиеОткрытогоРаздела(ЭтотОбъект);
	
	Если Элементы.ИзменитьВидимостьПодсказок.Пометка Тогда
		
		Состояние = Ложь;
		Элементы.ИзменитьВидимостьПодсказок.Картинка = БиблиотекаКартинок.СтрелкаВлево;
		УправлениеПанельюПодсказкиКлиентСервер.ЗаписатьОперациюБизнесСтатистики(
		СтрШаблон("%1.ЗакрытиеФормы", НаименованиеРаздела));
		
	Иначе
		
		Состояние = Истина;
		Элементы.ИзменитьВидимостьПодсказок.Картинка = БиблиотекаКартинок.СтрелкаВправо;
		УправлениеПанельюПодсказкиКлиентСервер.ЗаписатьОперациюБизнесСтатистики(
		СтрШаблон("%1.ОткрытиеФормы", НаименованиеРаздела));
		
	КонецЕсли;
	
	Элементы.ИзменитьВидимостьПодсказок.Пометка = Состояние;
	Элементы.ПанельПодсказки.Видимость = Состояние;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СписокДействий()
	
	СписокДействий = Новый СписокЗначений;  
	
	СписокДействий.Добавить("ЗаполнитьДатуИНомерСчетаФактуры", 
	"Дату и номер счета-фактуры по дате вх. и номеру вх.", Ложь);
	СписокДействий.Добавить("ЗаполнитьДатуСчетаФактуры", 
	"Дату счета-фактуры по дате вх.", Ложь);
	СписокДействий.Добавить("ЗаполнитьСтавкуНДСВоВсехСтроках", 
	"Ставку НДС по всем остаткам", Истина);
	СписокДействий.Добавить("ЗаполнитьСтавкуНДСВоВсехСтрокахДляБезНДС", 
	"Ставку НДС по всем остаткам с установленной ставкой ""Без НДС""", Истина);
	
	Возврат СписокДействий;
	
КонецФункции

&НаСервере
Процедура ОтображениеПолейЧтоСделать()
	
	Элементы.СтавкаНДС.Видимость = Ложь;
	
	Если ЧтоСделать = "" Тогда 
		Возврат
	КонецЕсли;
	
	ЗначениеВыбора = СписокДействий.НайтиПоЗначению(ЧтоСделать);
	
	Если ЗначениеВыбора = Неопределено Тогда 
		Возврат
	КонецЕсли;
	
	Элементы.СтавкаНДС.Видимость = ЗначениеВыбора.Пометка;
	Элементы.Выполнить.Доступность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокиВыбора() 
	
	ТЗНДСПоОстаткам = НДСПоОстаткам.Выгрузить();
	
	СтрокиДозаполнить = ТЗНДСПоОстаткам.НайтиСтроки(ОтборНеХватаетДанныхДляВычета());
	КопияДозаполнить = ТЗНДСПоОстаткам.Скопировать(СтрокиДозаполнить, "Подразделение, Контрагент, ДоговорКонтрагента");
	
	Элементы.Подразделение.СписокВыбора.ЗагрузитьЗначения(МассивПоКолонке(КопияДозаполнить, "Подразделение"));
	Элементы.Контрагент.СписокВыбора.ЗагрузитьЗначения(МассивПоКолонке(КопияДозаполнить, "Контрагент"));
	Элементы.ДоговорКонтрагента.СписокВыбора.ЗагрузитьЗначения(МассивПоКолонке(КопияДозаполнить, "ДоговорКонтрагента"));
	
	Элементы.Подразделение.Видимость = Элементы.Подразделение.СписокВыбора.Количество() > 1;
	Элементы.Контрагент.Видимость = Элементы.Контрагент.СписокВыбора.Количество() > 1;
	Элементы.ДоговорКонтрагента.Видимость = Элементы.ДоговорКонтрагента.СписокВыбора.Количество() > 1;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтборНеХватаетДанныхДляВычета()
	
	Возврат	Новый Структура("Группа, Статус", "НеХватаетДанныхДляВычета", "Не подготовлен к вычету");
	
КонецФункции

&НаСервереБезКонтекста
Функция МассивПоКолонке(ТаблицаЗначений, ИмяКолонки)
	
	КопияСКолонкой = ТаблицаЗначений.Скопировать(, ИмяКолонки);
	КопияСКолонкой.Свернуть(ИмяКолонки);
	Массив = КопияСКолонкой.ВыгрузитьКолонку(ИмяКолонки);
	ИндексМассива = 0;
	Для Каждого ЭлементМассива Из Массив Цикл 
		Если НЕ ЗначениеЗаполнено(ЭлементМассива) Тогда 
			Массив.Удалить(ИндексМассива);
			Прервать;
		КонецЕсли;
		ИндексМассива = ИндексМассива + 1;
	КонецЦикла;
	
	Возврат Массив
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПартии()
	
	ОтображениеПолейЧтоСделать();
	
	Партии.Очистить();
	
	КолонкиПартий = КолонкиПартий();
	СтрокиДозаполнить = НДСПоОстаткам.НайтиСтроки(ОтборНеХватаетДанныхДляВычета());
	ТЗПартии = НДСПоОстаткам.Выгрузить(СтрокиДозаполнить, КолонкиПартий.Все);
	ТЗПартии.Свернуть(КолонкиПартий.КолонкиГруппировки, КолонкиПартий.КолонкиСуммирования);
	
	Если ТЗПартии.Количество() = 0 Тогда 
		Возврат
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("НачалоПериода", НачалоПериода);
	ПараметрыОтбора.Вставить("КонецПериода", КонецПериода);
	ПараметрыОтбора.Вставить("Контрагент", Контрагент);
	ПараметрыОтбора.Вставить("ДоговорКонтрагента", ДоговорКонтрагента);
	ПараметрыОтбора.Вставить("Подразделение", Подразделение);
	
	СтрокаПараметов = "";
	Запрос = Новый Запрос;
	Для Каждого Параметр Из ПараметрыОтбора Цикл 
		Если ЗначениеЗаполнено(Параметр.Значение) Тогда 
			Если Параметр.Ключ = "НачалоПериода" Тогда 
				Шаблон = "%1 И ВТПартии.Дата >= &%2";
			ИначеЕсли Параметр.Ключ = "КонецПериода" Тогда 
				Шаблон = "%1 И ВТПартии.Дата <= &%2";
			Иначе 
				Шаблон = "%1 И ВТПартии.%2 = &%2";
			КонецЕсли;
			СтрокаПараметов = СтрШаблон(Шаблон, СтрокаПараметов, Параметр.Ключ);
			
			Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокаПараметов = "" Тогда 
		Партии.Загрузить(ТЗПартии);
		Возврат
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТЗПартии", ТЗПартии);
	Запрос.Текст = СтрШаблон("%1 %2", ТекстЗапросаПартии(ТЗПартии), СтрокаПараметов);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Возврат
	КонецЕсли;
	Партии.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КолонкиПартий()
	КолонкиПартий = Новый Структура;
	
	КолонкиГруппировки = "Партия, 
	|Контрагент, 
	|ДокументПоступления, 
	|СчетФактура, 
	|СчетФактураДатаВх, 
	|СчетФактураНомерВх, 
	|ДатаВх, 
	|НомерВх, 
	|СуммаВключаетНДС, 
	|НДСВключенВСтоимость, 
	|Дата, 
	|Номер, 
	|ДоговорКонтрагента, 
	|Подразделение, 
	|СуммаДокумента";
	
	КолонкиСуммирования = "СуммаБезНДС, 
	|СуммаНДС, 
	|Всего, 
	|РасходУСН, 
	|УчтенныйНДС";
	
	КолонкиПартий.Вставить("КолонкиГруппировки", КолонкиГруппировки);
	КолонкиПартий.Вставить("КолонкиСуммирования", КолонкиСуммирования);
	КолонкиПартий.Вставить("Все", СтрШаблон("%1, %2", КолонкиГруппировки, КолонкиСуммирования));
	
	Возврат КолонкиПартий;
КонецФункции    

&НаСервереБезКонтекста
Функция ТекстЗапросаПартии(Знач ТЗПартии)
	
	ПоляЗапроса = "";
	Для Каждого КолонкаТЗПартии Из ТЗПартии.Колонки Цикл 
		ПоляЗапроса = СтрШаблон("%1 ТЗПартии.%2 КАК %2, ", ПоляЗапроса, КолонкаТЗПартии.Имя);
	КонецЦикла;
	
	ПоляЗапроса = Лев(ПоляЗапроса, СтрДлина(ПоляЗапроса) - 2);
	
	ТекстЗапроса = СтрШаблон("ВЫБРАТЬ
	|	%1
	|ПОМЕСТИТЬ ВТПартии
	|ИЗ 
	|	&ТЗПартии КАК ТЗПартии
	|; 
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	%2
	|ИЗ 
	|	ВТПартии КАК ВТПартии
	|ГДЕ
	|	ИСТИНА", ПоляЗапроса, СтрЗаменить(ПоляЗапроса, "ТЗПартии", "ВТПартии"));
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура УстановитьСвойстваПолей()
	
	СписокТолькоОткрытие = "ПартииПартия, 
	|ПартииКонтрагент, 
	|ПартииДоговорКонтрагента, 
	|ПартииПодразделение";
	
	СписокТолькоПросмотр = "ПартииСчетФактураДатаВх, 
	|ПартииСчетФактураНомерВх, 
	|ПартииРеквизитыСчетаФактуры, 
	|ПартииСуммаДокумента, 
	|ПартииСуммаНДС, 
	|ПартииДатаВх, 
	|ПартииНомерВх, 
	|ПартииДата, 
	|ПартииНомер, 
	|ПартииКомментарий";
	
	Обработки.ПодготовкаКВычетуНДСУчтенногоВСтоимости.УстановитьСвойстваПолей(Элементы,
		СписокТолькоОткрытие, СписокТолькоПросмотр);
	
КонецПроцедуры

&НаСервере
Функция АдресНДСПоОстаткамВоВовременномХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(НДСПоОстаткам.Выгрузить());
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДатуИНомерСчетаФактуры(ОперацияВыполнена, Знач ЗаполнитьДату = Истина, Знач ЗаполнитьНомер = Истина)
	
	ПараметрыОтбора = ОтборНеХватаетДанныхДляВычета();
	Для Каждого СтрокаПартии Из Партии Цикл 
		ЗаполнитьДатуВСтроке = ЗаполнитьДату И СтрокаПартии.СчетФактураДатаВх = Дата("00010101");
		ЗаполнитьНомерВСтроке = ЗаполнитьНомер И СтрокаПартии.СчетФактураНомерВх = "";
		
		Если ЗаполнитьДатуВСтроке ИЛИ ЗаполнитьНомерВСтроке Тогда 
			ПараметрыОтбора.Вставить("Партия", СтрокаПартии.Партия);
			СтрокиПоПартии = НДСПоОстаткам.НайтиСтроки(ПараметрыОтбора);
			Для Каждого СтрокаНДСПоОстаткам Из СтрокиПоПартии Цикл 
				Если ЗаполнитьДатуВСтроке Тогда 
					СтрокаНДСПоОстаткам.СчетФактураДатаВх = СтрокаНДСПоОстаткам.ДатаВх;
				КонецЕсли;
				Если ЗаполнитьНомерВСтроке Тогда 
					СтрокаНДСПоОстаткам.СчетФактураНомерВх = СтрокаНДСПоОстаткам.НомерВх;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ОперацияВыполнена = Истина;
	
КонецПроцедуры

&НаСервере
Функция ЗаполненаСтавкаНДС()
	Если ЗначениеЗаполнено(СтавкаНДС) Тогда 
		Возврат Истина;
	Иначе 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнена ставка НДС";
		Сообщение.Поле = "СтавкаНДС";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтавкуНДСВСтроках(ОперацияВыполнена, Знач СтавкиЗамены = Неопределено)
	
	Для Каждого СтрокаПартии Из Партии Цикл
		ЗаполнитьНДСВСтрокахПоПартии(СтрокаПартии.Партия, СтавкиЗамены);
	КонецЦикла;
	
	ОперацияВыполнена = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНДСВСтрокахПоПартии(Партия, СтавкиЗамены = Неопределено)
	
	ПараметрыОтбора = Новый Структура("Партия", Партия);
	СтрокиПоПартии = НДСПоОстаткам.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаНДСПоОстаткам Из СтрокиПоПартии Цикл 
		Если СтрокаНДСПоОстаткам.СтавкаНДС <> СтавкаНДС И 
			(СтавкиЗамены = Неопределено ИЛИ 
			(СтавкиЗамены <> Неопределено И СтавкиЗамены.Найти(СтрокаНДСПоОстаткам.СтавкаНДС) <> Неопределено)) Тогда
				СтрокаНДСПоОстаткам.СтавкаНДС = СтавкаНДС;
				СтрокаНДСПоОстаткам.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(СтрокаНДСПоОстаткам.Всего, Истина, 
					УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтавкаНДС));
				СтрокаНДСПоОстаткам.СуммаБезНДС = СтрокаНДСПоОстаткам.Всего - СтрокаНДСПоОстаткам.СуммаНДС;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьГрупповоеИзменениеНаСервере()
	
	Если ЧтоСделать = "ЗаполнитьДатуИНомерСчетаФактуры" Тогда
		ЗаполнитьДатуИНомерСчетаФактуры(БылиИзменения);
	ИначеЕсли ЧтоСделать = "ЗаполнитьДатуСчетаФактуры" Тогда
		ЗаполнитьДатуИНомерСчетаФактуры(БылиИзменения, , Ложь);
	ИначеЕсли ЧтоСделать = "ЗаполнитьСтавкуНДСВоВсехСтроках" И ЗаполненаСтавкаНДС() Тогда
		ЗаполнитьСтавкуНДСВСтроках(БылиИзменения);
	ИначеЕсли ЧтоСделать = "ЗаполнитьСтавкуНДСВоВсехСтрокахДляБезНДС" И ЗаполненаСтавкаНДС() Тогда
		СтавкиЗамены  = Новый Массив;
		СтавкиЗамены.Добавить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС"));
		ЗаполнитьСтавкуНДСВСтроках(БылиИзменения, СтавкиЗамены);
	ИначеЕсли ЧтоСделать = "ЗаполнитьСтавкуНДСВоВсехСтрокахДляНДС0" И ЗаполненаСтавкаНДС() Тогда
		СтавкиЗамены  = Новый Массив;
		СтавкиЗамены.Добавить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС"));
		СтавкиЗамены.Добавить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0"));
		ЗаполнитьСтавкуНДСВСтроках(БылиИзменения, СтавкиЗамены);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

























