
#Область СлужебныйПрограммныйИнтерфейс

Функция ПоказатьПредупреждениеОРеквизитахСчета(Форма, Организация) Экспорт
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если ЗначениеЗаполнено(Организация)
		И НЕ Форма.ИспользоватьНесколькоБанковскихСчетовОрганизации
		И НЕ Форма.ОсновнойБанковскийСчетОрганизацииЗаполнен Тогда
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Процедура УстановитьВидимостьПредупрежденияОДатеПрисвоенияОГРНИП(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	УстановитьСообщениеУкажитеДатуПрисвоенияОГРНИП(Элементы);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
	 	"ПредупреждениеОЗаполненииДатыПрисвоенияОГРНИП",
	 	"Видимость",
	 	ПроверкаРеквизитовОрганизацииВызовСервера.НужноЗаполнитьДатуПрисвоенияОГРНИП(Объект.Организация));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьСообщениеУкажитеДатуПрисвоенияОГРНИП(Элементы)
	
	ТекстСообщения = Новый ФорматированнаяСтрока(
		НСтр("ru = 'Укажите дату присвоения ОГРНИП в'"), " ",
		Новый ФорматированнаяСтрока(НСтр("ru = 'реквизитах организации'"),,,,"ДатаПрисвоенияОГРНИП"));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
	 	"ДекорацияДатаПрисвоенияОГРНИПСсылка", "Заголовок", ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти