#Область ОписаниеПеременных

&НаКлиенте
Перем ОткрытыеФормы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоПросмотрНастройкиYclients = ПравоДоступа("Просмотр",
		Метаданные.РегистрыСведений.НастройкиYclients);
	ЕстьПравоПросмотрНастройкиBNovo = ПравоДоступа("Просмотр",
		Метаданные.РегистрыСведений.НастройкиИнтеграцииBnovo);
	ЕстьПравоИспользованиеСервисДоставки = ПравоДоступа("Использование",
		Метаданные.Обработки.СервисДоставки);
		
	Элементы.ЗагрузкаПродажBNovo.Видимость       = ЕстьПравоПросмотрНастройкиBNovo;
	Элементы.ЗагрузкаПродажYclients.Видимость    = ЕстьПравоПросмотрНастройкиYclients;
	Элементы.СписокЗаказов1ССДЭК.Видимость       = ЕстьПравоИспользованиеСервисДоставки;
	Элементы.СписокЗаказовДеловыеЛинии.Видимость = ЕстьПравоИспользованиеСервисДоставки;
		
	МобильныйКлиентАдаптацияФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузкаПродажBNovo(Команда)
	ПараметрыФормы = Новый Структура("ПоказыватьКомандыЗагрузки", Истина);
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("РегистрСведений.НастройкиИнтеграцииBnovo.ФормаСписка",
		ЭтотОбъект, ПараметрыФормы, , ОткрытыеФормы);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаПродажYclients(Команда)
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("РегистрСведений.НастройкиYclients.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовДеловыеЛинии(Команда)
	
	ПараметрыФормы = СервисДоставкиКлиент.НовыйПараметрыОткрытьФормуСервисаДоставки();
	ПараметрыФормы.ИмяФормы = "СписокЗаказов";
	ПараметрыФормы.ТипГрузоперевозки = 1;
	
	СервисДоставкиКлиент.ОткрытьФормуСервисаДоставки(ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказов1ССДЭК(Команда)
	
	ПараметрыФормы = СервисДоставкиКлиент.НовыйПараметрыОткрытьФормуСервисаДоставки();
	ПараметрыФормы.ИмяФормы = "СписокЗаказов";
	ПараметрыФормы.ТипГрузоперевозки = 4;
	
	СервисДоставкиКлиент.ОткрытьФормуСервисаДоставки(ПараметрыФормы);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанели(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
#КонецОбласти

