#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает значение перечисления, соответствующее идентификатору платформы Самозанятые
//
// Параметры:
//  Идентификатор - Строка - возможные идентификаторы см. ИдентификаторыПлатформыСамозанятые()
//
// Возвращаемое значение:
//  - ПеречислениеСсылка.СтатусыОповещенийПлатформыСамозанятые
//  - Неопределено
//
Функция ЗначениеПоИдентификатору(Идентификатор) Экспорт
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Значение = ИдентификаторыПлатформыСамозанятые().Получить(ВРег(СокрЛП(Идентификатор)));
	Иначе
		Значение = ПустаяСсылка();
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИдентификаторыПлатформыСамозанятые()
	
	Идентификаторы = Новый Соответствие();
	Идентификаторы.Вставить("NEW", НеПрочитано);
	Идентификаторы.Вставить("ACKNOWLEDGED", Прочитано);
	Идентификаторы.Вставить("ARCHIVED", Удалено);
	
	Возврат Новый ФиксированноеСоответствие(Идентификаторы);
	
КонецФункции

#КонецОбласти

#КонецЕсли