#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если МобильныйКлиентБПКлиент.ЭтоМобильныйКлиент() Тогда
		МобильныйКлиентБПКлиент.ОткрытьОтчетПродажи("ПродажиПоКонтрагентамПоОплате");
		Возврат;
	КонецЕсли;
	
	Вариант = Новый Структура;
	Вариант.Вставить("ИмяОтчета",    "Продажи");
	Вариант.Вставить("КлючВарианта", "ПродажиПоКонтрагентамПоОплате");
	
	БухгалтерскиеОтчетыКлиент.ОткрытьВариантОтчета(Вариант);

КонецПроцедуры

#КонецОбласти
