#Область ОписаниеПеременных

&НаКлиенте
Перем ОригинальныеТекстыСообщений; // Исп. в ОбновитьПредставлениеБалансаНаКлиенте

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьРаспознаваниеДокументов") Тогда
		ВызватьИсключение НСтр("ru = 'Функциональная опция ИспользоватьРаспознаваниеДокументов отключена.'");
	КонецЕсли;
	
	ЭтотОбъект.НавигационнаяСсылка = "e1cib/list/Документ.РаспознанныйДокумент";
	
	ОбщиеНастройки = ПолучитьОбщиеНастройки();
	
	БалансПредставление = СтроковыеФункции.ФорматированнаяСтрока(НСтр("ru='Пожалуйста подождите...'"));
	
	ДатаСеанса = ТекущаяДатаСеанса();
	ДатаСеансаУниверсальная = УниверсальноеВремя(ДатаСеанса, ЧасовойПоясСеанса());
	ПоправкаКУниверсальномуВремени = ДатаСеанса - ДатаСеансаУниверсальная;
	Список.Параметры.УстановитьЗначениеПараметра("ПоправкаВремени", ПоправкаКУниверсальномуВремени);
	
	ФильтрПоСтатусу = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ФильтрПоСтатусу.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
	ФильтрПоСтатусу.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	
	СписокВсеСтатусы = Новый СписокЗначений();
	СписокВсеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСозданныхДокументовРаспознаваниеДокументов.ПустаяСсылка"));
	СписокВсеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСозданныхДокументовРаспознаваниеДокументов.Новый"));
	СписокВсеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСозданныхДокументовРаспознаваниеДокументов.Ошибка"));
	
	ФильтрПоСтатусу.ПравоеЗначение = СписокВсеСтатусы;
	ФильтрПоСтатусу.Использование = Истина;
	
	ИдентификаторФильтраПоСтатусам = Список.Отбор.ПолучитьИдентификаторПоОбъекту(ФильтрПоСтатусу);
	
	ОтборСтатусМК = "Новые";
	ИзменитьОтборПоСтатусу();
	
	РаспознаваниеДокументовПереопределяемый.ПриСозданииФормыСпискаМКРаспознаванияНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	ПоказатьВсеКолонки = Форма.ОтборСтатусМК = "Все";
	Элементы.НаправлениеДокумента.Видимость = ПоказатьВсеКолонки;
	Элементы.Дубль.Видимость = ПоказатьВсеКолонки;
	Элементы.СтатусСвязанногоДокумента.Видимость = ПоказатьВсеКолонки;
	Элементы.Организация.Видимость = ПоказатьВсеКолонки;
	Элементы.Номер.Видимость = ПоказатьВсеКолонки;
	Элементы.Контрагент.Видимость = ПоказатьВсеКолонки;
	Элементы.СтатусРаспознавания.ОтображатьВШапке = ПоказатьВсеКолонки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("Подключаемый_ЗагрузитьРаспознанныеДокументы", 3, Истина);
	ПодключитьОбработчикОжидания("Подключаемый_Периодический_ЗагрузитьРаспознанныеДокументы", 30);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "РаспознанныйДокумент_СтатусОбработан" Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСписок", 0.1, Истина);
	ИначеЕсли ИмяСобытия = "РаспознанныйДокумент_ОбновитьПредставлениеБаланса" Тогда
		СостоянияПоБалансу = Неопределено;
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьПредставлениеБаланса", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборСтатусМКПриИзменении(Элемент)
	
	ИзменитьОтборПоСтатусу();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресЭлПочтыИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Ошибка = Не ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(Текст);
	Элементы.ТекстНеверныйАдресЭлПочты.Видимость = Ошибка;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтатусРаспознавания = Элемент.ТекущиеДанные.СтатусРаспознавания;
	ТипДокумента = Элемент.ТекущиеДанные.ТипДокумента;
	Если СтатусРаспознавания = 0 Тогда
		Если Элемент.ТекущиеДанные.ЭтоЗаданиеРаспознавания Тогда 
			Статус = НСтр("ru = 'Задание распознавания отменено.'");
		Иначе 
			Статус = НСтр("ru = 'Установлена пометка на удаление.'");
		КонецЕсли;
	ИначеЕсли СтатусРаспознавания = 1 Тогда
		Статус = НСтр("ru = 'При распознавании возникла ошибка. Попробуйте снова отсканировать документ.'");
	ИначеЕсли СтатусРаспознавания = 4 Тогда
		ЭтоЧек = (ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.КассовыйЧек"));
		Если ЭтоЧек Тогда
			Статус = НСтр("ru = 'Для загрузки чека в документах Авансовый отчет, Путевой лист или Расходы предпринимателя нажмите ""Загрузить""'");
		Иначе
			Статус = СтрШаблон(НСтр("ru = '%1 уже обработан.'"), ТипДокумента);
		КонецЕсли;
	ИначеЕсли СтатусРаспознавания = 2 Тогда
		Статус = СтрШаблон(
		НСтр("ru = 'Документ %1 распознан и ожидает проверки на компьютере'"),
		ТипДокумента);
	ИначеЕсли СтатусРаспознавания = 3 Тогда
		Статус = НСтр("ru = 'Документ в процессе распознавания. Пожалуйста, подождите...'");
	КонецЕсли;
	ПоказатьПредупреждение(, Статус);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерейтиЛичныйКабинет(Команда)
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(
		РаспознаваниеДокументовСлужебныйКлиентСервер.АдресЛичногоКабинета()
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьТестовыйПериод(Команда)
	
	ИдентификаторСервиса = РаспознаваниеДокументовСлужебныйКлиентСервер.ИдентификаторСервиса();
	Обработчик = Новый ОписаниеОповещения("ПослеПодключенияТестовогоПериода", ЭтотОбъект);
	ПодключениеСервисовСопровожденияКлиент.ПодключитьТестовыйПериод(ИдентификаторСервиса, ЭтотОбъект, Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура БалансПредставлениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "#Перейти" Тогда
		
		СтандартнаяОбработка = Ложь;
		НеВыполнятьОбновление = Истина; // Запретить загрузку принудительно
		ОтрисоватьПредставлениеБалансаНаКлиенте(Неопределено);
		
		Обработчик = Новый ОписаниеОповещения("ПослеПроверкиПодключенияКСервисуРаспознавания", ЭтотОбъект);
		РаспознаваниеДокументовКлиент.ПоказатьАвторизациюИТС(Обработчик, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлыДляРаспознавания(Команда)
	
	ОткрытьФормуДобавления();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЧекПоQRКамеройТелефона(Команда)
	ОткрытьФормуЧтенияQR();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаданияИЗагрузить(Команда)
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСписок", 0.1, Истина);
	ПодключитьОбработчикОжидания("Подключаемый_ЗагрузитьРаспознанныеДокументы", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайл(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтоЗаданиеРаспознавания Тогда
		Если ТекущиеДанные.ПометкаУдаления Тогда
			ПоказатьПредупреждение(,
				НСтр("ru = 'Нельзя сохранить файл отмененного задания распознавания.'"));
		Иначе
			ПоказатьПредупреждение(,
				НСтр("ru = 'Нельзя сохранить в процессе обработки.
				           |Дождитесь окончания распознавания и повторите.'"));
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	РаспознаваниеДокументовСлужебныйКлиент.СохранитьФайлыДокумента(ТекущиеДанные.Ссылка, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИдентификаторДокумента(Команда)
	
	Если ТипЗнч(Элементы.Список.ТекущиеДанные) = Тип("ДанныеФормыСтруктура") Тогда
		ПараметрыСообщения = Новый Структура;
		ПараметрыСообщения.Вставить("Заголовок", НСтр("ru = 'Идентификатор документа'"));
		ПараметрыСообщения.Вставить("Сообщение", Элементы.Список.ТекущиеДанные.Идентификатор);
		ПараметрыСообщения.Вставить("МногострочныйРежим", Ложь);
		
		ОткрытьФорму("Обработка.РаспознаваниеДокументов.Форма.ФормаСообщениеБРД", ПараметрыСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьОбработано(Команда)
	
	Для Каждого СтрокаСписка Из Элементы.Список.ВыделенныеСтроки Цикл
		ТекущиеДанные = Элементы.Список.ДанныеСтроки(СтрокаСписка);
		Если ТипЗнч(ТекущиеДанные) = Тип("ДанныеФормыСтруктура") Тогда
			ОтметитьОбработаноНаСервере(ТекущиеДанные.Ссылка);
			ОповеститьОбИзменении(ТекущиеДанные.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСписок", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдаление(Команда)
	
	ПометитьНаУдалениеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиСайт(Команда)
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(
		РаспознаваниеДокументовСлужебныйКлиентСервер.АдресСведенияСайт()
	);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьАдресЭлПочты(Команда)
	
	Ошибка = Не ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(АдресЭлПочты);
	Если Ошибка Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		СохранитьАдресЭлПочтыНаСервере();
		
		ПараметрыВопроса = РаспознаваниеДокументовСлужебныйКлиент.ПараметрыВопросаПользователю();
		ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
		ПараметрыВопроса.Картинка = БиблиотекаКартинок.УспешнаяОтправка;
		ПараметрыВопроса.Заголовок = НСтр("ru = 'Подписка оформлена'");
		
		РаспознаваниеДокументовСлужебныйКлиент.ПоказатьВопросПользователю(
			Неопределено,
			НСтр("ru = 'Адрес электронной почты подписан на уведомления'"),
			РежимДиалогаВопрос.ОК,
			ПараметрыВопроса
		);
		
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьПредставлениеБаланса", 0.1, Истина);
	Исключение
		ПоказатьИнформациюОбОшибке(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеОбработчикиСобытий

&НаКлиенте
Процедура ПослеПроверкиПодключенияКСервисуРаспознавания(Результат, Контекст) Экспорт
	
	НеВыполнятьОбновление = Ложь; // Разрешить загрузку
	ОтрисоватьПредставлениеБалансаНаКлиенте(Неопределено);
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьПредставлениеБаланса", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеДобавленияФайлов(КоличествоДобавленныхФайлов, ДополнительныеПараметры) Экспорт
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСписок", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПоказаПредупреждения(Результат, ДополнительныеПараметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодключенияТестовогоПериода(Результат, Контекст) Экспорт
	
	Если Результат = ПредопределенноеЗначение("Перечисление.СостоянияПодключенияСервисов.Подключен") Тогда
		Элементы.ПодключитьТестовыйПериод.Видимость = Ложь;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьПредставлениеБаланса", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область Представления

&НаСервере
Процедура ИзменитьОтборПоСтатусу()
	
	ВключитьФильтр = ?(ОтборСтатусМК = "Новые", Истина, Ложь);
	
	ЭлементОтбора = Список.Отбор.ПолучитьОбъектПоИдентификатору(ИдентификаторФильтраПоСтатусам);
	
	ЭлементОтбора.Использование = ВключитьФильтр;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДобавления()
	
	#Если МобильныйКлиент Тогда
		
		Обработчик = Новый ОписаниеОповещения("ПослеПолученияСпискаФайлов", ЭтотОбъект);
		РаспознаваниеДокументовМККлиент.СканироватьДокументы(Обработчик);
		
	#Иначе
	     ПослеПолученияСпискаФайлов(Неопределено, Неопределено);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияСпискаФайлов(Результат, ДопПараметры) Экспорт
	
	Обработчик = Новый ОписаниеОповещения("ПослеДобавленияФайлов", ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура;
	Если ЗначениеЗаполнено(Результат) тогда
		ПараметрыОткрытия.Вставить("ДанныеЗаполнения", Результат);
	КонецЕсли;
	
	ОткрытьФорму("Обработка.РаспознаваниеДокументовОтправкаФайлов.Форма.ФормированиеПакетаМК",
		ПараметрыОткрытия,
		,,,,
		Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьСписок()
	
	Элементы.Список.Обновить();
	
	СостоянияПоСтатусам = СостоянияПоСтатусам();
	ПереключательНовые = Элементы.ОтборСтатусМК.СписокВыбора.НайтиПоЗначению("Новые");
	ПереключательНовые.Представление = СтрШаблон(НСтр("ru = 'Новые (%1)'"),
		СостоянияПоСтатусам.ФайловКОбработке
		+ СостоянияПоСтатусам.ФайловНовых
		+ СостоянияПоСтатусам.ФайловСОшибкой);
	
	Если СостоянияПоСтатусам.ЧековЗарегистрировано > ЧековЗарегистрировано Тогда
		
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Распознаны новые кассовые чеки: '") + СостоянияПоСтатусам.ЧековЗарегистрировано,
			"e1cib/data/Документ.АвансовыйОтчет.Форма.ФормаСписка",
			"Данные из этих чеков вы можете перенести в документы Авансовый отчет, Путевой лист и Расходы предпринимателя по кнопке ""Загрузить""",
			БиблиотекаКартинок.ЧекУспешноБРД,
			СтатусОповещенияПользователя.Важное,
			"ЧекЗарегистрирован");
		
		ЧековЗарегистрировано = СостоянияПоСтатусам.ЧековЗарегистрировано;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьПредставлениеБаланса()
	
	ДлительнаяОперация = НачатьПолучениеСостояниеБаланса(УникальныйИдентификатор);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус <> "Ошибка" Тогда
		
		Элементы.СписокПроверитьЗаданияИЗагрузить.Картинка = БиблиотекаКартинок.СинхронизацияДанныхДлительнаяОперация;
		
		НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
		
		Обработчик = Новый ОписаниеОповещения("ПослеПолученияСостоянияБаланса", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НачатьПолучениеСостояниеБаланса(УникальныйИдентификатор)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение состояния по балансу в фоне'");
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "РаспознаваниеДокументов.СостоянияПоБалансу");
	
КонецФункции

&НаКлиенте
Процедура ПослеПолученияСостоянияБаланса(ДлительнаяОперация, Контекст) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		Элементы.СписокПроверитьЗаданияИЗагрузить.Картинка = БиблиотекаКартинок.Обновить;
		
		СостоянияПоБалансу = ПолучитьИзВременногоХранилища(ДлительнаяОперация.АдресРезультата);
		ОтрисоватьПредставлениеБалансаНаКлиенте(СостоянияПоБалансу);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтрисоватьПредставлениеБалансаНаКлиенте(СостоянияПоБалансу)
	
	// Расчет состояний в фоновом задании.
	// Вызывается РаспознаваниеДокументов.СостоянияПоБалансу()
	
	Если СостоянияПоБалансу = Неопределено Тогда
		
		БалансЗаголовок = НСтр("ru='Проверка статуса подключения'");
		ПоказатьСтраницуБиллинга(Элементы.СтраницаПроверкаСтатусаПодключения);
		
		Возврат;
	КонецЕсли;
	
	Если ОригинальныеТекстыСообщений = Неопределено Тогда
		
		// Инициализация кэша текстов оригинальных сообщений.
		// Требуется чтобы при выполнении следующего цикла
		// можно было использовать оригинальной текст как шаблон
		// в котором заполнять параметры.
		
		ОригинальныеТекстыСообщений = Новый Соответствие;
		ОригинальныеТекстыСообщений.Вставить(
			Элементы.ТекстСтраницаПилотныйРежимДатаОкончания.Имя,
			Элементы.ТекстСтраницаПилотныйРежимДатаОкончания.Заголовок
		);
		ОригинальныеТекстыСообщений.Вставить(
			Элементы.ТекстСтраницаПилотныйРежимДатаОкончанияНаступила.Имя,
			Элементы.ТекстСтраницаПилотныйРежимДатаОкончанияНаступила.Заголовок
		);
		ОригинальныеТекстыСообщений.Вставить(
			Элементы.ТекстСтраницаБалансНулевой.Имя,
			Элементы.ТекстСтраницаБалансНулевой.Заголовок
		);
		ОригинальныеТекстыСообщений.Вставить(
			Элементы.ТекстСтраницаБалансПоложительный.Имя,
			Элементы.ТекстСтраницаБалансПоложительный.Заголовок
		);
		ОригинальныеТекстыСообщений.Вставить(
			Элементы.ТекстСтраницаБалансПоложительныйДатаОкончания.Имя,
			Элементы.ТекстСтраницаБалансПоложительныйДатаОкончания.Заголовок
		);
		ОригинальныеТекстыСообщений.Вставить(
			Элементы.ТекстСтраницаБалансОтрицательный.Имя,
			Элементы.ТекстСтраницаБалансОтрицательный.Заголовок
		);
		ОригинальныеТекстыСообщений.Вставить(
			Элементы.ТекстСтраницаСервисОтключен.Имя,
			Элементы.ТекстСтраницаСервисОтключен.Заголовок
		);
		
	КонецЕсли;
	
	Элементы.ГруппаБиллингПодробно.ЦветТекстаЗаголовка = WebЦвета.Зеленый; // цвет по-умолчанию
	
	Если СостоянияПоБалансу.СостояниеБаланса = "Ошибка" Тогда
		
		Элементы.ГруппаБиллингПодробно.ЦветТекстаЗаголовка = WebЦвета.Красный;
		БалансЗаголовок = НСтр("ru='Проверка не удалась'");
		
		ПоказатьСтраницуБиллинга(Элементы.СтраницаОшибка);
		
		Возврат;
	КонецЕсли;
	
	Если СостоянияПоБалансу.СостояниеБаланса = "НеПоказыватьБаланс" Тогда
		Элементы.ГруппаБиллинг.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если СостоянияПоБалансу.СостояниеБаланса = "НеАвторизован" Тогда
		
		БалансЗаголовок = НСтр("ru = 'Подключить сервис'");
		
		ПоказатьСтраницуБиллинга(Элементы.СтраницаНеАвторизован);
		
	ИначеЕсли СостоянияПоБалансу.СостояниеБаланса = "НеАктивирован" Тогда
		
		БалансЗаголовок = НСтр("ru = 'Заявка отправлена'");
		
		ПоказатьСтраницуБиллинга(Элементы.СтраницаНеАктивирован);
		АдресЭлПочты = СостоянияПоБалансу.АдресЭлПочты;
		
		Если Не ПустаяСтрока(АдресЭлПочты) Тогда
			
			ПараметрыЗамены = Новый Структура;
			ПараметрыЗамены.Вставить("АдресЭлПочты", СостоянияПоБалансу.АдресЭлПочты);
			
			Элементы.ТекстОжиданиеАктивации.Заголовок = РаспознаваниеДокументовСлужебныйКлиентСервер.ВставитьПараметрыВСтроку(
				НСтр("ru = 'Заявка на подключение сервиса распознавания документов отправлена
				           |и будет обработана в ближайшее время.
				           |
				           |На адрес [АдресЭлПочты] мы отправим уведомление по факту подключения.'"),
				ПараметрыЗамены
			);
			Элементы.АдресЭлПочты.Заголовок = НСтр("ru = 'Вы можете заменить e-mail для уведомления'");
			Элементы.СохранитьАдресЭлПочты.Заголовок = НСтр("ru = 'Заменить'");
		КонецЕсли;
		
	ИначеЕсли СостоянияПоБалансу.СостояниеБаланса = "БалансНулевой" Тогда
		
		ПараметрыЗамены = Новый Структура;
		ПараметрыЗамены.Вставить("БалансПрописью", ПредставлениеБаланса(СостоянияПоБалансу.Баланс));
		
		БалансЗаголовок = РаспознаваниеДокументовСлужебныйКлиентСервер.ВставитьПараметрыВСтроку(
			НСтр("ru = 'Баланс: [БалансПрописью]'"),
			ПараметрыЗамены
		);
		
		ПоказатьСтраницуБиллинга(Элементы.СтраницаБалансНулевой);
		Элементы.ТекстСтраницаБалансНулевой.Заголовок = РаспознаваниеДокументовСлужебныйКлиентСервер
			.ВставитьПараметрыВСтроку(
				ОригинальныеТекстыСообщений[Элементы.ТекстСтраницаБалансНулевой.Имя],
				ПараметрыЗамены
			);
		
		Элементы.ПодключитьТестовыйПериод.Видимость = СостоянияПоБалансу.ПодключениеТестовогоПериодаДоступно;
		
	ИначеЕсли СостоянияПоБалансу.СостояниеБаланса = "БалансПоложительный" Тогда
		
		ПараметрыЗамены = Новый Структура;
		ПараметрыЗамены.Вставить("БалансПрописью", ПредставлениеБаланса(СостоянияПоБалансу.Баланс));
		
		БалансЗаголовок = РаспознаваниеДокументовСлужебныйКлиентСервер.ВставитьПараметрыВСтроку(
			НСтр("ru = 'Баланс: [БалансПрописью]'"),
			ПараметрыЗамены
		);
		
		ПоказатьСтраницуБиллинга(Элементы.СтраницаБалансПоложительный);
		Элементы.ТекстСтраницаБалансПоложительный.Заголовок = РаспознаваниеДокументовСлужебныйКлиентСервер
			.ВставитьПараметрыВСтроку(
				ОригинальныеТекстыСообщений[Элементы.ТекстСтраницаБалансПоложительный.Имя],
				ПараметрыЗамены
			);
			
		//На мобильном свернем группу - будет видно представление баланса
		Элементы.ГруппаБиллингПодробно.Скрыть();
		
	ИначеЕсли СостоянияПоБалансу.СостояниеБаланса = "БалансПоложительныйДатаОкончания" Тогда
		
		ПараметрыЗамены = Новый Структура;
		ПараметрыЗамены.Вставить("БалансПрописью", ПредставлениеБаланса(СостоянияПоБалансу.Баланс));
		ПараметрыЗамены.Вставить("ДатаОкончанияПрописью", Формат(СостоянияПоБалансу.ДатаОкончания, "ДЛФ=DD"));
		
		БалансЗаголовок = РаспознаваниеДокументовСлужебныйКлиентСервер.ВставитьПараметрыВСтроку(
			НСтр("ru = 'Баланс: [БалансПрописью]'"),
			ПараметрыЗамены
		);
		
		ПоказатьСтраницуБиллинга(Элементы.СтраницаБалансПоложительныйДатаОкончания);
		Элементы.ТекстСтраницаБалансПоложительныйДатаОкончания.Заголовок = РаспознаваниеДокументовСлужебныйКлиентСервер
			.ВставитьПараметрыВСтроку(
				ОригинальныеТекстыСообщений[Элементы.ТекстСтраницаБалансПоложительныйДатаОкончания.Имя],
				ПараметрыЗамены
			);
		
	ИначеЕсли СостоянияПоБалансу.СостояниеБаланса = "БалансОтрицательный" Тогда
		
		ПараметрыЗамены = Новый Структура;
		ПараметрыЗамены.Вставить("КредитПрописью", ПредставлениеБаланса(СостоянияПоБалансу.Кредит));
		ПараметрыЗамены.Вставить("КредитПрописьюРодительный", ПредставлениеБаланса(СостоянияПоБалансу.Кредит, "Родительный"));
		ПараметрыЗамены.Вставить("ДатаОкончанияПрописью", Формат(СостоянияПоБалансу.ДатаОкончания, "ДЛФ=DD"));
		ПараметрыЗамены.Вставить("ИспользованоПрописью", ПредставлениеБаланса(СостоянияПоБалансу.Использовано));
		ПараметрыЗамены.Вставить("Использовано", СостоянияПоБалансу.Использовано);
		
		Элементы.ГруппаБиллингПодробно.ЦветТекстаЗаголовка = WebЦвета.Красный;
		БалансЗаголовок = РаспознаваниеДокументовСлужебныйКлиентСервер.ВставитьПараметрыВСтроку(
			НСтр("ru = 'Кредит: использовано [Использовано] из [КредитПрописьюРодительный]'"),
			ПараметрыЗамены
		);
		
		ПоказатьСтраницуБиллинга(Элементы.СтраницаБалансОтрицательный);
		Элементы.ТекстСтраницаБалансОтрицательный.Заголовок = РаспознаваниеДокументовСлужебныйКлиентСервер
			.ВставитьПараметрыВСтроку(
				ОригинальныеТекстыСообщений[Элементы.ТекстСтраницаБалансОтрицательный.Имя],
				ПараметрыЗамены
			);
		
	ИначеЕсли СостоянияПоБалансу.СостояниеБаланса = "СервисОтключен" Тогда
		
		ПараметрыЗамены = Новый Структура;
		ПараметрыЗамены.Вставить("ИспользованоПрописью", ПредставлениеБаланса(СостоянияПоБалансу.Использовано));
		
		Элементы.ГруппаБиллингПодробно.ЦветТекстаЗаголовка = WebЦвета.Красный;
		БалансЗаголовок = НСтр("ru = 'Сервис отключен'");
		
		ПоказатьСтраницуБиллинга(Элементы.СтраницаСервисОтключен);
		Элементы.ТекстСтраницаСервисОтключен.Заголовок = РаспознаваниеДокументовСлужебныйКлиентСервер
			.ВставитьПараметрыВСтроку(
				ОригинальныеТекстыСообщений[Элементы.ТекстСтраницаСервисОтключен.Имя],
				ПараметрыЗамены
			);
			
	КонецЕсли;
	
	Если СостоянияПоБалансу.ПоказатьТребованиеВключитьИТС Тогда
		Обработчик = Новый ОписаниеОповещения("ПослеПоказаПредупреждения", ЭтотОбъект);
		РаспознаваниеДокументовСлужебныйКлиент.ПоказатьТребованиеВключитьИТС(Обработчик);
	КонецЕсли;
	
	Если СостоянияПоБалансу.ПоказатьПредупреждениеНулевойБаланс Тогда
		Обработчик = Новый ОписаниеОповещения("ПослеПоказаПредупреждения", ЭтотОбъект);
		РаспознаваниеДокументовСлужебныйКлиент.ПоказатьПредупреждениеНулевойБаланс(Обработчик, СостоянияПоБалансу.ДатаОкончания);
	КонецЕсли;
	
	Если СостоянияПоБалансу.ПоказатьПредупреждениеСервисОтключен Тогда
		Обработчик = Новый ОписаниеОповещения("ПослеПоказаПредупреждения", ЭтотОбъект);
		РаспознаваниеДокументовСлужебныйКлиент.ПоказатьПредупреждениеСервисОтключен(Обработчик);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуБиллинга(СтраницаКПоказу)
	
	Для Каждого СтраницаГруппы Из Элементы.ГруппаСостоянияБиллинга.ПодчиненныеЭлементы Цикл
		СтраницаГруппы.Видимость = (СтраницаГруппы = СтраницаКПоказу);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПредставлениеБаланса(Знач Баланс, Знач Падеж = "Именительный")
	
	Если Баланс = 0 Тогда
		Возврат НСтр("ru = '0 страниц'");
	КонецЕсли;
	
	Баланс = ?(Баланс > 0, Баланс, -Баланс); // По модулю
	
	Если Падеж = "Именительный" Тогда
		
		Возврат СтрокаСЧислом(
			НСтр("ru=';
			         |%1 страница;
			         |;
			         |%1 страницы;
			         |%1 страниц;
			         |%1 страницы'"),
			Баланс,
			ВидЧисловогоЗначения.Количественное,
			"Л=ru"
		);
		
		
	ИначеЕсли Падеж = "Родительный" Тогда
		
		Возврат СтрокаСЧислом(
			НСтр("ru=';
			         |%1 страницы;
			         |;
			         |%1 страниц;
			         |%1 страниц;
			         |%1 страниц'"),
			Баланс,
			ВидЧисловогоЗначения.Количественное,
			"Л=ru"
		);
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область БизнесЛогика

&НаСервереБезКонтекста
Функция ПолучитьОбщиеНастройки()
	Возврат РегистрыСведений.ОбщиеНастройкиРаспознаваниеДокументов.ТекущиеНастройки();
КонецФункции

&НаСервереБезКонтекста
Процедура ОтметитьОбработаноНаСервере(ДокументСсылка)
	
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторРезультата = "";
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Документ.РаспознанныйДокумент");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ДокументСсылка);
		Блокировка.Заблокировать();
		
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		
		Если ДокументОбъект.ПометкаУдаления Тогда 
			ВызватьИсключение НСтр("ru = 'Невозможно отправить в обработанные помеченный на удаление документ.'");
		КонецЕсли;
		
		ДокументОбъект.Заблокировать();
		ДокументОбъект.Статус = Перечисления.СтатусыСозданныхДокументовРаспознаваниеДокументов.Обработан;
		ДокументОбъект.Записать();
		
		ИдентификаторРезультата = ДокументОбъект.ИдентификаторРезультата;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	// Замер производительности
	РезультатОбратнойСвязи = РаспознаваниеДокументов.ОписаниеОбратнойСвязи("Проигнорировано");
	Пакет = Новый Структура("created", РезультатОбратнойСвязи);
	РаспознаваниеДокументовКоннекторСлужебный.ПередатьОбратнуюСвязь(ИдентификаторРезультата, Пакет);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СостоянияПоСтатусам()
	
	Возврат РаспознаваниеДокументов.СостоянияПоСтатусам();
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура Подключаемый_Периодический_ЗагрузитьРаспознанныеДокументы()
	
	// Этот метод обертка нужен для того чтобы периодический вызов работал независимо всегда
	// и для него не сбрасывался таймер запуска при попытке запуска принудительно 1 раз.
	
	Подключаемый_ЗагрузитьРаспознанныеДокументы();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗагрузитьРаспознанныеДокументы()
	
	Если НеВыполнятьОбновление() Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьРаспознанныеДокументыНаСервере();
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСписок", 0.1, Истина);
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьПредставлениеБаланса", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Функция НеВыполнятьОбновление()
	
	ПоказанаСтраницаВводаПочты = Не Элементы.ГруппаБиллингПодробно.Скрыта()
		И Элементы.СтраницаНеАктивирован.Видимость;
	
	Возврат ПоказанаСтраницаВводаПочты Или НеВыполнятьОбновление;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗагрузитьРаспознанныеДокументыНаСервере()
	
	Возврат РаспознаваниеДокументовСлужебный.ЗагрузкаРаспознанныхДокументов();
	
КонецФункции

#Область Отборы

&НаСервере
Процедура СохранитьАдресЭлПочтыНаСервере()
	
	РаспознаваниеДокументовSDK.УстановитьАдресЭлектроннойПочты(АдресЭлПочты);
	
	МенеджерЗаписи = РегистрыСведений.ОбщиеНастройкиРаспознаваниеДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.АдресЭлПочты = АдресЭлПочты;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ПометитьНаУдаление

&НаКлиенте
Процедура ПометитьНаУдалениеНаКлиенте()
	
	Для Каждого СтрокаСписка Из Элементы.Список.ВыделенныеСтроки Цикл
		ТекущиеДанные = Элементы.Список.ДанныеСтроки(СтрокаСписка);
		Если ТипЗнч(ТекущиеДанные) = Тип("ДанныеФормыСтруктура") Тогда
			
			Если ТекущиеДанные.ЭтоЗаданиеРаспознавания Тогда 
				ОтменитьЗаданиеРаспознавания(ТекущиеДанные.Идентификатор);
			Иначе
				ПометитьНаУдалениеНаСервере(ТекущиеДанные.Ссылка);
				ОповеститьОбИзменении(ТекущиеДанные.Ссылка);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСписок", 0.1, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПометитьНаУдалениеНаСервере(ДокументСсылка)
	
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Документ.РаспознанныйДокумент");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ДокументСсылка);
		Блокировка.Заблокировать();
		
		КорректировкаНераспознанныхДокументовРазрешена = РольДоступна("КорректировкаНераспознанныхДокументов");
		
		Если КорректировкаНераспознанныхДокументовРазрешена Тогда
			УстановитьПривилегированныйРежим(Истина);
		КонецЕсли;
		
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.УстановитьПометкуУдаления(Не ДокументОбъект.ПометкаУдаления);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтменитьЗаданиеРаспознавания(ИдентификаторЗадания)
	
	РегистрыСведений.СостоянияЗаданийРаспознаваниеДокументов.ИзменитьСтатусОбработкиЗадания(
		ИдентификаторЗадания,
		Перечисления.СтатусыНаСервисеРаспознаваниеДокументов.Отменено
	);
	
КонецПроцедуры

#КонецОбласти

#Область ЧтениеQR
&НаКлиенте
Процедура ОткрытьФормуЧтенияQR()
	
	#Если МобильныйКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			ОбработчикСканирования = Новый ОписаниеОповещения("ОбработкаСканирования", ЭтотОбъект);
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов(
				НСтр("ru = 'Наведите камеру на QR-код чека'; en = 'Focus the camera on the receipt QR code'"),
				ОбработчикСканирования);
		КонецЕсли;
		
	#ИначеЕсли ТонкийКлиент Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВвестиСтрокуQRКодаЗавершение", ЭтотОбъект);
		ПоказатьВводСтроки(ОписаниеОповещения,, НСтр("ru = 'Текст QR-кода'; en = 'QR code text'"), 100);
		
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСканирования(Штрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		
		ТекстQRКода = "" + Штрихкод;
		#Если МобильныйКлиент Тогда
			СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		ОбработатьQRКод(ТекстQRКода);
		
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСписок", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиСтрокуQRКодаЗавершение(Строка, ДополнительныеПараметры) Экспорт
	
	Если Строка <> Неопределено Тогда
		ОбработатьQRКод(Строка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьQRКод(ТекстQRКода)
	
	РеквизитыЧека = РеквизитыЧека(ТекстQRКода);
	Если ПустаяСтрока(РеквизитыЧека.Номер) Тогда
		РаспознаваниеДокументовМККлиент.ПоказатьСообщение(
			НСтр("ru = 'Штрихкод не является QR-кодом чека. Попробуйте отсканировать другой QR-код.';
			     |en = 'The barcode is not a receipt QR code. Try scan another QR code.'")
		);
		Возврат;
	КонецЕсли;
	
	ОтправитьQRКод(ТекстQRКода, РеквизитыЧека);
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьQRКод(ТекстQRКода, РеквизитыЧека)
	
	СоздатьЗаданиеРаспознаванияИзQRКода(ТекстQRКода, РеквизитыЧека);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаданиеРаспознаванияИзQRКода(ТекстQRКода, РеквизитыЧека)
	
	Попытка
		
		ИдентификаторЗадания = РаспознаваниеДокументовSDK.СоздатьЗаданиеРаспознаванияПоQRКоду(ТекстQRКода);
		
		Результат = РаспознаваниеДокументовSDK.ПолучитьСостояниеОбработкиЗадания(ИдентификаторЗадания);
		
		Если Результат.ОбработкаЗавершена Тогда
			ВызватьИсключение НСтр("ru = 'Произошла ошибка при создании задания. Попробуйте повторить позже.'");
		КонецЕсли;
		
		РегистрыСведений.СостоянияЗаданийРаспознаваниеДокументов.ИзменитьСтатусОбработкиЗадания(
			ИдентификаторЗадания,
			Перечисления.СтатусыНаСервисеРаспознаваниеДокументов.Обрабатывается
		);
		
	Исключение
		
		ЗаписьЖурналаРегистрации(
			РаспознаваниеДокументов.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка, , ,
			НСтр("ru = 'Ошибка при создании задания распознавания'") + Символы.ПС
				+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Произошла ошибка при отправке:
			           |%1'"),
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаЗапросаОбновления()
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСписок", 0.1, Истина);
	ПодключитьОбработчикОжидания("Подключаемый_ЗагрузитьРаспознанныеДокументы", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	РаспознаваниеДокументовКлиентПереопределяемый.ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
КонецПроцедуры
#КонецОбласти

// Версия модуля kktService 1.0.1.39

// Приказ от 21.03.2017 № ММВ-7-20/229@
// "Об утверждении дополнительных реквизитов фискальных документов и форматов фискальных документов,
// обязательных к использованию"

#Область ЧтениеQRНаКлиенте

// Десериализует данные QR-кода.
// Пример строки QR-кода: t=20150720T1638&s=9999999.00&fn=000110000105&i=12345678&fp=123456&n=2
//
// Параметры:
//  QRКод - Строка
// 
// Возвращаемое значение:
//  Структура - см. НовыйРеквизитыЧека
//
&НаКлиенте
Функция РеквизитыЧека(QRКод) Экспорт
	
	РеквизитыЧека = КассовыеЧекиQRКодыКлиентСервер.НовыйРеквизитыЧека();
	ИменаПолей    = КассовыеЧекиQRКодыКлиентСервер.ИменаПолейQRКода();
	
	ПоляQRКода = СтрРазделить(QRКод, "&");
	ТипДата = Тип("Дата");
	
	Для Каждого СодержимоеПоля Из ПоляQRКода Цикл
		
		ЭлементыПоля = СтрРазделить(СодержимоеПоля, "=");
		Если ЭлементыПоля.Количество() <> 2 Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПоля   = ЭлементыПоля[0];
		ТекстПоля = ЭлементыПоля[1];
		
		ИмяПоля = ИменаПолей[ИмяПоля];
		Если ИмяПоля = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭталонноеЗначение = РеквизитыЧека[ИмяПоля];
		ЭталонныйТип      = ТипЗнч(ЭталонноеЗначение);
		
		Если ЭталонныйТип = ТипДата Тогда
			Значение = ДесериализоватьДатуISO(ТекстПоля);
		Иначе
			ОписаниеТипов = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЭталонныйТип));
			Значение = ОписаниеТипов.ПривестиЗначение(ТекстПоля);
		КонецЕсли;
		
		РеквизитыЧека[ИмяПоля] = Значение;
		
	КонецЦикла;
	
	Возврат РеквизитыЧека;
	
КонецФункции

// Проверяет заполненность реквизитов чека
//
// Параметры:
//  РеквизитыЧека - Структура - см. НовыйРеквизитыЧека
// 
// Возвращаемое значение:
//  Булево
//
&НаКлиенте
Функция РеквизитыЧекаЗаполнены(РеквизитыЧека) Экспорт
	
	Возврат ЗначениеЗаполнено(РеквизитыЧека.Дата) И ЗначениеЗаполнено(РеквизитыЧека.Номер);
	
КонецФункции

// Преобразует значение даты, сериализованное по ISO 8601, в значение типа Дата
//
// Параметры:
//  ДатаСтрокой - Строка - дата в формате ISO 8601
// 
// Возвращаемое значение:
//  Дата - десериализованная дата; при невозможности десериализовать - пустая дата
//
&НаКлиенте
Функция ДесериализоватьДатуISO(ДатаСтрокой) Экспорт
	
	Дата = '0001-01-01';
	#Если Не ВебКлиент Тогда
		//Метод ПрочитатьДатуJSON недоступен в веб-клиенте.
		//Форма недоступна пользователю в режиме веб-клиента
		Попытка
			Дата = ПрочитатьДатуJSON(ДатаСтрокой, ФорматДатыJSON.ISO);
		Исключение
			Возврат Дата;
		КонецПопытки;
	#КонецЕсли
	
	Возврат Дата;
	
КонецФункции

#КонецОбласти

#КонецОбласти
