#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокПараметров = "Организация, 
	|НачалоПериода, 
	|КонецПериода, 
	|ДатаПерехода, 
	|СтавкаНДС";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, СписокПараметров);
	
	ТекстВвестиРеквизиты = НСтр("ru = '<Ввести реквизиты>'");
	ЗагрузитьСхраненныеДанные();
	УстановитьУсловноеОформление();
	УстановитьСвойстваПолей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.СостояниеВыполняется.Видимость = Ложь;
	РассчитатьВозможностьПодготовитьКВычету();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		Если ЗавершениеРаботы Тогда
			Отказ = Истина;
			Возврат;
		Иначе 
			ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, 
			НСтр("ru = 'Данные были изменены. Сохранить изменения?'"), 
			РежимДиалогаВопрос.ДаНетОтмена);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если СтрНайти(ИмяСобытия, "ПодготовкаКВычетуНДС") = 0 Тогда 
		Возврат
	КонецЕсли;
	
	Если ИмяСобытия = "ПодготовкаКВычетуНДСГрупповоеИзменениеРеквизитов" Тогда
		ЗагрузитьВНДСПоОстаткамИзВременногоХранилища(Параметр);
		ЗаполнитьПартии();
		Модифицированность = Истина;
		РассчитатьВозможностьПодготовитьКВычету();
	ИначеЕсли ИмяСобытия = "ПодготовкаКВычетуНДСЗакрытьФормуДозаполнения" Тогда
		Модифицированность = Ложь;
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПомощникЗаполнения" Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КонецПериода", КонецПериода);
		ПараметрыФормы.Вставить("АдресНДСПоОстаткам", АдресНДСПоОстаткамВоВовременномХранилище());
		ОткрытьФорму("Обработка.ПодготовкаКВычетуНДСУчтенногоВСтоимости.Форма.ФормаГрупповогоЗаполненияДанных", 
			ПараметрыФормы, ЭтотОбъект, "ФормаГрупповогоЗаполненияДанных", , , , 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОперацию(Команда)
	
	ОтменитьОперациюСервер(ВыполняемаяОперация);
	ЗаблокироватьФормуНаВремяДлительнойОперации(Ложь);
	РассчитатьВозможностьПодготовитьКВычету();
	Оповестить("ПодготовкаКВычетуНДСОбновитьПослеДозаполнения");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПартии

&НаКлиенте
Процедура ПартииПриИзменении(Элемент)
	
	РассчитатьВозможностьПодготовитьКВычету();
	
КонецПроцедуры

&НаКлиенте
Процедура ПартииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ПартииРеквизитыСчетаФактуры" Тогда
		ОткрытьФормуРеквизитовСчетаФактуры(ВыбраннаяСтрока);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПартииПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Партии.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Партия		 = Неопределено;
		ПартияИдентификаторСтроки = "";
	Иначе 
		Партия		 = ТекущиеДанные.Партия;
		ПартияИдентификаторСтроки = Элементы.Партии.ТекущаяСтрока;
	КонецЕсли;
	
	Если ТипЗнч(Партия) = Тип("ДокументСсылка.КомплектацияНоменклатуры") Тогда 
		Элементы.УстановитьНДСПоНоменклатуре.Видимость = Ложь;
	ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда 
		Элементы.УстановитьНДСПоНоменклатуре.Видимость = Истина;
	Иначе 
		Элементы.УстановитьНДСПоНоменклатуре.Видимость = Ложь;
	КонецЕсли;
	
	ЗаполнитьТовары();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.Товары.ТекущиеДанные;  
	ТоварыПересчитатьСуммыПриИзмененииСтавкаНДС(СтрокаТаблицы);
	ОбновитьСуммыВПартии();
	РассчитатьВозможностьПодготовитьКВычету();
	
КонецПроцедуры

#КонецОбласти

 #Область ОбработчикиКомандФормы
 
&НаКлиенте
Процедура ЗакрытьПанельПодсказок(Команда)
	
	ИзменитьВидимостьПодсказокНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидимостьПодсказок(Команда)
	
	ИзменитьВидимостьПодсказокНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьНДСКВычету(Команда)
	
	ЗаблокироватьФормуНаВремяДлительнойОперации(Истина);
	СохранитьДанные();
	Модифицированность = Ложь;
	
	ВыполняемаяОперация = СоздатьДокументыВводаОстатковВФоне();
	
	Обработчик = Новый ОписаниеОповещения("ПослеПодготовкиКВычету", ЭтотОбъект);
	
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
	НастройкиОжидания.ВыводитьПрогрессВыполнения = Истина;
	ДополнительныеПараметры = Новый Структура;
	НастройкиОжидания.ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ПриОбновленииПрогрессаФоновогоЗадания", 
		ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ВыполняемаяОперация, Обработчик, НастройкиОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНДС10ПоПартии(Команда)
	
	УстановитьНДСПоПартииНаСервере(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10"));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНДС20ПоПартии(Команда)
	
	УстановитьНДСПоПартииНаСервере(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20"));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНДС22ПоПартии(Команда)
	
	УстановитьНДСПоПартииНаСервере(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22"));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНДС5ПоПартии(Команда)
	
	УстановитьНДСПоПартииНаСервере(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5"));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНДС7ПоПартии(Команда)

	УстановитьНДСПоПартииНаСервере(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7"));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНДСПоНоменклатуреПоПартии(Команда)
	
	УстановитьНДСПоНоменклатуреПоПартииНаСервере();
	Для Каждого СтрокаТовары Из Товары Цикл 
		ТоварыПересчитатьСуммыПриИзмененииСтавкаНДС(СтрокаТовары);
	КонецЦикла;
	ОбновитьСуммыВПартии();
	РассчитатьВозможностьПодготовитьКВычету();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаблокироватьФормуНаВремяДлительнойОперации(Блокировка)
	
	Элементы.СохранитьИзменения.Доступность = НЕ Блокировка;
	Элементы.ГруппаПартии.Доступность = НЕ Блокировка;
	Элементы.ГруппаТовары.Доступность = НЕ Блокировка;
	Элементы.ПанельПодсказки.Доступность = НЕ Блокировка;
	
	Элементы.СостояниеВыполняется.Видимость = Блокировка;
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьОперациюСервер(ВыполняемаяОперация)
	
	Если ВыполняемаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ВыполняемаяОперация.ИдентификаторЗадания);
	ЗагрузитьСхраненныеДанные();
	
КонецПроцедуры

&НаСервере
Функция СоздатьДокументыВводаОстатковВФоне()
	
	ПараметрыПроцедуры = РеквизитыФормы(Истина);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Создание документов ввода остатков'");
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.ПодготовкаКВычетуНДСУчтенногоВСтоимости.СозданиеДокументовВводаОстатков",
		ПараметрыПроцедуры,
		ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ПослеПодготовкиКВычету(Результат, Параметры) Экспорт
	
	ЗагрузитьСхраненныеДанные();
	ЗаблокироватьФормуНаВремяДлительнойОперации(Ложь);
	РассчитатьВозможностьПодготовитьКВычету();
	Оповестить("ПодготовкаКВычетуНДСОбновитьПослеДозаполнения");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСхраненныеДанные()
	
	Обработки.ПодготовкаКВычетуНДСУчтенногоВСтоимости.ЗагрузитьСхраненныеДанные(ЭтотОбъект);
	ЗаполнитьПартии();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОбновленииПрогрессаФоновогоЗадания(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Прогресс <> Неопределено Тогда
		Элементы.ПредставлениеПрогресса.Заголовок = Результат.Прогресс.Текст;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РеквизитыФормы(ВыгружатьНДСПоОстаткам = Ложь)
	
	РеквизитыФормы = Новый Структура();
	РеквизитыФормы.Вставить("Организация", 	Организация);
	РеквизитыФормы.Вставить("НачалоПериода", НачалоПериода);
	РеквизитыФормы.Вставить("КонецПериода", 	КонецПериода);
	РеквизитыФормы.Вставить("ДатаПерехода", 	ДатаПерехода);
	РеквизитыФормы.Вставить("СтавкаНДС", 	СтавкаНДС);
	РеквизитыФормы.Вставить("ЗаполненоАвтоматически", Ложь);
	Если ВыгружатьНДСПоОстаткам Тогда 
		РеквизитыФормы.Вставить("НДСПоОстаткам", НДСПоОстаткам.Выгрузить());
	КонецЕсли;
	Возврат РеквизитыФормы;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//Не заполнен счет-фактура
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПартииРеквизитыСчетаФактуры");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, 
	"Партии.РеквизитыСчетаФактурыЗаполнены", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НезаполненныйРеквизит);
	//Не заполнена сумма НДС
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПартииСуммаНДС");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, 
	"Партии.СуммаНДС", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	//Можно подготовить к вычету
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	Для Каждого Поле Из Элементы.Партии.ПодчиненныеЭлементы Цикл 
		Если Поле.Вид = ВидПоляФормы.ПолеВвода Тогда 
			КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Поле.Имя);
		КонецЕсли;
	КонецЦикла;

	ГруппаОтбор = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(ЭлементУО.Отбор.Элементы, 
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбор, "Партии.СуммаНДС", 
	ВидСравненияКомпоновкиДанных.Больше, 0);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбор, "Партии.РеквизитыСчетаФактурыЗаполнены", 
	ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Роса);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПартии()
	
	КолонкиПартий = КолонкиПартий();
	
	СтрокиДозаполнить = НДСПоОстаткам.НайтиСтроки(ОтборДозаполнить());
	ТЗПартии = НДСПоОстаткам.Выгрузить(СтрокиДозаполнить, КолонкиПартий.Все);
	ТЗПартии.Свернуть(КолонкиПартий.КолонкиГруппировки, КолонкиПартий.КолонкиСуммирования);
	Партии.Загрузить(ТЗПартии);
	НомерСтроки = 1;
	Для Каждого СтрокаПартии Из Партии Цикл 
		СтрокаПартии.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
		ЗаполнитьРеквизитыСчетаФактуры(СтрокаПартии);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТовары()	
	
	Товары.Очистить();
	
	Если Партия = Неопределено Тогда 
		Возврат
	КонецЕсли;
	
	ПоискПоПартии = ОтборДозаполнить();
	ПоискПоПартии.Вставить("Партия", Партия);
		
	СтрокиПоПартии = НДСПоОстаткам.НайтиСтроки(ПоискПоПартии);
	
	КолонкиТоваров = КолонкиТоваров();
	
	ОстаткиПоПартии = НДСПоОстаткам.Выгрузить(СтрокиПоПартии, КолонкиТоваров.Все);
	ОстаткиПоПартии.Свернуть(КолонкиТоваров.КолонкиГруппировки, КолонкиТоваров.КолонкиСуммирования);
	Товары.Загрузить(ОстаткиПоПартии);
	
	Для Каждого СтрокаТовары Из Товары Цикл 
		СтрокаТовары.Сумма = ?(СтрокаТовары.СуммаВключаетНДС, СтрокаТовары.Всего, СтрокаТовары.СуммаБезНДС);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КолонкиПартий()
	
	КолонкиПартий = Новый Структура;
	
	КолонкиГруппировки = "Партия, 
	|Контрагент, 
	|ДокументПоступления, 
	|СчетФактура, 
	|СчетФактураДатаВх, 
	|СчетФактураНомерВх, 
	|ДатаВх, 
	|НомерВх, 
	|СуммаВключаетНДС, 
	|НДСВключенВСтоимость, 
	|Дата, 
	|Номер, 
	|ДоговорКонтрагента, 
	|Подразделение, 
	|СуммаДокумента";
	
	КолонкиСуммирования = "СуммаНДС, 
	|СуммаБезНДС, 
	|РасходУСН, 
	|УчтенныйНДС, 
	|Всего";
	
	КолонкиПартий.Вставить("КолонкиГруппировки", КолонкиГруппировки);
	КолонкиПартий.Вставить("КолонкиСуммирования", КолонкиСуммирования);
	КолонкиПартий.Вставить("Все", СтрШаблон("%1, %2", КолонкиГруппировки, КолонкиСуммирования));
	
	Возврат КолонкиПартий;
	
КонецФункции    

&НаСервереБезКонтекста
Функция КолонкиТоваров()
	
	КолонкиТоваров = Новый Структура;
	
	КолонкиГруппировки = "Партия, 
	|Номенклатура, 
	|СчетУчета, 
	|СчетУчетаНДС, 
	|СтавкаНДС, 
	|СуммаВключаетНДС";
	
	КолонкиСуммирования = "Количество, 
	|СуммаБезНДС, 
	|СуммаНДС,
	|РасчетныйНДС,
	|Всего";
	
	КолонкиТоваров.Вставить("КолонкиГруппировки", КолонкиГруппировки);
	КолонкиТоваров.Вставить("КолонкиСуммирования", КолонкиСуммирования);
	КолонкиТоваров.Вставить("Все", СтрШаблон("%1, %2", КолонкиГруппировки, КолонкиСуммирования));
	
	Возврат КолонкиТоваров;

КонецФункции

&НаСервереБезКонтекста
Функция ОтборДозаполнить()
	
	Возврат Новый Структура("Группа, Статус", "НеХватаетДанныхДляВычета", "Не подготовлен к вычету");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРеквизитыСчетаФактуры(ДанныеСтроки)
	
	РеквизитыСчетаФактурыТекст = ТекстВвестиРеквизиты;
	
	Если ЗначениеЗаполнено(ДанныеСтроки.СчетФактураДатаВх) И ЗначениеЗаполнено(ДанныеСтроки.СчетФактураНомерВх) Тогда
		
		РеквизитыСчетаФактурыДляПредставления = Новый Структура();
		РеквизитыСчетаФактурыДляПредставления.Вставить("ВидСчетаФактуры", Перечисления.ВидСчетаФактурыПолученного.НаПоступление);
		РеквизитыСчетаФактурыДляПредставления.Вставить("Исправление", Ложь);
		РеквизитыСчетаФактурыДляПредставления.Вставить("НомерИсправления", 0);
		РеквизитыСчетаФактурыДляПредставления.Вставить("ДатаИсправления", Дата(1, 1, 1));
		РеквизитыСчетаФактурыДляПредставления.Вставить("НомерВходящегоДокумента", ДанныеСтроки.СчетФактураНомерВх);
		РеквизитыСчетаФактурыДляПредставления.Вставить("ДатаВходящегоДокумента", ДанныеСтроки.СчетФактураДатаВх);
		РеквизитыСчетаФактурыДляПредставления.Вставить("БланкСтрогойОтчетности", Ложь);
		
		СтруктураПредставления = Документы.СчетФактураПолученный.ПолучитьПредставлениеПоРеквизитам(РеквизитыСчетаФактурыДляПредставления);
		РеквизитыСчетаФактурыТекст = СтруктураПредставления.ТекстПредставлениеКраткое;
		
		РеквизитыСчетаФактурыЗаполнены = Истина;
	Иначе
		РеквизитыСчетаФактурыЗаполнены = Ложь;
	КонецЕсли;
	
	ДанныеСтроки.РеквизитыСчетаФактуры 				 = РеквизитыСчетаФактурыТекст;
	ДанныеСтроки.РеквизитыСчетаФактурыЗаполнены 	 = РеквизитыСчетаФактурыЗаполнены;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВозможностьПодготовитьКВычету()
	
	СуммаНДСДоступнаяКВычету = 0;
	ТекстСуммаНДСДоступнаяКВычету = "";
	
	СтрокиСЗаполненымиСчетамиФактурами = Партии.НайтиСтроки(Новый Структура("РеквизитыСчетаФактурыЗаполнены", Истина));
	Для Каждого СтрокаСЗаполненымСчетомФактурой Из СтрокиСЗаполненымиСчетамиФактурами Цикл 
		Если СтрокаСЗаполненымСчетомФактурой.СуммаНДС > 0 Тогда
			СуммаНДСДоступнаяКВычету = СуммаНДСДоступнаяКВычету + СтрокаСЗаполненымСчетомФактурой.СуммаНДС;
		КонецЕсли;
	КонецЦикла;
	
	Если СуммаНДСДоступнаяКВычету > 0 Тогда 
		ДоступноКВычетуТекст = Формат(СуммаНДСДоступнаяКВычету, "ЧЦ = 15; ЧДЦ = 2");
		ЕстьВозможностьПодготовитьКВычету = Истина;
	Иначе 
		ДоступноКВычетуТекст = "0";
		ЕстьВозможностьПодготовитьКВычету = Ложь;
	КонецЕсли;  
	
	СуммаНДСДоступнаяКВычетуЗаголовок = СтрШаблон("%1 из максимально возможных %2", 
	ДоступноКВычетуТекст, Формат(МакисмальнаяСуммаНДСДоступнаяКВычету(), "ЧЦ = 15; ЧДЦ = 2"));
	
	Элементы.СохранитьИзменения.Доступность				 = ЕстьВозможностьПодготовитьКВычету; 
	Элементы.СохранитьИзменения.КнопкаПоУмолчанию		 = ЕстьВозможностьПодготовитьКВычету; 
	Элементы.ДекорацияСуммаНДСДоступнаяКВычету.Заголовок = СуммаНДСДоступнаяКВычетуЗаголовок;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваПолей()
	
	СписокТолькоОткрытие = "ПартииДоговорКонтрагента, 
	|ПартииКонтрагент, 
	|ПартииПартия, 
	|ПартииПодразделение, 
	|ТоварыНоменклатура";
	
	СписокТолькоПросмотр = "ПартииДата, 
	|ПартииДатаВх, 
	|ПартииНомер, 
	|ПартииНомерВх, 
	|ПартииРеквизитыСчетаФактуры, 
	|ПартииСуммаДокумента, 
	|ПартииСуммаНДС, 
	|ПартииСчетФактураДатаВх, 
	|ПартииСчетФактураНомерВх, 
	|ТоварыВсего, 
	|ТоварыКоличество, 
	|ТоварыСумма, 
	|ТоварыСуммаНДС, 
	|ТоварыЭтоКомплектующая";

	Обработки.ПодготовкаКВычетуНДСУчтенногоВСтоимости.УстановитьСвойстваПолей(Элементы, СписокТолькоОткрытие, СписокТолькоПросмотр);

КонецПроцедуры

&НаСервере
Функция АдресНДСПоОстаткамВоВовременномХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(НДСПоОстаткам.Выгрузить());
	
КонецФункции

&НаКлиенте 
Процедура ОткрытьФормуРеквизитовСчетаФактуры(ВыбраннаяСтрока)
	
	ДанныеСтроки = Элементы.Партии.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	 
	ЗначенияЗаполнения = Новый Структура();
	ЗначенияЗаполнения.Вставить("ДатаДокумента", ДанныеСтроки.СчетФактураДатаВх);
	ЗначенияЗаполнения.Вставить("ПредъявленСФ", Истина);
	ЗначенияЗаполнения.Вставить("ДатаСФ", ДанныеСтроки.СчетФактураДатаВх);
	ЗначенияЗаполнения.Вставить("НомерСФ", ДанныеСтроки.СчетФактураНомерВх);
	ЗначенияЗаполнения.Вставить("Исправление", Ложь);
	ЗначенияЗаполнения.Вставить("НомерИсправления", "");
	ЗначенияЗаполнения.Вставить("ДатаИсправления", Дата(1, 1, 1));
	ЗначенияЗаполнения.Вставить("РазделУчета", 
		ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.НДСУчтенныйВСтоимости"));
	ЗначенияЗаполнения.Вставить("КорректировочныйСчетФактура", Ложь);
	ЗначенияЗаполнения.Вставить("НомерИсходногоДокумента", "");
	ЗначенияЗаполнения.Вставить("ДатаИсходногоДокумента", Дата(1, 1, 1));
	ЗначенияЗаполнения.Вставить("УчитыватьИсправлениеИсходногоДокумента", Ложь);
	ЗначенияЗаполнения.Вставить("НомерИсправленияИсходногоДокумента", 0);
	ЗначенияЗаполнения.Вставить("ДатаИсправленияИсходногоДокумента", Дата(1, 1, 1));
	ЗначенияЗаполнения.Вставить("ПродавецДоступен", Ложь);
	ЗначенияЗаполнения.Вставить("ТребуетсяСчетФактура", Истина);
	ЗначенияЗаполнения.Вставить("НомерСтрокиДокумента", ДанныеСтроки.НомерСтроки);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ТолькоПросмотр", Ложь);
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОповещениеФормы = Новый ОписаниеОповещения("ОбработчикЗакрытияФормыРеквизитовСчетаФактурыЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Документ.ВводНачальныхОстатков.Форма.ФормаРеквизитыСчетаФактуры", 
	ПараметрыФормы, ЭтотОбъект, , , , ОповещениеФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытияФормыРеквизитовСчетаФактурыЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Партии.НайтиПоИдентификатору(Элементы.Партии.ТекущаяСтрока);
	Если ТекущиеДанные.СчетФактураНомерВх = РезультатЗакрытия.НомерСФ
		И ТекущиеДанные.СчетФактураДатаВх = РезультатЗакрытия.ДатаСФ Тогда 
		Возврат;
	КонецЕсли;

	ДанныеСтроки = Новый Структура("ПредъявленСФ, 
	|СчетФактураДатаВх, СчетФактураНомерВх, Исправление, КодВидаОперации, Продавец, 
	|НомерИсправления, ДатаИсправления, КорректировочныйСчетФактура, Продавец, 
	|НомерИсходногоДокумента, ДатаИсходногоДокумента, 
	|УчитыватьИсправлениеИсходногоДокумента, НомерИсправленияИсходногоДокумента, 
	|ДатаИсправленияИсходногоДокумента, ПродавецДоступен, РеквизитыСчетаФактуры, РеквизитыСчетаФактурыЗаполнены");
	
	ЗаполнитьЗначенияСвойств(ДанныеСтроки, РезультатЗакрытия);
	ДанныеСтроки.СчетФактураНомерВх = РезультатЗакрытия.НомерСФ;
	ДанныеСтроки.СчетФактураДатаВх = РезультатЗакрытия.ДатаСФ;
	ДанныеСтроки.КорректировочныйСчетФактура = Не РезультатЗакрытия.СтандартныйСчетФактура;
	
	ЗаполнитьРеквизитыСчетаФактуры(ДанныеСтроки);
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеСтроки);
	
	СтрокиПоПартии = НДСПоОстаткам.НайтиСтроки(Новый Структура("Партия", ТекущиеДанные.Партия));
	
	Для Каждого СтрокаПоПартии Из СтрокиПоПартии Цикл
		
		ЗаполнитьЗначенияСвойств(СтрокаПоПартии, ДанныеСтроки);
		
	КонецЦикла;
	
	Модифицированность = Истина;
	РассчитатьВозможностьПодготовитьКВычету();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПересчитатьСуммыПриИзмененииСтавкаНДС(СтрокаТаблицы)
	
	ПоискПоНоменклатуре = Новый Структура();
	ПоискПоНоменклатуре.Вставить("Партия", СтрокаТаблицы.Партия);
	ПоискПоНоменклатуре.Вставить("Номенклатура", СтрокаТаблицы.Номенклатура);
	СвязанныеСтроки = НДСПоОстаткам.НайтиСтроки(ПоискПоНоменклатуре);
	СтрокаТаблицы.СуммаНДС = 0;
	СтрокаТаблицы.СуммаБезНДС = 0;
	Для Каждого СвязаннаяСтрока Из СвязанныеСтроки Цикл 
		СвязаннаяСтрока.СтавкаНДС = СтрокаТаблицы.СтавкаНДС;
		СвязаннаяСтрока.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(СвязаннаяСтрока.Всего, Истина, 
			УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СвязаннаяСтрока.СтавкаНДС));
		СвязаннаяСтрока.СуммаБезНДС = СвязаннаяСтрока.Всего - СвязаннаяСтрока.СуммаНДС;
		
		СтрокаТаблицы.СуммаНДС = СтрокаТаблицы.СуммаНДС + СвязаннаяСтрока.СуммаНДС;
		СтрокаТаблицы.СуммаБезНДС = СтрокаТаблицы.СуммаБезНДС + СвязаннаяСтрока.СуммаБезНДС;
	КонецЦикла;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСуммыВПартии()
	
	СтрокаПартии = Партии.НайтиПоИдентификатору(ПартияИдентификаторСтроки);
	СтрокаПартии.СуммаНДС = Товары.Итог("СуммаНДС");
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьВидимостьПодсказокНаСервере()
	
	НаименованиеРаздела = УправлениеПанельюПодсказкиКлиентСервер.НаименованиеОткрытогоРаздела(ЭтотОбъект);
	
	Если Элементы.ИзменитьВидимостьПодсказок.Пометка Тогда
		
		Состояние = Ложь;
		Элементы.ИзменитьВидимостьПодсказок.Картинка = БиблиотекаКартинок.СтрелкаВлево;
		УправлениеПанельюПодсказкиКлиентСервер.ЗаписатьОперациюБизнесСтатистики(
			СтрШаблон("%1.ЗакрытиеФормы", НаименованиеРаздела));
		
	Иначе
		
		Состояние = Истина;
		Элементы.ИзменитьВидимостьПодсказок.Картинка = БиблиотекаКартинок.СтрелкаВправо;
		УправлениеПанельюПодсказкиКлиентСервер.ЗаписатьОперациюБизнесСтатистики(
			СтрШаблон("%1.ОткрытиеФормы", НаименованиеРаздела));
		
	КонецЕсли;
	
	Элементы.ИзменитьВидимостьПодсказок.Пометка = Состояние;
	Элементы.ПанельПодсказки.Видимость = Состояние;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНДСПоПартииНаСервере(СтавкаНДС)
	
	Для Каждого СтрокаТовары Из Товары Цикл 
		СтрокаТовары.СтавкаНДС = СтавкаНДС;
		ТоварыПересчитатьСуммыПриИзмененииСтавкаНДС(СтрокаТовары);
	КонецЦикла;
	ОбновитьСуммыВПартии();
	РассчитатьВозможностьПодготовитьКВычету();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНДСПоНоменклатуреПоПартииНаСервере()
	
	СтрокаПартии = Партии.НайтиПоИдентификатору(ПартияИдентификаторСтроки);
	
	ТЗТовары = РеквизитФормыВЗначение("Товары");
	Номенклатура = ТЗТовары.ВыгрузитьКолонку("Номенклатура");
	ВидыСтавокНДСПоТоварам = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Номенклатура, "ВидСтавкиНДС");
	
	Для Каждого ВидСтавкиНДСПоТоварам Из ВидыСтавокНДСПоТоварам Цикл 
		СтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(ВидСтавкиНДСПоТоварам.Значение, СтрокаПартии.Дата);
		СтрокиТовары = ТЗТовары.НайтиСтроки(Новый Структура("Номенклатура", ВидСтавкиНДСПоТоварам.Ключ));
		Для Каждого СтрокаТовары Из СтрокиТовары Цикл 
			СтрокаТовары.СтавкаНДС = СтавкаНДС;
		КонецЦикла;
	КонецЦикла;
	ЗначениеВРеквизитФормы(ТЗТовары, "Товары");
	
КонецПроцедуры

&НаСервере
Функция МакисмальнаяСуммаНДСДоступнаяКВычету()
	
	Возврат УчетНДСКлиентСервер.РассчитатьСуммуНДС(РеквизитФормыВЗначение("Партии").Итог("Всего"), Истина, 
		УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтавкаНДС));
	
КонецФункции

&НаСервере
Процедура ЗагрузитьВНДСПоОстаткамИзВременногоХранилища(Адрес)
	
	НДСПоОстаткам.Загрузить(ПолучитьИзВременногоХранилища(Адрес));
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьДанные();
		Оповестить("ПодготовкаКВычетуНДСОбновитьПослеДозаполнения");
		Модифицированность = Ложь;
		Закрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанные()
	
	Обработки.ПодготовкаКВычетуНДСУчтенногоВСтоимости.СохранитьВХранилище(РеквизитыФормы(Истина));
	
КонецПроцедуры

#КонецОбласти





