#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
		
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием(ПараметрыВыполненияКоманды);
	ПараметрыОткрытия.ИмяФормы = "Документ.СведенияОбУдержанномНДФЛ.ФормаСписка";
	ПараметрыОткрытия.Заголовок = НСтр("ru ='Сведения об удержанном НДФЛ'");
	ПараметрыОткрытия.ЗамерПроизводительности = "ПростойИнтерфейсСведенияОбУдержанномНДФЛ";

	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти