#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	//
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ЗаполнитьПриОткрытии = Ложь;
	Если Параметры.Ключ.Пустая() Тогда
		Параметры.Свойство("ЗаполнениеИзПомощника", ЗаполнениеИзПомощника);
		Если ЗаполнениеИзПомощника Тогда
			ЗаполнитьЗначенияСвойств(Объект, Параметры, "Организация, РазделУчета, Дата");
			СчетУчетаПодраздела = Параметры.СчетУчетаПодраздела;
		КонецЕсли;
		Объект.ПодразделениеОрганизации = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ЗаполнениеИзПомощника Тогда
		ЗаполнитьНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьСостояниеДокумента();
	ЗаполнитьДобавленныеКолонки();
	УстановитьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Организация", Объект.Организация);
	ПараметрыОповещения.Вставить("РазделУчета", Объект.РазделУчета);
	ПараметрыОповещения.Вставить("СчетУчетаПодраздела", СчетУчетаПодраздела);
	Оповестить("ОбновитьФормуПомощникаИнвентаризации", ПараметрыОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СчетаУчетаУстановитьФлажки(Команда)
	
	СчетаУчетаУстановитьСнятьФлажки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаУчетаСнятьФлажки(Команда)
	
	СчетаУчетаУстановитьСнятьФлажки(Ложь);
	
КонецПроцедуры

#Область СтандартныеПодсистемы_ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Асинх Процедура ОрганизацияПриИзменении(Элемент)
	
	ПредупреждениеОЗаписи = "";
	Если Объект.Проведен Тогда
		ПредупреждениеОЗаписи = НСтр("ru = 'Перед заполнением документ будет записан.'");
	КонецЕсли;
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Перезаполнить таблицу ""Объекты учета""?
		|%1'"),
		ПредупреждениеОЗаписи);
		
	Если ЗначениеЗаполнено(Объект.ОбъектыУчета)
		И Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ЗаполнитьНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыУчета

&НаКлиенте
Процедура ОбъектыУчетаПередНачаломИзменения(Элемент, Отказ)
	
	СтрокаТаблицы = Элементы.ОбъектыУчета.ТекущиеДанные;
	
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма);
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, СтрокаТаблицы.СчетУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыУчетаПриИзменении(Элемент)
	
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыУчетаСчетУчетаПриИзменении(Элемент)

	СтрокаТаблицы = Элементы.ОбъектыУчета.ТекущиеДанные;
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, СтрокаТаблицы.СчетУчета);
	
	ПоляОбъекта = Новый Структура("Организация, Субконто1, Субконто2, Субконто3",
		Объект.Организация, "Субконто1", "Субконто2", "Субконто3");
		
	БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(СтрокаТаблицы.СчетУчета, СтрокаТаблицы, ПоляОбъекта, Истина,, Ложь);
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма);
	ЗаполнитьДобавленныеКолонки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыУчетаСубконто1ПриИзменении(Элемент)
	
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыУчетаСубконто2ПриИзменении(Элемент)
	
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыУчетаСубконто3ПриИзменении(Элемент)
	
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыУчетаСубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтрокаТаблицы = Элементы.ОбъектыУчета.ТекущиеДанные;

	ПараметрыДокумента = ПолучитьСписокПараметров(ЭтаФорма, СтрокаТаблицы, "Субконто%Индекс%");
	ПараметрыДокумента.Вставить("СчетУчета", СтрокаТаблицы.СчетУчета);
	ОбщегоНазначенияБПКлиент.НачалоВыбораЗначенияСубконто(ЭтаФорма, Элемент, СтандартнаяОбработка, ПараметрыДокумента);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИнвентаризационнаяКомиссия

&НаКлиенте
Процедура ИнвентаризационнаяКомиссияПередУдалением(Элемент, Отказ)
	ИнвентаризацияАктивовОбязательствКлиент.ИнвентаризационнаяКомиссияПередУдалением(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризационнаяКомиссияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ИнвентаризацияАктивовОбязательствКлиент.ИнвентаризационнаяКомиссияОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризационнаяКомиссияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ИнвентаризацияАктивовОбязательствКлиент.ИнвентаризационнаяКомиссияПриНачалеРедактирования(ЭтотОбъект, Копирование);
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризационнаяКомиссияФизЛицоПриИзменении(Элемент)
	ИнвентаризацияАктивовОбязательствКлиент.ИнвентаризационнаяКомиссияФизЛицоПриИзменении(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризационнаяКомиссияФизЛицоОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	ИнвентаризацияАктивовОбязательствКлиент.ИнвентаризационнаяКомиссияИсключитьДублиФизическихЛиц(
		Объект.ИнвентаризационнаяКомиссия,
		Элементы.ИнвентаризационнаяКомиссия,
		ВыбранноеЗначение,
		СтандартнаяОбработка);
		
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризационнаяКомиссияПредседательПриИзменении(Элемент)
	ИнвентаризацияАктивовОбязательствКлиент.ИнвентаризационнаяКомиссияПредседательПриИзменении(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура Заполнить(Команда)
	
	ТекстВопросаУдалениеСтрок = НСтр("ru = 'Перед заполнением все строки таблицы ""Объекты учета"" будут удалены. Продолжить?'");
		
	Если Не ЗначениеЗаполнено(Объект.ОбъектыУчета)
		Или Ждать ВопросАсинх(ТекстВопросаУдалениеСтрок, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьНаКлиенте();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборФизическихЛиц(Команда)
	ИнвентаризацияАктивовОбязательствКлиент.ПодборФизическихЛиц(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКомиссиюИзПредыдущегоДокумента(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, , НСтр("ru = 'Организация'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.Организация");
		Возврат;
	КонецЕсли;
	
	ТекстПредупреждения = ЗаполнитьИнвентаризационнуюКомиссию();
	Если ЗначениеЗаполнено(ТекстПредупреждения) Тогда
		ПоказатьПредупреждение(,ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	// Ограничение выбора счета учета
	СчетаДляИнвентаризации = ИнвентаризацияАктивовОбязательств.СчетаДляИнвентаризации(Объект.РазделУчета, Объект.Дата, Объект.Организация);
	СчетаУчета = СчетаДляИнвентаризации.СчетаУчета;
	
	Если Объект.СчетаУчета.Количество() = 0 Тогда
		Для Каждого Счет Из СчетаУчета Цикл
			НоваяСтрокаСчетаУчета = Объект.СчетаУчета.Добавить();
			НоваяСтрокаСчетаУчета.СчетУчета = Счет;
			НоваяСтрокаСчетаУчета.УчаствуетВРасчетах = Истина;
			Если Объект.РазделУчета = Перечисления.РазделыУчетаДляИнвентаризации.ПрочиеСчетаБухгалтерскогоУчета
				Или Объект.РазделУчета = Перечисления.РазделыУчетаДляИнвентаризации.ЗабалансовыеСчета
				Или Объект.РазделУчета = Перечисления.РазделыУчетаДляИнвентаризации.НезавершенноеПроизводство Тогда
				Если ЗначениеЗаполнено(СчетУчетаПодраздела) И Счет <> СчетУчетаПодраздела Тогда
					НоваяСтрокаСчетаУчета.УчаствуетВРасчетах = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если Объект.РазделУчета = Перечисления.РазделыУчетаДляИнвентаризации.ЗабалансовыеСчета
				И СчетаДляИнвентаризации.ИсключаемыеСчета.Найти(Счет) <> Неопределено Тогда
				НоваяСтрокаСчетаУчета.УчаствуетВРасчетах = Ложь;
			КонецЕсли;
		КонецЦикла;
	Иначе
		СчетаУчета = Объект.СчетаУчета.Выгрузить().ВыгрузитьКолонку("СчетУчета");
	КонецЕсли;
	
	УчетПоПодразделениям = Ложь;
	Элементы.ОбъектыУчетаКоличество.Видимость = Ложь;
	Элементы.ОбъектыУчетаВалюта.Видимость = Ложь;
	Элементы.ОбъектыУчетаВалютнаяСумма.Видимость = Ложь;
	
	УсловиеОтбора = БухгалтерскийУчет.НовыеУсловияОтбораСубсчетов();
	УсловиеОтбора.ИспользоватьВПроводках = Истина;
	УсловиеОтбора.СчетаИсключения = СчетаДляИнвентаризации.ИсключаемыеСчета;
	Для Каждого СтрокаСчетУчета Из Объект.СчетаУчета Цикл
		Если Не СтрокаСчетУчета.УчаствуетВРасчетах Тогда
			Продолжить;
		КонецЕсли;
		МассивСчетов = Новый Массив;
		МассивСчетов.Добавить(СтрокаСчетУчета.СчетУчета);
		СчетУчетаСубсчета = БухгалтерскийУчет.СформироватьМассивСубсчетовПоОтбору(МассивСчетов, УсловиеОтбора);
		УстановитьВидимостьОбъектыУчета(СчетУчетаСубсчета, УчетПоПодразделениям)
	КонецЦикла;
	Элементы.ПодразделениеОрганизации.Видимость = УчетПоПодразделениям;
	Элементы.ОбъектыУчетаПодразделение.Видимость = УчетПоПодразделениям;
	
	УсловияОтбора = БухгалтерскийУчет.НовыеУсловияОтбораСубсчетов();
	УсловияОтбора.ИспользоватьВПроводках = Истина;
	УсловияОтбора.СчетаИсключения = СчетаДляИнвентаризации.ИсключаемыеСчета;
	СчетаДляОтбора = БухгалтерскийУчет.СформироватьМассивСубсчетовПоОтбору(СчетаУчета, УсловияОтбора);
	
	УсловияОтбора = БухгалтерскийУчет.НовыеУсловияОтбораСубсчетов();
	УсловияОтбора.СчетаИсключения = СчетаДляИнвентаризации.ИсключаемыеСчета;
	СчетаДляОтбораСРодителями = БухгалтерскийУчет.СформироватьМассивСубсчетовПоОтбору(СчетаУчета, УсловияОтбора);
	
	ОтборПоПризнакуЗабалансовый = ?(Объект.РазделУчета = Перечисления.РазделыУчетаДляИнвентаризации.ЗабалансовыеСчета, Истина, Ложь);
	
	БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораСчета(Элементы.ОбъектыУчетаСчетУчета, СчетаДляОтбора,, ОтборПоПризнакуЗабалансовый);
	
	Если Объект.РазделУчета = Перечисления.РазделыУчетаДляИнвентаризации.НезавершенноеПроизводство Тогда
		БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораСчета(Элементы.СчетаУчетаСчетУчета, СчетаДляОтбора,, ОтборПоПризнакуЗабалансовый, Неопределено);
	ИначеЕсли Объект.РазделУчета = Перечисления.РазделыУчетаДляИнвентаризации.ПрочиеСчетаБухгалтерскогоУчета Тогда
		БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораСчета(Элементы.СчетаУчетаСчетУчета,,, ОтборПоПризнакуЗабалансовый, Неопределено);
	Иначе
		БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораСчета(Элементы.СчетаУчетаСчетУчета, СчетаДляОтбораСРодителями,, ОтборПоПризнакуЗабалансовый, Неопределено);
	КонецЕсли;
	
	УстановитьФункциональныеОпцииФормы();
	ЗаполнитьДобавленныеКолонки();
	УстановитьЗаголовокФормы();
	УстановитьСостояниеДокумента();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаКлиенте()
	
	ДлительнаяОперация = НачатьЗаполнение();
	ОжидатьЗавершениеЗаполнения(ДлительнаяОперация);
	
КонецПроцедуры

&НаСервере
Функция НачатьЗаполнение()
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("Дата",              Объект.Дата);
	ПараметрыОперации.Вставить("Организация",       Объект.Организация);
	ПараметрыОперации.Вставить("РазделУчета",       Объект.РазделУчета);
	ПараметрыОперации.Вставить("Подразделение",     Объект.ПодразделениеОрганизации);
	ПараметрыОперации.Вставить("ОтветственноеЛицо", Объект.ОтветственноеЛицо);
	ВыбранныеСчета = Новый Массив;
	Для Каждого СтрокаСчета Из Объект.СчетаУчета Цикл
		Если ЗначениеЗаполнено(СтрокаСчета.СчетУчета) И СтрокаСчета.УчаствуетВРасчетах Тогда
			ВыбранныеСчета.Добавить(СтрокаСчета.СчетУчета);
		КонецЕсли;
	КонецЦикла;
	ПараметрыОперации.Вставить("СчетаУчета", ВыбранныеСчета);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"Документы.ИнвентаризацияОбъектовУчета.ДанныеПоУчету",
		ПараметрыОперации);
	
КонецФункции

&НаКлиенте
Процедура ОжидатьЗавершениеЗаполнения(ДлительнаяОперация)
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершениеОперации = Новый ОписаниеОповещения("ЗавершитьЗаполнение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ЗавершениеОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьЗаполнение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение НСтр("ru = 'Не удалось заполнить документ. Подробная информация в журнале регистрации.'");
	КонецЕсли;
	
	ЗавершитьЗаполнениеНаСервере(Результат.АдресРезультата);
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьЗаполнениеНаСервере(АдресРезультата)
	
	ДанныеЗаполнения = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ОбъектыУчета.Загрузить(ДанныеЗаполнения.ОбъектыУчета);
	ЗаполнитьДобавленныеКолонки();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонки()
	
	// Установим еще раз видимость от конкретного списка счетов
	МассивСчетов = Объект.ОбъектыУчета.Выгрузить().ВыгрузитьКолонку("СчетУчета");
	СчетаУчета = ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(МассивСчетов);
	
	Если СчетаУчета.Количество() <> 0 Тогда
		УчетПоПодразделениям = Ложь;
		Элементы.ОбъектыУчетаКоличество.Видимость = Ложь;
		Элементы.ОбъектыУчетаВалюта.Видимость = Ложь;
		Элементы.ОбъектыУчетаВалютнаяСумма.Видимость = Ложь;
		
		УстановитьВидимостьОбъектыУчета(СчетаУчета, УчетПоПодразделениям);
		Элементы.ПодразделениеОрганизации.Видимость = УчетПоПодразделениям;
		Элементы.ОбъектыУчетаПодразделение.Видимость = УчетПоПодразделениям;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из Объект.ОбъектыУчета Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.СчетУчета) Тогда
			
			СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрокаТаблицы.СчетУчета);
			
			КоличествоСубконто = СвойстваСчета.КоличествоСубконто;
			Для Индекс = 1 По 3 Цикл
				СтрокаТаблицы["Субконто" + Индекс + "Доступность"] = (Индекс <= КоличествоСубконто) И Не СвойстваСчета["ВидСубконто" + Индекс + "ТолькоОбороты"];
			КонецЦикла;
			СтрокаТаблицы.СчетУчетаВалютный       = СвойстваСчета.Валютный;
			СтрокаТаблицы.СчетУчетаКоличественный = СвойстваСчета.Количественный;
			
			Если СвойстваСчета.Вид = ВидСчета.Активный И СтрокаТаблицы.Сумма < 0 Тогда
				СтрокаТаблицы.Сумма = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	//Субконто
	Для Сч = 1 По 3 Цикл
		
		// Если субконто нет на счете, то делаем его недоступным,
		// а для 2-го и 3-его субконто скрываем его полностью, чтобы не занимать лишную строку.
		// Первое субконто не скрываем, чтобы колонка не "мигала" для разных строк.
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОбъектыУчетаСубконто" + Сч);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ОбъектыУчета.Субконто" + Сч + "Доступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);
		Если Сч = 1 Тогда
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
		Иначе
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		КонецЕсли;
		
		// Пустое субконто в виде <...>
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОбъектыУчетаСубконто" + Сч);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ОбъектыУчета.Субконто" + Сч + "Доступность", ВидСравненияКомпоновкиДанных.Равно, Истина);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ОбъектыУчета.Субконто" + Сч, ВидСравненияКомпоновкиДанных.НеЗаполнено);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<...>'"));
		
	КонецЦикла;
	
	// Количество
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОбъектыУчетаКоличество");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОбъектыУчета.СчетУчетаКоличественный", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// ВалютнаяСумма
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОбъектыУчетаВалютнаяСумма");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОбъектыУчета.СчетУчетаВалютный", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не требуется>'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Валюта
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОбъектыУчетаВалюта");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОбъектыУчета.СчетУчетаВалютный", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконто(Форма, Счет)
	
	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
		"ОбъектыУчетаСубконто1",
		"ОбъектыУчетаСубконто2",
		"ОбъектыУчетаСубконто3");
	
	БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Счет, Форма, ПоляФормы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьПараметрыВыбораПолейСубконто(Форма)
	
	Если Форма.Элементы.ОбъектыУчета.ТекущаяСтрока <> Неопределено Тогда
		СтрокаТаблицы = Форма.Объект.ОбъектыУчета.НайтиПоИдентификатору(Форма.Элементы.ОбъектыУчета.ТекущаяСтрока);
		ПараметрыДокумента = ПолучитьСписокПараметров(Форма, СтрокаТаблицы, "Субконто%Индекс%");
		БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(Форма, СтрокаТаблицы, "Субконто%Индекс%", "ОбъектыУчетаСубконто%Индекс%", ПараметрыДокумента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокПараметров(Форма, Объект, ШаблонИмяПоляОбъекта)
	
	СписокПараметров = Новый Структура;
	БухгалтерскийУчетКлиентСервер.ДополнитьСписокПараметровСубконто(СписокПараметров, Объект, ШаблонИмяПоляОбъекта);
	СписокПараметров.Вставить("Организация" , Форма.Объект.Организация);
	
	Возврат СписокПараметров;
	
КонецФункции

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	ТекстЗаголовка = НСтр("ru = 'Инвентаризация объектов учета'");
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1 %2 от %3'"), ТекстЗаголовка, Объект.Номер, Формат(Объект.Дата, "ДЛФ=D"));
	Иначе
		ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 %2'"), ТекстЗаголовка, НСтр("ru = ' (создание)'"));
	КонецЕсли;
	
	Заголовок = ТекстЗаголовка + " (" + Строка(Объект.РазделУчета) + ")";

КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()
	
	ОбщегоНазначенияБПКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОбъектыУчета(СчетаУчета, УчетПоПодразделениям)

	Для Каждого Счет Из СчетаУчета Цикл
		СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
		Если Не УчетПоПодразделениям И СвойстваСчета.УчетПоПодразделениям Тогда
			УчетПоПодразделениям = Истина;
		КонецЕсли;
		Если Не Элементы.ОбъектыУчетаКоличество.Видимость И СвойстваСчета.Количественный Тогда
			Элементы.ОбъектыУчетаКоличество.Видимость = Истина;
		КонецЕсли;
		Если Не Элементы.ОбъектыУчетаВалюта.Видимость И СвойстваСчета.Валютный Тогда
			Элементы.ОбъектыУчетаВалюта.Видимость = Истина;
			Элементы.ОбъектыУчетаВалютнаяСумма.Видимость = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаУчетаУстановитьСнятьФлажки(Флаг)
	
	Для Каждого ТекущаяСтрока Из Объект.СчетаУчета Цикл
		
		ТекущаяСтрока.УчаствуетВРасчетах = Флаг;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьИнвентаризационнуюКомиссию()
	
	Возврат ИнвентаризацияАктивовОбязательств.ЗаполнитьИнвентаризационнуюКомиссию(Объект);
	
КонецФункции

#КонецОбласти
