#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЭтоУдалениеНабораЗаписей(Замещение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого Запись ИЗ ЭтотОбъект Цикл
		РаспознаваниеДокументовСлужебный.УстановитьПараметрРегламентногоЗадания(
			Метаданные.РегламентныеЗадания.УдалениеУстаревшихРаспознанныхДокументов,
			"Использование",
			Запись.АвтоматическиУдалятьОбработанныеИПомеченныеНаУдаление
		);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли