
#Область ОписаниеПеременных

&НаКлиенте
Перем ОбновитьИнтерфейс; // Индикатор обновления интерфейса

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	УстановитьДоступность();
	
	ДобавитьСервисДоставки(СервисДоставкиКлиентСервер.ТипГрузоперевозкиСервис1СДоставка(), "ИспользоватьСервис1СДоставка");
	ДобавитьСервисДоставки(СервисДоставкиКлиентСервер.ТипГрузоперевозкиСервис1ССДЭК(), "ИспользоватьСервис1ССДЭК");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НаборКонстант"
		И (Источник = "ИспользоватьОбменБизнесСеть"
		ИЛИ Источник = "ИспользоватьСервис1СДоставка"
		ИЛИ Источник = "ИспользоватьСервис1СКурьер"
		ИЛИ Источник = "ИспользоватьСервис1СКурьерика")
		Тогда
		Прочитать();
		УстановитьДоступность();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПомощникПодключенияБизнесСеть(Команда)
	ФормаПомощникаБизнесСети = "Обработка.БизнесСеть.Форма.РегистрацияОрганизаций";
	ОткрытьФорму(ФормаПомощникаБизнесСети);
КонецПроцедуры


#КонецОбласти  

#Область ОбработчикиСобытийШапкиФормы

&НаКлиенте
Процедура СервисыДоставкиПриИзменении(Элемент)

	ТекущиеДанные = Элемент.ТекущиеДанные;
	ТипГрузоперевозки = ТекущиеДанные.ТипГрузоперевозки;
		
	Если Элемент.ТекущийЭлемент = Элементы.СервисыДоставкиИспользоватьСервисДоставки Тогда
		ЗначениеРеквизита = ТекущиеДанные.ИспользоватьСервисДоставки;
		Если ЗначениеРеквизита Тогда
			СервисДоставкиВызовСервера.ЗаполнитьНастройкиОбщиеСервисДоставкиПоУмолчанию(ТипГрузоперевозки);
		КонецЕсли;
		Если ТипГрузоперевозки = СервисДоставкиКлиентСервер.ТипГрузоперевозкиСервис1СДоставка() Тогда
			РеквизитПутьКДанным = "Константа_ИспользоватьСервис1СДоставка";
		ИначеЕсли ТипГрузоперевозки = СервисДоставкиКлиентСервер.ТипГрузоперевозкиСервис1ССДЭК() Тогда
			РеквизитПутьКДанным = "Константа_ИспользоватьСервис1ССДЭК";
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Подключаемый_ПриИзмененииРеквизитаТабличнойЧасти(РеквизитПутьКДанным, ЗначениеРеквизита);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьСервисДоставки(ТипГрузоперевозки, ИмяФО)
	Сервис = СервисыДоставки.Добавить();
	Сервис.ТипГрузоперевозки = ТипГрузоперевозки;
	Сервис.СервисДоставки = СервисДоставкиКлиентСервер.ПредставлениеТипаГрузоперевозки(Сервис.ТипГрузоперевозки);
	Сервис.ИспользоватьСервисДоставки = ПолучитьФункциональнуюОпцию(ИмяФО);
	Сервис.НастройкаПодключения = НСтр("ru = 'Настроить'");
	Сервис.ОбщиеНастройки = НСтр("ru = 'Настроить'");
	Сервис.Подсказка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаТабличнойЧасти(РеквизитПутьКДанным, ЗначениеРеквизита, ОбновлятьИнтерфейс = Истина)
	
	Результат = Новый Структура;
	
	СохранитьЗначениеРеквизита(РеквизитПутьКДанным, Результат, ЗначениеРеквизита);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Если ОбновлятьИнтерфейс Тогда
		
		ОбновитьИнтерфейс = Истина;
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 1, Истина);
		
	КонецЕсли;
	
	Если Результат.Свойство("ОповещениеФорм") Тогда
		Оповестить(Результат.ОповещениеФорм.ИмяСобытия, Результат.ОповещениеФорм.Параметр,
			Результат.ОповещениеФорм.Источник);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СервисыДоставкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОчиститьСообщения();
	
	ТекущиеДанные = СервисыДоставки[ВыбраннаяСтрока];
	
	Если Не ТекущиеДанные.ИспользоватьСервисДоставки Тогда
		Индекс = СервисыДоставки.Индекс(ТекущиеДанные);
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр(
			"ru = 'Для настройки подключения необходимо активировать сервис доставки.'"), ,
			 "СервисыДоставки[" + Индекс + "].ИспользоватьСервисДоставки");
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.СервисыДоставкиНастройкаПодключения Тогда
		
		ПараметрыФормы = СервисДоставкиКлиент.НовыйПараметрыОткрытьФормуСервисаДоставки();
		ПараметрыФормы.ИмяФормы = "ДоступныеПеревозчики";
		ПараметрыФормы.ТипГрузоперевозки = ТекущиеДанные.ТипГрузоперевозки;
		ПараметрыФормы.ЗаполнятьОрганизациюПоУмолчанию = Истина;
		ПараметрыФормы.ОрганизацияБизнесСети = ОрганизацияБизнесСети();
		
		СервисДоставкиКлиент.ОткрытьФормуСервисаДоставки(ПараметрыФормы);
		
	ИначеЕсли Поле = Элементы.СервисыДоставкиИнформация Тогда
		
		ПараметрыФормы = СервисДоставкиКлиент.НовыйПараметрыОткрытьФормуСервисаДоставки();
		ПараметрыФормы.ИмяФормы = "КарточкаГрузоперевозчика";
		ПараметрыФормы.ТипГрузоперевозки = ТекущиеДанные.ТипГрузоперевозки;
		ПараметрыФормы.ЗаполнятьОрганизациюПоУмолчанию = Истина;
		ПараметрыФормы.ОрганизацияБизнесСети = ОрганизацияБизнесСети();
		
		СервисДоставкиКлиент.ОткрытьФормуСервисаДоставки(ПараметрыФормы);
	ИначеЕсли Поле = Элементы.СервисыДоставкиОбщиеНастройки Тогда
		
		ПараметрыФормы = СервисДоставкиКлиент.НовыйПараметрыОткрытьФормуСервисаДоставки();
		ПараметрыФормы.ИмяФормы = "ОбщиеНастройки";
		ПараметрыФормы.ТипГрузоперевозки = ТекущиеДанные.ТипГрузоперевозки;
		ПараметрыФормы.ЗаполнятьОрганизациюПоУмолчанию = Истина;
		ПараметрыФормы.ОрганизацияБизнесСети = ОрганизацияБизнесСети();
		СервисДоставкиКлиент.ОткрытьФормуОбщиеНастройкиСервисаДоставки(ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура СохранитьЗначениеРеквизита(Знач РеквизитПутьКДанным, Результат, ЗначениеРеквизита = "ЗначениеРеквизита")
	
	// Сохранение значений реквизитов, не связанных с константами напрямую (в отношении один-к-одному).
	Если РеквизитПутьКДанным = "" Тогда
		Возврат;
	КонецЕсли;
	
	// Определение имени константы.
	КонстантаИмя = "";
	Если НРег(Лев(РеквизитПутьКДанным, 10)) = НРег("Константа_") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 11);
	Иначе
		// Определение имени и запись значения реквизита в соответствующей константе из "НаборКонстант".
		// Используется для тех реквизитов формы, которые связаны с константами напрямую (в отношении один-к-одному).
	КонецЕсли;
	
	// Сохранения значения константы.
	Если КонстантаИмя <> "" Тогда
		
		ЗначениеРеквизита = ?(ЗначениеРеквизита = "ЗначениеРеквизита", ЭтотОбъект[РеквизитПутьКДанным], ЗначениеРеквизита);
		
		Если Константы[КонстантаИмя].Получить() <> ЗначениеРеквизита Тогда
			Константы[КонстантаИмя].Установить(ЗначениеРеквизита);
		КонецЕсли;
		
		ОповещениеФорм = Новый Структура(
			"ИмяСобытия, Параметр, Источник",
			"Запись_НаборКонстант", Неопределено, КонстантаИмя);
		Результат.Вставить("ОповещениеФорм", ОповещениеФорм);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность(РеквизитПутьКДанным = "")
	
	ЕстьОбменБизнесСеть = ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.БизнесСеть");
	ВключенСервисБизнесСеть = Константы["ИспользоватьОбменБизнесСеть"].Получить();
	
	Элементы.ПанельОшибки.Видимость = НЕ ЕстьОбменБизнесСеть ИЛИ (ЕстьОбменБизнесСеть И НЕ ВключенСервисБизнесСеть);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОрганизацияБизнесСети()
	
	ОрганизацияБизнесСетиСсылка = Неопределено;
	
	ОбщийМодульБизнесСеть = ОбщегоНазначения.ОбщийМодуль("БизнесСеть");
	ДанныеОрганизаций = ОбщийМодульБизнесСеть.ПодключенныеОрганизации();
	
	Если ДанныеОрганизаций.Количество() Тогда
		
		Если ДанныеОрганизаций.Количество() = 1 Тогда
			ОрганизацияБизнесСетиСсылка = ДанныеОрганизаций[0].Организация;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОрганизацияБизнесСетиСсылка;
	
КонецФункции

#КонецОбласти
