Функция НачатьЗагрузкуBNovo(УникальныйИдентификатор, ПараметрыЗагрузки) Экспорт
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "ИнтеграцияBnovo.ЗагрузитьДанные", 
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗагрузки, "Организация"), 
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗагрузки, "Гостиница"),
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗагрузки, "Период"));
КонецФункции 

