#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Номенклатура 						= Объект.Владелец;
	ЕдиницаХраненияОстатковНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "ЕдиницаИзмерения");
	
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Коэффициент = 1;
		ЭтоНовый = Истина;
	Иначе
		ТекущиеПараметры 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ссылка, "ЕдиницаИзмерения,Коэффициент");
		ТекущаяЕдиница 		= ТекущиеПараметры.ЕдиницаИзмерения;
		ТекущийКоэффициент 	= ТекущиеПараметры.Коэффициент;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ЕдиницаИзмерения = УпаковкиВызовСервера.ЕдиницаПоУмолчанию(Номенклатура) Тогда
		Объект.ЕдиницаИзмерения 	= ?(ЗначениеЗаполнено(ТекущаяЕдиница), ТекущаяЕдиница, Неопределено);
		ЭтаФорма.Модифицированность = ?(ЗначениеЗаполнено(ТекущаяЕдиница), Ложь, Истина);
		ТекстОшибки 				= "%1 упаковки не может быть равна %1 номенклатуры";
		СообщитьПользователюОбОшибке(ТекстОшибки, "Единица измерения", Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		УпаковкаИспользуетсяВДокументах = ?(ЭтоНовый, Ложь, УпаковкиВызовСервера.УпаковкаИспользуетсяВДокументах(Объект.Ссылка)); 
		ТекстОшибки 					= "Упаковка уже используется в документах. Изменение значения реквизита %1 не допускается";
		
		Если Не ЭтоНовый И Объект.ЕдиницаИзмерения <> ТекущаяЕдиница И УпаковкаИспользуетсяВДокументах Тогда
			Объект.ЕдиницаИзмерения 	= ТекущаяЕдиница;
			ЭтаФорма.Модифицированность = Ложь;
			СообщитьПользователюОбОшибке(ТекстОшибки, "Единица измерения", Отказ);
		КонецЕсли;
		
		Если Не ЭтоНовый И Объект.Коэффициент <> ТекущийКоэффициент И УпаковкаИспользуетсяВДокументах Тогда
			Объект.Коэффициент 			= ТекущийКоэффициент;
			ЭтаФорма.Модифицированность = Ложь;
			СообщитьПользователюОбОшибке(ТекстОшибки, "Коэффициент", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Отказ Тогда
		УстановитьНаименованиеУпаковкиНаСервере();	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЭтоНовый = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении(Элемент)
		
	УстановитьНаименованиеУпаковкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентПриИзменении(Элемент)
		
	УстановитьНаименованиеУпаковкиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьНаименованиеУпаковкиНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.Коэффициент) ИЛИ НЕ  ЗначениеЗаполнено(Объект.ЕдиницаИзмерения) Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеЕдиницыХранения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдиницаХраненияОстатковНоменклатуры, "Наименование");
	НаименованиеУпаковки 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЕдиницаИзмерения, "Наименование");
	СтрокаКоэффицент 			= Формат(Объект.Коэффициент, "ЧН = ; ЧГ = 0");
	РазныеЕдиницы 				= ЕдиницаХраненияОстатковНоменклатуры <> Объект.ЕдиницаИзмерения; 
	
	Объект.Наименование = НаименованиеУпаковки + ?(РазныеЕдиницы," (" + СтрокаКоэффицент + " " + НаименованиеЕдиницыХранения + ")", "");
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьПользователюОбОшибке(ТекстСообщения, ИмяРеквизита, Отказ) 
	
	ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяРеквизита);
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "Объект." + СтрЗаменить(ИмяРеквизита, " ", ""), , Отказ);
	
КонецПроцедуры


#КонецОбласти