
#Область СлужебныйПрограммныйИнтерфейс

Функция НастройкаИнтеграцииСБППоБанку(Организация, Банк, Вид = "c2b") Экспорт
	
	НастройкаИнтеграции = ИнтеграцияССБПБП.НастройкаИнтеграцииСБППоБанку(Организация, Банк, Вид);
	
	Возврат НастройкаИнтеграции;
	
КонецФункции

Функция НастройкаИнтеграцииСБППоБИК(Организация, БИКБанка, Вид = "c2b") Экспорт
	
	НастройкаИнтеграции = ИнтеграцияССБПБП.НастройкаИнтеграцииСБП(Организация, БИКБанка, Вид);
	
	Возврат НастройкаИнтеграции;
	
КонецФункции

// Определяет доступность использования функциональности СБП
// на основании прав доступа пользователя.
//
// Возвращаемое значение:
//  Булево - если Истина, Система быстрых платежей доступна.
//
Функция ДоступнаИнтеграцияССБП() Экспорт
	
	Результат = ПравоДоступа("Чтение", Метаданные.Справочники.НастройкиПодключенияКСистемеБыстрыхПлатежей);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
