#Область ОписаниеПеременных

&НаКлиенте
Перем ОткрытыеФормы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МобильныйКлиентАдаптацияФормы();
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ЛьготныеКредиты(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ЗаявкиНаЛьготныйКредит.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Сервис1СОткрытиеСчета(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("РегистрСведений.СостояниеЗаявокНаОткрытиеСчета.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Сервис1СКредит(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("СервисОбменаСБанками",
		ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ЗаявкиНаКредит"));
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("РегистрСведений.СостояниеЗаявокНаКредит.ФормаСписка",
		ЭтотОбъект, ПараметрыФормы, "ЗаявкиНаКредит", ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Сервис1СЛизинг(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("СервисОбменаСБанками",
		ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ЗаявкиНаЛизинг"));
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("РегистрСведений.СостояниеЗаявокНаКредит.ФормаСписка",
		ЭтотОбъект, ПараметрыФормы, "ЗаявкиНаЛизинг", ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Сервис1СФинОтчетность(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("РегистрСведений.ЖурналСтатусовФинОтчетностиВБанки.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ФинансыОрганизации(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Обработка.ФинансыОрганизации.Форма", ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаДепозит(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ЗаявкаНаДепозитОбменСБанками.Форма.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетДенежныхСредств(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Обработка.Бюджет.Форма", ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланФактныйАнализБюджета(Команда)
	
	Вариант = Новый Структура;
	Вариант.Вставить("ИмяОтчета",    "ПланФактныйАнализБюджета");
	Вариант.Вставить("КлючВарианта", "ПланФактныйАнализБюджета");
	
	БухгалтерскиеОтчетыКлиент.ОткрытьВариантОтчета(Вариант);
	
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанели(ЭтотОбъект, "ФинансыОрганизации");
	
КонецПроцедуры

#КонецОбласти

