////////////////////////////////////////////////////////////////////////////////
// Подсистема "Индивидуальный предприниматель"
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает дату начала действия прогрессивной шкалы НДФЛ
//
// Возвращаемое значение:
//   Дата
//
Функция ДатаНачалаПрогрессивнойШкалы() Экспорт
	
	Возврат Дата(2021, 1, 1);
	
КонецФункции

// Возвращает дату начала действия расширенной прогрессивной шкалы НДФЛ
// 
// Параметры:
//   Период - Дата - Дата расчета НДФЛ для ИП
//
// Возвращаемое значение:
//   Дата
//
Функция ПрименяетсяРасширеннаяПрогрессивнаяйШкала(Период) Экспорт
	
	// Федеральный закон от 12.07.2024 N 176-ФЗ
	Возврат Период >= Дата(2025, 1, 1);
	
КонецФункции

// Конструктор параметров записи данных стандартных вычетов.
//
// Параметры:
//   ИмяОбъектаМетаданных - Строка - Наименование регистра, напр. РегистрСведений.ИПСтандартныеВычетыНаДетей
//
// Возвращаемое значение:
//   Структура:
//        * Организация - СправочникСсылка.Организации - Организация, для которой указывается вычет
//        * Период - Дата - Начало периода действия вычета
//        * КонецПериода - Дата - Конец периода действия вычета
//        * ИмяОбъектаМетаданных - Строка - Наименование регистра, напр. РегистрСведений.ИПСтандартныеВычетыНаДетей
//        * СданыНормыГТО - Булево - Признак того, что налогоплательщик сдал нормы ГТО - только для РегистрСведений.ИПСтандартныеВычетыНаНалогоплательщика
//
Функция НовыеРеквизитыЗаписиВычета(ИмяОбъектаМетаданных) Экспорт
	
	РеквизитыЗаписи = Новый Структура;
	РеквизитыЗаписи.Вставить("Организация", ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));
	РеквизитыЗаписи.Вставить("Период", '00010101');
	РеквизитыЗаписи.Вставить("КонецПериода", '00010101');
	РеквизитыЗаписи.Вставить("ИмяОбъектаМетаданных", ИмяОбъектаМетаданных);
	
	Если УчитываетсяВычетЗаСдачуНормГТО(ИмяОбъектаМетаданных) Тогда
		РеквизитыЗаписи.Вставить("СданыНормыГТО", Ложь);
	КонецЕсли;
	
	Возврат РеквизитыЗаписи;
	
КонецФункции

// Возращает признак того, нужно ли учитывать в регистре вычет за сдачу норм ГТО
//
// Параметры:
//   ИмяОбъектаМетаданных - Строка - Наименование регистра, напр. РегистрСведений.ИПСтандартныеВычетыНаДетей
//
// Возвращаемое значение:
//   Булево
//
Функция УчитываетсяВычетЗаСдачуНормГТО(ИмяОбъектаМетаданных) Экспорт
	
	Возврат ИмяОбъектаМетаданных = "РегистрСведений.ИПСтандартныеВычетыНаНалогоплательщика";
	
КонецФункции

#КонецОбласти