#Область СлужебныеПроцедурыИФункции

Функция ТекущийУзелОбмена() Экспорт
	
	НастройкаСсылка = СовместноеИспользование.ТекущаяНастройка();
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаСсылка, "УзелОбмена");
	
КонецФункции

Функция ОтражениеДокументовВключено() Экспорт
	
	// Эту проверку можно запускать и для случаев, когда у пользователей нет прав
	// на справочник. Поэтому выполнять ее нужно в привилегированном режиме.
	// Закрывать привилегированный режим не нужно, т.к. он нужен во всей функции, он автоматически закроется при выходе.
	УстановитьПривилегированныйРежим(Истина);
	
	НастройкаСсылка = Справочники.НастройкиСовместногоИспользованияПриложений.ТекущаяНастройка();
	
	Если НастройкаСсылка.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаСсылка, "ОтражениеВключено");
	
КонецФункции

#КонецОбласти