#Область СлужебныйПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("Проверить", Истина);
	
КонецПроцедуры

Функция НачатьПроверку(ПараметрыПроверки, Знач ИдентификаторФормы) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверка кодов по классификаторам'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"ПроверкаКодовПоКлассификаторамВызовСервера.Проверить",
		ПараметрыПроверки);
		
	Возврат ДлительнаяОперация;
	
КонецФункции

Функция Проверить(ПараметрыПроверки) Экспорт
	
	Возврат ПроверкаКодовПоКлассификаторам.Проверить(ПараметрыПроверки);
	
КонецФункции

Функция ПрочитатьРезультатПроверки(Адрес) Экспорт
	
	Возврат ПолучитьИзВременногоХранилища(Адрес);
	
КонецФункции

#КонецОбласти