#Область СлужебныйПрограммныйИнтерфейс

Процедура НастроитьЭлементыЧекаНПД(Форма) Экспорт
	
	Если Форма.ЭтоДоговорССамозанятым Тогда
		Объект = Форма.Объект;
		Элементы = Форма.Элементы;
		Если ЗначениеЗаполнено(Объект.НомерЧека) Тогда
			ПредставлениеЧекаНПД = Объект.НомерЧека;
		ИначеЕсли ЗначениеЗаполнено(Объект.ЧекСамозанятого) Тогда
			ПредставлениеЧекаНПД = Объект.ЧекСамозанятого;
		Иначе
			ПредставлениеЧекаНПД = "";
		КонецЕсли;
		Если ЗначениеЗаполнено(ПредставлениеЧекаНПД) Тогда
			Элементы.ЗагрузитьЧекНПД.Вид = ВидКнопкиФормы.Гиперссылка;
			Элементы.ЗагрузитьЧекНПД.Заголовок = СтрШаблон(НСтр("ru = '%1'"), ПредставлениеЧекаНПД);
		Иначе
			Элементы.ЗагрузитьЧекНПД.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
			Элементы.ЗагрузитьЧекНПД.Заголовок = НСтр("ru = 'Загрузить'");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти