
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПробиватьЧеки = Параметры.ПробиватьЧеки;
	ОтправлятьEmail = Параметры.ОтправлятьEmail;
	ОтправлятьSMS = Параметры.ОтправлятьSMS;
	
	Если ЗначениеЗаполнено(Параметры.ОписаниеНастройки) Тогда
		Элементы.ДекорацияОписание.Заголовок = Параметры.ОписаниеНастройки;
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если ЗавершениеРаботы И Модифицированность Тогда
		Отказ = Истина;
	ИначеЕсли Модифицированность Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗакрытиемФормыЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПробиватьЧекиПриИзменении(Элемент)
	
	Если Не ПробиватьЧеки Тогда
		ОтправлятьEmail = Ложь;
		ОтправлятьSMS = Ложь;
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправлятьEmailПриИзменении(Элемент)
	
	Если ОтправлятьEmail Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьEmailНастройкаУчетнойЗаписиПредложена", ЭтотОбъект);
		РаботаСПочтовымиСообщениямиКлиент.ПроверитьНаличиеУчетнойЗаписиДляОтправкиПочты(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправлятьSMSПриИзменении(Элемент)
	
	Если ОтправлятьSMS И Не НастройкаОтправкиSMSВыполнена() Тогда
		НастроитьОтправкуСМС();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)

	СохранитьИЗакрыть();

КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	ОтменитьИЗакрыть();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ОтправлятьEmail.Доступность = Форма.ПробиватьЧеки;
	Элементы.ОтправлятьSMS.Доступность = Форма.ПробиватьЧеки;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗакрытиемФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьИЗакрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ОтменитьИЗакрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьEmailНастройкаУчетнойЗаписиПредложена(УчетнаяЗаписьНастроена, ДополнительныеПараметры) Экспорт
	
	Если УчетнаяЗаписьНастроена <> Истина Тогда
		ОтправлятьEmail = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкаОтправкиSMSВыполнена()
	
	Возврат ОтправкаSMS.НастройкаОтправкиSMSВыполнена();
	
КонецФункции

&НаКлиенте
Процедура НастроитьОтправкуСМС()
	
	Если ЕстьПравоНастраиватьСМС() Тогда
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастроитьОтправкуСМСЗавершение", ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.НастройкаОтправкиSMS", , 
			ЭтотОбъект, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОтправлятьSMS = Ложь;
		ТекстПредупреждения = НСтр("ru = 'Попросите администратора выполнить настройку отправки СМС'");
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения, , НСтр("ru = 'Отправка СМС не настроена'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтправкуСМСЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не НастройкаОтправкиSMSВыполнена() Тогда
		ОтправлятьSMS = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьПравоНастраиватьСМС()
	
	Возврат ПравоДоступа("Просмотр", Метаданные.ОбщиеФормы.НастройкаОтправкиSMS);
	
КонецФункции

&НаКлиенте
Процедура СохранитьИЗакрыть()
	
	Модифицированность = Ложь;
	Результат = Новый Структура;
	Результат.Вставить("ПробиватьЧеки", ПробиватьЧеки);
	Результат.Вставить("ОтправлятьEmail", ОтправлятьEmail);
	Результат.Вставить("ОтправлятьSMS", ОтправлятьSMS);
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьИЗакрыть()
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
