// Модуль содержит кешируемые функции, используемые в ходе проведения документов.
// Чтобы избежать вытеснения более "дорогих" в получении значений, повторное использование - на время вызова.

#Область ПрограммныйИнтерфейс

// Проверяет, могут ли по указанным статьям прочих расходов отражаться суммы налогового учета.
//
// Параметры:
//  ВидДоходовРасходов - СправочникСсылка.ПрочиеДоходыИРасходы - проверяемая статья
// 
// Возвращаемое значение:
//  Булево - Истина, если по указанной статье можно отражать суммы налогового учета.
//
Функция ВидДоходовРасходовУчитывается(ВидДоходовРасходов) Экспорт
	
	Возврат Не НалоговыйУчет.ЗапрещеноОтражатьСуммыНалоговогоУчетаПоСтатьямПрочихРасходов(ВидДоходовРасходов);
	
КонецФункции

// Определяет, учитываются ли суммы затрат для целей налогообложения, исходя из статьи затрат.
//
// Назначение статьи (вид деятельности) не проверяется, так как предполагается, что раздельный учет
// по видам деятельности обеспечивается разрезами учета (например, субсчетами), а не суммами проводок.
//
// Параметры:
//  СтатьяЗатрат - СправочникСсылка.СтатьиЗатрат - проверяемая статья затрат
// 
// Возвращаемое значение:
//  Булево - Истина, если расходы учитываются для целей налогообложения.
//
Функция СтатьяЗатратУчитывается(СтатьяЗатрат) Экспорт
	
	Возврат НалоговыйУчет.СтатьяЗатратУчитывается(СтатьяЗатрат);
	
КонецФункции

// Планируется к удалению в одной из следующих версий.
//
// Проверяет, используется ли счет для формирования стоимости амортизируемого имущество в разрезе статей затрат.
// Использование статей затрат на счете 08.03 задумывалось как временное решение, поэтому их выводили из общих правил.
//
// Параметры:
//  Счет - ПланСчетов.Хозрасчетный - проверяемый счет
// 
// Возвращаемое значение:
//  Булево - Истина, если используется.
//
Функция ЭтоФормированиеСтоимостиАмортизируемогоИмуществаПоСтатьямЗатрат(Счет) Экспорт
	
	Возврат НалоговыйУчет.ЭтоФормированиеСтоимостиАмортизируемогоИмуществаПоСтатьямЗатрат(Счет);
	
КонецФункции

// Проверяет, не запрещает ли в общем случае статья затрат учитывать расход для целей налогообложения.
//
// Параметры:
//  СтатьяЗатрат - СправочникСсылка.СтатьиЗатрат - проверяемая статья.
// 
// Возвращаемое значение:
//  Булево - Истина, если свойства статьи затрат запрещают учитывать расход для целей налогообложения.
//
Функция СтатьяЗатратЗапрещаетУчитыватьРасход(СтатьяЗатрат) Экспорт
	
	Возврат НалоговыйУчет.СтатьяЗатратЗапрещаетУчитыватьРасход(СтатьяЗатрат);
	
КонецФункции

// Определяет, используется ли счет для учета таких активов (обязательств), налоговая сумма которых заведомо равняется нулю.
//
// Параметры:
//  Счет - ПланСчетовСсылка.Хозрасчетный - проверяемый счет
// 
// Возвращаемое значение:
//  Булево - Истина, если налоговая сумма активов (обязательств) на этом счете заведомо равняется нулю.
//         - Ложь, если налоговая сумма приравнивается к сумме бухгалтерского учета
//
Функция ЭтоСчетБезНалоговойСтоимости(Счет) Экспорт
	
	Возврат НалогНаПрибыльБухгалтерскийУчет.ЭтоСчетБезНалоговойСтоимости(Счет);
	
КонецФункции

#КонецОбласти
