#Область ПрограммныйИнтерфейс

// Конструктор строки списка Содержание задания
//
// Параметры:
//  ИНН - Строка - ИНН физического лица
//  НаДату - Дата - дата в часовом поясе "Europe/Moscow",
//           на которую необходимо получить статус самозанятого
// 
// Возвращаемое значение:
//  Структура - новая строка содержания задания:
//    * ИНН - Строка - ИНН физ. лица
//    * НаДату - Дата, Неопределено - дата, на которую выполняется проверка
//
Функция НоваяСтрокаСодержанияЗадания(ИНН, Знач НаДату) Экспорт
	
	СтрокаСодержания = Новый Структура();
	СтрокаСодержания.Вставить("ИНН", ИНН);
	СтрокаСодержания.Вставить("НаДату", НачалоДня(НаДату));
	
	Возврат СтрокаСодержания;
	
КонецФункции

// Конструктор строки списка результата выполнения задания
// 
// Возвращаемое значение:
//  Структура - новая строка результата выполнения задания:
//    * ИНН - Строка - ИНН физического лица
//    * НаДату - Дата - дата, на которую выполнялась проверка по часовому поясу
//               сервиса получения статусов самозанятых
//    * ПлательщикНПД - Булево - Истина, если физ.лицо применяет НПД
//    * ДатаРегистрации - Дата, Неопределено - дата изменения статуса по часовому поясу
//                        сервиса получения статусов самозанятых
//    * ЭтоОкончательноеЗначение - Булево - признак того, что повторно запрашивать значение из сервиса не требуется
//
Функция НоваяСтрокаРезультатаВыполненияЗадания() Экспорт
	
	СтрокаРезультатаВыполнения = Новый Структура();
	СтрокаРезультатаВыполнения.Вставить("ИНН", "");
	СтрокаРезультатаВыполнения.Вставить("НаДату", Дата(1, 1, 1));
	СтрокаРезультатаВыполнения.Вставить("ПлательщикНПД", Ложь);
	СтрокаРезультатаВыполнения.Вставить("ДатаРегистрации", Неопределено);
	СтрокаРезультатаВыполнения.Вставить("ЭтоОкончательноеЗначение", Ложь);
	
	Возврат СтрокаРезультатаВыполнения;
	
КонецФункции

// Конструктор строки описания остатка опции
// 
// Возвращаемое значение:
//  Структура - Новая строка списка опций:
//    * ДатаНачала - Дата - начало действия
//    * ДатаОкончания - Дата - окончание действия
//    * ИспользованныйОбъем - Число - использованный объем
//    * МаксимальныйОбъем - Число - начисленный объем
//    * ЭтоПромоТариф - Булево - Истина, если это опция Промо-тарифа
//
Функция НоваяСтрокаСпискаОпций() Экспорт
	
	СтрокаРезультатаВыполнения = Новый Структура();
	СтрокаРезультатаВыполнения.Вставить("ДатаНачала", Дата(1, 1, 1));
	СтрокаРезультатаВыполнения.Вставить("ДатаОкончания", Дата(1, 1, 1));
	СтрокаРезультатаВыполнения.Вставить("ИспользованныйОбъем", 0);
	СтрокаРезультатаВыполнения.Вставить("МаксимальныйОбъем", 0);
	СтрокаРезультатаВыполнения.Вставить("ЭтоПромоТариф", Ложь);
	
	Возврат СтрокаРезультатаВыполнения;
	
КонецФункции

// Конструктор статуса задания
// 
// Возвращаемое значение:
//  Структура - результат выполнения метода:
//    * Идентификатор - Строка - идентификтор задания
//    * Статус - Строка - статус задания
//
Функция НовыйСтатусЗадания() Экспорт
	
	СтатусЗадания = Новый Структура();
	СтатусЗадания.Вставить("Идентификатор", "");
	СтатусЗадания.Вставить("Статус", "");
	
	Возврат СтатусЗадания;
	
КонецФункции

// Конструктор настроек лимитов
// 
// Возвращаемое значение:
//  Структура - результат выполнения метода:
//    * МаксимальноеЧислоСтрокВЗадании - Число - максимальное число строк в одном задании
//    * ВремяЖизниЗадания - Число - время жизни задания в секундах
//    * ВремяКэшированияТекущегоСтатуса - Число - время кэширования текущего статуса самозанятого в секундах
//
Функция НовыйНастройкиЛимитов() Экспорт
	
	НастройкиЛимитов = Новый Структура();
	НастройкиЛимитов.Вставить("МаксимальноеЧислоСтрокВЗадании", 0);
	НастройкиЛимитов.Вставить("ВремяЖизниЗадания", 0);
	НастройкиЛимитов.Вставить("ВремяКэшированияТекущегоСтатуса", 0);
	
	Возврат НастройкиЛимитов;
	
КонецФункции

// Конструктор описания ошибки
// 
// Возвращаемое значение:
//  Структура - Новый описание ошибки:
//   * Идентификатор - Строка - идентификатор ошибки
//   * Вид - Строка - вид ошибки
//   * Описание - Строка - представление ошибки
//
Функция НовыйОписаниеОшибки() Экспорт
	
	ОписаниеОшибки = Новый Структура();
	ОписаниеОшибки.Вставить("Идентификатор", "");
	ОписаниеОшибки.Вставить("Вид", "");
	ОписаниеОшибки.Вставить("Описание", "");
	
	Возврат ОписаниеОшибки;
	
КонецФункции

// Формирует представление статуса физического лица.
// 
// Параметры:
//  ПлательщикНПД - Булево - Булево - Истина, если физ.лицо применяет НПД
//  ДатаРегистрации - Дата - дата изменения статуса
// 
// Возвращаемое значение:
//  Строка - Описание статуса
//
Функция ОписаниеСтатуса(ПлательщикНПД, ДатаРегистрации) Экспорт
	
	Если ЗначениеЗаполнено(ДатаРегистрации) Тогда
		ПредставлениеДатыРегистрации = Формат(ДатаРегистрации, "ДЛФ=D;");
	КонецЕсли;
	
	Если ПлательщикНПД Тогда
		Если ЗначениеЗаполнено(ДатаРегистрации) Тогда
			Описание = СтрШаблон(
				НСтр("ru = 'Контрагент %1 зарегистрирован в качестве плательщика налога на профессиональный доход (по московскому времени)'"),
				ПредставлениеДатыРегистрации);
		Иначе
			Описание = НСтр("ru = 'Контрагент является плательщиком налога на профессиональный доход'");
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(ДатаРегистрации) Тогда
			Описание = СтрШаблон(
				НСтр("ru = 'Контрагент %1 утратил статус плательщика налога на профессиональный доход (по московскому времени)'"),
				ПредставлениеДатыРегистрации);
		Иначе
			Описание = НСтр("ru = 'Контрагент не является плательщиком налога на профессиональный доход'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Описание;
	
КонецФункции

// Формирует описание остатка опций.
// 
// Параметры:
//  Баланс - Число, Неопределено - остаток опций
// 
// Возвращаемое значение:
//  Строка - Описание остатка опций
//
Функция ОписаниеОстаткаОпций(Баланс) Экспорт
	
	Если Баланс = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Если Баланс > 0 Тогда
		Результат = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru=';Вы можете проверить еще %1 физическое лицо;;Вы можете проверить еще %1 физических лица;Вы можете проверить еще %1 физических лиц;'"),
			Баланс,
			ВидЧисловогоЗначения.Количественное,
			"ЧН=0; ЧГ=;")
	Иначе
		Результат = НСтр("ru = 'Израсходован пакет опций, входящих в ваш тариф'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИдентификаторСервиса() Экспорт

	Возврат "1C-Self-Employed";

КонецФункции

Функция ОписаниеСервиса() Экспорт

	Возврат НСтр("ru = 'Автоматическая проверка регистрации физического лица в качестве плательщика налога на профессиональный доход.'");

КонецФункции

Функция НаименованиеСервиса() Экспорт

	Возврат НСтр("ru = '1С:Статус самозанятого'");

КонецФункции

Функция ИмяПодсистемы() Экспорт
	
	Возврат "СтатусСамозанятого";
	
КонецФункции

Функция СинонимПодсистемы() Экспорт
	
	Возврат НСтр("ru = 'Статус самозанятого'", КодОсновногоЯзыка());
	
КонецФункции

// Имя события в журнале регистрации
//
// Параметры:
//  Детализация - Строка - уточнение события
// 
// Возвращаемое значение:
//   Строка - полное имя события
// 
Функция ИмяСобытияЖурналаРегистрации(Детализация = "") Экспорт
	
	Если ПустаяСтрока(Детализация) Тогда
		Возврат ИмяПодсистемы();
	Иначе
		Возврат СтрШаблон("%1.%2", СинонимПодсистемы(), Детализация);
	КонецЕсли;
	
КонецФункции

// Возвращает список параметров для вызова метода взаимодействия по его имени.
//
// Параметры:
//   МетодВзаимодействия - Строка - имя метода из списка методов ИнтеграцияСтатусСамозанятого.МетодыВзаимодействия()
//
// Возвращаемое значение:
//  Структура - ключом является имя параметра, значение - пустым значением нужного типа
//
Функция НовыеПараметрыМетодаВзаимодействия(МетодВзаимодействия) Экспорт
	
	ИменаМетодов = ИменаМетодовВзаимодействия();
	
	// API для работы с документами
	
	Если МетодВзаимодействия = ИменаМетодов.СоздатьТокенАвторизации Тогда
		//@skip-check constructor-function-return-section
		Возврат НовыеПараметры_СоздатьТокенАвторизации(МетодВзаимодействия);
		
	ИначеЕсли МетодВзаимодействия = ИменаМетодов.СоздатьЗадание Тогда
		//@skip-check constructor-function-return-section
		Возврат НовыеПараметры_СоздатьЗадание(МетодВзаимодействия);
		
	ИначеЕсли МетодВзаимодействия = ИменаМетодов.РезультатВыполненияЗадания
		Или МетодВзаимодействия = ИменаМетодов.СтатусЗадания Тогда
		//@skip-check constructor-function-return-section
		Возврат НовыеПараметры_ПолучениДанныхПоИдентификатору(МетодВзаимодействия);
		
	ИначеЕсли МетодВзаимодействия = ИменаМетодов.НастройкиЛимитов Тогда
		//@skip-check constructor-function-return-section
		Возврат НовыеПараметры(МетодВзаимодействия);
		
	ИначеЕсли МетодВзаимодействия = ИменаМетодов.СоздатьЗапросСпискаОпций Тогда
		//@skip-check constructor-function-return-section
		Возврат НовыеПараметры(МетодВзаимодействия);
		
	ИначеЕсли МетодВзаимодействия = ИменаМетодов.РезультатЗапросаСпискаОпций
		Или МетодВзаимодействия = ИменаМетодов.СтатусЗапросаСпискаОпций Тогда
		//@skip-check constructor-function-return-section
		Возврат НовыеПараметры_ПолучениДанныхПоИдентификатору(МетодВзаимодействия);
		
	Иначе
		ВызватьИсключение СтрШаблон("ИнтеграцияСтатусСамозанятогоКлиентСервер.НовыеПараметрыМетодаВзаимодействия():
			|Метод взаимодействия %1 не определен", МетодВзаимодействия);
	КонецЕсли;
	
КонецФункции

// Возвращает список имен методов взаимодействия.
// 
// Возвращаемое значение:
//  Структура - имена методов взаимодействия
Функция ИменаМетодовВзаимодействия() Экспорт
	
	ИменаМетодов = Новый Структура;
	ИменаМетодов.Вставить("СоздатьТокенАвторизации", "СоздатьТокенАвторизации");
	ИменаМетодов.Вставить("СоздатьЗадание", "СоздатьЗадание");
	ИменаМетодов.Вставить("РезультатВыполненияЗадания", "РезультатВыполненияЗадания");
	ИменаМетодов.Вставить("СтатусЗадания", "СтатусЗадания");
	ИменаМетодов.Вставить("НастройкиЛимитов", "НастройкиЛимитов");
	ИменаМетодов.Вставить("СоздатьЗапросСпискаОпций", "СоздатьЗапросСпискаОпций");
	ИменаМетодов.Вставить("РезультатЗапросаСпискаОпций", "РезультатЗапросаСпискаОпций");
	ИменаМетодов.Вставить("СтатусЗапросаСпискаОпций", "СтатусЗапросаСпискаОпций");
	//@skip-check constructor-function-return-section
	Возврат ИменаМетодов;
	
КонецФункции

Функция ФормаСервисСтатусСамозанятого() Экспорт
	
	Возврат "e1cib/command/ОбщаяКоманда.СервисСтатусСамозанятого";
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыеПараметры(МетодВзаимодействия)
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("МетодВзаимодействия", МетодВзаимодействия);
	Возврат ПараметрыМетода;
	
КонецФункции

Функция НовыеПараметры_СоздатьТокенАвторизации(МетодВзаимодействия)
	
	ПараметрыМетода = НовыеПараметры(МетодВзаимодействия);
	ПараметрыМетода.Вставить("ИмяКонфигурации", "");
	ПараметрыМетода.Вставить("Тикет", "");
	Возврат ПараметрыМетода;
	
КонецФункции

Функция НовыеПараметры_СоздатьЗадание(МетодВзаимодействия)
	
	ПараметрыМетода = НовыеПараметры(МетодВзаимодействия);
	ПараметрыМетода.Вставить("СодержаниеЗадания", Новый Массив());
	Возврат ПараметрыМетода;
	
КонецФункции

Функция НовыеПараметры_ПолучениДанныхПоИдентификатору(МетодВзаимодействия)
	
	ПараметрыМетода = НовыеПараметры(МетодВзаимодействия);
	ПараметрыМетода.Вставить("Идентификатор", "");
	Возврат ПараметрыМетода;
	
КонецФункции

Функция КодОсновногоЯзыка()
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		КодЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	#Иначе
		КодЯзыка = ОбщегоНазначенияКлиент.КодОсновногоЯзыка();
	#КонецЕсли
	
	Возврат КодЯзыка;
	
КонецФункции

#КонецОбласти
