
#Область ПрограммныйИнтерфейс

//@skip-check module-region-empty
#Область Описание
// В этом модуле описаны алгоритмы работы с подсказкой кодов ОКВЭД в обработке КлассификацияВыручкиПоОКВЭД.
// Подсказка представляет собой выпадающий список в поле выбора кода ОКВЭД на форме обработки КлассификацияВыручкиПоОКВЭД,
// а также в поле поиска формы выбора вида деятельности (классификатор ОКВЭД), при условии, что эта форма открывается из обработки
// КлассификацияВыручкиПоОКВЭД.
// Чтобы сформировать этот список, наименования номенклатуры передаются в специальный сервис классификации номенклатуры, который
// с помощью алгоритмов ИИ по наименованию определяет перечень наиболее подходящих кодов ОКВЭД. Далее этот список уточняется
// на основании учетных данных по той аналитике, для которой подбирается код ОКВЭД.
// 
// Все данные, необходимые для формирования списка-подсказки, хранятся на форме в коллекции ДанныеПодсказкиКодов
// с типом см. НовыйДанныеПодсказкиКодов. Она хранится во временном хранилище с адресом АдресПодсказкаКодов,
// привязанном к форме классификации выручки.
// Наполнение этой коллекции и формирование подсказки происходит в несколько этапов:
// 
// 1. ПодсказкаКодовОКВЭД.ПроверкаДоступностиСервиса
// При открытии формы выполняется тестовый вызов функции ПодсказкаКодовОКВЭД.СервисДоступен(),
// проверяющей доступность сервиса классификации номенклатуры.
// 
// 2. ПодсказкаКодовОКВЭД.ПодготовитьВспомогательныеДанныеПодсказкиКодов
// Выполняется в фоновом задании.
// Одновременно с подготовкой данных для заполнения формы в методе Обработки.КлассификацияВыручкиПоОКВЭД.ДанныеРаспределенияВыручки
// происходит получение информации о структуре выручки - СтруктураВыручки - (товар для перепродажи, опт/розница, производство),
// а также СопоставленияИдентификаторовКодов - эти данные используются для "перевода" кодов, который возвращает сервис
// (целое число, порядковый номер группы классификатора), в термины кодов, которыми оперирует пользователь
// ("47.21", "01.11" и пр. из Общероссийский классификатора видов экономической деятельности (ОКВЭД 2)
// ОК 029-2014 (КДЕС Ред. 2)). Также на этом этапе заполняются ПравилаКорректировкиКодов
// (см. ПравилаКорректировкиКодовСУчетомВыручки) - правила, по которым обогащается или сокращается
// список-подсказка. Например, если мы понимаем, что конкретная номенклатура продается только в розницу и при этом
// она не произведена самой организацией, то из подсказки будут исключены коды производства и оптовой торговли,
// если сервис подобрал их как вероятные для данной позиции номенклатуры или номенклатурной группы.
// 
// 3. ПодсказкаКодовОКВЭД.ПолучениеПодсказкиКодов
// На этом этапе пригождается коллекция СопоставленияИдентификаторовКодов.
// Возможны два случая, когда выполняется этот метод:
// 
// а) Выполняется в фоновом задании.
// В сервис передаются названия значений аналитик, по которым строится выручка (наименования номенклатуры и номенклатурных
// групп в виде массива строк), а сервис возвращает наиболее вероятные коды классификатора и их вероятности.
// Получение кодов из сервиса сопровождается выводом на форму индикатора прогресса.
// Результатом этого этапа является заполнение свойства КодыПодобранныеСервисом коллекции ДанныеПодсказкиКодов.
// Также заполняется свойство НаименованияДляПоискаВСервисе - по какому наименованию был выполнен поиск в сервисе для каждого
// элемента справочника. Эти данные потребуются на этапе 5. Их можно было бы и не хранить, но мы так делаем с целью оптимизации,
// чтобы заново их не получать в момент отправки обратной связи.
// б) Выполняется синхронно, в момент подбора кода на этапе 4.
// В сервис передается коллекция, состоящая из одного элемента-строки.
// 
// Полученный из сервиса список кодов-кандидатов используется на этапе 4 для формирования окончательного списка с учетом характера
// выручки и прошлых выборов пользователя.
// 
// 4. ПодсказкаКодовОКВЭД.ПодсказкаКодовСУчетомВыручки
// Синхронный вызов в момент выбора кода ОКВЭД: выдаваемый пользователю список учитывает контекст - в каком месте дерева
// производится выбор, какие коды были выбраны для "соседних" строк, какими операциями была отражена выручка.
// Список строится с использованием коллекций КодыПодобранныеСервисом, СтруктураВыручки, ПравилаКорректировкиКодов.
// 5. ПодсказкаКодовОКВЭД.ОтправитьОбратнуюСвязь
// Выполняется в фоновом задании.
// Если пользователь решает сохранить результат своей работы, программа отправляет в сервис "обратную связь"
// (результат сопоставления и вспомогательные данные) для того, чтобы:
// а) дообучать модель, улучшать качество классификаций для всех пользователей сервиса;
// б) оценивать и улучшать правила корректировки кодов подсказки, описанные в программе Бухгалтерия предприятия 3.0.
// На этом этапе используются свойства КодыПодобранныеСервисом, СтруктураВыручки, НаименованияДляПоискаВСервисе,
// СопоставленияИдентификаторовКодов из коллекции ДанныеПодсказкиКодов.

#КонецОбласти

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ПолучениеПодсказкиКодов", Истина);
	Методы.Вставить("ОтправитьОбратнуюСвязь", Истина);
	
КонецПроцедуры

// Готовит вспогательные данные для вычисления подсказки: информацию о структуре выручки, связь кодов в терминах
// сервиса с кодами из классификатора ОКВЭД, а также правила, по которым точечно корректируется список кодов, возвращенных
// сервисом исходя из операций, которые происходили с номенклатурой (производство, перепродажа, опт/розница и прочее)
// для окончательного формирования списка подсказки.
// 
// Параметры:
//  ДанныеПодсказкиКодов - см. НовыйДанныеПодсказкиКодов
//  ПараметрыЗаполнения - см. Обработки.КлассификацияВыручкиПоОКВЭД.НовыйПараметрыДанныхРаспределенияВыручки
//  ДанныеНоменклатуры - см. Обработки.КлассификацияВыручкиПоОКВЭД.НовыйДанныеНоменклатуры
//                     - Неопределено
Процедура ПодготовитьВспомогательныеДанныеПодсказкиКодов(ДанныеПодсказкиКодов, ПараметрыЗаполнения, ДанныеНоменклатуры = Неопределено) Экспорт
	
	ГруппыНоменклатуры = НовыйГруппыНоменклатуры();
	Если ДанныеНоменклатуры <> Неопределено Тогда
		ПоляГруппНоменклатуры = ПоляГруппНоменклатуры();
		ГруппыНоменклатуры = ДанныеНоменклатуры.Скопировать(, ПоляГруппНоменклатуры);
		ГруппыНоменклатуры.Свернуть(ПоляГруппНоменклатуры);
	КонецЕсли;
	
	ДанныеПодсказкиКодов.СтруктураВыручки = СтруктураВыручки(ПараметрыЗаполнения, ГруппыНоменклатуры);
	СопоставленияИдентификаторовКодов = ДанныеПодсказкиКодов.СопоставленияИдентификаторовКодов;
	Если Не ЗначениеЗаполнено(СопоставленияИдентификаторовКодов.ИдентификаторыПоКодам)
		Или Не ЗначениеЗаполнено(СопоставленияИдентификаторовКодов.КодыПоИдентификаторам) Тогда
		ДанныеПодсказкиКодов.СопоставленияИдентификаторовКодов = СопоставленияИдентификаторовКодов();
	КонецЕсли;
	Если ДанныеПодсказкиКодов.ПравилаКорректировкиКодов.Количество() = 0 Тогда
		ДанныеПодсказкиКодов.ПравилаКорректировкиКодов = ПравилаКорректировкиКодовСУчетомВыручки();
	КонецЕсли;
	
КонецПроцедуры

// Получение из сервиса классификации номенклатуры данных о том, какой код более вероятен для каждого наименования
// номенклатуры / номенклатурной группы, а также величины этих вероятностей.
// 
// Параметры:
//  ДанныеПодсказкиКодов - см. НовыйДанныеПодсказкиКодов
//  АдресПодсказкиКодов  - Строка - АдресВременногоХранилища, связанного с уникальным идентификатором формы, из которой выполняется
//                                  классификация выручки. В этот адрес временного хранилища помещается
//                                  коллекция ДанныеПодсказкиКодов, дополненная новыми сопоставлениями номенклатуры,
//                                  полученными из сервиса.
//
Процедура ПолучениеПодсказкиКодов(ДанныеПодсказкиКодов, АдресПодсказкиКодов) Экспорт
	
	КодыПодобранныеСервисом = ДанныеПодсказкиКодов.КодыПодобранныеСервисом;
	
	ПоляГруппировок = Обработки.КлассификацияВыручкиПоОКВЭД.НастраиваемыеПоляГруппировки();
	ПоляГруппировкиВыручки = ПоляГруппировкиВыручки(ПоляГруппировок); // Поля, в разрезе которых строится дерево
	
	СтруктураВыручки = ДанныеПодсказкиКодов.СтруктураВыручки;
	
	// Для подбора подходящих кодов ОКВЭД в сервис передаем наименования номенклатуры/номенклатурных групп.
	// Для элементов справочника номенклатуры поиск в сервисе выполняется по Полному наименованию,
	// и только если оно не заполнено, то сопоставление выполняем по Наименованию.
	СписокИменДляСопоставления = СписокИменДляСопоставления(СтруктураВыручки, ПоляГруппировкиВыручки, КодыПодобранныеСервисом);
	
	ИменаДляПоискаВСервисе = ОбщегоНазначенияБПКлиентСервер.КлючиКоллекции(СписокИменДляСопоставления);
	
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("ЗаполнениеПодсказкиКодовСервер");
		
	КодыПоИдентификаторам = ДанныеПодсказкиКодов.СопоставленияИдентификаторовКодов.КодыПоИдентификаторам;
	РезультатыСопоставления = ПодсказкаКодовОКВЭДОбмен.РезультатСопоставления(ИменаДляПоискаВСервисе, КодыПоИдентификаторам);
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, СписокИменДляСопоставления.Количество());
	
	Если ОбщегоНазначения.РежимОтладки() Тогда
		
		ОтветСервиса = ОбщегоНазначения.ЗначениеВJSON(РезультатыСопоставления);

		ЗаписьЖурналаРегистрации(
			СтрШаблон("%1.%2", ИмяОбщегоСобытияЖурналаРегистрации(), ИмяСобытияПолучениеДанных()),
			УровеньЖурналаРегистрации.Примечание,
			Метаданные.Обработки.КлассификацияВыручкиПоОКВЭД,
			,
			ОтветСервиса);
			
	КонецЕсли;

	НаименованияДляПоискаВСервисе = ДанныеПодсказкиКодов.НаименованияДляПоискаВСервисе;
	Для Каждого РезультатСопоставления Из РезультатыСопоставления Цикл
		
		Сопоставления = СписокИменДляСопоставления[РезультатСопоставления.Ключ];
		
		Если Сопоставления = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ЭлементСопоставления Из Сопоставления Цикл
			КодыПодобранныеСервисом.Вставить(ЭлементСопоставления, РезультатСопоставления.Значение);
			НаименованияДляПоискаВСервисе.Вставить(ЭлементСопоставления, РезультатСопоставления.Ключ);
		КонецЦикла;
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ДанныеПодсказкиКодов, АдресПодсказкиКодов);
	
КонецПроцедуры

// Формирует список подсказки кодов ОКВЭД по данным коллекции ДанныеПодсказкиКодов. На момент запроса списка в этой коллекции
// могут отсутствовать необходимые данные в свойстве КодыПодобранныеСервисом (например, в этот момент еще
// выполняется получение данных из сервиса в фоновом задании). Тогда будет выполнено синхронное обращение к сервису
// классификации номенклатуры. В параметре ПоляИерархии содержится информация о значении аналитики, для которой формируется
// подсказка, а также о положении ее в дереве на форме обработки КлассификацияВыручкиПоОКВЭД - имен и значений вышестоящей иерархии.
// 
// Параметры:
//  ДанныеПодсказкиКодов - см. НовыйДанныеПодсказкиКодов
//  ДанныеНоменклатуры - см. Обработки.КлассификацияВыручкиПоОКВЭД.НовыйДанныеНоменклатуры
//  ПоляИерархии - см. ПодсказкаКодовОКВЭДКлиентСервер.НовыйПоляИерархии
// 
// Возвращаемое значение:
//  Массив из Структура - сформированный список подсказки:
//    * Ключ - Строка
//    * Значение - см. НовыйДанныеКода
Функция ПодсказкаКодовСУчетомВыручки(ДанныеПодсказкиКодов, ДанныеНоменклатуры, ПоляИерархии) Экспорт
	
	ПодсказкаКодовСУчетомВыручки = Новый Массив;

	Если ДанныеПодсказкиКодов = Неопределено Тогда
		Возврат ПодсказкаКодовСУчетомВыручки;
	КонецЕсли;
	
	Правила = ДанныеПодсказкиКодов.ПравилаКорректировкиКодов; // см. НовыйПравилаКорректировкиКодов
	СтруктураВыручки = ДанныеПодсказкиКодов.СтруктураВыручки; // см. СтруктураВыручки
	КодыПоИдентификаторам = ДанныеПодсказкиКодов.СопоставленияИдентификаторовКодов.КодыПоИдентификаторам;
	
	Выручка = СтруктураВыручки.Скопировать(ПоляИерархии.СписокВсехПолей);
	
	ЗначениеПоля = ПоляИерархии.ТекущееПоле.ЗначениеПоля;
	КодыСервиса = ДанныеПодсказкиКодов.КодыПодобранныеСервисом[ЗначениеПоля];
	
	Если КодыСервиса = Неопределено Тогда
	
		ИмяПоля = ПоляИерархии.ТекущееПоле.ИмяПоля;

		ПоляГруппировкиВыручки = Новый Массив;
		ПоляГруппировкиВыручки.Добавить(ИмяПоля);
		СписокИменДляСопоставления = Новый Соответствие;
		
		ЗаполнитьСписокИменПоЗначениям(
			СписокИменДляСопоставления,
			ИмяПоля,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЗначениеПоля),
			ДанныеПодсказкиКодов.КодыПодобранныеСервисом);

		РезультатСопоставления = ПодсказкаКодовОКВЭДОбмен.РезультатСопоставления(СписокИменДляСопоставления, КодыПоИдентификаторам, Истина);
		
		Для Каждого КлючИЗначение Из РезультатСопоставления Цикл
			КодыСервиса = КлючИЗначение.Значение;
			Прервать;
		КонецЦикла;
		
		Если КодыСервиса = Неопределено Тогда
			Возврат ПодсказкаКодовСУчетомВыручки;
		КонецЕсли;
		
	КонецЕсли;
	
	// Найдем список ранее выбранных кодов в строках, находящихся в пределах одного уровня иерархии.
	// Такие коды будем считать более приоритетными по сравнению с остальными.
	// Кроме этого, более приоритетными по сравнению с остальными кодами будут считаться коды, входящие в одну группу, 
	// подгруппу, класс и раздел с ранее выбранными кодами.
	СписокВсехПолейКромеТекущего = ОбщегоНазначения.СкопироватьРекурсивно(ПоляИерархии.СписокВсехПолей); // Структура
	СписокВсехПолейКромеТекущего.Удалить(ПоляИерархии.ТекущееПоле.ИмяПоля);
	КодыТекущейГруппировки = ДанныеНоменклатуры;
	Если СписокВсехПолейКромеТекущего.Количество() > 0 Тогда
		КодыТекущейГруппировки = ДанныеНоменклатуры.Скопировать(СписокВсехПолейКромеТекущего);
	КонецЕсли;
	РанееВыбранныеКоды = ОбщегоНазначенияКлиентСервер.СвернутьМассив(КодыТекущейГруппировки.ВыгрузитьКолонку("ОКВЭДКод"));
	
	ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом = НовыйДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом();
	
	ПрименитьПравила(ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом, КодыСервиса, Правила, Выручка);
	
	ВычислитьПодсказку(ПодсказкаКодовСУчетомВыручки, ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом, РанееВыбранныеКоды);
	
	Возврат ПодсказкаКодовСУчетомВыручки;
	
КонецФункции

// Передает обратную связь в сервис классификации номенклатуры.
// Обратная связь содержит информацию как о работе сервиса, так и работе программы по корректировке
// списка кодов, выданных сервисом.
// 
// Параметры:
//  ДанныеПодсказкиКодов - см. НовыйДанныеПодсказкиКодов
//  ДанныеНоменклатуры - см. Обработки.КлассификацияВыручкиПоОКВЭД.НовыйДанныеНоменклатуры
//  ПоляИерархии - СписокЗначений из Строка
Процедура ОтправитьОбратнуюСвязь(ДанныеПодсказкиКодов, ДанныеНоменклатуры, ПоляИерархии) Экспорт
	
	Если ДанныеПодсказкиКодов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеПодсказкиКодов.КодыПодобранныеСервисом.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Имеет смысл передавать только те данные, для которых выполнено сопоставление.
	ДанныеСопоставленнойНоменклатуры = ДанныеНоменклатуры.СкопироватьКолонки();
	Для Каждого СтрокаДанных Из ДанныеНоменклатуры Цикл
		Если ЗначениеЗаполнено(СтрокаДанных.ОКВЭДКод) Тогда
			НоваяСтрока = ДанныеСопоставленнойНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		КонецЕсли;
	КонецЦикла;
	
	Если ДанныеСопоставленнойНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Правила = ДанныеПодсказкиКодов.ПравилаКорректировкиКодов; // см. НовыйПравилаКорректировкиКодов
	СтруктураВыручки = ДанныеПодсказкиКодов.СтруктураВыручки; // см. СтруктураВыручки
	КодыПодобранныеСервисом = ДанныеПодсказкиКодов.КодыПодобранныеСервисом;
	ПоляГруппировкиВыручки = ПоляГруппировкиВыручки(ПоляИерархии);
	НаименованияДляПоискаВСервисе = ДанныеПодсказкиКодов.НаименованияДляПоискаВСервисе;
	
	КолонкиПоказателиСтруктурыВыручки = КолонкиПоказателиСтруктурыВыручки(СтруктураВыручки);
	
	ОбратнаяСвязь = Новый Соответствие;
	ПоляТекущейГруппировки = Новый Массив;
	// Обходим таблицу как дерево, чтобы на каждом уровне дерева определить перечень выбранных кодов.
	// Например, если дерево сгруппировано по полям "Номенклатурная группа", "Группа номенклатуры верхнего уровня" и "Номенклатура",
	// то сначала обходим все номенклатурные группы и определяем для каждой из них список всех кодов, выбранных на нижних уровнях иерархии,
	// затем обходим все сочетания "Номенклатурная группа" + "Группа номенклатуры верхнего уровня" и в конце
	// обходим по сочетаниям "Номенклатурная группа" + "Группа номенклатуры верхнего уровня" + "Номенклатура".
	Для Каждого ТекущееПолеГруппировкиВыручки Из ПоляГруппировкиВыручки Цикл
		ПоляТекущейГруппировки.Добавить(ТекущееПолеГруппировкиВыручки);

		ИменаТекущихПолей = СтрСоединить(ПоляТекущейГруппировки, ",");
		
		ДанныеСопоставленнойНоменклатуры.Индексы.Добавить(ИменаТекущихПолей);
		
		РазличныеЗначенияПолейТекущейГруппировки = ДанныеСопоставленнойНоменклатуры.Скопировать(,ИменаТекущихПолей);
		РазличныеЗначенияПолейТекущейГруппировки.Свернуть(ИменаТекущихПолей);
		
		Для Каждого ЗначениеПолейТекущейГруппировки Из РазличныеЗначенияПолейТекущейГруппировки Цикл
			Если Не ЗначениеЗаполнено(ЗначениеПолейТекущейГруппировки[ТекущееПолеГруппировкиВыручки]) Тогда
				Продолжить;
			КонецЕсли;
			Значение = ЗначениеПолейТекущейГруппировки[ТекущееПолеГруппировкиВыручки];
			НаименованиеДляПоискаВСервисе = НаименованияДляПоискаВСервисе[Значение];
			КодыПодобранныеСервисомДляТекущегоЗначения = КодыПодобранныеСервисом[Значение];
			
			Если Не ЗначениеЗаполнено(НаименованиеДляПоискаВСервисе) Тогда
				Продолжить;
			КонецЕсли;
			
			СоставОбратнойСвязи = СоставОбратнойСвязи(ОбратнаяСвязь, НаименованиеДляПоискаВСервисе);
			Если Не ЗначениеЗаполнено(СоставОбратнойСвязи.КодыСервиса) Тогда
				Для Каждого СтрокаПодсказки Из КодыПодобранныеСервисомДляТекущегоЗначения Цикл
					СоставОбратнойСвязи.КодыСервиса.Добавить(СтрокаПодсказки.КодОКВЭД);
				КонецЦикла;
			КонецЕсли;
			
			КонтекстВыбранногоКода = НовыйКонтекстВыбранногоКода(КолонкиПоказателиСтруктурыВыручки);
			СоставВыручки = КонтекстВыбранногоКода.СоставВыручки;
			СоставОбратнойСвязи.Контекст.Добавить(КонтекстВыбранногоКода);
			
			КонтекстВыбранногоКода.Тип = ТекущееПолеГруппировкиВыручки;
			
			ЗаполнитьСоставВыручки(СоставВыручки, СтруктураВыручки, ЗначениеПолейТекущейГруппировки, ИменаТекущихПолей, КолонкиПоказателиСтруктурыВыручки);
			
			ОпределитьВыбранныеКоды(СоставОбратнойСвязи.ВыбранныеКоды, ДанныеСопоставленнойНоменклатуры, ЗначениеПолейТекущейГруппировки, ИменаТекущихПолей);
			ОпределитьВыбранныеКоды(КонтекстВыбранногоКода.ВыбранныеКоды, ДанныеСопоставленнойНоменклатуры, ЗначениеПолейТекущейГруппировки, ИменаТекущихПолей);
			
			ОпределитьДобавленныеУдаленныеКоды(КонтекстВыбранногоКода, СоставОбратнойСвязи, Правила, КодыПодобранныеСервисомДляТекущегоЗначения);
						
		КонецЦикла;
	КонецЦикла;
	
	ПодсказкаКодовОКВЭДОбмен.ОтправитьОбратнуюСвязь(ОбратнаяСвязь, КолонкиПоказателиСтруктурыВыручки);
	
КонецПроцедуры

// Проверяет возможность обращения к сервису классификации номенклатуры.
// 
// Параметры:
//  ДоступноРедактированиеНастроекКлассификацииВыручки - Булево
//
// Возвращаемое значение:
//  Булево - Истина, если подсказка кодов разрешена
Функция РазрешенаПодсказкаКодов(ДоступноРедактированиеНастроекКлассификацииВыручки) Экспорт
	
	ЕстьПравоИспользоватьНастраиватьПодсказку =
		ДоступноРедактированиеНастроекКлассификацииВыручки
			И ПравоДоступа("Редактирование", Метаданные.Константы.ИспользоватьПодсказкуКодовОКВЭД);
			
	Возврат ЕстьПравоИспользоватьНастраиватьПодсказку И ОбщегоНазначения.РазделениеВключено();
	
КонецФункции

// Проверка доступности сервиса.
// 
// Возвращаемое значение:
//  Булево
Функция СервисДоступен() Экспорт
	
	Возврат ПодсказкаКодовОКВЭДОбмен.СервисДоступен();
	
КонецФункции

// Определяет, необходимо ли использовать подсказку кодов ОКВЭД.
//
// Возвращаемое значение:
//  Булево - Истина, если подсказка кодов ОКВЭД включена в настройках.
Функция ИспользоватьПодсказкуКодовОКВЭД() Экспорт
	ИспользоватьПодсказкуКодовОКВЭД = Константы.ИспользоватьПодсказкуКодовОКВЭД.Получить();
	Возврат ИспользоватьПодсказкуКодовОКВЭД;
КонецФункции

// Коллекция содержит данные, необходимые для формирования списка подсказки кодов в момент формирования данных выбора
// конкретной ячейки дерева формы обработки "Классификация выручки по ОКВЭД".
// 
// Возвращаемое значение:
//  Структура - Новый данные подсказки кодов:
// * КодыПодобранныеСервисом - Соответствие из КлючИЗначение:
//   ** Ключ - СправочникСсылка.Номенклатура
//           - СправочникСсылка.НоменклатурныеГруппы
//   ** Значение - Массив из см. ПодсказкаКодовОКВЭДОбмен.НовыйЭлементСопоставления
// * СтруктураВыручки - ТаблицаЗначений
// * ПравилаКорректировкиКодов - см. НовыйПравилаКорректировкиКодов
// * НаименованияДляПоискаВСервисе - Соответствие из КлючИЗначение:
//   ** Ключ - СправочникСсылка.Номенклатура
//           - СправочникСсылка.НоменклатурныеГруппы
//   ** Значение - Строка
// * СопоставленияИдентификаторовКодов - см. НовыйСопоставленияИдентификаторовКодов
//
Функция НовыйДанныеПодсказкиКодов() Экспорт
	
	ДанныеПодсказкиКодов = Новый Структура;
	ДанныеПодсказкиКодов.Вставить("КодыПодобранныеСервисом", Новый Соответствие);
	ДанныеПодсказкиКодов.Вставить("СтруктураВыручки", Новый ТаблицаЗначений()); // см. СтруктураВыручки
	ДанныеПодсказкиКодов.Вставить("ПравилаКорректировкиКодов", НовыйПравилаКорректировкиКодов());
	ДанныеПодсказкиКодов.Вставить("НаименованияДляПоискаВСервисе", Новый Соответствие());
	ДанныеПодсказкиКодов.Вставить("СопоставленияИдентификаторовКодов", НовыйСопоставленияИдентификаторовКодов());
	
	Возврат ДанныеПодсказкиКодов;
	
КонецФункции

// Функция формирует таблицу значений с детализацией выручки для подсказки кодов ОКВЭД.
// Анализирует проводки по счетам выручки, определяет контрагентов, номенклатуру и признаки деятельности (розница, услуга, товар).
//
// Параметры:
//   ПараметрыЗаполненияПодсказкиКодов - см. Обработки.КлассификацияВыручкиПоОКВЭД.НовыйПараметрыДанныхРаспределенияВыручки
//   ГруппыНоменклатуры - см. НовыйГруппыНоменклатуры
//
// Возвращаемое значение:
//   ТаблицаЗначений - см. содержание функции.
//
Функция СтруктураВыручки(ПараметрыЗаполненияПодсказкиКодов, ГруппыНоменклатуры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетаВыручки", БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.Выручка));
	Запрос.УстановитьПараметр("ДатаНачала", ПараметрыЗаполненияПодсказкиКодов.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПараметрыЗаполненияПодсказкиКодов.ДатаОкончания);
	Запрос.УстановитьПараметр("Организации", ПараметрыЗаполненияПодсказкиКодов.ОрганизацииОтчета);
	Запрос.УстановитьПараметр("ВидСубконтоКонтрагенты", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	Запрос.УстановитьПараметр("ВидСубконтоНоменклатура", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	Запрос.УстановитьПараметр("ВидСубконтоНоменклатурныеГруппы", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
	Запрос.УстановитьПараметр("ВидСубконтоСтатьиДДС", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДвиженияДенежныхСредств);
	Запрос.УстановитьПараметр("СчетаЗапасов", УчетЗатрат.ПредопределенныеСчетаЗапасов());
	Запрос.УстановитьПараметр("СчетаСебестоимость", БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.СебестоимостьПродаж));
	Запрос.УстановитьПараметр("СчетаРозничныхПродаж", БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыСРозничнымиПокупателями));

	СчетаПроизводства = ОбщегоНазначенияКлиентСервер.МассивЗначений(
		БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ГотоваяПродукция),
		БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ПроизводствоИзДавальческогоСырья));
	Запрос.УстановитьПараметр("СчетаПроизводства", СчетаПроизводства);

	СчетаМатериалы = БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.Материалы);
	Запрос.УстановитьПараметр("СчетаМатериалы", СчетаМатериалы);
	
	СчетаПерепродажа = ОбщегоНазначенияКлиентСервер.МассивЗначений(
		БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.Товары),
		СчетаМатериалы);
		
	Запрос.УстановитьПараметр("СчетаПерепродажа", СчетаПерепродажа);
	Запрос.УстановитьПараметр("СчетаПерепродажаМаркетПлейс", БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные));
	Запрос.УстановитьПараметр("ГруппыНоменклатуры", ГруппыНоменклатуры);
	
	КонтрагентыМаркетПлейсов = РегистрыСведений.НоменклатураМаркетплейсов.КонтрагентыМаркетплейсов();
	Запрос.УстановитьПараметр("КонтрагентыМаркетплейсов", ОбщегоНазначенияБПКлиентСервер.КлючиКоллекции(КонтрагентыМаркетПлейсов));
	
	// Чаще всего продажа материальных ценностей отражается проводками:
	// Дт 62    - Кт 90.01 - выручка
	// Дт 90.02 - Кт 10, 41, 43 и пр. - списание товара, материала, продукции
	// Поэтому, чтобы узнать к какой категории материальных ценностей относится продажа, будем соединять эти две проводки
	// по регистратору (см. временные таблицы ТаблицаВыручки и ВыручкаСчетаУчета).
	// На первый взгляд кажущиеся взаимоисключающими признаки Услуга и Товар, присутствуют в составе структуры выручки для того,
	// чтобы определять случаи, когда продажа отражена не классической схемой проводок, приведенной выше. Например, без закрывающих
	// документов или другими, пока еще не известными нам схемами.
	//@skip-check ql-temp-table-index
	// Заведомо маленькие временные таблицы не индексируем.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГруппыНоменклатуры.ГруппаНоменклатурыВерхнегоУровня КАК ГруппаНоменклатурыВерхнегоУровня,
	|	ГруппыНоменклатуры.ГруппаНоменклатурыВторогоУровня КАК ГруппаНоменклатурыВторогоУровня,
	|	ГруппыНоменклатуры.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ГруппыНоменклатуры
	|ИЗ
	|	&ГруппыНоменклатуры КАК ГруппыНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.СчетДт КАК СчетДт,
	|	ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК СубконтоДт1,
	|	ХозрасчетныйОборотыДтКт.СубконтоДт2 КАК СубконтоДт2,
	|	ХозрасчетныйОборотыДтКт.СубконтоДт3 КАК СубконтоДт3,
	|	ХозрасчетныйОборотыДтКт.СчетКт КАК СчетКт,
	|	ХозрасчетныйОборотыДтКт.СубконтоКт1 КАК СубконтоКт1,
	|	ХозрасчетныйОборотыДтКт.СубконтоКт2 КАК СубконтоКт2,
	|	ХозрасчетныйОборотыДтКт.СубконтоКт3 КАК СубконтоКт3,
	|	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ТаблицаВыручки
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&ДатаНачала, &ДатаОкончания, Регистратор, , , СчетКт В (&СчетаВыручки), , Организация В (&Организации)) КАК ХозрасчетныйОборотыДтКт
	|ГДЕ
	|	ХозрасчетныйОборотыДтКт.СуммаОборот > 0
	|
	|ИНДЕКСИРОВАТЬ ПО НАБОРАМ
	|(
	|	(СчетДт),
	|	(СчетКт)
	|)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаВыручки.СчетДт КАК СчетРасчетов,
	|	ВидыСубконто.НомерСтроки КАК НомерСубконтоКонтрагенты
	|ПОМЕСТИТЬ НомераСубконтоРасчетов
	|ИЗ
	|	ТаблицаВыручки КАК ТаблицаВыручки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконто
	|		ПО ТаблицаВыручки.СчетДт = ВидыСубконто.Ссылка
	|			И (ВидыСубконто.ВидСубконто = &ВидСубконтоКонтрагенты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаВыручки.СчетКт КАК СчетВыручки,
	|	ВидыСубконтоНоменклатура.НомерСтроки КАК НомерСубконтоНоменклатура,
	|	ВидыСубконтоНоменклатурнаяГруппа.НомерСтроки КАК НомерСубконтоНоменклатурнаяГруппа
	|ПОМЕСТИТЬ НомераСубконтоВыручка
	|ИЗ
	|	ТаблицаВыручки КАК ТаблицаВыручки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоНоменклатурнаяГруппа
	|		ПО ТаблицаВыручки.СчетКт = ВидыСубконтоНоменклатурнаяГруппа.Ссылка
	|			И (ВидыСубконтоНоменклатурнаяГруппа.ВидСубконто = &ВидСубконтоНоменклатурныеГруппы)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоНоменклатура
	|		ПО ТаблицаВыручки.СчетКт = ВидыСубконтоНоменклатура.Ссылка
	|			И (ВидыСубконтоНоменклатура.ВидСубконто = &ВидСубконтоНоменклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаВыручки.СчетДт КАК СчетРасчетов,
	|	ВидыСубконто.НомерСтроки КАК НомерСубконтоСтатьяДДС
	|ПОМЕСТИТЬ НомераСубконтоСтатьиДДС
	|ИЗ
	|	ТаблицаВыручки КАК ТаблицаВыручки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконто
	|		ПО ТаблицаВыручки.СчетДт = ВидыСубконто.Ссылка
	|			И (ВидыСубконто.ВидСубконто = &ВидСубконтоСтатьиДДС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаВыручки.СчетДт КАК СчетДт,
	|	ВЫБОР НомераСубконтоРасчетов.НомерСубконтоКонтрагенты
	|		КОГДА 1
	|			ТОГДА ТаблицаВыручки.СубконтоДт1
	|		КОГДА 2
	|			ТОГДА ТаблицаВыручки.СубконтоДт2
	|		КОГДА 3
	|			ТОГДА ТаблицаВыручки.СубконтоДт3
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР НомераСубконтоВыручка.НомерСубконтоНоменклатурнаяГруппа
	|		КОГДА 1
	|			ТОГДА ТаблицаВыручки.СубконтоКт1
	|		КОГДА 2
	|			ТОГДА ТаблицаВыручки.СубконтоКт2
	|		КОГДА 3
	|			ТОГДА ТаблицаВыручки.СубконтоКт3
	|	КОНЕЦ КАК НоменклатурнаяГруппа,
	|	ВЫБОР НомераСубконтоВыручка.НомерСубконтоНоменклатура
	|		КОГДА 1
	|			ТОГДА ТаблицаВыручки.СубконтоКт1
	|		КОГДА 2
	|			ТОГДА ТаблицаВыручки.СубконтоКт2
	|		КОГДА 3
	|			ТОГДА ТаблицаВыручки.СубконтоКт3
	|	КОНЕЦ КАК Номенклатура,
	|	ТаблицаВыручки.Регистратор КАК Регистратор,
	|	ВЫБОР НомераСубконтоСтатьиДДС.НомерСубконтоСтатьяДДС
	|		КОГДА 1
	|			ТОГДА ТаблицаВыручки.СубконтоДт1
	|		КОГДА 2
	|			ТОГДА ТаблицаВыручки.СубконтоДт2
	|		КОГДА 3
	|			ТОГДА ТаблицаВыручки.СубконтоДт3
	|	КОНЕЦ КАК СтатьяДДС
	|ПОМЕСТИТЬ ДетальнаяВыручка
	|ИЗ
	|	ТаблицаВыручки КАК ТаблицаВыручки
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСубконтоВыручка КАК НомераСубконтоВыручка
	|		ПО ТаблицаВыручки.СчетКт = НомераСубконтоВыручка.СчетВыручки
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСубконтоРасчетов КАК НомераСубконтоРасчетов
	|		ПО ТаблицаВыручки.СчетДт = НомераСубконтоРасчетов.СчетРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСубконтоСтатьиДДС КАК НомераСубконтоСтатьиДДС
	|		ПО ТаблицаВыручки.СчетДт = НомераСубконтоСтатьиДДС.СчетРасчетов
	|
	|ИНДЕКСИРОВАТЬ ПО НАБОРАМ
	|(
	|	(Номенклатура,
	|	Регистратор,
	|	НоменклатурнаяГруппа),
	|	(Контрагент)
	|)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СчетаЗапасов
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|		ПО ХозрасчетныйВидыСубконто.Ссылка = Хозрасчетный.Ссылка
	|ГДЕ
	|	ХозрасчетныйВидыСубконто.Ссылка В ИЕРАРХИИ(&СчетаЗапасов)
	|	И НЕ Хозрасчетный.Забалансовый
	|	И ХозрасчетныйВидыСубконто.ВидСубконто = &ВидСубконтоНоменклатура
	|	И ХозрасчетныйВидыСубконто.Количественный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.СчетКт КАК СчетУчетаНоменклатуры,
	|	ХозрасчетныйОборотыДтКт.СубконтоКт1 КАК Номенклатура,
	|	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор,
	|	ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК НоменклатурнаяГруппа
	|ПОМЕСТИТЬ ВыручкаСчетаУчета
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			СчетДт В (&СчетаСебестоимость),
	|			&ВидСубконтоНоменклатурныеГруппы,
	|			СчетКт В
	|				(ВЫБРАТЬ
	|					СчетаЗапасов.Ссылка
	|				ИЗ
	|					СчетаЗапасов КАК СчетаЗапасов),
	|			&ВидСубконтоНоменклатура,
	|			Организация В (&Организации)) КАК ХозрасчетныйОборотыДтКт
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	Номенклатура,
	|	НоменклатурнаяГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ДетальнаяВыручка.НоменклатурнаяГруппа КАК Справочник.НоменклатурныеГруппы) КАК НоменклатурнаяГруппа,
	|	ВЫРАЗИТЬ(ДетальнаяВыручка.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(СправочникНоменклатура.ВидНоменклатуры, ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)) КАК ВидНоменклатуры,
	|	ЕСТЬNULL(ГруппыНоменклатуры.ГруппаНоменклатурыВерхнегоУровня, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК ГруппаНоменклатурыВерхнегоУровня,
	|	ЕСТЬNULL(ГруппыНоменклатуры.ГруппаНоменклатурыВторогоУровня, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК ГруппаНоменклатурыВторогоУровня,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ДетальнаяВыручка.Регистратор КАК Документ.ПриходныйКассовыйОрдер).БезЗакрывающихДокументов
	|			ИЛИ ВЫРАЗИТЬ(ДетальнаяВыручка.Регистратор КАК Документ.ПоступлениеНаРасчетныйСчет).БезЗакрывающихДокументов, ЛОЖЬ) КАК БезЗакрывающихДокументов,
	|	ЕСТЬNULL(СправочникКонтрагенты.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
	|					И НЕ СправочникКонтрагенты.ИндивидуальныйПредприниматель
	|				ИЛИ ДетальнаяВыручка.СчетДт В (&СчетаРозничныхПродаж), ЛОЖЬ)
	|		ИЛИ ЕСТЬNULL(ДетальнаяВыручка.Регистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|				ИЛИ СправочникКонтрагенты.Ссылка В (&КонтрагентыМаркетплейсов), ЛОЖЬ) КАК Розница,
	|	ЕСТЬNULL(СправочникНоменклатура.Услуга, ЛОЖЬ) КАК Услуга,
	|	ЕСТЬNULL(ВыручкаСчетаУчета.СчетУчетаНоменклатуры В (&СчетаПроизводства), ЛОЖЬ) КАК Производство,
	|	ЕСТЬNULL(НЕ СправочникНоменклатура.Услуга, ЛОЖЬ) КАК Товар,
	|	ЕСТЬNULL((СправочникКонтрагенты.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
	|			ИЛИ СправочникКонтрагенты.ИндивидуальныйПредприниматель)
	|			И НЕ ДетальнаяВыручка.СчетДт В (&СчетаРозничныхПродаж)
	|			И НЕ СправочникКонтрагенты.Ссылка В (&КонтрагентыМаркетплейсов), ЛОЖЬ) КАК Опт,
	|	ЕСТЬNULL(ВыручкаСчетаУчета.СчетУчетаНоменклатуры В (&СчетаПерепродажа), ЛОЖЬ) КАК Перепродажа,
	|	ЕСТЬNULL(ВыручкаСчетаУчета.СчетУчетаНоменклатуры В (&СчетаМатериалы), ЛОЖЬ) КАК Материалы,
	|	ЕСТЬNULL(ВыручкаСчетаУчета.СчетУчетаНоменклатуры В (&СчетаПерепродажаМаркетПлейс)
	|			И СправочникКонтрагенты.Ссылка В (&КонтрагентыМаркетплейсов), ЛОЖЬ) КАК ПерепродажаМаркетплейс
	|ИЗ
	|	ДетальнаяВыручка КАК ДетальнаяВыручка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыручкаСчетаУчета КАК ВыручкаСчетаУчета
	|		ПО ДетальнаяВыручка.Регистратор = ВыручкаСчетаУчета.Регистратор
	|			И ДетальнаяВыручка.НоменклатурнаяГруппа = ВыручкаСчетаУчета.НоменклатурнаяГруппа
	|			И ДетальнаяВыручка.Номенклатура = ВыручкаСчетаУчета.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК СправочникКонтрагенты
	|		ПО ДетальнаяВыручка.Контрагент = СправочникКонтрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ДетальнаяВыручка.Номенклатура = СправочникНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГруппыНоменклатуры КАК ГруппыНоменклатуры
	|		ПО ДетальнаяВыручка.Номенклатура = ГруппыНоменклатуры.Номенклатура";
	
	СтруктураВыручки = Запрос.Выполнить().Выгрузить();
	
	Если СтруктураВыручки.Количество() > 0 И ГруппыНоменклатуры.Количество() = 0 Тогда
		Обработки.КлассификацияВыручкиПоОКВЭД.ЗаполнитьГруппыНоменклатуры(СтруктураВыручки);
	КонецЕсли;
	
	СтруктураВыручки.Индексы.Добавить("НоменклатурнаяГруппа");
	СтруктураВыручки.Индексы.Добавить("Номенклатура");
	СтруктураВыручки.Индексы.Добавить("НоменклатурнаяГруппа, Номенклатура");
	
	Возврат СтруктураВыручки;
	
КонецФункции

// Возвращает имена полей распределения выручки по ОКВЭД, относящихся к иерархии поля "Номенклатура".
// 
// Возвращаемое значение:
//  Строка
Функция ПоляГруппНоменклатуры() Экспорт
	ПоляГруппНоменклатуры = "ГруппаНоменклатурыВерхнегоУровня,ГруппаНоменклатурыВторогоУровня,Номенклатура";
	Возврат ПоляГруппНоменклатуры;
КонецФункции

// Конструктор таблицы сопоставления номенклатуры и групп номенклатуры.
// 
// Возвращаемое значение:
//  ТаблицаЗначений
Функция НовыйГруппыНоменклатуры() Экспорт
	
	ПоляГруппНоменклатуры = ПоляГруппНоменклатуры();
	
	ГруппыНоменклатуры = Новый ТаблицаЗначений();
	ОписаниеТипаНоменклатура = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	Для Каждого Колонка Из СтрРазделить(ПоляГруппНоменклатуры, ",") Цикл
		ГруппыНоменклатуры.Колонки.Добавить(Колонка, ОписаниеТипаНоменклатура);
	КонецЦикла;
	
	Возврат ГруппыНоменклатуры;
	
КонецФункции

// см. ПодсказкаКодовОКВЭДОбмен.НовыйСопоставленияИдентификаторовКодов
Функция НовыйСопоставленияИдентификаторовКодов() Экспорт
	
	Возврат ПодсказкаКодовОКВЭДОбмен.НовыйСопоставленияИдентификаторовКодов();
	
КонецФункции

// Соответствие кодов сервиса кодам классификатора ОКВЭД: в сервисе классификации номенклатуры позиции классификатора
// представлены числовыми идентификаторами, а не самими кодами.
//
// Возвращаемое значение:
//  см. ПодсказкаКодовОКВЭДОбмен.НовыйСопоставленияИдентификаторовКодов
Функция СопоставленияИдентификаторовКодов() Экспорт
	
	Возврат ПодсказкаКодовОКВЭДОбмен.СопоставленияИдентификаторовКодов();
	
КонецФункции

// Возвращает префикс общего события, связанного с подсказкой кодов, для записи в журнал регистрации.
// 
// Возвращаемое значение:
//  Строка - Имя общего события журнала регистрации
Функция ИмяОбщегоСобытияЖурналаРегистрации() Экспорт
	Возврат НСтр("ru = 'Подсказка кодов ОКВЭД'", ОбщегоНазначения.КодОсновногоЯзыка());
КонецФункции

// Имя события получение данных из сервиса для записи в журнал регистрации.
// 
// Возвращаемое значение:
//  Строка
Функция ИмяСобытияПолучениеДанных() Экспорт
	Возврат НСтр("ru = 'Получение данных из сервиса'", ОбщегоНазначения.КодОсновногоЯзыка())
КонецФункции

// См. ОбщегоНазначенияБП.ЗаписатьОперациюБизнесСтатистики
// 
// Параметры:
//  ИмяСобытияСокращенное - Строка
Процедура ЗаписатьБизнесСтатистику(ИмяСобытияСокращенное) Экспорт
	ОбщегоНазначенияБП.ЗаписатьОперациюБизнесСтатистики(СтрШаблон("СтатистикаБП.%1", ИмяСобытияСокращенное));
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает массив имен колонок, описывающих характер выручки, упорядоченных в алфавитном порядке.
//
// Параметры:
//  СтруктураВыручки - см. СтруктураВыручки
// 
// Возвращаемое значение:
//  Массив из Строка
//
Функция КолонкиПоказателиСтруктурыВыручки(СтруктураВыручки) Экспорт
	
	КолонкиСтруктурыВыручки = ИменаКолонокТаблицы(СтруктураВыручки);
	
	СписокНастраиваемыхПолей = Обработки.КлассификацияВыручкиПоОКВЭД.НастраиваемыеПоляГруппировки();
	
	КолонкиПоказателиСтруктурыВыручки = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		КолонкиСтруктурыВыручки,
		ПоляГруппировкиВыручки(СписокНастраиваемыхПолей));
	
	// При передаче обратной связи в сервис классификации номенклатуры информация о структуре выручки передается в виде
	// массива из нулей и единиц, при этом сами названия показателей выручки - Опт, Производство, Товар - в сервис не передаются.
	// Чтобы сделать эту информацию устойчивой к изменению порядка полей в запросе и к иным корректировкам алгоритма,
	// отсортируем колонки в порядке возрастания их имен.
	СписокДляСортировки = Новый СписокЗначений();
	СписокДляСортировки.ЗагрузитьЗначения(КолонкиПоказателиСтруктурыВыручки);
	СписокДляСортировки.СортироватьПоЗначению();
	
	Возврат СписокДляСортировки.ВыгрузитьЗначения();
	
КонецФункции

// Возвращает пустую таблицу СтруктураВыручки.
// 
// Возвращаемое значение:
//  см. СтруктураВыручки
//
Функция НовыйСтруктураВыручки() Экспорт
	
	ПараметрыВыручки = Обработки.КлассификацияВыручкиПоОКВЭД.НовыйПараметрыДанныхРаспределенияВыручки();
	СтруктураВыручки = ПодсказкаКодовОКВЭД.СтруктураВыручки(ПараметрыВыручки, ПодсказкаКодовОКВЭД.НовыйГруппыНоменклатуры());
	
	Возврат СтруктураВыручки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВычислитьПодсказку(ПодсказкаКодов, ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом, РанееВыбранныеКоды)
	// В таблице ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом содержатся коды ОКВЭД, рассчитанные на основе правил корректировки
	// кодов. У каждого из них есть приоритет. Часть кодов отмечена признаком Удалить. Эти коды не должны попасть в подсказку.
	// Здесь мы для каждого кода ОКВЭД из ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом заполняем наименование и представление,
	// чтобы показать их пользователю, а также производим ранжирование и обогащение ранее выбранными кодами из "соседних" строк
	// дерева.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДействияПравил", ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом);
	Запрос.УстановитьПараметр("РанееВыбранныеКоды", РанееВыбранныеКоды);
	Запрос.УстановитьПараметр("МаксимальнаяДлинаКодаСервиса", МаксимальнаяДлинаКодаСервиса());
	// Таблица подобранных кодов заведомо небольшая, индексировать не требуется.
	//@skip-check ql-temp-table-index
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеОКВЭД.Раздел КАК Раздел,
		|	ВЫРАЗИТЬ(ДанныеОКВЭД.КодБезТочек КАК СТРОКА(2)) КАК Класс,
		|	ВЫРАЗИТЬ(ДанныеОКВЭД.КодБезТочек КАК СТРОКА(3)) КАК Подкласс,
		|	ВЫРАЗИТЬ(ДанныеОКВЭД.КодБезТочек КАК СТРОКА(4)) КАК Группа,
		|	ДанныеОКВЭД.Код КАК Код,
		|	ДанныеОКВЭД.Наименование КАК Наименование,
		|	ДанныеОКВЭД.Код + "" "" + ДанныеОКВЭД.Наименование КАК Представление
		|ПОМЕСТИТЬ РанееВыбранныеКоды
		|ИЗ
		|	РегистрСведений.ДанныеОКВЭД КАК ДанныеОКВЭД
		|ГДЕ
		|	ДанныеОКВЭД.Код В (&РанееВыбранныеКоды)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДействияПравил.Код КАК Код,
		|	ДействияПравил.Приоритет КАК Приоритет,
		|	ДействияПравил.Удалить КАК Удалить
		|ПОМЕСТИТЬ ДействияПравил
		|ИЗ
		|	&ДействияПравил КАК ДействияПравил
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ДанныеОКВЭД.КодБезТочек КАК СТРОКА(4)) В
		|			(ВЫБРАТЬ
		|				РанееВыбранныеКоды.Группа
		|			ИЗ
		|				РанееВыбранныеКоды КАК РанееВыбранныеКоды)
		|			ТОГДА 4
		|		КОГДА ВЫРАЗИТЬ(ДанныеОКВЭД.КодБезТочек КАК СТРОКА(3)) В
		|			(ВЫБРАТЬ
		|				РанееВыбранныеКоды.Подкласс
		|			ИЗ
		|				РанееВыбранныеКоды КАК РанееВыбранныеКоды)
		|			ТОГДА 3
		|		КОГДА ВЫРАЗИТЬ(ДанныеОКВЭД.КодБезТочек КАК СТРОКА(2)) В
		|			(ВЫБРАТЬ
		|				РанееВыбранныеКоды.Класс
		|			ИЗ
		|				РанееВыбранныеКоды КАК РанееВыбранныеКоды)
		|			ТОГДА 2
		|		КОГДА ДанныеОКВЭД.Раздел В
		|			(ВЫБРАТЬ
		|				РанееВыбранныеКоды.Раздел
		|			ИЗ
		|				РанееВыбранныеКоды КАК РанееВыбранныеКоды)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ + ДействияПравил.Приоритет КАК Приоритет,
		|	ДанныеОКВЭД.Код КАК Код,
		|	ДанныеОКВЭД.КодБезТочек КАК КодБезТочек,
		|	ДанныеОКВЭД.Наименование КАК Наименование,
		|	ДанныеОКВЭД.Код + "" "" + ДанныеОКВЭД.Наименование КАК Представление,
		|	ДействияПравил.Удалить КАК Удалить
		|ПОМЕСТИТЬ ПриоритетыСУчетомРанееВыбранных
		|ИЗ
		|	ДействияПравил КАК ДействияПравил
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеОКВЭД КАК ДанныеОКВЭД
		|		ПО ДействияПравил.Код = ДанныеОКВЭД.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ПриоритетыСУчетомРанееВыбранных.Приоритет) КАК Приоритет,
		|	ПриоритетыСУчетомРанееВыбранных.Код КАК Код,
		|	ПриоритетыСУчетомРанееВыбранных.КодБезТочек КАК КодБезТочек,
		|	ПриоритетыСУчетомРанееВыбранных.Наименование КАК Наименование,
		|	ПриоритетыСУчетомРанееВыбранных.Представление КАК Представление,
		|	МАКСИМУМ(ПриоритетыСУчетомРанееВыбранных.Удалить) КАК Удалить
		|ПОМЕСТИТЬ ГруппыПоПравилам
		|ИЗ
		|	ПриоритетыСУчетомРанееВыбранных КАК ПриоритетыСУчетомРанееВыбранных
		|СГРУППИРОВАТЬ ПО
		|	ПриоритетыСУчетомРанееВыбранных.Код,
		|	ПриоритетыСУчетомРанееВыбранных.КодБезТочек,
		|	ПриоритетыСУчетомРанееВыбранных.Наименование,
		|	ПриоритетыСУчетомРанееВыбранных.Представление
		|ИМЕЮЩИЕ
		|	НЕ МАКСИМУМ(ПриоритетыСУчетомРанееВыбранных.Удалить)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ГруппыПоПравилам.Приоритет) КАК Приоритет,
		|	ГруппыПоПравилам.Код КАК Код,
		|	ГруппыПоПравилам.Наименование КАК Наименование,
		|	ГруппыПоПравилам.Представление КАК Представление,
		|	МАКСИМУМ(ГруппыПоПравилам.ЭтоРанееВыбранныйДетальныйКод) КАК ЭтоРанееВыбранныйДетальныйКод
		|ИЗ
		|	(ВЫБРАТЬ
		|		ГруппыПоПравилам.Приоритет КАК Приоритет,
		|		ГруппыПоПравилам.Код КАК Код,
		|		ГруппыПоПравилам.Наименование КАК Наименование,
		|		ГруппыПоПравилам.Представление КАК Представление,
		|		ЛОЖЬ КАК ЭтоРанееВыбранныйДетальныйКод
		|	ИЗ
		|		ГруппыПоПравилам КАК ГруппыПоПравилам
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ГруппыПоПравилам.Приоритет КАК Приоритет,
		|		РанееВыбранныеКоды.Код,
		|		РанееВыбранныеКоды.Наименование КАК Наименование,
		|		РанееВыбранныеКоды.Представление КАК Представление,
		|		ИСТИНА
		|	ИЗ
		|		ГруппыПоПравилам КАК ГруппыПоПравилам
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РанееВыбранныеКоды КАК РанееВыбранныеКоды
		|			ПО РанееВыбранныеКоды.Группа = ГруппыПоПравилам.КодБезТочек
		|	ГДЕ
		|		ДЛИНАСТРОКИ(РанееВыбранныеКоды.Код) > &МаксимальнаяДлинаКодаСервиса
		|		И РанееВыбранныеКоды.Код <> ГруппыПоПравилам.Код) КАК ГруппыПоПравилам
		|СГРУППИРОВАТЬ ПО
		|	ГруппыПоПравилам.Код,
		|	ГруппыПоПравилам.Наименование,
		|	ГруппыПоПравилам.Представление
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет УБЫВ,
		|	ЭтоРанееВыбранныйДетальныйКод УБЫВ";
	
	ВыборкаКодов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаКодов.Следующий() Цикл
		ДанныеКода = НовыйДанныеКода();
		ЗаполнитьЗначенияСвойств(ДанныеКода, ВыборкаКодов);
		ПодсказкаКодов.Добавить(ДанныеКода);
	КонецЦикла;
	
КонецПроцедуры

Функция НовыйДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом()
	
	ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом = Новый ТаблицаЗначений();
	ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом.Колонки.Добавить("Код", ОбщегоНазначения.ОписаниеТипаСтрока(8));
	// Приоритет влияет на порядок выдачи кодов в подсказке. Зависит от вероятности, которую рассчитал сервис - 
	// он возвращает ее в виде долей числа 1. Будем округлять ее до сотых знаков.
	// Также приоритет меняется в зависимости от тех кодов, которые уже выбраны на форме. Такое изменение
	// выполняется путем увеличения вероятности на целое число - в зависимости того, в какой близости
	// к ранее подобранным кодам находятся коды сервиса - в одном разделе, классе, подклассе или в одной группе.
	ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом.Колонки.Добавить("Приоритет", ОбщегоНазначения.ОписаниеТипаЧисло(5,2));
	ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом.Колонки.Добавить("Удалить", Новый ОписаниеТипов("Булево"));
	
	ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом.Индексы.Добавить("Код");
	Возврат ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом;
КонецФункции

Процедура ПрименитьПравила(ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом, КодыСервиса, Правила, Выручка)

	ДействияПравила = ДействияПравила();
	Для Каждого КодСервиса Из КодыСервиса Цикл
		ПрименитьПравилаДляКодаСервиса(ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом, КодСервиса, Правила, Выручка, ДействияПравила);
	КонецЦикла;
КонецПроцедуры

Функция СоставОбратнойСвязи(ОбратнаяСвязь, ИдентификаторВСервисе)

	СоставОбратнойСвязи = ОбратнаяСвязь[ИдентификаторВСервисе];
	Если СоставОбратнойСвязи = Неопределено Тогда
		СоставОбратнойСвязи = НовыйСоставОбратнойСвязи();
		ОбратнаяСвязь.Вставить(ИдентификаторВСервисе, СоставОбратнойСвязи);
	КонецЕсли;
	Возврат СоставОбратнойСвязи;
	
КонецФункции

Функция НовыйСоставОбратнойСвязи()
	
	СоставОбратнойСвязи = Новый Структура;
	СоставОбратнойСвязи.Вставить("КодыСервиса", Новый Массив());
	СоставОбратнойСвязи.Вставить("ВыбранныеКоды", Новый Массив);
	СоставОбратнойСвязи.Вставить("Контекст", Новый Массив);
	
	Возврат СоставОбратнойСвязи;
	
КонецФункции

Функция НовыйКонтекстВыбранногоКода(КолонкиПоказателиСтруктурыВыручки)
	
	КонтекстВыбранногоКода = Новый Структура;
	
	// Список кодов, которые не вернул сервис, но которые мы добавили, посмотрев на характер выручки,
	// и показали (были готовы показать) пользователю.
	КонтекстВыбранногоКода.Вставить("ДобавленныеКоды", Новый Массив);
	// Список кодов, которые вернул сервис, но которые мы не посчитали необходимым показывать пользователю
	//(сработало правило с действием "Удалить").
	КонтекстВыбранногоКода.Вставить("УдаленныеКоды", Новый Массив);
	КонтекстВыбранногоКода.Вставить("СоставВыручки", НовыйСоставВыручки(КолонкиПоказателиСтруктурыВыручки));
	КонтекстВыбранногоКода.Вставить("ВыбранныеКоды", Новый Массив);
	КонтекстВыбранногоКода.Вставить("Тип", "");
	
	Возврат КонтекстВыбранногоКода;
	
КонецФункции

Функция НовыйСоставВыручки(КолонкиПоказателиСтруктурыВыручки)
	СоставВыручки = Новый ТаблицаЗначений();
	Для Каждого Колонка Из КолонкиПоказателиСтруктурыВыручки Цикл
		СоставВыручки.Колонки.Добавить(Колонка);
	КонецЦикла;
	Возврат СоставВыручки;
КонецФункции

Функция НовыйДанныеКода()
	
	ДанныеКода = Новый Структура;
	
	ДанныеКода.Вставить("Код", "");
	ДанныеКода.Вставить("Наименование", "");
	ДанныеКода.Вставить("Представление", "");
	
	Возврат ДанныеКода;
	
КонецФункции

Функция ДанныеКлассификатораСИерархией()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МаксимальноеКоличествоЦифрКодовСервиса", МаксимальнаяДлинаКодаСервиса());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеОКВЭД.Код КАК Код,
	|	ЛЕВ(ДанныеОКВЭД.КодБезТочек, 1) КАК ЧастьКода1,
	|	ЛЕВ(ДанныеОКВЭД.КодБезТочек, 2) КАК ЧастьКода2,
	|	ЛЕВ(ДанныеОКВЭД.КодБезТочек, 3) КАК ЧастьКода3,
	|	ЛЕВ(ДанныеОКВЭД.КодБезТочек, 4) КАК ЧастьКода4,
	|	ЛЕВ(ДанныеОКВЭД.КодБезТочек, 5) КАК ЧастьКода5,
	|	ЛЕВ(ДанныеОКВЭД.КодБезТочек, 6) КАК ЧастьКода6
	|ИЗ
	|	РегистрСведений.ДанныеОКВЭД КАК ДанныеОКВЭД
	|ГДЕ
	|	ДЛИНАСТРОКИ(ДанныеОКВЭД.Код) <= &МаксимальноеКоличествоЦифрКодовСервиса";
	
	ДанныеКлассификатораСИрерахией = Запрос.Выполнить().Выгрузить();
	Для ДлинаЧастиКода = 1 По 6 Цикл
		ДанныеКлассификатораСИрерахией.Индексы.Добавить(СтрШаблон("ЧастьКода%1", XMLСтрока(ДлинаЧастиКода)));
	КонецЦикла;
	
	Возврат ДанныеКлассификатораСИрерахией;
	
КонецФункции

Функция МаксимальнаяДлинаКодаСервиса()
	// На текущий момент классификатор в сервисе представлен группами кодов
	// При увеличении детализации кодов сервиса потребуется внести изменения в алгоритм см. ВычислитьПодсказку
	Возврат 5;
КонецФункции

#Область Правила_Корректировки_Кодов

Функция ДействияПравила()
	
	ДействияПравила = Новый Структура;
	ДействияПравила.Вставить("Дополнить", "Дополнить");
	ДействияПравила.Вставить("Удалить", "Удалить");
	
	Возврат ДействияПравила;
	
КонецФункции

// Возвращает пустую таблицу для хранения правил корректировки подсказки кодов ОКВЭД, возвращенных сервисом классификации номенклатуры.
// Корректировка подсказки осуществляется на основании учетных данных отражения выручки по данной номенклатуре / номенклатурной группе.
// Например, с помощью правил можно указать, что если организация занимается только розничной торговлей и не занимается
// производственной деятельностью, то код производства конкретной продукции, который предложил сервис, нужно удалить,
// а код розничной продажи этого вида продукции - наоборот, добавить, если сервис его не предложил.
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица с колонками для описания правил корректировки:
//     * Код             - Строка - код ОКВЭД, к которому применяется правило.
//     * Действие        - Строка - действие, которое будет выполнено в результате применения правила -"Дополнить" или "Удалить".
//                                  Если выполнено условие правила, описанное в свойстве ПризнакВыручки, то для правила с действием
//                                  "Удалить" код ОКВЭД, указанный в поле Код, будет удален из списка-подсказки.
//                                  Если выполняется правило с действием "Дополнить", то в список-подсказку будут добавлены коды,
//                                  указанные в свойстве "ДобавляемыеКоды".
//     * ПризнакВыручки  - Строка - наборы строковых представлений признаков выручки. Имена признаков в наборе разделены
//                                  запятыми. Отдельная строка структуры выручки считается удовлетворяющей набору, если у нее
//                                  есть одновременно все признаки перечисленные в наборе (по правилу логического "И" - конъюнкции).
//                                  Если наборов несколько, они перечисляются через точку с запятой. Строковые представления
//                                  соответствуют полям запроса с типом Булево из см. СтруктураВыручки. Правило "Удалить" применяется,
//                                  если каждая строка структуры выручки соответствует любому из перечисленных наборов.
//                                  Правило "Дополнить" применяется, если хотя бы одна строка структуры выручки
//                                  соответствует любому из перечисленных наборов.
//                                  Например, правило с действием "Удалить" и признаком выручки строка
//                                  "Товар,Перепродажа,Розница;БезЗакрывающихДокументов" считается выполненым, если все операции продажи
//                                  по данной номенклатуре/номенклатурной группе - это розничные продажи товаров, не произведенных
//                                  собственными силами, или если продажа отражена банковскими или кассовыми документами с признаком
//                                  "Без закрывающих документов".
//                                  Такое же правило с действием "Дополнить" будет считаться выполненным, если обнаруживается хотя бы одна
//                                  операция розничной продажи товара (не собстственного производства) или хотя бы одна продажа
//                                  "Без закрывающих документов".
//                                  Используем такую сложную логику, потому что пока считаем, что лучше добавить что-то ненужное,
//                                  чем удалить что-то нужное.
//     * ДобавляемыеКоды - Строка - коды, перечисленные через запятую, которые будут добавлены в подсказку,
//                                  если у правила установлено действие "Дополнить". Имеет смысл указывать только для правил
//                                  с действием "Дополнить". Для правил с действием "Удалить" значения, указанные в этом
//                                  поле, игнорируются.
//
Функция НовыйПравилаКорректировкиКодов()
	
	ПравилаКорректировкиКодов = Новый ТаблицаЗначений;
	ПравилаКорректировкиКодов.Колонки.Добавить("Код");
	// Возможны только два действия: удалить или дополнить
	ПравилаКорректировкиКодов.Колонки.Добавить("Действие"); // см. ДействияПравила.Дополнить, ДействияПравила.Удалить
	ПравилаКорректировкиКодов.Колонки.Добавить("ПризнакВыручки"); // "Опт,Товар,Производство;БезЗакрывающихДокументов"
	ПравилаКорректировкиКодов.Колонки.Добавить("ДобавляемыеКоды");
	
	Возврат ПравилаКорректировкиКодов
	
КонецФункции

// Описание правил описано в комментарии к см. НовыйПравилаКорректировкиКодов
// 
// Возвращаемое значение:
//  см. НовыйПравилаКорректировкиКодов
Функция ПравилаКорректировкиКодовСУчетомВыручки()
	
	Правила = НовыйПравилаКорректировкиКодов();
	
	ДанныеКлассификатора = ДанныеКлассификатораСИерархией();
	Действие = ДействияПравила();
	
	// 0-3 - здесь означает коды, которые начинаются с цифр 0, 1, 2, 3, то есть это виды деятельности из разделов А, В, С, D, E,
	// которые в большинстве связаны с производством продукции и оказанием услуг. Если оранизация занимается исключительно продажей
	//товаров, то кодов из этих разделов в подсказке быть не должно, даже если сервис посчитал их подходящими исходя
	// из наименования.
	ДобавитьПравило(ДанныеКлассификатора, Правила, "0-3", Действие.Удалить, "Товар,Перепродажа");
	
	// Торговля
	// Мясо
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.1", Действие.Дополнить, ОптоваяТорговля(), "46.32,46.39");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.1,46.32", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.22"));
	// Рыба (+ мука и крупы для оптовой торговли)
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.2,10.61", Действие.Дополнить, ОптоваяТорговля(), "46.38,46.39");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.2", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.23"));
	// Фрукты, овощи
	ДобавитьПравило(ДанныеКлассификатора, Правила, "01.21-01.26,10.31,10.39", Действие.Дополнить, ОптоваяТорговля(), "46.31,46.39");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "01.21-01.26,10.31,10.39,46.31", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.21"));
	// Напитки
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.32,11.07", Действие.Дополнить, ОптоваяТорговля(), "46.34.1,46.39");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.32,11.07,46.34.1", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.25.2"));
	// Масло и жиры
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.4", Действие.Дополнить, ОптоваяТорговля(), "46.33.3,46.39");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.4", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.29.2"));
	// Молочная продукция
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.51", Действие.Дополнить, ОптоваяТорговля(), "46.33.1,46.39");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.51,46.33", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.29"));
	// Мороженое
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.52", Действие.Дополнить, ОптоваяТорговля(), "46.38.26,46.39");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.52", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.24.3"));
	// Мука и крупы (оптовая торговля совпадает с пунктом "Рыба")
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.61", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.29.3"));
	// Хлебобулочные изделия, торты, пироженое
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.71,10.72", Действие.Дополнить, ОптоваяТорговля(), "46.36,46.39");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.71,10.72", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.24"));
	// Макароны
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.73", Действие.Дополнить, ОптоваяТорговля(), "46.38.23,46.39");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.73", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.29.31"));
	// Сахар
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.81", Действие.Дополнить, ОптоваяТорговля(), "46.36.1,46.39");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.81", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.29.33"));
	// Какао, шоколад
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.82", Действие.Дополнить, ОптоваяТорговля(), "46.36.2,46.39");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.82", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.24.22"));
	// Чай, кофе (+ приправы и пряности для опта)
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.83,10.84", Действие.Дополнить, ОптоваяТорговля(), "46.37,46.39");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.83", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.29.35"));
	// Приправа, пряности
	// Оптовая торговля - в группе "Чай, кофе"
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.84", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.29.3"));
	// Детское и диетическое питание
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.86", Действие.Дополнить, ОптоваяТорговля(), "46.38.21,46.39");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.86", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.29.36"));
	// Прочее
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.89", Действие.Дополнить, ОптоваяТорговля(), "46.38.29,46.39");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.89", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.29.39"));
	// Корм для продуктивных животных
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.91", Действие.Дополнить, ОптоваяТорговля(), "46.21.14");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.91", Действие.Дополнить, РозничнаяТорговля(), "47.78.9");
	// Корм для домашних животных
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.92", Действие.Дополнить, ОптоваяТорговля(), "46.38.22,46.39");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "10.92", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.76.2"));
	// Алкоголь
	ДобавитьПравило(ДанныеКлассификатора, Правила, "11.01-11.06", Действие.Дополнить, ОптоваяТорговля(), "46.34.2,46.39");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "11.01-11.06", Действие.Дополнить, РозничнаяТорговля(), "47.11,47.25.1");
	// Безалкогольные напитки
	ДобавитьПравило(ДанныеКлассификатора, Правила, "11.07", Действие.Дополнить, ОптоваяТорговля(), "46.34.1,46.39");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "11.07", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.25.2"));
	// Табак
	ДобавитьПравило(ДанныеКлассификатора, Правила, "12.00", Действие.Дополнить, ОптоваяТорговля(), "46.39.2");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "12.00", Действие.Дополнить, РозничнаяТорговля(), "47.11,47.19,47.26,47.81");
	// Текстильные волокна
	ДобавитьПравило(ДанныеКлассификатора, Правила, "13.10", Действие.Дополнить, ОптоваяТорговля(), "46.76.2,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "13.10", Действие.Дополнить, РозничнаяТорговля(), "47.51.1,47.82,47.91,47.99");
	// Текстильные ткани
	ДобавитьПравило(ДанныеКлассификатора, Правила, "13.2-13.3", Действие.Дополнить, ОптоваяТорговля(), "46.41,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "13.2-13.3", Действие.Дополнить, РозничнаяТорговля(), "47.51.1,47.82,47.91,47.99");

	// Производство одежды из кожи
	ДобавитьПравило(ДанныеКлассификатора, Правила, "14.11-14.13", Действие.Дополнить, ОптоваяТорговля(), "46.42.11,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "14.11", Действие.Дополнить, РозничнаяТорговля(), "47.71.4,47.82,47.91,47.99");

	// Производство спецодежды
	// Производство прочей верхней одежды (костюмы, пальто, куртки)
	ДобавитьПравило(ДанныеКлассификатора, Правила, "14.12-14.13", Действие.Дополнить, РозничнаяТорговля(), "47.71,47.82,47.91,47.99");

	// Производство нательного белья
	ДобавитьПравило(ДанныеКлассификатора, Правила, "14.14", Действие.Дополнить, ОптоваяТорговля(), "46.42.12,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "14.14", Действие.Дополнить, РозничнаяТорговля(), "47.71.2,47.82,47.91,47.99");

	// Производство прочей одежды и аксессуаров (детская, спортивная, головные уборы, перчатки и т.д.)
	// Примечание: группа включает как одежду, так и аксессуары, поэтому для опта указаны оба подходящих кода.
	ДобавитьПравило(ДанныеКлассификатора, Правила, "14.19", Действие.Дополнить, ОптоваяТорговля(), "46.42.11,46.42.14,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "14.19", Действие.Дополнить, РозничнаяТорговля(), "47.71,47.82,47.91,47.99");

	// Производство меховых изделий (одежда и аксессуары из меха)
	ДобавитьПравило(ДанныеКлассификатора, Правила, "14.20", Действие.Дополнить, ОптоваяТорговля(), "46.42.13,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "14.20", Действие.Дополнить, РозничнаяТорговля(), "47.71.3,47.82,47.91,47.99");

	// Производство чулочно-носочных изделий
	ДобавитьПравило(ДанныеКлассификатора, Правила, "14.31", Действие.Дополнить, ОптоваяТорговля(), "46.42.12,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "14.31", Действие.Дополнить, РозничнаяТорговля(), "47.71.6,47.82,47.91,47.99");

	// Производство прочих вязаных и трикотажных изделий (джемперы, пуловеры)
	ДобавитьПравило(ДанныеКлассификатора, Правила, "14.39", Действие.Дополнить, ОптоваяТорговля(), "46.42.11,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "14.39", Действие.Дополнить, РозничнаяТорговля(), "47.71.1,47.82,47.91,47.99");

	// Производство кожи и изделий из кожи (согласно примечаниям к 46.42)
	ДобавитьПравило(ДанныеКлассификатора, Правила, "15.1", Действие.Дополнить, ОптоваяТорговля(), "46.49,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "15.1", Действие.Дополнить, РозничнаяТорговля(), "47.72.2,47.82,47.91,47.99");

	// Производство обуви
	ДобавитьПравило(ДанныеКлассификатора, Правила, "15.20", Действие.Дополнить, ОптоваяТорговля(), "46.42.2,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "15.20", Действие.Дополнить, РозничнаяТорговля(), "47.72.1,47.91,47.99");
	
	// Распиловка и строгание древесины
	ДобавитьПравило(ДанныеКлассификатора, Правила, "16.10", Действие.Дополнить, ОптоваяТорговля(), "46.73,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "16.10", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.52.71"));

	// Производство изделий из дерева, пробки, соломки и материалов для плетения
	ДобавитьПравило(ДанныеКлассификатора, Правила, "16.21-16.22", Действие.Дополнить, ОптоваяТорговля(), "46.73,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "16.21-16.22", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.52"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "16.23-16.24", Действие.Дополнить, ОптоваяТорговля(), "46.49,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "16.23", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.52.74"));
	ДобавитьПравило(ДанныеКлассификатора, Правила, "16.24", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.78.9"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "16.29", Действие.Дополнить, ОптоваяТорговля(), "46.49.2,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "16.29", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.59.4"));

	// Производство целлюлозы и древесной массы
	ДобавитьПравило(ДанныеКлассификатора, Правила, "17.11", Действие.Дополнить, ОптоваяТорговля(), "46.76,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "17.11", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.78"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "17.12", Действие.Дополнить, ОптоваяТорговля(), "46.76.1,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "17.12", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.78"));
	
	// Для кода 17.21,17.29 точного соответствия нет ни в рознице, ни в опте.
	// Для кода 17.22 нет точного соответствия в рознице
	ДобавитьПравило(ДанныеКлассификатора, Правила, "17.22", Действие.Дополнить, ОптоваяТорговля(), "46.49,46.90");
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "17.23", Действие.Дополнить, ОптоваяТорговля(), "46.49.33,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "17.23", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.62.2"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "17.24", Действие.Дополнить, ОптоваяТорговля(), "46.73.7,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "17.24", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.53.3"));
	
	// Деятельность полиграфическая и предоставление услуг в этой области
	// Включает печать книг, газет, рекламной продукции и т.д.
	ДобавитьПравило(ДанныеКлассификатора, Правила, "18.11", Действие.Дополнить, ОптоваяТорговля(), "46.49.32,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "18.11", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.62.1"));

	ДобавитьПравило(ДанныеКлассификатора, Правила, "18.12-18.14", Действие.Дополнить, ОптоваяТорговля(), "46.49.3,46.90");
	
	// Для кода 18.20 точного соответствия нет.

	// Производство кокса
	ДобавитьПравило(ДанныеКлассификатора, Правила, "19.10", Действие.Дополнить, ОптоваяТорговля(), "46.71.1,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "19.10", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.78.61"));

	// Производство нефтепродуктов
	ДобавитьПравило(ДанныеКлассификатора, Правила, "19.20-19.34", Действие.Дополнить, ОптоваяТорговля(), "46.71,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "19.20-19.34", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.78.6"));

	// Производство химических веществ и продуктов
	ДобавитьПравило(ДанныеКлассификатора, Правила, "20.1", Действие.Дополнить, ОптоваяТорговля(), "46.75,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "20.15", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.76.1"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "20.4", Действие.Дополнить, ОптоваяТорговля(), "46.45,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "20.4,46.45", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.75"));

	// Производство фармацевтической продукции и материалов
	ДобавитьПравило(ДанныеКлассификатора, Правила, "21.10-21.20", Действие.Дополнить, ОптоваяТорговля(), "46.46,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "21.10-21.20,46.46", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.73"));

	// Производство резиновых и пластмассовых изделий
	// Код 22 содержит изделия широкого спектра, невозможно выполнить сопоставление.

	// Производство стекла и изделий из стекла
	ДобавитьПравило(ДанныеКлассификатора, Правила, "23.11-23.12", Действие.Дополнить, ОптоваяТорговля(), "46.73.5,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "23.11-23.12", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.52.3"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "23.14", Действие.Дополнить, ОптоваяТорговля(), "46.73.6,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "23.14", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.52"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "23.19", Действие.Дополнить, ОптоваяТорговля(), "46.44.1,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "23.19", Действие.Дополнить, РозничнаяТорговля(), "47.59.2,47.89,47.91,47.99");

	// Производство фарфоровых и керамических изделий (посуда, сантехника, украшения)
	ДобавитьПравило(ДанныеКлассификатора, Правила, "23.20", Действие.Дополнить, ОптоваяТорговля(), "46.73,46.49,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "23.20", Действие.Дополнить, РозничнаяТорговля(), "47.52.7,47.89,47.91,47.99");
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "23.31-23.32", Действие.Дополнить, ОптоваяТорговля(), "46.44.1,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "23.31-23.32", Действие.Дополнить, РозничнаяТорговля(), "47.52.7,47.89,47.91,47.99");
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "23.41,23.43-23.49", Действие.Дополнить, ОптоваяТорговля(), "46.44.1,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "23.42", Действие.Дополнить, ОптоваяТорговля(), "46.73,46.49,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "23.4", Действие.Дополнить, РозничнаяТорговля(), "47.59.2,47.89,47.91,47.99");
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "23.51-23.65", Действие.Дополнить, ОптоваяТорговля(), "46.73,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "23.51-23.65", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.52.7"));
	
	// Для кодов 23.69, 23.91, 23.99 нет однозначного сопоставления
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "24.10", Действие.Дополнить, ОптоваяТорговля(), "46.72,46.90");
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "24.20-24.34", Действие.Дополнить, ОптоваяТорговля(), "46.74,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "24.20", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.52"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "24.41", Действие.Дополнить, ОптоваяТорговля(), "46.72.23,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "24.41", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.77.29"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "24.42-24.45", Действие.Дополнить, ОптоваяТорговля(), "46.72.23,46.90");
	
	// Код 24.46 Производство ядерного топлива
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "24.51-24.54", Действие.Дополнить, ОптоваяТорговля(), "46.72,46.90");
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "25.11-25.12", Действие.Дополнить, ОптоваяТорговля(), "46.73.6,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "25.11-25.12", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.52.73"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "25.21", Действие.Дополнить, ОптоваяТорговля(), "46.74.2,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "25.21", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.52.5"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "25.29-25.30", Действие.Дополнить, ОптоваяТорговля(), "46.69.9,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "25.29", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.52.73,47.59.9"));
	ДобавитьПравило(ДанныеКлассификатора, Правила, "25.30", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.59.9"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "25.40", Действие.Дополнить, ОптоваяТорговля(), "46.69.6,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "25.40", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.78.7"));
	
	// Код 25.50 Ковка, прессование, штамповка и профилирование, изготовление изделий методом порошковой металлургии
	// Код 25.61 Обработка металлов и нанесение покрытий на металлы
	// Код 25.62 Обработка металлических изделий механическая
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "25.71", Действие.Дополнить, ОптоваяТорговля(), "46.49.1,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "25.71", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.59.2"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "25.72-25.73,25.93-25.94", Действие.Дополнить, ОптоваяТорговля(), "46.74.1,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "25.72-25.73,25.93-25.94", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.52.1"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "25.91", Действие.Дополнить, ОптоваяТорговля(), "46.49.49,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "25.91", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.59.9"));
	
	// Код 25.92 Производство тары из легких металлов
	// Код 25.99 Производство прочих готовых металлических изделий, не включенных в другие группировки
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "26.11-26.12", Действие.Дополнить, ОптоваяТорговля(), "46.52,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "26.11-26.12", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.59.9"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "26.20", Действие.Дополнить, ОптоваяТорговля(), "46.51.1,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "26.20", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.41"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "26.30", Действие.Дополнить, ОптоваяТорговля(), "46.52,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "26.30", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.59"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "26.40", Действие.Дополнить, ОптоваяТорговля(), "46.43,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "26.40", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.43"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "26.51", Действие.Дополнить, ОптоваяТорговля(), "46.69,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "26.51", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.59.9"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "26.52", Действие.Дополнить, ОптоваяТорговля(), "46.48.1,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "26.52", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.77.1"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "26.60", Действие.Дополнить, ОптоваяТорговля(), "46.69.8,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "26.60", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.74.1"));

	// Код 26.70 Производство оптических приборов, фото- и кинооборудования
	// Код 26.80 Производство незаписанных магнитных и оптических технических носителей информации
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "27.11-27.12", Действие.Дополнить, ОптоваяТорговля(), "46.69,46.90");
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "27.20-27.40", Действие.Дополнить, ОптоваяТорговля(), "46.69,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "27.20-27.40", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.78.9"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "27.51", Действие.Дополнить, ОптоваяТорговля(), "46.43,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "27.51", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.54"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "27.52", Действие.Дополнить, ОптоваяТорговля(), "46.49.5,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "27.52", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.59.6"));
	
	// Код 27.90 Производство прочего электрического оборудования
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "28.1,28.21-28.22", Действие.Дополнить, ОптоваяТорговля(), "46.69,46.90");
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "28.23", Действие.Дополнить, ОптоваяТорговля(), "46.66,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "28.23,46.66", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.41.4"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "28.24", Действие.Дополнить, ОптоваяТорговля(), "46.74.3,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "28.24", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.59.9"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "28.25-28.29", Действие.Дополнить, ОптоваяТорговля(), "46.69.9,46.90");
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "28.30", Действие.Дополнить, ОптоваяТорговля(), "46.61,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "28.30", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.52.6"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "28.41", Действие.Дополнить, ОптоваяТорговля(), "46.62.2,46.90");
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "28.49", Действие.Дополнить, ОптоваяТорговля(), "46.62,46.90");
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "28.91", Действие.Дополнить, ОптоваяТорговля(), "46.69,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "28.92", Действие.Дополнить, ОптоваяТорговля(), "46.63,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "28.93", Действие.Дополнить, ОптоваяТорговля(), "46.69.4,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "28.94", Действие.Дополнить, ОптоваяТорговля(), "46.64,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "28.95-28.99", Действие.Дополнить, ОптоваяТорговля(), "46.69.9,46.90");
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "29.10", Действие.Дополнить, ОптоваяТорговля(), "45.11,45.19");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "29.10", Действие.Дополнить, РозничнаяТорговля(), "45.11,45.19");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "29.20", Действие.Дополнить, ОптоваяТорговля(), "45.19");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "29.20", Действие.Дополнить, РозничнаяТорговля(), "45.19");
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "29.31,29.32", Действие.Дополнить, ОптоваяТорговля(), "45.31");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "29.31,29.32", Действие.Дополнить, РозничнаяТорговля(), "45.32");
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "30.1-30.4", Действие.Дополнить, ОптоваяТорговля(), "46.69.1,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "30.91", Действие.Дополнить, ОптоваяТорговля(), "46.69.1,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "30.91", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("45.40.3"));
	
	// Код 30.92 Производство велосипедов и инвалидных колясок
	// Код 30.99 Производство прочих транспортных средств и оборудования, не включенных в другие группировки
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "31.01", Действие.Дополнить, ОптоваяТорговля(), "46.65,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "31.02-31.09", Действие.Дополнить, ОптоваяТорговля(), "46.47.1,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "31,46.65", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.59.1"));
		
	// Код 32.11 Чеканка монет
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "32.12", Действие.Дополнить, ОптоваяТорговля(), "46.48.2,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "32.12", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.77.2"));
	
	// Код 32.13 Производство бижутерии и подобных товаров
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "32.20", Действие.Дополнить, ОптоваяТорговля(), "46.49.41,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "32.20", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.59.5"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "32.30", Действие.Дополнить, ОптоваяТорговля(), "46.49.43,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "32.30", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.64.1"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "32.40", Действие.Дополнить, ОптоваяТорговля(), "46.49.42,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "32.40", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.65"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "32.50", Действие.Дополнить, ОптоваяТорговля(), "46.69.8,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "32.50", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.74.1"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "45.32", Действие.Дополнить, ОптоваяТорговля(), "45.31,46.90");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "45.31", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("45.32"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "46.21,46.22", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.76.1"));
	ДобавитьПравило(ДанныеКлассификатора, Правила, "46.23", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.76.2"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "46.34", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.25"));
	ДобавитьПравило(ДанныеКлассификатора, Правила, "46.35", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.26"));
	ДобавитьПравило(ДанныеКлассификатора, Правила, "46.37", Действие.Дополнить, РозничнаяТорговля(), КодыРозницыПродукты("47.29.3"));
	ДобавитьПравило(ДанныеКлассификатора, Правила, "46.39", Действие.Дополнить, РозничнаяТорговля(), "47.11");
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "46.41", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.51"));
	ДобавитьПравило(ДанныеКлассификатора, Правила, "46.48", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.77"));
	
	ДобавитьПравило(ДанныеКлассификатора, Правила, "46.51", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.41"));
	ДобавитьПравило(ДанныеКлассификатора, Правила, "46.52", Действие.Дополнить, РозничнаяТорговля(), КодыРозницаПрочее("47.41"));

	ДобавитьПравило(ДанныеКлассификатора, Правила, "46", Действие.Удалить, "Товар,Розница;Товар,Производство");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "47", Действие.Удалить, "Товар,Опт;Товар,Производство");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "01-46,47.1-47.8,47.99,48-96", Действие.Удалить, "Товар,ПерепродажаМаркетплейс");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "01-46,47.1-47.8,47.99,48-96", Действие.Дополнить, "Товар,ПерепродажаМаркетплейс", "47.91");
	ДобавитьПравило(ДанныеКлассификатора, Правила, "84", Действие.Удалить);
	ДобавитьПравило(ДанныеКлассификатора, Правила, "97-99", Действие.Удалить);
		
	Правила.Индексы.Добавить("Код");
	
	Возврат Правила;
	
КонецФункции

Функция КодыРозницаПрочее(ОсновныеКоды = "")
	КодыРозницы = "47.19,47.89,47.91,47.99";
	
	Если ЗначениеЗаполнено(ОсновныеКоды) Тогда
 		КодыРозницы = СтрШаблон("%1,%2", ОсновныеКоды, КодыРозницы);
 	КонецЕсли;
	
	Возврат КодыРозницы;
	
КонецФункции

Функция КодыРозницыПродукты(ОсновныеКоды = "")
	
	КодыРозницы = "47.11,47.19,47.81,47.91,47.99";
	
	Если ЗначениеЗаполнено(ОсновныеКоды) Тогда
 		КодыРозницы = СтрШаблон("%1,%2", ОсновныеКоды, КодыРозницы);
 	КонецЕсли;
	
	Возврат КодыРозницы;
	
КонецФункции

Функция РозничнаяТорговля()
	Возврат "Товар,Перепродажа,Розница";
КонецФункции

Функция ОптоваяТорговля()
	Возврат "Товар,Перепродажа,Опт";
КонецФункции

// Добавляет в таблицу ПравилаКорректировкиКодов группу правил на основании значения, указанного в параметре Код.
// В этом параметре могут быть указаны:
// - Набор кодов, перечисленных через запятую. В качестве кода могут быть указаны не только коды групп, например, "47.54" (именно в разрезе
// групп представлен классификатор сервиса), но и более общие группировки классификатора - например, подклассы, классы или даже первые
// цифры кодов классификатора. В этом случае соответствующее правило будет добавлено для всех кодов, входящих в иерархию этого кода.
// Например, если указать код "47.5", то будут добавлены правила для кодов "47.51", "47.52", "47.54", "47.59".
// - Диапазон кодов, в котором начало и конец диапазона разделены дефисом. При составлении диапазона следует учесть, что
// коды, описывающие начало и конец диапазона должны быть сопоставимы, то есть должны иметь одинаковую длину строки.
// Если при составлении дипазона не получается выполнить это правило, следует разбить такой один диапазон не несколько более мелких.
// Например, вместо "47.3-47.63" следует указать два диапазона, разделенных запятой: "47.3-47.5,47.61-47.63".
// - Различные комбинации и сочетания единичных кодов и диапазонов, перечисленных через запятую.
// 
// Параметры:
//  ДанныеКлассификатора - см. ДанныеКлассификатораСИерархией
//  ПравилаКорректировкиКодов - см. НовыйПравилаКорректировкиКодов
//  Код - Строка
//  Действие - Строка - см. ДействияПравила
//  ПризнакВыручки - Строка - описано в НовыйПравилаКорректировкиКодов.ПризнакВыручки
//  ДобавляемыеКоды - Строка - описано в НовыйПравилаКорректировкиКодов.ДобавляемыеКоды
Процедура ДобавитьПравило(ДанныеКлассификатора, ПравилаКорректировкиКодов, Код, Действие, ПризнакВыручки = "", ДобавляемыеКоды = "")
	
	КодБезТочек = СтрЗаменить(Код, ".", "");

	Для Каждого ГруппаКодов Из СтрРазделить(КодБезТочек, ",") Цикл

		ДиапазонКодов = СтрРазделить(ГруппаКодов, "-");

		НачалоДиапазона = ДиапазонКодов[0];
		КонецДиапазона = ДиапазонКодов[ДиапазонКодов.ВГраница()]; // Может совпадать с началом

		Для КодПравила = Число(НачалоДиапазона) По Число(КонецДиапазона) Цикл
			ДлинаКода = СтрДлина(НачалоДиапазона);
			КодПравилаСтрокой = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(XMLСтрока(КодПравила), ДлинаКода);
			Поиск = Новый Структура;
			Поиск.Вставить(СтрШаблон("ЧастьКода%1", XMLСтрока(ДлинаКода)), КодПравилаСтрокой);
			СтрокиКлассификатораВИерархии = ДанныеКлассификатора.НайтиСтроки(Поиск);

			Для Каждого СтрокаКлассификатора Из СтрокиКлассификатораВИерархии Цикл
				Правило = ПравилаКорректировкиКодов.Добавить();
				Правило.Код = СтрокаКлассификатора.Код;
				Правило.Действие = Действие;
				Правило.ПризнакВыручки = ПризнакВыручки;
				Правило.ДобавляемыеКоды = ДобавляемыеКоды;
			КонецЦикла;
			
		КонецЦикла;

	КонецЦикла;
	
КонецПроцедуры

Процедура ПрименитьПравилаДляКодаСервиса(ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом, КодСервиса, Правила, Выручка, ДействияПравила)
	
	Код = КодСервиса.КодОКВЭД;
	
	Если ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом.Найти(Код, "Код") <> Неопределено Тогда
		Возврат;
	КонецЕсли;

	НоваяСтрока = ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом.Добавить();
	НоваяСтрока.Код = Код;
	НоваяСтрока.Приоритет = КодСервиса.Вероятность;
	
	ПоискПравилаПоКоду = Новый Структура("Код", Код);
	СтрокиПравила = Правила.НайтиСтроки(ПоискПравилаПоКоду);
	
	Для Каждого СтрокаПравила Из СтрокиПравила Цикл
		
		ВыполняетсяУсловиеПравила = ВыполняетсяУсловиеПравила(
			СтрокаПравила.ПризнакВыручки,
			Выручка, 
			СтрокаПравила.Действие = ДействияПравила.Дополнить);

		Если Не ВыполняетсяУсловиеПравила Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаПравила.Действие = ДействияПравила.Дополнить Тогда
			
			Для Каждого Дополнение Из СтрРазделить(СтрокаПравила.ДобавляемыеКоды, ",") Цикл
				СтрокиДополнения = ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом.Добавить();
				СтрокиДополнения.Код = Дополнение;
				СтрокиДополнения.Приоритет = КодСервиса.Вероятность;
			КонецЦикла;
			
		ИначеЕсли СтрокаПравила.Действие = ДействияПравила.Удалить Тогда
			// Добавленной строке устанавливаем признак удаления.
			// Так, чтобы если в других правилах строка с таким же кодом будет добавлена,
			// он не попал в итоговый результат.
			НоваяСтрока.Удалить = Истина;
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет, соответствует ли набор данных о выручке заданному правилу.
// Правило определяется набором признаков и типом (добавление/исключение).
// Для правил добавления достаточно одного совпадения, для исключения - все строки должны подходить.
//
// Параметры:
//  ПризнакВыручки - Строка - Признак для фильтрации. Если не задан, условие выполнено.
//  Выручка - Массив из СтрокаТаблицыЗначений - Набор данных для проверки.
//  ЭтоПравилоДобавления - Булево - Истина для правила добавления, Ложь - для исключения.
//
// Возвращаемое значение:
//  Булево - Истина, если условие выполняется, иначе Ложь.
Функция ВыполняетсяУсловиеПравила(ПризнакВыручки, Выручка, ЭтоПравилоДобавления = Истина)

	// Если признак выручки не задан, считаем, что правило всегда выполняется.
	Если Не ЗначениеЗаполнено(ПризнакВыручки) Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Получаем все возможные наборы признаков для проверки в виде массива структур.
	НаборыИменПризнаков = ИменаПризнаковВыручки(ПризнакВыручки);
	
	ПравилоВыполненоДляВсехСтрок = Истина;
	Для Каждого СтрокаВыручки Из Выручка Цикл
		
		ПравилоВыполняетсяДляТекущейСтроки = Ложь;
		Для Каждого ПризнакиВыручки Из НаборыИменПризнаков Цикл
			
			// Если на одном из шагов переменная ПравилоВыполняетсяДляТекущейСтроки = Истина, вторая часть выражения не вычисляется.
			// Ветку с прерыванием цикла для правил удаления не делаем, чтобы не запутывать код.
			ПравилоВыполняетсяДляТекущейСтроки =
				ПравилоВыполняетсяДляТекущейСтроки Или ВыручкаСоответствуетПризнаку(ПризнакиВыручки, СтрокаВыручки);
			
			// Для правил добавления достаточно совпадения одного из набора признаков (например, "Товар,Розница") хотя бы по одной из строк
			// выручки.
			Если ПравилоВыполняетсяДляТекущейСтроки И ЭтоПравилоДобавления Тогда
				Возврат Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		ПравилоВыполненоДляВсехСтрок = ПравилоВыполненоДляВсехСтрок И ПравилоВыполняетсяДляТекущейСтроки;

	КонецЦикла;
	
	Возврат ПравилоВыполненоДляВсехСтрок;
	
КонецФункции

Функция ВыручкаСоответствуетПризнаку(ПризнакиВыручки, СтрокаВыручки)
	
	ЗаполнитьЗначенияСвойств(ПризнакиВыручки, СтрокаВыручки);
	ЗначенияПризнаков = ОбщегоНазначенияБПКлиентСервер.ЗначенияКоллекции(ПризнакиВыручки, Истина);
	
	Возврат ЗначенияПризнаков.Количество() = 1 И ЗначенияПризнаков[0] = Истина;

КонецФункции

#КонецОбласти

Функция ИменаПризнаковВыручки(ПризнакиВыручки)
	
	ИменаПризнаковВыручки = Новый Массив;
	Если Не ЗначениеЗаполнено(ПризнакиВыручки) Тогда
		Возврат ИменаПризнаковВыручки;
	КонецЕсли;
	
	НаборыИмен =  СтрРазделить(ПризнакиВыручки, ";");
	
	Для Каждого НаборИмен Из НаборыИмен Цикл
		ИменаПризнаковВыручки.Добавить(Новый Структура(НаборИмен));
	КонецЦикла;
	
	Возврат ИменаПризнаковВыручки;
	
КонецФункции

Функция ИменаКолонокТаблицы(СтруктураВыручкиПоПолямГруппировки)

	КолонкиСтруктурыВыручки = Новый Массив;
	Для Каждого Колонка Из СтруктураВыручкиПоПолямГруппировки.Колонки Цикл
		КолонкиСтруктурыВыручки.Добавить(Колонка.Имя);
	КонецЦикла;
	Возврат КолонкиСтруктурыВыручки
КонецФункции

Функция ПоляГруппировкиВыручки(СписокПолей)

	ПоляГруппировкиВыручки = СписокПолей.ВыгрузитьЗначения();
	
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ПоляГруппировкиВыручки, "ОКВЭД");
	
	ПоляГруппировкиВыручки.Добавить("Номенклатура");
	
	Возврат ПоляГруппировкиВыручки;
	
КонецФункции

Функция СписокИменДляСопоставления(СтруктураВыручки, ПоляГруппировок, КодыПодобранныеСервисомРанее)
	
	СписокИменДляСопоставления = Новый Соответствие;
	
	// Значения в некоторых разрезах могут иметь наименования, которые плохо соотносятся с классификатором.
	// Например, предполагаем, что таким разрезом должен быть ВидНоменклатуры: предполагается, что у него
	// максимально обобщенное название - Товары, Услуги, Материалы и тому подобное.
	ПоляНеПоказыватьПодсказку = ПодсказкаКодовОКВЭДКлиентСервер.ПоляНеПоказыватьПодсказку();
	
	Для Каждого ПолеСопоставления Из ПоляГруппировок Цикл
		
		Если ПоляНеПоказыватьПодсказку.Найти(ПолеСопоставления) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ЗначенияПолейДляСопоставления = СтруктураВыручки.ВыгрузитьКолонку(ПолеСопоставления);
		ЗначенияПолейДляСопоставления = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ЗначенияПолейДляСопоставления);
		
		ЗаполнитьСписокИменПоЗначениям(
			СписокИменДляСопоставления,
			ПолеСопоставления,
			ЗначенияПолейДляСопоставления,
			КодыПодобранныеСервисомРанее);

	КонецЦикла;
			
	Возврат СписокИменДляСопоставления;
	
КонецФункции

Процедура ЗаполнитьСписокИменПоЗначениям(СписокИменДляСопоставления, ПолеСопоставления, ЗначенияПолейДляСопоставления, КодыПодобранныеСервисомРанее)
	
	Если ПолеСопоставления = "Номенклатура" Тогда
			
		// Для поля "Номенклатура" особый поиск, потому что в первую очередь для сопоставления используем реквизит "НаименованиеПолное"
		// и только если он не заполнен, используем "Наименование". У других полей реквизита "НаименованиеПолное" нет.
		ЗаполнитьПоискНоменклатура(СписокИменДляСопоставления, ЗначенияПолейДляСопоставления, КодыПодобранныеСервисомРанее);
	Иначе
		ЗаполнитьПоискПрочиеПоля(СписокИменДляСопоставления, ЗначенияПолейДляСопоставления, КодыПодобранныеСервисомРанее);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоискПрочиеПоля(СписокИменДляСопоставления, ЗначенияПолейДляСопоставления, КодыПодобранныеСервисомРанее)
	
	ЗначенияДляКлассификации = Новый Массив;
	Для Каждого ЗначениеПоля Из ЗначенияПолейДляСопоставления Цикл
		Если Не ЗначениеЗаполнено(ЗначениеПоля) Тогда
			Продолжить;
		КонецЕсли;
		Если КодыПодобранныеСервисомРанее[ЗначениеПоля] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗначенияДляКлассификации.Добавить(ЗначениеПоля);
	КонецЦикла;
	
	ИменаДляКлассификации = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ЗначенияДляКлассификации, "Наименование");

	Для Каждого ИмяДляКлассификации Из ИменаДляКлассификации Цикл

		Если Не ЗначениеЗаполнено(ИмяДляКлассификации.Значение) Тогда
			Продолжить;
		КонецЕсли;

		ОбщегоНазначенияБПКлиентСервер.ДополнитьРазделенныйМассив(
			СписокИменДляСопоставления,
			ИмяДляКлассификации.Значение,
			ИмяДляКлассификации.Ключ);

	КонецЦикла;

КонецПроцедуры
	
Процедура ЗаполнитьПоискНоменклатура(СписокИменДляСопоставления, ЗначенияПолейДляСопоставления, КодыПодобранныеСервисомРанее)
	
	ЗначенияДляКлассификации = Новый Массив;
	Для Каждого ЗначениеПоля Из ЗначенияПолейДляСопоставления Цикл
		Если Не ЗначениеЗаполнено(ЗначениеПоля) Тогда
			Продолжить;
		КонецЕсли;
		Если КодыПодобранныеСервисомРанее[ЗначениеПоля] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗначенияДляКлассификации.Добавить(ЗначениеПоля);
	КонецЦикла;
	
	ИменаДляКлассификации = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
		ЗначенияДляКлассификации,
		"Наименование, НаименованиеПолное");
		
	Для Каждого НаименованияНоменклатуры Из ИменаДляКлассификации Цикл
		
		Наименование = НаименованияНоменклатуры.Значение.Наименование;
		НаименованиеПолное = НаименованияНоменклатуры.Значение.НаименованиеПолное;
		
		ИмяДляПоиска = "";
		Если ЗначениеЗаполнено(НаименованиеПолное) Тогда
			ИмяДляПоиска = НаименованиеПолное;
		ИначеЕсли ЗначениеЗаполнено(Наименование) Тогда
			ИмяДляПоиска = Наименование;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ИмяДляПоиска) Тогда
			Продолжить;
		КонецЕсли;
		
		ОбщегоНазначенияБПКлиентСервер.ДополнитьРазделенныйМассив(
			СписокИменДляСопоставления,
			ИмяДляПоиска,
			НаименованияНоменклатуры.Ключ);
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСоставВыручки(СоставВыручки, СтруктураВыручки, ЗначениеПолейТекущейГруппировки, ИменаТекущихПолей, КолонкиПоказателиСтруктурыВыручки)

	ПоискСтруктурыВыручки = Новый Структура(ИменаТекущихПолей);
	ЗаполнитьЗначенияСвойств(ПоискСтруктурыВыручки, ЗначениеПолейТекущейГруппировки);
	
	КолонкиПоказателейВыручкиСтрокой = СтрСоединить(КолонкиПоказателиСтруктурыВыручки, ",");
	СтруктураВыручкиПоЗначению = СтруктураВыручки.Скопировать(
		ПоискСтруктурыВыручки,
		КолонкиПоказателейВыручкиСтрокой);
	СтруктураВыручкиПоЗначению.Свернуть(КолонкиПоказателейВыручкиСтрокой);
	
	Для Каждого СтрокаСтруктурыВыручки Из СтруктураВыручкиПоЗначению Цикл
		ЗаписьСоставаВыручки = СоставВыручки.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьСоставаВыручки, СтрокаСтруктурыВыручки);
	КонецЦикла;
	
	СоставВыручки.Свернуть(КолонкиПоказателейВыручкиСтрокой);
	
КонецПроцедуры

Процедура ОпределитьВыбранныеКоды(СоставВыбранныхКодов, ДанныеСопоставленнойНоменклатуры, ЗначениеПолейТекущейГруппировки, ИменаТекущихПолей)
	
	ПоискВыбранныхКодов = Новый Структура(ИменаТекущихПолей);
	ЗаполнитьЗначенияСвойств(ПоискВыбранныхКодов, ЗначениеПолейТекущейГруппировки);
	ВыбранныеКоды = ДанныеСопоставленнойНоменклатуры.НайтиСтроки(ПоискВыбранныхКодов);
	
	Для Каждого ВыбранныйКод Из ВыбранныеКоды Цикл
		
		КодПриведенныйКДлинеКодаСервиса = Лев(ВыбранныйКод.ОКВЭДКод, МаксимальнаяДлинаКодаСервиса());
		
		Если СоставВыбранныхКодов.Найти(КодПриведенныйКДлинеКодаСервиса) = Неопределено Тогда
			СоставВыбранныхКодов.Добавить(КодПриведенныйКДлинеКодаСервиса);
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

Процедура ОпределитьДобавленныеУдаленныеКоды(КонтекстВыбранногоКода, СоставОбратнойСвязи, Правила, КодыСервисаСВероятностями)
	
	ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом = НовыйДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом();
	
	ПрименитьПравила(
		ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом,
		КодыСервисаСВероятностями,
		Правила,
		КонтекстВыбранногоКода.СоставВыручки);

	УдаляемыеКоды = Новый Массив;
	ОстающиесяКоды = Новый Массив;

	Для Каждого КодПоПравилам Из ДействияПравилСУчетомВыручкиДляКодовПодобранныхСервисом Цикл

		Код = Лев(КодПоПравилам.Код, 5);

		Если КодПоПравилам.Удалить Тогда

			УдаляемыеКоды.Добавить(Код);

		Иначе

			ОстающиесяКоды.Добавить(Код);

		КонецЕсли;

	КонецЦикла;

	КонтекстВыбранногоКода.УдаленныеКоды = ОбщегоНазначенияКлиентСервер.СвернутьМассив(УдаляемыеКоды);

	ОстающиесяКоды = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ОстающиесяКоды, УдаляемыеКоды);
	
	КонтекстВыбранногоКода.ДобавленныеКоды = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ОстающиесяКоды, СоставОбратнойСвязи.КодыСервиса);
	КонтекстВыбранногоКода.ДобавленныеКоды = ОбщегоНазначенияКлиентСервер.СвернутьМассив(КонтекстВыбранногоКода.ДобавленныеКоды);
	
КонецПроцедуры


#КонецОбласти