#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.НастройкиКадровогоУчета.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	Если НЕ МенеджерЗаписи.Выбран() Или МенеджерЗаписи.ИспользоватьРаботуНаНеполнуюСтавку <> Значение Тогда
		МенеджерЗаписи.ИспользоватьРаботуНаНеполнуюСтавку = Значение;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
