
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Бюджет = Параметры.Бюджет;
	ЗаполнитьСписокКорректировок();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВсеКорректировки

&НаКлиенте
Процедура ВсеКорректировкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбраннаяКорректировка = Элемент.ТекущиеДанные.Значение;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Бюджет", Бюджет);
	ПараметрыФормы.Вставить("ДокументСсылка", ВыбраннаяКорректировка);

	ОткрытьФорму("Обработка.КорректировкаБюджета.Форма", ПараметрыФормы, , Ложь);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокКорректировок()
	
	Для Каждого Корректировка Из Документы.КорректировкаБюджета.ВсеКорректировки(Бюджет) Цикл
		ВсеКорректировки.Добавить(Корректировка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


