#Область ПрограммныйИнтерфейс

Функция ИмяФормыДокумента(ДокументСсылка) Экспорт
	Возврат СтрШаблон("Документ.%1.ФормаОбъекта", ДокументСсылка.Метаданные().Имя);
КонецФункции

Функция ИспользоватьПодключаемоеОборудование() Экспорт
	Возврат МенеджерОборудованияБП.ИспользоватьПодключаемоеОборудование();
КонецФункции

Функция ОборудованиеТребуетОрганизацию(ТипОборудования) Экспорт
	Возврат МенеджерОборудованияБП.ЭтоКассовоеОборудование(ТипОборудования, Истина)
		ИЛИ ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал;
КонецФункции 

Функция ЭтоОблачнаяКасса(ИдентификаторОборудования) Экспорт
	ДанныеУстройства = МенеджерОборудования.ДанныеУстройства(ИдентификаторОборудования);
	ТипОборудования = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеУстройства, "ТипОборудования");
	
	Возврат ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ОблачнаяККТ;
КонецФункции

Функция СистемнаяУчетнаяЗапись() Экспорт
	Возврат РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
КонецФункции

Функция ИспользуетсяОборудование(ТипыПО) Экспорт
	Возврат МенеджерОборудованияБП.ИспользуетсяОборудование(ТипыПО);
КонецФункции    

Функция ТребуетсяОбновлениеДрайвера(ИдентификаторОборудования) Экспорт
	Возврат МенеджерОборудованияБП.ТребуетсяОбновлениеДрайвера(ИдентификаторОборудования);
КонецФункции      

Функция ДоступнаИнтерактивнаяЗагрузкаВнешнихКомпонент() Экспорт
	Возврат ПолучениеВнешнихКомпонент.ДоступнаИнтерактивнаяЗагрузкаВнешнихКомпонент();
КонецФункции 

Функция ПараметрыККТ(ИдентификаторУстройства) Экспорт
	ПараметрыПодключаемогоОборудования = МенеджерОборудованияБП.ПараметрыПодключаемогоОборудования(ИдентификаторУстройства);
	
	ПараметрыККТ = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыРегистрацииККТ();
	ПараметрыККТ.Вставить("ТипОборудования", ПараметрыПодключаемогоОборудования.ТипОборудования);
	// Версия ФФД облачной кассы нам неизвестна - принимаем ее за 1.2
	ПараметрыККТ.Вставить("ВерсияФФДККТ", "1.2.0.0");
	ПараметрыККТ.Вставить("ВерсияФФДФН", "1.2.0.0");
	
	СтруктураОрганизация = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ПараметрыПодключаемогоОборудования.Организация);
	ПараметрыККТ.Вставить("ОрганизацияНаименование", СтруктураОрганизация.НаименованиеДляПечатныхФорм);
	ПараметрыККТ.Вставить("ОрганизацияИНН", СтруктураОрганизация.ИНН);
	
	Возврат ПараметрыККТ;
КонецФункции

Функция ПараметрыРегистрацииУстройства(Идентификатор) Экспорт
	Возврат ОборудованиеЧекопечатающиеУстройства.ПараметрыРегистрацииУстройства(Идентификатор);
КонецФункции


#КонецОбласти 

