
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Организация") Тогда
		ОтборОрганизация = Параметры.Отбор.Организация;
		ЭлементОтбораОрганизация = ОтборыСписковКлиентСервер.ЭлементОтбораСпискаПоИмени(Список, "Организация");
		Если ЭлементОтбораОрганизация <> Неопределено Тогда
			ЭлементОтбораОрганизация.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("ПодразделениеОрганизации") Тогда
		ОтборПодразделение = Параметры.Отбор.ПодразделениеОрганизации;
		ЭлементОтбораПодразделение = ОтборыСписковКлиентСервер.ЭлементОтбораСпискаПоИмени(Список, "ПодразделениеОрганизации");
		Если ЭлементОтбораПодразделение <> Неопределено Тогда
			ОтборПодразделение.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВладелецФормы <> Неопределено
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВладелецФормы, "Объект")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВладелецФормы.Объект, "Ссылка")
		И ТипЗнч(ВладелецФормы.Объект.Ссылка) = Тип("СправочникСсылка.ПодразделенияОрганизаций")
		И НЕ ВладелецФормы.Объект.ОбособленноеПодразделение Тогда
		ТолькоПросмотр = Истина;
		ПоказатьПредупреждение(, НСтр("ru = 'Лимит остатка кассы устанавливается только для обособленных подразделений'"));
	КонецЕсли;
	
КонецПроцедуры