#Область СлужебныйПрограммныйИнтерфейс

Функция ИнтеграцияНастроена(НастройкаИнтеграции) Экспорт
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьОстаткиТоваров(НастройкиИнтеграцииМаркетплейс, Отбор, Отказ) Экспорт
	
	Отказ = Истина;
	
КонецФункции

Функция СписокТоваровМаркетплейс(НастройкаИнтеграции, СообщениеОбОшибке, Отказ) Экспорт
	
	Отказ = Истина;
	СообщениеОбОшибке = НСтр("ru = 'Получение списка товаров для Мегамаркета не поддерживается.'");
	
КонецФункции

Функция СписокСкладов(НастройкаИнтеграции, Отказ) Экспорт
	
	Отказ = Истина;
	
КонецФункции

Функция ПодготовитьФайлОстатков(НастройкаИнтеграции, ТаблицаОстатки) Экспорт
	
	СтруктураФайла = Новый Структура;
	СтруктураФайла.Вставить("ИмяФайла", "undefined.xlsx");
	СтруктураФайла.Вставить("Страницы", Новый Соответствие);
	
	Возврат СтруктураФайла;
	
КонецФункции

Процедура ПередатьОстаткиТоваров(НастройкаИнтеграции, ТаблицаТовары, СообщениеОбОшибке, Отказ, КодОтветаСервера = 0) Экспорт
	
	Отказ = Истина;
	СообщениеОбОшибке = НСтр("ru = 'Передача остатков не поддерживается для Мегамаркета'");
	
КонецПроцедуры

Функция ПолучитьДанныеДокумента(ПараметрыОтчета, КодОтветаСервера, СообщениеОбОшибке) Экспорт
	
	СообщениеОбОшибке = НСтр("ru = 'Получение отчетов Мегамаркета через API не поддерживается.'");
	
КонецФункции

Функция ПериодыАвтозагрузки(Интеграция, ПериодыАвтозагрузки) Экспорт
	
	Возврат Новый Массив;
	
КонецФункции

Функция ПодготовитьОтложенноеСопоставлениеНоменклатуры(Контрагент, НезаполненнаяНоменклатура) Экспорт
	
	Возврат Новый Массив;

КонецФункции

Функция НастройкиСопоставленияНоменклатуры(ВидДокумента) Экспорт
КонецФункции

#КонецОбласти