#Область ОписаниеПеременных

&НаКлиенте
Перем ОткрытыеФормы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоПросмотрСчетПокупателю = ПравоДоступа("Просмотр", Метаданные.Документы.СчетНаОплатуПокупателю);
	ЕстьПравоПросмотрРеализацияТоваровУслуг = ПравоДоступа("Просмотр", Метаданные.Документы.РеализацияТоваровУслуг);
	ЕстьПравоПросмотрСчетФактураВыданный = ПравоДоступа("Просмотр", Метаданные.Документы.СчетФактураВыданный);
	ЕстьПравоПросмотрКорректировкаРеализации = ПравоДоступа("Просмотр", Метаданные.Документы.КорректировкаРеализации);
	ЕстьПравоПросмотрРеализацияОтгруженныхТоваров = ПравоДоступа("Просмотр", Метаданные.Документы.РеализацияОтгруженныхТоваров);
	ЕстьПравоПросмотрВозвратТоваровОтПокупателя =
		ПравоДоступа("Просмотр", Метаданные.Документы.ВозвратТоваровОтПокупателя);
	ЕстьПравоПросмотрРозничныеПродажи = ПравоДоступа("Просмотр", Метаданные.ЖурналыДокументов.РозничныеПродажи);
	ЕстьПравоИспользованиеОжидаемаяОплатаОтПокупателей =
		ПравоДоступа("Использование", Метаданные.Обработки.ОжидаемаяОплатаОтПокупателей); 
	ЕстьПравоПросмотрКоммерческоеПредложение = ПравоДоступа("Просмотр", Метаданные.Документы.КоммерческоеПредложение);
	ЕстьПравоПросмотрАктОРасхожденияхПолученный = ПравоДоступа("Просмотр",
		Метаданные.Документы.АктОРасхожденияхПолученный);
	ЕстьПравоИспользованиеОказаниеУслуг = ПравоДоступа("Просмотр", Метаданные.Документы.ОказаниеУслуг);
	ЕстьПравоПросмотрОтчетКомиссионераОПродажах = ПравоДоступа("Просмотр",
		Метаданные.Документы.ОтчетКомиссионераОПродажах);
	ЕстьПравоПросмотрЗаявлениеОВвозеТоваровПолученное = ПравоДоступа("Просмотр",
		Метаданные.Документы.ЗаявлениеОВвозеТоваровПолученное);
	ЕстьПравоПросмотрТаможеннаяДекларацияЭкспорт = ПравоДоступа("Просмотр",
		Метаданные.Документы.ТаможеннаяДекларацияЭкспорт);
	
	Элементы.СчетаПокупателям.Видимость = ЕстьПравоПросмотрСчетПокупателю;
	Элементы.Реализация.Видимость = ЕстьПравоПросмотрРеализацияТоваровУслуг;
	Элементы.СчетаФактурыВыданные.Видимость = ЕстьПравоПросмотрСчетФактураВыданный;
	Элементы.КорректировкаРеализации.Видимость = ЕстьПравоПросмотрКорректировкаРеализации;
	Элементы.РеализацияОтгруженныхТоваров.Видимость = ЕстьПравоПросмотрРеализацияОтгруженныхТоваров;
	Элементы.ВозвратыОтПокупателей.Видимость = ЕстьПравоПросмотрВозвратТоваровОтПокупателя;
	Элементы.РозничныеПродажи.Видимость = ЕстьПравоПросмотрРозничныеПродажи;
	Элементы.ВсеНеоплаченныеСчета.Видимость = ЕстьПравоИспользованиеОжидаемаяОплатаОтПокупателей;
	Элементы.ГруппаКонтроль.Видимость = Параметры.ЭтоКонтрагенты;
	Элементы.КоммерческиеПредложения.Видимость = ЕстьПравоПросмотрКоммерческоеПредложение;
	Элементы.АктыОРасхожденияхПолученные.Видимость = ЕстьПравоПросмотрАктОРасхожденияхПолученный;
	
	Элементы.ОказаниеУслуг.Видимость = ЕстьПравоИспользованиеОказаниеУслуг;
	Элементы.ОтчетыКомиссионераОПродажах.Видимость = ЕстьПравоПросмотрОтчетКомиссионераОПродажах;
	Элементы.ЗаявлениеОВвозеТоваровПолученное.Видимость = ЕстьПравоПросмотрЗаявлениеОВвозеТоваровПолученное
		И Параметры.ЭтоТовары;
	Элементы.ТаможеннаяДекларацияЭкспорт.Видимость = ЕстьПравоПросмотрТаможеннаяДекларацияЭкспорт
		И Параметры.ЭтоТовары;
	
	МобильныйКлиентАдаптацияФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СчетаПокупателям(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.СчетНаОплатуПокупателю.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Реализация(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.РеализацияТоваровУслуг.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаФактурыВыданные(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.СчетФактураВыданный.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаРеализации(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.КорректировкаРеализации.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацияОтгруженныхТоваров(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.РеализацияОтгруженныхТоваров.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратыОтПокупателей(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ВозвратТоваровОтПокупателя.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура РозничныеПродажи(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("ЖурналДокументов.РозничныеПродажи.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеНеоплаченныеСчета(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Обработка.ОжидаемаяОплатаОтПокупателей.Форма",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КоммерческиеПредложения(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.КоммерческоеПредложение.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура АктыОРасхожденияхПолученные(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.АктОРасхожденияхПолученный.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявлениеОВвозеТоваровПолученное(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ЗаявлениеОВвозеТоваровПолученное.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
		
КонецПроцедуры

&НаКлиенте
Процедура ТаможеннаяДекларацияЭкспорт(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ТаможеннаяДекларацияЭкспорт.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
		
КонецПроцедуры

&НаКлиенте
Процедура ОказаниеУслуг(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ОказаниеУслуг.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
		
КонецПроцедуры

&НаКлиенте
Процедура ОтчетыКомиссионераОПродажах(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ОтчетКомиссионераОПродажах.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
		
КонецПроцедуры

&НаКлиенте
Процедура ОригиналыПервичныхДокументовПокупатели(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимОтображенияДокументов", "Покупатели");
		
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("ЖурналДокументов.ЖурналОпераций.Форма.ФормаУчетаОригиналовПервичныхДокументов",
		ЭтотОбъект, ПараметрыФормы, , ОткрытыеФормы);
		
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаДокументыПокупателю,
		"КоммерческиеПредложения,СчетаПокупателям,Реализация,СчетаФактурыВыданные,ВозвратыОтПокупателей,"
		+ "РеализацияОтгруженныхТоваров,ОказаниеУслуг,РозничныеПродажи");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаКонтроль,
		"ВсеНеоплаченныеСчета,ОригиналыПервичныхДокументовПокупатели");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаВнешняяТорговля);
	
КонецПроцедуры

#КонецОбласти
