#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокСвойств = "Номенклатура, Количество, ЕдиницаИзмерения, Цена, Валюта,
		|ЕстьКоличество, ЕстьЦена";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, СписокСвойств);
	
	Если НЕ ЕстьКоличество И НЕ ЕстьЦена Тогда
		Отказ = Истина;
	КонецЕсли;
	
	СвойстваНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "Наименование, ЕдиницаИзмерения");
	
	Заголовок = СвойстваНоменклатуры.Наименование;
	Если НЕ ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		ЕдиницаИзмерения = СвойстваНоменклатуры.ЕдиницаИзмерения;
	КонецЕсли;
	
	Элементы.Количество.Видимость       = ЕстьКоличество;
	Элементы.ЕдиницаИзмерения.Видимость = ЕстьКоличество;	
	
	
	ИспользуютсяУпаковки 						= ?(Параметры.Свойство("ИспользуютсяУпаковки"), Параметры.ИспользуютсяУпаковки, Ложь);
	Элементы.ГруппаКоличествоУпаковка.Видимость = ИспользуютсяУпаковки; 
	Элементы.ГруппаКоличество.Видимость 		= Не ИспользуютсяУпаковки;
	КоличествоУпаковок 							= Количество;
	Упаковка 									= УпаковкиВызовСервера.ЕдиницаПоУмолчанию(Номенклатура, УпаковкаЕдиницаИзмерения);
	КоэффициентУпаковки							= УпаковкиВызовСервера.КоэффициентУпаковки(Упаковка);
	Элементы.КоличествоУпаковок.Видимость 		= ЕстьКоличество;
	Элементы.УпаковкаЕдиницаИзмерения.Видимость = ЕстьКоличество;
	Элементы.ГруппаЦена.Видимость 				= Не ИспользуютсяУпаковки;
	Элементы.ГруппаЦенаЗаУпаковку.Видимость 	= ИспользуютсяУпаковки;
	ЦенаЗаУпаковку 								= Окр(Цена * КоэффициентУпаковки, 2);
	

	Элементы.Цена.Видимость         = ЕстьЦена;
	Элементы.ВалютаЦены.Видимость   = ЕстьЦена;
	Элементы.Сумма.Видимость        = ЕстьЦена;
	Элементы.ВалютаСуммы.Видимость  = ЕстьЦена;
	
	Сумма = Цена * Количество;
	
	МобильныйКлиентАдаптацияФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если НЕ ЕстьКоличество Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Количество");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	Сумма = Цена * Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура УпаковкаЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокЕдиниц = УпаковкиВызовСервера.ПолучитьСписокЕдиницИзмеренияУпаковок(Номенклатура);
	
	ЕдиницаПоУмолчанию 	=  УпаковкиВызовСервера.ЕдиницаПоУмолчанию(Номенклатура);
	ТекущаяЕдиница 		= ?(ЗначениеЗаполнено(Упаковка), Упаковка, ЕдиницаПоУмолчанию);
	НачальноеЗначение 	= СписокЕдиниц.НайтиПоЗначению(ТекущаяЕдиница);

	Оповещение = Новый ОписаниеОповещения("ПослеВыбораУпаковкиЕдиницыИзмерения", ЭтаФорма);
	ПоказатьВыборИзСписка(Оповещение, СписокЕдиниц, Элемент, НачальноеЗначение); 

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораУпаковкиЕдиницыИзмерения(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Упаковка 					= ВыбранноеЗначение.Значение;
	УпаковкаЕдиницаИзмерения 	= НаименованиеЕдиницы(Упаковка);
	КоэффициентУпаковки 		= УпаковкиВызовСервера.КоэффициентУпаковки(Упаковка);
	КоличествоУпаковок 			= Окр(Количество / КоэффициентУпаковки, 3);
	ЦенаЗаУпаковку 				= Окр(Цена * КоэффициентУпаковки, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоУпаковокПриИзменении(Элемент)
	
	Количество = Окр(КоличествоУпаковок * КоэффициентУпаковки, 3);
	КоличествоПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	
	Сумма = Цена * Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаЗаУпаковкуПриИзменении(Элемент)
	
	Цена = Окр(ЦенаЗаУпаковку / КоэффициентУпаковки, 2); 
	ЦенаПриИзменении(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Отказ = НЕ ПроверитьЗаполнение();
	
	Если НЕ Отказ Тогда
		Если ИспользуютсяУпаковки Тогда
			ПараметрЗакрытия = Новый Структура("Номенклатура, Количество, КоличествоУпаковок, Упаковка, КоэффициентУпаковки, Цена, ЦенаЗаУпаковку, Валюта");
		Иначе
			ПараметрЗакрытия = Новый Структура("Номенклатура, Количество, Цена, Валюта");
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ПараметрЗакрытия, ЭтотОбъект);
		Закрыть(ПараметрЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	МобильныйКлиентБПФормаОбъекта.АдаптироватьМККоманднаяПанель(ЭтотОбъект);
	
	МобильныйКлиентБПФормаОбъекта.ПеренестиКомандыВМККомандыФормы(Элементы, Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы);
	
КонецПроцедуры

#КонецОбласти

#Область Упаковки

&НаСервере
Функция НаименованиеЕдиницы(ЕдиницаИзмерения)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдиницаИзмерения, "Наименование");
	
КонецФункции

#КонецОбласти


