////////////////////////////////////////////////////////////////////////////////
// ОбменСБанкамиОповещенияОСобытиях: механизм обмена электронными документами с банками.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Устарела, следует использовать ОбменСБанкамиСлужебныйКлиентСервер.ИмяОповещенияОНовыхПисьмах.
// см. ОбменСБанкамиСлужебныйКлиентСервер.ИмяОповещенияОНовыхПисьмах.
//
Функция ИмяОповещенияОНовыхПисьмах() Экспорт
	Возврат ОбменСБанкамиСлужебныйКлиентСервер.ИмяОповещенияОНовыхПисьмах();
КонецФункции

// Устарела, следует использовать ОбменСБанкамиСлужебныйКлиентСервер.ИмяОповещенияОНепрочитанныхПисьмах.
// см. ОбменСБанкамиСлужебныйКлиентСервер.ИмяОповещенияОНепрочитанныхПисьмах.
//
Функция ИмяОповещенияОНепрочитанныхПисьмах() Экспорт
	Возврат ОбменСБанкамиСлужебныйКлиентСервер.ИмяОповещенияОНепрочитанныхПисьмах();
КонецФункции

// Устарела, следует использовать ОбменСБанкамиСлужебныйКлиентСервер.ИмяОповещенияОНеотправленныхПисьмах.
// см. ОбменСБанкамиСлужебныйКлиентСервер.ИмяОповещенияОНеотправленныхПисьмах.
//
Функция ИмяОповещенияОНеотправленныхПисьмах() Экспорт
	Возврат ОбменСБанкамиСлужебныйКлиентСервер.ИмяОповещенияОНеотправленныхПисьмах();
КонецФункции

#КонецОбласти