#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("УстановитьЗначениеПоУмолчанию");
	
КонецПроцедуры

// Возвращает значение константы в привилегированном режиме.
//
// Возвращаемое значение:
//  Булево - значение константы.
//
Функция ПолучитьЗначение() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ОтображатьДополнительнуюИнформациюВСпискеИмущество.Получить();
	
КонецФункции

#Область ОбработчикиОбновления

// Устанавливает значение по умолчанию при обновлении и начальном заполнении ИБ
//
Процедура УстановитьЗначениеПоУмолчанию() Экспорт
	
	КонстантаОбъект = Константы.ОтображатьДополнительнуюИнформациюВСпискеИмущество.СоздатьМенеджерЗначения();
	КонстантаОбъект.Значение = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(КонстантаОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли