#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// БП исправление ошибки 60016885. Исключение записей с ошибочным типом Строка
Процедура ПередЗаписью(Отказ, Замещение)
	
	ЗаписиУдалить = Новый Массив;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если ТипЗнч(Запись.Предмет) = Тип("Строка") Тогда
			ЗаписиУдалить.Добавить(Запись);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЗаписьКУдалению Из ЗаписиУдалить Цикл
		Удалить(ЗаписьКУдалению);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли