#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "ПростойИнтерфейсТоварыПродажи");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЭтоТовары", Истина);
	
	ОткрытьФорму(
		"Обработка.ПанелиПростойИнтерфейс.Форма.ПанельПродажи",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти
