#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает класс профессионального риска, соответствующий ставке взноса.
//
// Параметры:
//  Ставка - Число
//  Дата - Дата
// 
// Возвращаемое значение:
//  Число
//
Функция КлассПрофессиональногоРиска(Ставка, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ставка", Ставка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлассПрофРискаИСтавкаВзноса.КлассПрофессиональногоРиска КАК КлассПрофессиональногоРиска
	|ИЗ
	|	РегистрСведений.КлассПрофессиональногоРискаИСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.СрезПоследних(&Дата, ) КАК КлассПрофРискаИСтавкаВзноса
	|ГДЕ
	|	КлассПрофРискаИСтавкаВзноса.Ставка = &Ставка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	КлассПрофессиональногоРиска = Неопределено;
	Если Выборка.Следующий() Тогда
		КлассПрофессиональногоРиска = Выборка.КлассПрофессиональногоРиска;
	КонецЕсли;
	
	Возврат КлассПрофессиональногоРиска;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Начальное заполнение и обновление информационной базы.
Процедура ЗаполнитьПоставляемыеДанные() Экспорт
	Обновить(ПолучитьМакет("ПредопределенныеЗначения").ПолучитьТекст());
КонецПроцедуры

// Обновляет данные регистра.
//
// Параметры:
//  ТекстXML - Строка
//
Процедура Обновить(ТекстXML) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	ЗагружаемыеСведения = ОбщегоНазначения.ЗначениеИзСтрокиXML(ТекстXML);
	НаборЗаписей.Загрузить(ЗагружаемыеСведения.Данные);
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли