#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ЗаполнитьПриОбновлении");
	
КонецПроцедуры

Процедура ЗаполнитьПриОбновлении() Экспорт
	
	МенеджерЗначения = Константы.АдресСервисаСтатусСамозанятого.СоздатьМенеджерЗначения();
	МенеджерЗначения.Значение = ЗначениеПоУмолчанию();
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерЗначения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗначениеПоУмолчанию()
	
	Возврат "https://status-npd.1cmycloud.com/applications/status-npd/api";
	
КонецФункции

#КонецОбласти

#КонецЕсли
