////////////////////////////////////////////////////////////////////////////////
// ЕдиныйНалоговыйСчетИнтеграцияПереопределяемый
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ПослеЗагрузкиДанныхЛичногоКабинета(Параметры) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияВнутреннийБП.ЗарегистрироватьОперацииЕНС(Параметры);
	ЕдиныйНалоговыйСчетИнтеграцияВнутреннийБП.ЗарегистрироватьУплатуНалоговИВзносов(Параметры);
	
КонецПроцедуры

Процедура ПослеРегистрацииОрганизацииВСервисе(Параметры) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияВнутреннийБП.УстановитьУчетПоДаннымФНСПослеРегистрацииВСервисе(Параметры);
	
КонецПроцедуры

Функция ИмяНастройкиБольшеНеПоказыватьБаннерПредупреждение(Параметры) Экспорт
	
	Возврат ЕдиныйНалоговыйСчетИнтеграцияВнутреннийБП.ИмяНастройкиБольшеНеПоказыватьБаннерПредупреждение(Параметры);
	
КонецФункции

#КонецОбласти
