#Область СлужебныеПроцедурыИФункции

// Идентификаторы гиперссылок, расположенных в поле HTML-документа на форме выбора ОКВЭД.
// 
// Возвращаемое значение:
//  Структура - Идентификаторы гиперссылок:
// * ПереходПоСсылке - Строка
// * ВозвратПоСсылке - Строка
// * ИзменитьИзбранное - Строка
Функция ИдентификаторыГиперссылок() Экспорт
	
	ИдентификаторыГиперссылок = Новый Структура;
	
	ИдентификаторыГиперссылок.Вставить("ПереходПоСсылке", "Код_");
	ИдентификаторыГиперссылок.Вставить("ВозвратПоСсылке", "Возврат_");
	ИдентификаторыГиперссылок.Вставить("ИзменитьИзбранное", "ИзменитьИзбранное_");

	Возврат ИдентификаторыГиперссылок;
	
КонецФункции

#КонецОбласти