
#Область СлужебныйПрограммныйИнтерфейс

Функция ЭтоФормаБанковскогоСчета(ИмяФормы) Экспорт
	Возврат СтрНайти(ИмяФормы, "БанковскиеСчета") > 0;
КонецФункции

Функция ЭтоФормаСИнформационнойПанелью(ИмяФормы) Экспорт
	Возврат СтрНайти(ИмяФормы, "ПлатежноеПоручение") > 0 Или СтрНайти(ИмяФормы, "БанковскиеВыписки") > 0;
КонецФункции

Функция ЭтоФормаФинансыОрганизации(ИмяФормы) Экспорт
	Возврат СтрНайти(ИмяФормы, "ФинансыОрганизации") > 0;
КонецФункции

Функция МаксимальноеКоличествоБаннеров(ИмяФормы, ВысотаЭкрана = Неопределено, ВебКлиент = Неопределено) Экспорт
	
	Если ФинУслугиКлиентСервер.ЭтоФормаСИнформационнойПанелью(ИмяФормы) Тогда  
		Если ВысотаЭкрана = Неопределено Или ВысотаЭкрана < 900 Тогда
    		Возврат 0;
		ИначеЕсли ВысотаЭкрана < 1080 Тогда
    		Возврат 1;
		ИначеЕсли ВебКлиент <> Неопределено И ВебКлиент И ФинУслугиВызовСервера.ДоступенОбменДепозитами() Тогда
			Возврат 1;
		Иначе
			Возврат 2;
        КонецЕсли;
    ИначеЕсли ФинУслугиКлиентСервер.ЭтоФормаБанковскогоСчета(ИмяФормы) Тогда
		Возврат 1;
	Иначе
		Возврат 4;
	КонецЕсли;
	
КонецФункции

Функция СостоянияПлатежныхПоручений() Экспорт
	
	МассивСостояний = Новый Массив;
	МассивСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияБанковскихДокументов.Подготовлено"));
	МассивСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияБанковскихДокументов.Согласовано"));
	
	Возврат МассивСостояний;
	
КонецФункции

Процедура УстановитьВидимостьДанныхПлатежи(Форма, Видимость, ОпцияПлатежи) Экспорт
	
	УстановитьВидимостьЭлемента(Форма.Элементы, "ГруппаДлительнаяОперация", Не Видимость);
	УстановитьВидимостьЭлемента(Форма.Элементы, "ГруппаПлатежи", Видимость);
		
	Если ОпцияПлатежи <> Неопределено Тогда
		ВидимостьНачниПланировать = Не ОпцияПлатежи.ОтПокупателей Или Не ОпцияПлатежи.Поставщикам;
		УстановитьВидимостьЭлемента(Форма.Элементы, "ГруппаПлатежиНачниПланировать", ВидимостьНачниПланировать);
		УстановитьВидимостьЭлемента(Форма.Элементы, "ТекстОпцияПоставщики", Не ОпцияПлатежи.Поставщикам);
		УстановитьВидимостьЭлемента(Форма.Элементы, "ТекстОпцияПокупатели", Не ОпцияПлатежи.ОтПокупателей);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьВидимостьЭлемента(Элементы, Раздел, Видимость, РазрешениеЭкрана = "") Экспорт
	
	ИмяЭлемента = СтрШаблон("%1%2", Раздел, РазрешениеЭкрана); 
	Если Элементы[ИмяЭлемента].Видимость <> Видимость Тогда
		Элементы[ИмяЭлемента].Видимость = Видимость;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьВидимостьФинУслуги(Форма, ЕстьПредложенияБанков) Экспорт
	
	Элементы = Форма.Элементы;
	Элементы.ГруппаВиджеты.Видимость = ЕстьПредложенияБанков; 
	Если ФинУслугиКлиентСервер.ЭтоФормаБанковскогоСчета(Форма.ИмяФормы) Тогда 
    	Элементы.ГруппаСервисыБанка.Видимость = ЕстьПредложенияБанков;  
		Возврат;
	КонецЕсли; 
	
	УстановитьВысотуЭлементовИнфоПанели(Форма);
	
КонецПроцедуры

Процедура УстановитьВидимостьПоРазделу(Форма, Раздел, Видимость, ПостфиксРаздела = "", Индекс = "", Вариант = "") Экспорт
	
	ИмяЭлемента = СтрШаблон("%1%2%3%4%5", Раздел, ПостфиксРаздела, Вариант, Индекс, Форма.РазрешениеЭкрана);
	Форма.Элементы[ИмяЭлемента].Видимость = Видимость;
		
КонецПроцедуры

Функция НомерСтрокиПоПозиции(Позиция, ТекущаяПозиция) Экспорт
	
	СтрокПредыдущихРазделов = ТекущаяПозиция - 1; 
	НомерСтроки = Позиция - СтрокПредыдущихРазделов;
	
	Возврат НомерСтроки;
	
КонецФункции

Процедура ДополнитьТаблицуСтатистики(ТаблицаСтатистики, ПредложениеБанка, Показы, Переходы, ИмяФормы) Экспорт 
	
	НаименованиеФормы = СтрЗаменить(ИмяФормы, ".Форма.ФормаЭлемента", "");
	НаименованиеФормы = СтрЗаменить(НаименованиеФормы, ".Форма.ФормаСписка", "");
	НаименованиеФормы = СтрЗаменить(НаименованиеФормы, "ЖурналДокументов.Деньги.Форма.", "");
    НаименованиеФормы = СтрЗаменить(НаименованиеФормы, ".Форма", "");

	СтрокаСтатистики = ТаблицаСтатистики.Добавить(); 
	СтрокаСтатистики.Банк = ПредложениеБанка.НаименованиеБанка;
	СтрокаСтатистики.ИДРекламы = ПредложениеБанка.ИдентификаторРекламы;
	СтрокаСтатистики.ИДУслуги = ПредложениеБанка.ИдентификаторУслуги;
	СтрокаСтатистики.Показы = Показы;
	СтрокаСтатистики.Переходы = Переходы;
	СтрокаСтатистики.ИмяФормы = НаименованиеФормы;
	
КонецПроцедуры

Процедура УстановитьВысотуЭлементовИнфоПанели(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	Если Не ФинУслугиВызовСервера.ДоступенОбменДепозитами() Тогда
		Элементы["ГруппаПлатежиИРасчеты"].Высота = 16;
	КонецЕсли;
	
	ВысотаБаннераИнфоПанели = ?(Элементы.Баннер.Видимость, 6, 7);
	Если ЭтоВебКлиент() Тогда
		ВысотаБаннераИнфоПанели = ВысотаБаннераИнфоПанели - 1;	  
	КонецЕсли;
	
	Для СчетчикБаннеров = 1 По Форма.КоличествоБаннеров Цикл
		ИмяЭлемента = СтрШаблон("Баннер%1",СчетчикБаннеров);
		Элементы[ИмяЭлемента].Высота = ВысотаБаннераИнфоПанели;
	КонецЦикла;
	
КонецПроцедуры

Функция ДнейПланированияКалендаряДляИнфопанели(Знач ДатаАктуальности, ТекущаяДата) Экспорт
	
	ГоризонтПланирования = 1;
	ДатаАктуальности = НачалоДня(ДатаАктуальности);
	ТекущаяДата = НачалоДня(ТекущаяДата);
	
	Если ДатаАктуальности > ТекущаяДата Тогда
		РазницаВДнях = (ДатаАктуальности - ТекущаяДата) / (60 * 60 * 24);
		ГоризонтПланирования = ГоризонтПланирования + РазницаВДнях;
	КонецЕсли;
	
	Возврат ГоризонтПланирования;
	
КонецФункции

Функция ЭтоВебКлиент()

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Возврат ОбщегоНазначения.ЭтоВебКлиент();
#ИначеЕсли ВебКлиент Тогда
	Возврат Истина;
#Иначе
	Возврат Ложь;
#КонецЕсли

КонецФункции

#КонецОбласти
