#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием(ПараметрыВыполненияКоманды);
	ПараметрыОткрытия.Заголовок = НСтр("ru = 'Формирование уставного капитала'");
	ПараметрыОткрытия.ИмяФормы = "Документ.ФормированиеУставногоКапитала.ФормаСписка";

	ПараметрыФормы = Новый Структура;
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Справочник.Организации.Форма.ФормаОрганизации" Тогда
		Отбор = Новый Структура("Организация", ПараметрКоманды);
		ПараметрыФормы.Вставить("Отбор", Отбор);
	КонецЕсли;
	
	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыФормы);

КонецПроцедуры

#КонецОбласти