#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Значение Тогда
		Константы.ИспользоватьДокументыРеализации.Установить(Истина);
	КонецЕсли;
	
	Константы.ИспользоватьДокументыПоступления.Установить(Значение);
	
	ОбщегоНазначенияБП.УстановитьОпциюОтображатьКомандыГлавноеПродажиПокупки();
	
	// Обеспечение функциональности
	Если Не Значение Тогда
		Возврат;
	КонецЕсли;
	
	КлассификаторыДоходовРасходов.ОбеспечитьФункциональность(
		Справочники.ПрочиеДоходыИРасходы,
		"ВестиУчетРасчетовСКонтрагентами");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли