#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Предполагается постепенный переход с алгоритмов ПБУ 6 на алгоритмы ФСБУ 6.
//
// В ранее созданных базах пока применяются алгоритмы ПБУ 6, когда это возможно.
//
// По умолчанию - незаполненное значение, применяются алгоритмы ФСБУ 6.
//
// Пользователи, которые столкнулись с ограничениями алгоритмов ПБУ 6,
// могут перейти на алгоритмы ФСБУ 6 с любой подходящей даты.

#Область ПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ВключитьПБУ6");
	Методы.Вставить("ЗаписатьБизнесСтатистику");
	
КонецПроцедуры

#Область ОбработчикиОбновления

// Включает использование режима, оставленного для совместимости с предыдущими версиями.
//
Процедура ВключитьПБУ6() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		Установить('2030-01-01'); // Произвольно выбранная дата с достаточным запасом
		
	Исключение
		
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Константы.КонецПримененияАлгоритмовАмортизацииПБУ6,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
КонецПроцедуры

// Собирает при обновлении программы статистику о ходе постепенного отказа от применения устаревших алгоритмов ПБУ 6.
//
// Параметры:
//  ПараметрыОтложенногоОбработчика - Структура - управляющая коллекция, см. документацию к подсистеме ОбновлениеИнформационнойБазы БСП.
//
Процедура ЗаписатьБизнесСтатистику(ПараметрыОтложенногоОбработчика) Экспорт
	
	ИмяОперации = СтрШаблон("СтатистикаБП.НастройкиУчета.КонецПримененияАлгоритмовАмортизацииПБУ6.%1", XMLСтрока(Год(Получить())));
	
	ОбщегоНазначенияБП.ЗаписатьОперациюБизнесСтатистики(ИмяОперации);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
