
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОписаниеФункциональности = Обработки.ФункциональностьПрограммы.ОписаниеФункциональности();
	Ограничения = Обработки.ФункциональностьПрограммы.ОграниченияФункциональностиПоТарифу(ОписаниеФункциональности);
	
	Для Каждого Функциональность Из ОписаниеФункциональности Цикл
		СтрокаФункциональности = ОтображаемаяФункциональность.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаФункциональности, Функциональность);
		НедоступнаяФункциональность = Ограничения.ФункциональностьНедоступнаяПоТарифу.Найти(Функциональность.Имя, "Имя");
		Если НедоступнаяФункциональность = Неопределено Тогда
			СтрокаФункциональности.Доступна = Истина;
		Иначе
			СтрокаФункциональности.Доступна = Ложь;
			СтрокаФункциональности.ТребуетсяУслуга = СтрСоединить(НедоступнаяФункциональность.ТребуютсяУслуги, Символы.ПС);
		КонецЕсли;
	КонецЦикла;
	
	ОтображаемаяФункциональность.Сортировать("Доступна Убыв, Заголовок");
	
	ОсновнаяФункциональность = ОтображаемаяФункциональность.Вставить(0);
	ОсновнаяФункциональность.Имя = "ОсновнаяФункциональность";
	ОсновнаяФункциональность.Заголовок = НСтр("ru='Основная функциональность'");
	ОсновнаяФункциональность.Подсказка = НСтр("ru='Базовая функциональность, доступная на любом тарифе, включает в себя учет денежных средств по кассе и банку, счета, акты и накладные для покупателей, налоговый учет'");
	ОсновнаяФункциональность.Доступна = Истина;
	
	Макет = Обработки.ФункциональностьПрограммы.ПолучитьМакет("Функциональность");
	АдресМакета = ПоместитьВоВременноеХранилище(Макет, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтобразитьОтчет();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтрокаПоискаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	// Обход платформенной ошибки - очищается строка поиска при возврате с сервера на клиент
	#Если Не ВебКлиент Тогда
	СтрокаПоиска = Текст;
	#КонецЕсли
	
	ОтобразитьОтчет(Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаОчистка(Элемент, СтандартнаяОбработка)
	
	СтрокаПоиска = "";
	ОтобразитьОтчет();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтобразитьОтчет(СтрокаПоиска = "")
	
	Макет = ПолучитьИзВременногоХранилища(АдресМакета);
	
	РежимОтладки = ТарификацияБП.РежимОтладки();
	
	ОтчетПоФункциональности = Новый ТабличныйДокумент;
	ШапкаФункциональность = Макет.ПолучитьОбласть("ШапкаФункциональность");
	ОтчетПоФункциональности.Вывести(ШапкаФункциональность);
	
	Если РежимОтладки Тогда
		ШапкаОтладка = Макет.ПолучитьОбласть("ШапкаОтладка");
		ОтчетПоФункциональности.Присоединить(ШапкаОтладка);
	КонецЕсли;
	
	Для Каждого СтрокаФункциональности Из ОтображаемаяФункциональность Цикл
		Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
			СтрокаПоиска = НРег(СтрокаПоиска);
			НайденоПоПоиску = Ложь;
			Если СтрНайти(НРег(СтрокаФункциональности.Заголовок), СтрокаПоиска) <> 0 Тогда
				НайденоПоПоиску = Истина;
			КонецЕсли;
			Если Не НайденоПоПоиску И СтрНайти(НРег(СтрокаФункциональности.Подсказка), СтрокаПоиска) <> 0 Тогда
				НайденоПоПоиску = Истина;
			КонецЕсли;
			Если Не НайденоПоПоиску Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаФункциональность");
		ОбластьСтрока.Параметры.НаименованиеФункциональности = ?(ЗначениеЗаполнено(СтрокаФункциональности.Заголовок),
			СтрокаФункциональности.Заголовок, СтрокаФункциональности.Имя);
		ОбластьСтрока.Параметры.Подсказка = СтрокаФункциональности.Подсказка;
		Если СтрокаФункциональности.Доступна Тогда
			ОбластьСтрока.Область(2, 4).Картинка = БиблиотекаКартинок.ВнешняяКомпонентаДоступна;
		КонецЕсли;
		Если СтрокаФункциональности.Имя = "ОсновнаяФункциональность" Тогда
			ОбластьНаименования = ОбластьСтрока.Область(2, 2);
			ИсходныйШрифт = ОбластьНаименования.Шрифт;
			ОбластьНаименования.Шрифт = Новый Шрифт(ИсходныйШрифт, , , Истина);
		КонецЕсли;
		ОтчетПоФункциональности.Вывести(ОбластьСтрока);
		
		Если РежимОтладки Тогда
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаОтладка");
			ОбластьСтрока.Параметры.ТребуетсяУслуга = СтрокаФункциональности.ТребуетсяУслуга;
			ОтчетПоФункциональности.Присоединить(ОбластьСтрока);
		КонецЕсли; 
		
	КонецЦикла;
	
	Результат.Очистить();
	Результат.Вывести(ОтчетПоФункциональности);
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Результат.АвтоМасштаб = Истина;
	Результат.ФиксацияСверху = 4;
	
КонецПроцедуры

#КонецОбласти
