#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Организация) Тогда
		Объект.Организация = Параметры.Организация;
	Иначе
		Объект.Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	КонецЕсли;
	ПредставлениеОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "НаименованиеСокращенное");
	
	ПодготовитьФормуНаСервере();
	УправлениеФормой(ЭтотОбъект);
	
	// Проверим рассылки запросов - при необходимости выведем баннер
	ТекущиеРассылки = НезавершенныеРассылки();
	НезавершенныеРассылки = Новый ФиксированныйМассив(ТекущиеРассылки);
	ГраницаАктуальностиСостоянияРассылки = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ПроверкаСостоянияРассылкиЗапросовНаСверкуВФоне = СостояниеРассылкиЗапросовНаСверкуВФоне(
		ТекущиеРассылки, ГраницаАктуальностиСостоянияРассылки, УникальныйИдентификатор);
		
	ОбщегоНазначенияБП.ЗаписатьОперациюБизнесСтатистики("СтатистикаБП.МониторСверкиСКонтрагентами.ОткрытМонитор");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗаполнятьСписокПриИзмененииНастроек Тогда
		ЗаполнитьДаннымиБухгалтерскогоУчетаНаКлиенте();
	КонецЕсли;
	
	// После загрузки настроек установим видимость элементов рассылки
	НастроитьЭлементыРежимаРассылки(ЭтотОбъект);
	
	Если ПроверкаСостоянияРассылкиЗапросовНаСверкуВФоне <> Неопределено Тогда
		ОжидатьЗавершенияПолученияСостоянияРассылкиЗапросовНаСверку(ПроверкаСостоянияРассылкиЗапросовНаСверкуВФоне);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Период
	// Для квартальной периодичности период уже установлен. В иных случаях устанавливаем здесь.
	Если Периодичность = Перечисления.Периодичность.Месяц Тогда
		ТекущаяДата = ОбщегоНазначения.ТекущаяДатаПользователя();
		// Смотрим прошлый месяц
		Объект.ДатаНачала = НачалоМесяца(ДобавитьМесяц(ТекущаяДата, -1));
		Объект.ДатаОкончания = КонецМесяца(Объект.ДатаНачала);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда
		ТекущаяДата = ОбщегоНазначения.ТекущаяДатаПользователя();
		// В декабре смотрим текущий год, а иначе - предшествующие 12 месяцев
		Если Месяц(ТекущаяДата) = 12 Тогда
			Объект.ДатаНачала = НачалоГода(ТекущаяДата);
			Объект.ДатаОкончания = КонецГода(ТекущаяДата);
		Иначе
			Объект.ДатаНачала = НачалоМесяца(ДобавитьМесяц(ТекущаяДата, -12));
			Объект.ДатаОкончания = КонецМесяца(ДобавитьМесяц(ТекущаяДата, -1));
		КонецЕсли;
	КонецЕсли;
	
	// Сортировка
	Если Не ЗначениеЗаполнено(Сортировка) Или Элементы.Сортировка.СписокВыбора.НайтиПоЗначению(Сортировка) = Неопределено Тогда
		Сортировка = Элементы.Сортировка.СписокВыбора[0].Значение;
	КонецЕсли;
	
	// Настройка рассылки
	// Если в пользовательскх настройках сохранена ссылка на удаленную настройку, то сбросим значение
	Если ЗначениеЗаполнено(НастройкаРассылки) И НастройкаРассылки.ПолучитьОбъект() = Неопределено Тогда
		НастройкаРассылки = Неопределено;
	КонецЕсли;

	// Кэшируем реквизиты настройки, чтобы далее использовать при обработке событий формы
	Если ЗначениеЗаполнено(НастройкаРассылки) Тогда
		
		СоставНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаРассылки, "Наименование, ПорядокСверки");
		
		ПорядокСверкиРасчетовСКонтрагентами = СоставНастройки.ПорядокСверки;
		Элементы.ЗапроситьСверки.Заголовок = СоставНастройки.Наименование;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_АктСверкиВзаиморасчетов" Тогда
		
		Контрагент = КонтрагентДляОбновленияПослеЗаписиАктаСверки(Источник);
		Если ЗначениеЗаполнено(Контрагент) Тогда
			ЗаполнитьДаннымиБухгалтерскогоУчетаНаКлиенте(, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Контрагент));
		КонецЕсли;
	
	ИначеЕсли ИмяСобытия = "Запись_СостояниеСверкиСКонтрагентами" Тогда
		// Обновляем комментарий
		Если Параметр.Организация = Объект.Организация Тогда
			СтрокиКонтрагента = СверкаСКонтрагентами.НайтиСтроки(Новый Структура("Контрагент", Параметр.Контрагент));
			Если СтрокиКонтрагента.Количество() > 0 Тогда
				СтрокиКонтрагента[0].Комментарий = Параметр.Комментарий;
			КонецЕсли;
		КонецЕсли;
	
	ИначеЕсли ИмяСобытия = "ВыполненаОтправкаПолучениеПисем" И Не РежимРассылки Тогда
		// Поищем ответы на запросы сверки по тем контрагентам, где нет ответа
		КонтрагентыОжидаютОтвета = Новый Массив;
		Для Каждого СтрокаСверки Из СверкаСКонтрагентами Цикл
			Если Не ЗначениеЗаполнено(СтрокаСверки.ЗапросСверкиДатаЗапроса)
				 Или ЗначениеЗаполнено(СтрокаСверки.ЗапросСверкиОтвет) Тогда
				Продолжить;
			КонецЕсли;
			КонтрагентыОжидаютОтвета.Добавить(СтрокаСверки.Контрагент);
		КонецЦикла;
		
		Если КонтрагентыОжидаютОтвета.Количество() > 0 Тогда
			ЗаполнитьДаннымиБухгалтерскогоУчетаНаКлиенте(, КонтрагентыОжидаютОтвета);
		КонецЕсли;
	
	ИначеЕсли ИмяСобытия = "Запись_Контрагенты" И РежимРассылки Тогда
		
		Если СверкаСКонтрагентами.НайтиСтроки(Новый Структура("Контрагент", Источник)).Количество() Тогда
			ПодготовитьРассылку(Параметр);
		КонецЕсли;
	
	ИначеЕсли ИмяСобытия = "Запись_КонтактныеЛица" И РежимРассылки Тогда
		
		Контрагент = Параметр.Контрагент;
		
		Если СверкаСКонтрагентами.НайтиСтроки(Новый Структура("Контрагент", Контрагент)).Количество() Тогда
			ПодготовитьРассылку(Контрагент);
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ПриИзмененииПериода();
	ПриИзмененииНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ПриИзмененииПериода();
	ПриИзмененииНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ПриИзмененииНастройки();
	ПриИзмененииОранизацииСервер();
КонецПроцедуры

&НаКлиенте
Процедура Баннер1ССверкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "СервисСверкиРасчетов" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("ОбщаяФорма.ИнтеграцияССервисомСверкиРасчетов");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаЗакрытьБаннерНажатие(Элемент)
	ЗакрытьБаннер1ССверка();
КонецПроцедуры

&НаКлиенте
Процедура СортировкаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Сортировка) Тогда
		Возврат;
	КонецЕсли;
	
	СверкаСКонтрагентами.Сортировать(Сортировка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикиПриИзменении(Элемент)
	ПриИзмененииНастройки();
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПокупателиПриИзменении(Элемент)
	ПриИзмененииНастройки();
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыСРасчетамиБезОстатковПриИзменении(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыСОстаткамиПрошлыхПериодовПриИзменении(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьСписокПриИзмененииНастроекПриИзменении(Элемент)
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура БаннерСостояниеРассылкиТекстОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьФормуСостоянияРассылкиСообщений" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Отбор = Новый Структура;
		Отбор.Вставить("ВидРассылки", ПредопределенноеЗначение("Перечисление.ВидыРассылокСообщений.ЗапросНаСверку"));
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Отбор);
 		// Отбор по рассылкам сообщений передаем отдельно от структуры Отбор для того, чтобы добавить в пользовательские
 		// настройки, а не в фиксированные
		ПараметрыФормы.Вставить("РассылкаСообщений", НезавершенныеРассылки);
		ОткрытьФорму("РегистрСведений.РассылкаСообщений.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КартинкаЗакрытьБаннерРассылкиНажатие(Элемент)
	
	Элементы.ГруппаБаннерСостояниеРассылки.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНетОтветаДнейПриИзменении(Элемент)
	
	ОтборЗапросНетОтвета = (ОтборНетОтветаДней > 0);
	ПриИзмененииНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаПодробнееПроЗапросНаСверкуНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура("Режим", "Рассылка");
	ОткрытьФорму("Обработка.МониторСверкиСКонтрагентами.Форма.Инструкция", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСверкаСКонтрагентами

&НаКлиенте
Процедура СверкаСКонтрагентамиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СверкаСКонтрагентами.ТекущиеДанные;
	СписокВыбора = Новый СписокЗначений;
	
	Если Поле.Имя = "Контрагент" Тогда
		
		ПоказатьЗначение(, ТекущиеДанные.Контрагент);
		
	ИначеЕсли Поле.Имя = "ДебиторскаяЗадолженность" Или Поле.Имя = "КредиторскаяЗадолженность" Тогда
		
		// Находим счета, по которым есть расчеты
		СчетаРасчетовКонтрагента = СчетаРасчетов.НайтиСтроки(Новый Структура("Контрагент", ТекущиеДанные.Контрагент));
		
		// Для каждого счета отдельная расшифровка через ОСВ
		Для Каждого СтрокаСчета Из СчетаРасчетовКонтрагента Цикл
			ДействиеРасшифровки = НовыйОписаниеДействияРасшифровки();
			ДействиеРасшифровки.Действие = "ОборотноСальдоваяВедомостьПоСчету";
			ДействиеРасшифровки.ПараметрыРасшифровки.Вставить("Контрагент", ТекущиеДанные.Контрагент);
			Если СтрокаСчета.СчетКоличество > 1 Тогда
				// Расчеты на нескольких субсчетах - расшифровываем счет верхнего уровня и детализируем до субсчетов
				ДействиеРасшифровки.ПараметрыРасшифровки.Вставить("Счет", СтрокаСчета.СчетВерхнегоУровня);
				ДействиеРасшифровки.ПараметрыРасшифровки.Вставить("ПоСубсчетам", Истина);
			Иначе
				// Расчеты на одном субсчете - открываем расшифровку именно по нему
				ДействиеРасшифровки.ПараметрыРасшифровки.Вставить("Счет", СтрокаСчета.Счет);
				ДействиеРасшифровки.ПараметрыРасшифровки.Вставить("ПоСубсчетам", Ложь);
			КонецЕсли;
			СписокВыбора.Добавить(
				ДействиеРасшифровки,
				СтрШаблон(НСтр("ru='ОСВ по счету %1'"), ДействиеРасшифровки.ПараметрыРасшифровки.Счет));
		КонецЦикла;
		
	ИначеЕсли Поле.Имя = "СостояниеСверки" Или Поле.Имя = "СтатусСверки" Тогда
		
		Если ТекущиеДанные.АктыСверкиКоличество = 1
			 И Не ТекущиеДанные.ТребуетсяАктСверки
			 И ЗначениеЗаполнено(ТекущиеДанные.АктСверки)
			 И Не (ТекущиеДанные.СервисСверкиИспользуется
			 И ТекущиеДанные.СервисСверкиДанныеАктуальны) Тогда
			
			// Открыть текущий акт сверки
			ДействиеРасшифровки = НовыйОписаниеДействияРасшифровки();
			ДействиеРасшифровки.Действие = "ОткрытьФорму";
			ДействиеРасшифровки.ПараметрыРасшифровки.Вставить("ИмяФормы", "Документ.АктСверкиВзаиморасчетов.ФормаОбъекта");
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.АктСверки);
			
			ДействиеРасшифровки.ПараметрыРасшифровки.Вставить("ПараметрыФормы", ПараметрыФормы);
			
			СписокВыбора.Добавить(ДействиеРасшифровки, НСтр("ru='Акт сверки'"));
			
		ИначеЕсли ТекущиеДанные.АктыСверкиКоличество > 0 Тогда
			// Показать расшифровку актов сверки за период
			ДействиеРасшифровки = НовыйОписаниеДействияРасшифровки();
			ДействиеРасшифровки.Действие = "ОткрытьФорму";
			ДействиеРасшифровки.ПараметрыРасшифровки.Вставить("ИмяФормы", "Обработка.МониторСверкиСКонтрагентами.Форма.Расшифровка");
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Организация",   Объект.Организация);
			ПараметрыФормы.Вставить("ДатаНачала",    Объект.ДатаНачала);
			ПараметрыФормы.Вставить("ДатаОкончания", Объект.ДатаОкончания);
			ПараметрыФормы.Вставить("Контрагент"   , ТекущиеДанные.Контрагент);
			ПараметрыФормы.Вставить("Поставщики"   , Поставщики);
			ПараметрыФормы.Вставить("Покупатели"   , Покупатели);
			ПараметрыФормы.Вставить("СчетаРасчетовСПоставщиками", СчетаРасчетовСПоставщиками);
			ПараметрыФормы.Вставить("СчетаРасчетовСПокупателями", СчетаРасчетовСПокупателями);
			ПараметрыФормы.Вставить("ИдентификаторРасшифровки", "РасшифровкаАктыСверки");
			
			ДействиеРасшифровки.ПараметрыРасшифровки.Вставить("ПараметрыФормы", ПараметрыФормы);
			
			СписокВыбора.Добавить(ДействиеРасшифровки, НСтр("ru='Подробное состояние сверки'"));
			
		ИначеЕсли ТекущиеДанные.СервисСверкиИспользуется И ТекущиеДанные.СервисСверкиДанныеАктуальны Тогда
			// Нет актов, но есть актуальные данные в сервисе сверки - открываем отчет по данным сервиса
			ДействиеРасшифровки = НовыйОписаниеДействияРасшифровки();
			ДействиеРасшифровки.Действие = "РасшифровкаСервисаСверки";
			ДействиеРасшифровки.ПараметрыРасшифровки.Вставить("Контрагент", ТекущиеДанные.Контрагент);
			
			СписокВыбора.Добавить(ДействиеРасшифровки, НСтр("ru='Отчет 1С:Сверка 2.0'"));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ЗапросСверкиОтвет)
			 И ТипЗнч(ТекущиеДанные.ЗапросСверкиОтвет) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
			// Открыть входящее письмо
			ДействиеРасшифровки = НовыйОписаниеДействияРасшифровки();
			ДействиеРасшифровки.Действие = "ОткрытьФорму";
			ДействиеРасшифровки.ПараметрыРасшифровки.Вставить(
				"ИмяФормы", "Документ.ЭлектронноеПисьмоВходящее.Форма.ФормаДокументаБП");
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.ЗапросСверкиОтвет);
			
			ДействиеРасшифровки.ПараметрыРасшифровки.Вставить("ПараметрыФормы", ПараметрыФормы);
			
			СписокВыбора.Добавить(ДействиеРасшифровки, НСтр("ru='Ответ контрагента'"));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ЗапросСверкиОтвет)
			 И ТипЗнч(ТекущиеДанные.ЗапросСверкиОтвет) = Тип("ДокументСсылка.ЭлектронныйДокументИсходящийЭДО") Тогда
			// Открыть документ ЭДО
			ДействиеРасшифровки = НовыйОписаниеДействияРасшифровки();
			ДействиеРасшифровки.Действие = "ОткрытьФорму";
			ДействиеРасшифровки.ПараметрыРасшифровки.Вставить(
				"ИмяФормы", "Документ.ЭлектронныйДокументИсходящийЭДО.ФормаОбъекта");
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.ЗапросСверкиОтвет);
			
			ДействиеРасшифровки.ПараметрыРасшифровки.Вставить("ПараметрыФормы", ПараметрыФормы);
			
			СписокВыбора.Добавить(ДействиеРасшифровки, НСтр("ru='Электронный документ'"));
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "КомментарийКартинка" Или Поле.Имя = "Комментарий" Тогда
		
		ВвестиКомментарийПоКонтрагенту();
		
	ИначеЕсли Поле.Имя = "НетОригиналов" Тогда
		
		ДействиеРасшифровки = НовыйОписаниеДействияРасшифровки();
		ДействиеРасшифровки.Действие = "ОткрытьФорму";
		ДействиеРасшифровки.ПараметрыРасшифровки.Вставить("ИмяФормы", "Обработка.МониторСверкиСКонтрагентами.Форма.Расшифровка");
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Организация", Объект.Организация);
		ПараметрыФормы.Вставить("ДатаНачала", Объект.ДатаНачала);
		ПараметрыФормы.Вставить("ДатаОкончания", Объект.ДатаОкончания);
		ПараметрыФормы.Вставить("Контрагент" , ТекущиеДанные.Контрагент);
		ПараметрыФормы.Вставить("ИдентификаторРасшифровки", "РасшифровкаНетОригиналов");
		ПараметрыФормы.Вставить("ИдентификаторЭДО", ИдентификаторЭДО);
		
		ДействиеРасшифровки.ПараметрыРасшифровки.Вставить("ПараметрыФормы", ПараметрыФормы);
		
		СписокВыбора.Добавить(ДействиеРасшифровки, ТекущиеДанные.НетОригиналовПредставление);
		
	ИначеЕсли Поле.Имя = "СтатусСпособаРассылки" Или Поле.Имя = "СпособРассылки" Тогда
		
		Если ВариантПолучателяРассылки = ПредопределенноеЗначение("Перечисление.ВариантыПолучателяЗапросаСверки.КонтактноеЛицоСРолью") Тогда
			
			ДействиеРасшифровки = НовыйОписаниеДействияРасшифровки();
			ДействиеРасшифровки.Действие = "ОткрытьФорму";
			
			ДействиеРасшифровки.ПараметрыРасшифровки.Вставить("ИмяФормы", "Справочник.КонтактныеЛица.Форма.ФормаСписка");
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Отбор", Новый Структура("ОбъектВладелец", ТекущиеДанные.Контрагент));
			ДействиеРасшифровки.ПараметрыРасшифровки.Вставить("ПараметрыФормы", ПараметрыФормы);
			
			СписокВыбора.Добавить(ДействиеРасшифровки, Нстр("ru='Контактные лица'"));
			
		Иначе
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Контрагент);
			ФормаКонтрагента = ПолучитьФорму("Справочник.Контрагенты.ФормаОбъекта", ПараметрыФормы);
			Если ФормаКонтрагента.Элементы.Найти("ГруппаКонтактныеДанные") <> Неопределено Тогда
				// Поищем e-mail основного контактного лица
				ЭлементEmail = ЭлементФормыПоЗаголовку(ФормаКонтрагента.Элементы.ГруппаКонтактныеДанные.ПодчиненныеЭлементы, "email");
				Если ЭлементEmail <> Неопределено Тогда
					ФормаКонтрагента.ТекущийЭлемент = ЭлементEmail;
				Иначе
					ФормаКонтрагента.ТекущийЭлемент = ФормаКонтрагента.Элементы.ГруппаКонтактныеДанные;
				КонецЕсли;
			ИначеЕсли ФормаКонтрагента.Элементы.Найти("КонтактнаяИнформацияПолеEmailКонтрагенты") <> Неопределено Тогда
				ФормаКонтрагента.ТекущийЭлемент = ФормаКонтрагента.Элементы.КонтактнаяИнформацияПолеEmailКонтрагенты;
			КонецЕсли;
			ФормаКонтрагента.Открыть();
			
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "АктСверкиКРассылке" Тогда
		
		ПоказатьЗначение(, ТекущиеДанные.АктСверки);
	
	КонецЕсли;
	
	ОповещениеПриВыборе = Новый ОписаниеОповещения("РасшифровкаПослеВыбораИзСписка", ЭтотОбъект);
	
	Если СписокВыбора.Количество() = 1 Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПриВыборе, СписокВыбора[0]);
	ИначеЕсли СписокВыбора.Количество() > 1 Тогда
		ПоказатьВыборИзМеню(ОповещениеПриВыборе, СписокВыбора, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранПриИзменении(Элемент)
	ОбновитьСчетчикВыбранных(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСчетаРасчетовСПоставщиками

&НаКлиенте
Процедура СчетаРасчетовСПоставщикамиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущиеДанные = Элементы.СчетаРасчетовСПоставщиками.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И Не ЗначениеЗаполнено(ТекущиеДанные.Значение) Или ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ПриИзмененииНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаРасчетовСПоставщикамиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ПриИзмененииНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаРасчетовСПоставщикамиПослеУдаления(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСчетаРасчетовСПокупателями

&НаКлиенте
Процедура СчетаРасчетовСПокупателямиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущиеДанные = Элементы.СчетаРасчетовСПокупателями.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И Не ЗначениеЗаполнено(ТекущиеДанные.Значение) Или ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ПриИзмененииНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаРасчетовСПокупателямиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ПриИзмененииНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаРасчетовСПокупателямиПослеУдаления(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыФормы = Новый Структура("НачалоПериода, КонецПериода", Объект.ДатаНачала, Объект.ДатаОкончания);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыФормы, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьДаннымиБухгалтерскогоУчетаНаКлиенте(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБыстрыеНастройки(Команда)
	
	Если Не КомпоновщикИнициализирован Тогда
		ИнициализироватьКомпоновщикНастроек();
	КонецЕсли;
	
	ПереключитьВидимостьБыстрыхНастроек(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура НовыйАктСверки(Команда)
	
	ТекущиеДанные = Элементы.СверкаСКонтрагентами.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура);
	ЗначенияЗаполнения = ПараметрыФормы.ЗначенияЗаполнения;
	ЗначенияЗаполнения.Вставить("Организация",   Объект.Организация);
	ЗначенияЗаполнения.Вставить("ДатаНачала",    Объект.ДатаНачала);
	ЗначенияЗаполнения.Вставить("ДатаОкончания", Объект.ДатаОкончания);
	ЗначенияЗаполнения.Вставить("Контрагент"   , ТекущиеДанные.Контрагент);
	ЗначенияЗаполнения.Вставить("ЭтоЭлектронныйДокумент", Истина);
	
	СчетаУчетаРасчетов = СчетаРасчетовСПоставщиками.ВыгрузитьЗначения();
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		СчетаУчетаРасчетов,
		СчетаРасчетовСПокупателями.ВыгрузитьЗначения(),
		Истина);
	
	ЗначенияЗаполнения.Вставить("СчетаУчетаРасчетов", СчетаУчетаРасчетов);
	
	ОткрытьФорму("Документ.АктСверкиВзаиморасчетов.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДляПечати(Команда)
	
	ПараметрыОткрытия = Новый Структура; 
	ПараметрыОткрытия.Вставить("ТабличныйДокумент", ПодготовитьСписокДляПечатиНаСервере());
	ОткрытьФорму("Обработка.МониторСверкиСКонтрагентами.Форма.ПечатьСписка", ПараметрыОткрытия);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПоСсылке(Команда)
	ИнтеграцияShareКлиент.ОткрытьФормуЗагрузитьДокументПоСсылке();
КонецПроцедуры

&НаКлиенте
Процедура ВвестиКомментарий(Команда)
	
	ВвестиКомментарийПоКонтрагенту();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого СтрокаКонтрагента Из СверкаСКонтрагентами Цикл
		СтрокаКонтрагента.Выбран = Истина;
	КонецЦикла;
	
	ОбновитьСчетчикВыбранных(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого СтрокаКонтрагента Из СверкаСКонтрагентами Цикл
		СтрокаКонтрагента.Выбран = Ложь;
	КонецЦикла;
	
	ОбновитьСчетчикВыбранных(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьСверки(Команда)
	
	Если СверкаСКонтрагентами.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru='Список контрагентов пустой. Запрос сверок невозможен.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкаРассылки) Тогда
		// Если настройка еще не выбрана, открываем сначала инструкцию, а потом помощник
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Режим", "Рассылка_ПервоеОткрытие");
		ОткрытьФорму("Обработка.МониторСверкиСКонтрагентами.Форма.Инструкция",
			ПараметрыФормы,,,,,
			Новый ОписаниеОповещения("ЗапроситьСверкиПослеПросмотраИнструкции", ЭтотОбъект),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		// Если настройка уже выбрана, сразу переходим в режим рассылки.
		Ошибки = Новый Массив;
		УстановитьРежимРассылки(Истина, Ошибки);
		Если Ошибки.Количество() > 0 Тогда
			СодержаниеПредупреждения = Новый Массив;
			СодержаниеПредупреждения.Добавить(НСтр("ru='Обнаружены ошибки при подготовке рассылки:'"));
			СодержаниеПредупреждения.Добавить(Символы.ПС);
			СодержаниеПредупреждения.Добавить(СтрСоединить(Ошибки, Символы.ПС));
			ПоказатьПредупреждение(, СтрСоединить(СодержаниеПредупреждения), , НСтр("ru='Ошибки при подготовке рассылки'"));
			УстановитьРежимРассылки(Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРассылку(Команда)
	ОткрытьПомощникРассылки();
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьРассылку(Команда)
	
	ОчиститьСообщения();
	
	КоличествоПолучателей = СверкаСКонтрагентами.НайтиСтроки(Новый Структура("Выбран", Истина)).Количество();
	
	Если КоличествоПолучателей = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru='Не выбран ни один контрагент для рассылки.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьПередЗапускомРассылки() Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	УИДЗамера = ОценкаПроизводительностиКлиент.ЗамерВремени("ОтправкаЗапросовНаСверку", Ложь, Ложь);
	ОценкаПроизводительностиКлиент.УстановитьВесЗамера(УИДЗамера, КоличествоПолучателей);
	// СтандартныеПодсистемы.ОценкаПроизводительности
	
	ЗапуститьРассылкуНаСервере();
	
	Если ЗначениеЗаполнено(РассылкаЗапросовНаСверкуПоПочте) Тогда
		
		// Отключим текущий обработчик ожидания, если он активен
		ОтключитьОбработчикОжидания("Подключаемый_ЗапуститьПроверкуСостоянияРассылкиЗапросов");
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
		ПараметрыОжидания.ВыводитьОкноОжидания           = Ложь;
		ПараметрыОжидания.ВыводитьПрогрессВыполнения     = Истина;
		ПараметрыОжидания.Интервал                       = 1;
		ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения(
			"ПрогрессВыполненияФоновогоЗаданияРассылки", ЭтотОбъект);
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			РассылкаЗапросовНаСверкуПоПочте,
			Новый ОписаниеОповещения("ЗапускРассылкиЗавершение", ЭтотОбъект),
			ПараметрыОжидания);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПодготовкаОбъектовРассылкиЭДОВФоне) Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПодготовкаОбъектовРассылкиЭДОЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			ПодготовкаОбъектовРассылкиЭДОВФоне, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	ОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(УИДЗамера);
	// СтандартныеПодсистемы.ОценкаПроизводительности
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Запущена рассылка'"),,, БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменаРассылки(Команда)
	
	УстановитьРежимРассылки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредварительныйПросмотрПисьма(Команда)
	
	ТекущиеДанные = Элементы.СверкаСКонтрагентами.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПорядокСверкиРасчетовСКонтрагентами = ПредопределенноеЗначение("Перечисление.ПорядокСверкиРасчетовСКонтрагентами.ОтправитьНашАктСверки")
		 И (Не ЗначениеЗаполнено(ТекущиеДанные.АктСверки) Или ТекущиеДанные.ТребуетсяАктСверки) Тогда
		// Нужно создать акт сверки перед просмотром письма - зададим вопрос пользователю
		ТекстВопроса = СтрШаблон(
			СтрЗаменить(Нстр("ru='Для предварительного показа письма уже сейчас будет создан акт сверки расчетов с %1
				                 |за период с %2 по %3. Продолжить?'"), Символы.ПС, " "),
				ТекущиеДанные.НаименованиеКонтрагента,
				Формат(Объект.ДатаНачала, "ДФ=dd.MM.yy"),
				Формат(Объект.ДатаОкончания, "ДФ=dd.MM.yy"));
		
		Оповещение = Новый ОписаниеОповещения(
			"ПослеОтветаНаВопросСоздатьАктСверки",
			ЭтотОбъект,
			Элементы.СверкаСКонтрагентами.ТекущаяСтрока);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ОткрытьПомощникРассылки(Элементы.СверкаСКонтрагентами.ТекущаяСтрока, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТолькоПроблемных(Команда)
	
	// Инвертируем флаг ТолькоПроблемные и обновляем фильтр и элементы формы
	УстановитьФильтрПроблемных(ЭтотОбъект, Не ТолькоПроблемные);
	ОбновитьСчетчикПроблемных();
	
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьРассылку(Команда)
	
	ТекстВопроса = НСтр("ru = 'Остановить рассылку? Все письма в очереди на отправку будут отменены.'");
	Оповещение = Новый ОписаниеОповещения("ВопросОстановитьРассылкуЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура НаписатьРазработчикам(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьПоЭлектроннойПочтеНастройкаУчетнойЗаписиПредложена", ЭтотОбъект);
	РаботаСПочтовымиСообщениямиКлиент.ПроверитьНаличиеУчетнойЗаписиДляОтправкиПочты(ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ГруппаСчетаРасчетовСПоставщиками.Доступность = Форма.Поставщики;
	Элементы.ГруппаСчетаРасчетовСПокупателями.Доступность = Форма.Покупатели;
	Элементы.КонтрагентыСОстаткамиПрошлыхПериодов.Доступность = Форма.Поставщики Или Форма.Покупатели;
	
	Элементы.ЗаполнитьВБыстрыхНастройках.Видимость = Не Форма.ЗаполнятьСписокПриИзмененииНастроек;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	// Заполним настройки по умолчанию. Далее могут быть заменены из сохраненных настроек.
	
	// Период по умолчанию - квартал (недавно завершенный или текущий)
	ТекущаяДата = ОбщегоНазначения.ТекущаяДатаПользователя();
	Если НачалоМесяца(ТекущаяДата) = НачалоКвартала(ТекущаяДата) Тогда
		// Сейчас 1-й месяц квартала - смотрим прошлый квартал
		Объект.ДатаНачала = НачалоКвартала(ДобавитьМесяц(ТекущаяДата, -3));;
		Объект.ДатаОкончания = КонецКвартала(Объект.ДатаНачала);
	Иначе
		// Смотрим текущий квартал
		Объект.ДатаНачала = НачалоКвартала(ТекущаяДата);;
		Объект.ДатаОкончания = КонецКвартала(ТекущаяДата);
	КонецЕсли;
	
	Периодичность = Перечисления.Периодичность.Квартал;
	СчетаРасчетовСПоставщиками.ЗагрузитьЗначения(Обработки.МониторСверкиСКонтрагентами.СчетаРасчетовСПоставщиками());
	СчетаРасчетовСПокупателями.ЗагрузитьЗначения(Обработки.МониторСверкиСКонтрагентами.СчетаРасчетовСПокупателями());
	Поставщики = Истина;
	Покупатели = Истина;
	КонтрагентыСРасчетамиИОстатками = Истина;
	КонтрагентыСРасчетамиБезОстатков = Истина;
	ЗаполнятьСписокПриИзмененииНастроек = Истина;
	ОтборНетОтветаДней = 10;
	
	ИтогиПоСтатусамСверки = Новый ФиксированноеСоответствие(Новый Соответствие);
	ЗаполнитьОтборПоСтатусамСверки();
	
	// Прочитаем ФО и настройки пользователя
	ИспользуетсяСервисСверкиРасчетов = СервисСверкиРасчетов.ИспользуетсяСервисСверкиРасчетов();
	ИспользуютсяОтветственные = 
		(ОбщегоНазначенияБП.ЭтоПолныйИнтерфейс() И ПолучитьФункциональнуюОпцию("ИспользоватьЛидыПолныйИнтерфейс")
		Или ПолучитьФункциональнуюОпцию("ИспользоватьЛидыПростойИнтерфейс"))
		И ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОтветственных");
	ПользовательУправляетСчетамиУчета = СчетаУчетаВДокументахВызовСервераПовтИсп.ПользовательУправляетСчетамиУчета();
	
	СписокИдентификаторов = УчетныеЗаписиЭДО.СписокИдентификаторовУчетныхЗаписейОрганизацииСервисаЭДО(Объект.Организация);
	Если СписокИдентификаторов.Количество() = 1 Тогда
		ИдентификаторЭДО = СписокИдентификаторов[0].Значение;
	КонецЕсли;
	
	ИнициализироватьКомпоновщикНастроек();
	
	Элементы.ГруппаБаннер.Видимость = ВидимостьБаннера1ССверка(ИспользуетсяСервисСверкиРасчетов);
	ДанныеБаннера = Новый Структура();
	ДанныеБаннера.Вставить("ПрименяетсяОСНО", ПолучитьФункциональнуюОпцию("ИспользуетсяОСНО") 
		Или ПолучитьФункциональнуюОпцию("ИспользуетсяНДФЛИП"));
	Элементы.Баннер1ССверка.Заголовок = ПерсонализированныеПредложенияСервисов.ТекстБаннераСервисСверкиРасчетов(
		"СервисСверкиРасчетов", ДанныеБаннера);

	Элементы.Ответственный.Видимость = ИспользуютсяОтветственные;
	
	Элементы.ГруппаСчетаРасчетовСПоставщиками.Видимость = ПользовательУправляетСчетамиУчета;
	Элементы.ГруппаСчетаРасчетовСПокупателями.Видимость = ПользовательУправляетСчетамиУчета;
	
	Если ПользовательУправляетСчетамиУчета Тогда
		Элементы.ЗадолженностьОстаток.Заголовок = ЗаголовокНаДату(НСтр("ru='Остаток'"), Объект.ДатаОкончания);
		Элементы.ДебиторскаяЗадолженность.Заголовок =  НСтр("ru='Дебет'");
		Элементы.КредиторскаяЗадолженность.Заголовок = НСтр("ru='Кредит'");
		Элементы.КредиторскаяЗадолженностьНетОпераций.Заголовок = НСтр("ru='Кредит'");
		Элементы.ПроцентПодтвержденнойДЗ.Заголовок = НСтр("ru='по дебиторской задолженности'");
		Элементы.ПроцентПодтвержденнойКЗ.Заголовок = НСтр("ru='по кредиторской задолженности'");
	Иначе
		Элементы.ЗадолженностьОстаток.Заголовок = ЗаголовокНаДату(НСтр("ru='Долг'"), Объект.ДатаОкончания);
		Элементы.ДебиторскаяЗадолженность.Заголовок =  НСтр("ru='Контрагента'");
		Элементы.КредиторскаяЗадолженность.Заголовок = НСтр("ru='Организации'");
		Элементы.КредиторскаяЗадолженностьНетОпераций.Заголовок = НСтр("ru='Организации'");
		Элементы.ПроцентПодтвержденнойДЗ.Заголовок = НСтр("ru='по долгу контрагентов'");
		Элементы.ПроцентПодтвержденнойКЗ.Заголовок = НСтр("ru='по долгу организации'");
	КонецЕсли;
	
	// Во всех вариантах дополнительно сортируем по ссылке контрагента, чтобы порядок записей был более стабильный
	Элементы.Сортировка.СписокВыбора.Добавить("ДебиторскаяЗадолженность Убыв,Контрагент", 
		?(ПользовательУправляетСчетамиУчета, НСтр("ru='По убыванию дебиторской задолженности'"), НСтр("ru='По убыванию долга контрагента'")));
	Элементы.Сортировка.СписокВыбора.Добавить("КредиторскаяЗадолженность Убыв,Контрагент",
		?(ПользовательУправляетСчетамиУчета, НСтр("ru='По убыванию кредиторской задолженности'"), НСтр("ru='По убыванию долга организации'")));
	Элементы.Сортировка.СписокВыбора.Добавить("АктыСверкиКоличество,Контрагент", НСтр("ru='Сначала без актов сверки'"));
	Элементы.Сортировка.СписокВыбора.Добавить("НетОригиналовКоличество Убыв,Контрагент", НСтр("ru='Сначала с неполученными оригиналами'"));
	Элементы.Сортировка.СписокВыбора.Добавить("НаименованиеКонтрагента,Контрагент", НСтр("ru='По наименованию'"));
	
	Если Не ЗначениеЗаполнено(Сортировка) Или Элементы.Сортировка.СписокВыбора.НайтиПоЗначению(Сортировка) = Неопределено Тогда
		Сортировка = Элементы.Сортировка.СписокВыбора[0].Значение;
	КонецЕсли;
	
	ПодключенЭДО = НастройкиЭДО.ИспользуетсяОбменЭлектроннымиДокументами();
	Элементы.ГруппаОтборЭДО.Видимость = ПодключенЭДО;
	
	// Если ввод акта сверки недоступен, то скрываем соответствующие элементы
	Если Не ПравоДоступа("Изменение", Метаданные.Документы.АктСверкиВзаиморасчетов) Тогда
		Элементы.КомандыСпискаАктСверки.Видимость = Ложь;
	КонецЕсли;
	
	// Если ввод комментария недоступен, то скрываем соответствующие элементы
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.СостояниеСверкиСКонтрагентами) Тогда
		Элементы.ВвестиКомментарий.Видимость = Ложь;
	КонецЕсли;
	
	// Если рассылка сообщений недоступна, то скрываем соответствующие элементы
	Если Не ПравоДоступа("Изменение", Метаданные.Справочники.РассылкиСообщений) Тогда
		Элементы.ГруппаРассылкаЗапросов.Видимость = Ложь;
		Элементы.СсылкаПодробнееПроЗапросНаСверку.Видимость = Ложь;
	КонецЕсли;
	
	// Показываем быстрые настройки
	ПереключитьВидимостьБыстрыхНастроек(ЭтотОбъект);
	
	УстановитьУсловноеОформление();
	
	КэшЦветов = Новый Структура;
	КэшЦветов.Вставить("ЦветФонаФормы", ЦветаСтиля.ЦветФонаФормы);
	КэшЦветов.Вставить("БыстрыеОтборыФонГруппы", ЦветаСтиля.БыстрыеОтборыФонГруппы);
	КэшЦветов.Вставить("ЦветБаннера", Элементы.ГруппаБаннер.ЦветФона);
	
	ЦветаФормы = Новый ФиксированнаяСтруктура(КэшЦветов);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПослеУспешнойЗагрузкиДанных()
	
	// Расчетные итоги
	ЗаполнитьОтборПоСтатусамСверки(); // расчет процента по каждому статусу
	Если ВсегоДЗ <> 0 Тогда
		ПроцентПодтвержденнойДЗ = (ПодтвержденнаяДЗ / ВсегоДЗ) * 100;
	Иначе
		ПроцентПодтвержденнойДЗ = 0;
	КонецЕсли;
	
	Если ВсегоКЗ <> 0 Тогда
		ПроцентПодтвержденнойКЗ = (ПодтвержденнаяКЗ / ВсегоКЗ) * 100;
	Иначе
		ПроцентПодтвержденнойКЗ = 0;
	КонецЕсли;
	
	// При успешной загрузке данных обновим указание на дату остатков
	Если ПользовательУправляетСчетамиУчета Тогда
		Элементы.ЗадолженностьОстаток.Заголовок = ЗаголовокНаДату(НСтр("ru='Остаток'"), Объект.ДатаОкончания);
	Иначе
		Элементы.ЗадолженностьОстаток.Заголовок = ЗаголовокНаДату(НСтр("ru='Долг'"), Объект.ДатаОкончания);
	КонецЕсли;
	
	Если ВсегоКонтрагентов > 0 Тогда
		Элементы.ОтборСтатусыСверки.Заголовок = СтрШаблон(
			НСтр("ru='Состояние сверки (из %1)'"),
			ПолучитьСклоненияСтрокиПоЧислу(
				"контрагент",
				ВсегоКонтрагентов,
				"",
				"Л= ru_RU; ЧС=Количественное",
				"ПД=Родительный;ПЧ=Число")[0]);
	Иначе
		Элементы.ОтборСтатусыСверки.Заголовок = НСтр("ru='Состояние сверки'");
	КонецЕсли;
	
	// Для корректного отображения заголовка в шапке таблицы служебная колонка скрыта при начальной загрузке формы.
	// Здесь отображаем колонку, т.к. ее видимость будет управляться условным оформлением.
	Элементы.КредиторскаяЗадолженностьНетОпераций.Видимость = (СверкаСКонтрагентами.Количество() > 0);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	// СпособРассылки
	
	// Если есть проблема, то требуется перейти по ссылке в нужную форму. В этом случае выводим гиперссылку.
	// В ином случае - просто текст.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СтатусСпособаРассылки");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СпособРассылки");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СверкаСКонтрагентами.СпособРассылкиЕстьПроблема", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СтатусСпособаРассылкиСообщение");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СпособРассылкиСообщение");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СверкаСКонтрагентами.СпособРассылкиЕстьПроблема", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// АктСверкиКРассылке
	
	// Если акта сверки нет, то выводим только подсказку о том, что будет создан, без гиперссылки.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "АктСверкиКРассылке");
	ГруппаИли = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(ЭлементУО.Отбор.Элементы,
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИли,
		"СверкаСКонтрагентами.ТребуетсяАктСверки", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИли,
		"СверкаСКонтрагентами.АктСверки", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "АктСверкиКРассылкеНеВыбран");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СверкаСКонтрагентами.ТребуетсяАктСверки", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СверкаСКонтрагентами.АктСверки", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// КредиторскаяЗадолженность
	
	// Если были остатки или обороты (СчетКоличество > 0), но сальдо нулевое, то выведем 0,
	// чтобы можно было открыть отчет по ссылке
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КредиторскаяЗадолженность");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СверкаСКонтрагентами.ДебиторскаяЗадолженность", ВидСравненияКомпоновкиДанных.Равно, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СверкаСКонтрагентами.КредиторскаяЗадолженность", ВидСравненияКомпоновкиДанных.Равно, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СверкаСКонтрагентами.СчетКоличество", ВидСравненияКомпоновкиДанных.Больше, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "0");
	
	// Если сальдо нулевое и не было оборотов (СчетКоличество = 0), то выведем просто подсказку, что не было операций.
	// В этом случае скроем гиперссылку КредиторскаяЗадолженность, а вместо этого выведем колонку с текстом пояснения.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КредиторскаяЗадолженность");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СверкаСКонтрагентами.СчетКоличество", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КредиторскаяЗадолженностьНетОпераций");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СверкаСКонтрагентами.СчетКоличество", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "Нет операций");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекста);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КредиторскаяЗадолженностьНетОпераций");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СверкаСКонтрагентами.СчетКоличество", ВидСравненияКомпоновкиДанных.Больше, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	//СостояниеСверки
	
	// Если нет актов и нет данных сервиса сверки, то сверка не выполнялась.
	// В этом случае скроем гиперссылку СостояниеСверки, а вместо этого выведем колонку с текстом пояснения.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СостояниеСверкиНеВыполнялась");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СверкаСКонтрагентами.АктыСверкиКоличество", ВидСравненияКомпоновкиДанных.Равно, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СверкаСКонтрагентами.ЗапросСверкиДатаЗапроса", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СверкаСКонтрагентами.ЗапросСверкиОтвет", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ГруппаИли = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(ЭлементУО.Отбор.Элементы,
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИли,
		"СверкаСКонтрагентами.СервисСверкиИспользуется", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИли,
		"СверкаСКонтрагентами.СервисСверкиДанныеАктуальны", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "Не выполнялась");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекста);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СтатусСверки");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СостояниеСверки");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СверкаСКонтрагентами.АктыСверкиКоличество", ВидСравненияКомпоновкиДанных.Равно, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СверкаСКонтрагентами.ЗапросСверкиОтвет", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ГруппаИли = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(ЭлементУО.Отбор.Элементы,
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИли,
		"СверкаСКонтрагентами.СервисСверкиИспользуется", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИли,
		"СверкаСКонтрагентами.СервисСверкиДанныеАктуальны", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СтатусСверкиНеВыполнялась");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СостояниеСверкиНеВыполнялась");
	ГруппаИли = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(ЭлементУО.Отбор.Элементы,
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИли,
		"СверкаСКонтрагентами.АктыСверкиКоличество", ВидСравненияКомпоновкиДанных.Больше, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИли,
		"СверкаСКонтрагентами.ЗапросСверкиОтвет", ВидСравненияКомпоновкиДанных.Заполнено);
	ГруппаИВторогоУровня = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(ГруппаИли.Элементы,
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИВторогоУровня,
		"СверкаСКонтрагентами.СервисСверкиИспользуется", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИВторогоУровня,
		"СверкаСКонтрагентами.СервисСверкиДанныеАктуальны", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Если актов сверки нет, но отправлен запрос (пока без ответа), то выводим текст пояснения, но без гиперссылки (см. выше).
	// Здесь только дополнительно настраиваем цвет текста, как для состояния Сверка не выполнялась.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СостояниеСверкиНеВыполнялась");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СверкаСКонтрагентами.АктыСверкиКоличество", ВидСравненияКомпоновкиДанных.Равно, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СверкаСКонтрагентами.ЗапросСверкиДатаЗапроса", ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СверкаСКонтрагентами.ЗапросСверкиОтвет", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ГруппаИли = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(ЭлементУО.Отбор.Элементы,
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИли,
		"СверкаСКонтрагентами.СервисСверкиИспользуется", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИли,
		"СверкаСКонтрагентами.СервисСверкиДанныеАктуальны", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекста);
	
	//Комментарий
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КомментарийКартинка");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Комментарий");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СверкаСКонтрагентами.Комментарий", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроек()
	
	КомпоновщикИнициализирован = Истина;
	
	Схема = Обработки.МониторСверкиСКонтрагентами.ПолучитьМакет("СхемаКомпоновкиДанных");
	СхемаКомпоновкиДанных = ПоместитьВоВременноеХранилище(Схема, УникальныйИдентификатор);
	
	ВариантНастроек = Схема.ВариантыНастроек.Найти("Основной");
	
	Если ВариантНастроек <> Неопределено Тогда
		Настройки = ВариантНастроек.Настройки;
	Иначе
		Настройки = Схема.НастройкиПоУмолчанию;
	КонецЕсли;
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
	ПолеКонтрагент = Новый ПолеКомпоновкиДанных("Контрагент");
	ПолеОтветственный = Новый ПолеКомпоновкиДанных("Ответственный");
	
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если Не ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементОтбора.ЛевоеЗначение = ПолеКонтрагент
			 Или ЭлементОтбора.ЛевоеЗначение = ПолеОтветственный И ИспользуютсяОтветственные Тогда
			 
			ИндексСтроки = КомпоновщикНастроек.Настройки.Отбор.Элементы.Индекс(ЭлементОтбора);
			
			Если ИндексСтроки = 0 Тогда
				// Элемент формы уже есть - только включим видимость и настроим заголовок ниже
				Элементы.ГруппаОтбор0.Видимость = Истина;
			Иначе
				СкопироватьЭлементФормыРекурсивно(Элементы.ГруппаОтбор0, Элементы.БыстрыеОтборыКомпоновки, ИндексСтроки);
			КонецЕсли;
			
			Элементы["Отбор" + ИндексСтроки + "Заголовок"].Заголовок = ЭлементОтбора.Представление;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьЭлементФормыРекурсивно(Знач ЭлементИсточник, Родитель, ИндексСтроки)
	
	// ЭлементИсточник - это всегда элемент с 0 в имени, который означает связь со строкой источника с индексом 0.
	ИмяНовогоЭлемента = СтрЗаменить(ЭлементИсточник.Имя, "0", ИндексСтроки);
	НовыйЭлемент = СкопироватьЭлементФормы(ЭлементИсточник, Родитель, ИмяНовогоЭлемента, ИндексСтроки);
	
	Если ТипЗнч(ЭлементИсточник) = Тип("ГруппаФормы") Тогда
		Для каждого ПодчиненныйЭлемент Из ЭлементИсточник.ПодчиненныеЭлементы Цикл
			СкопироватьЭлементФормыРекурсивно(ПодчиненныйЭлемент, НовыйЭлемент, ИндексСтроки);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СкопироватьЭлементФормы(ЭлементИсточник, Родитель, ИмяНовогоЭлемента, ИндексСтроки)

	ТипИсточника = ТипЗнч(ЭлементИсточник);
	НовыйЭлемент = Элементы.Добавить(ИмяНовогоЭлемента, ТипИсточника, Родитель);
	НовыйЭлемент.Вид = ЭлементИсточник.Вид;

	Если ТипИсточника = Тип("ПолеФормы") Тогда
		// Игнорируем свойства, которые вызывают ошибки копирования или устанавливаются однократно 
		НеКопируемыеСвойства = Новый Массив;
		НеКопируемыеСвойства.Добавить("ПутьКДанным");
		Если НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода Тогда
			НеКопируемыеСвойства.Добавить("ВыделенныйТекст");
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементИсточник,, СтрСоединить(НеКопируемыеСвойства, ", "));
		НовыйЭлемент.ПутьКДанным = СтрЗаменить(ЭлементИсточник.ПутьКДанным, "0", ИндексСтроки);
		// Копируем обработчик события "ПриИзменении" (другие не используются)
		ДействиеПриИзменении = ЭлементИсточник.ПолучитьДействие("ПриИзменении");
		Если ДействиеПриИзменении <> "" Тогда
			НовыйЭлемент.УстановитьДействие("ПриИзменении", ДействиеПриИзменении);
		КонецЕсли;
	ИначеЕсли ТипИсточника = Тип("ГруппаФормы") Тогда
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементИсточник,, "ПутьКДаннымЗаголовка");
	Иначе
		// Например, декорация формы
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементИсточник);
	КонецЕсли;
	
	НовыйЭлемент.Видимость = Истина;

	Возврат НовыйЭлемент;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПереключитьВидимостьБыстрыхНастроек(Форма)
	
	Элементы = Форма.Элементы;
	
	Форма.ПоказыватьБыстрыеНастройки = Не Форма.ПоказыватьБыстрыеНастройки;

	Элементы.БыстрыеНастройки.Видимость = Форма.ПоказыватьБыстрыеНастройки;
	Элементы.ПоказатьБыстрыеНастройки.Пометка = Форма.ПоказыватьБыстрыеНастройки;
	
	Если Форма.ПоказыватьБыстрыеНастройки Тогда
		Элементы.ПоказатьБыстрыеНастройки.Картинка = БиблиотекаКартинок.СтрелкаВправо;
	Иначе
		Элементы.ПоказатьБыстрыеНастройки.Картинка = БиблиотекаКартинок.СтрелкаВлево;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПоДаннымБухгалтерскогоУчета(ТихийРежим = Истина, Контрагенты = Неопределено)
	
	// Проверим заполненность обязательных реквизитов
	Если Не ПроверитьЗаполнение() Тогда
		Если ТихийРежим Тогда
			// Скроем сообщения об ошибках заполенения
			ПолучитьСообщенияПользователю(Истина);
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
	ИдентификаторЗадания = Неопределено;
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ДатаНачала",    Объект.ДатаНачала);
	СтруктураПараметров.Вставить("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	СтруктураПараметров.Вставить("Организация",   Объект.Организация);
	СтруктураПараметров.Вставить("ВключатьОбособленныеПодразделения", Ложь);
	
	Если ЗначениеЗаполнено(Контрагенты) Тогда
		СтруктураПараметров.Вставить("Контрагенты", Контрагенты);
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ИспользуетсяПочтовыйклиент", ПолучитьФункциональнуюОпцию("ИспользоватьПочтовыйКлиент"));
	СтруктураПараметров.Вставить("ПодключенЭДО", НастройкиЭДО.ИспользуетсяОбменЭлектроннымиДокументами()
		И ОбменСКонтрагентами.ОрганизацияПодключена(Объект.Организация));
	
	ВыбранныеСтатусыСверки = Новый СписокЗначений;
	Для Каждого Элемент Из ОтборСтатусыСверки Цикл
		Если Не Элемент.Пометка Тогда
			Продолжить;
		КонецЕсли;
		ВыбранныеСтатусыСверки.Добавить(Элемент.Значение);
	КонецЦикла;
	
	СтруктураПараметров.Вставить("Сортировка", Сортировка);
	
	СтруктураПараметров.Вставить("ОтбиратьПоСтатусуСверки",
		ВыбранныеСтатусыСверки.Количество() > 0 И ОтборСтатусыСверки.Количество() <> ВыбранныеСтатусыСверки.Количество());
	СтруктураПараметров.Вставить("СтатусыСверки", ВыбранныеСтатусыСверки);
	
	СтруктураПараметров.Вставить("ОтборЗапросНеОтправлялся", ОтборЗапросНеОтправлялся);
	СтруктураПараметров.Вставить("ОтборЗапросНетОтвета", ОтборЗапросНетОтвета);
	СтруктураПараметров.Вставить("ОтборНетОтветаДней", ОтборНетОтветаДней);
	
	СтруктураПараметров.Вставить("ОтборЭДОНеНастроен", ОтборЭДОНеНастроен);
	СтруктураПараметров.Вставить("ОтборЭДОНастроен", ОтборЭДОНастроен);
	
	СтруктураПараметров.Вставить("Поставщики", Поставщики);
	СтруктураПараметров.Вставить("Покупатели", Покупатели);
	
	СчетаРасчетовСПоставщикамиМассив = СчетаРасчетовСПоставщиками.ВыгрузитьЗначения();
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(СчетаРасчетовСПоставщикамиМассив , ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	СтруктураПараметров.Вставить("СчетаРасчетовСПоставщиками", СчетаРасчетовСПоставщикамиМассив);
	
	СчетаРасчетовСПокупателямиМассив = СчетаРасчетовСПокупателями.ВыгрузитьЗначения();
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(СчетаРасчетовСПокупателямиМассив , ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	// Во избежание дубирования данных о расчетах уберем из массива счетов покупателей те, что уже есть в счетах поставщиков
	Если Поставщики Тогда
		ОбщегоНазначенияКлиентСервер.РазностьМассивов(
			СчетаРасчетовСПокупателямиМассив, СчетаРасчетовСПоставщикамиМассив);
	КонецЕсли;
	СтруктураПараметров.Вставить("СчетаРасчетовСПокупателями", СчетаРасчетовСПокупателямиМассив);
	
	СтруктураПараметров.Вставить("КонтрагентыСОстаткамиПрошлыхПериодов", КонтрагентыСОстаткамиПрошлыхПериодов);
	СтруктураПараметров.Вставить("КонтрагентыСРасчетамиБезОстатков", КонтрагентыСРасчетамиБезОстатков);
	СтруктураПараметров.Вставить("СхемаКомпоновкиДанных", ПолучитьИзВременногоХранилища(СхемаКомпоновкиДанных));
	СтруктураПараметров.Вставить("НастройкиКомпоновкиДанных", КомпоновщикНастроек.ПолучитьНастройки());
	
	Если ЭтоАдресВременногоХранилища(АдресХранилищаСОшибками) Тогда
		УдалитьИзВременногоХранилища(АдресХранилищаСОшибками);
		АдресХранилищаСОшибками = "";
	КонецЕсли;
	
	АдресХранилищаСОшибками = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	СтруктураПараметров.Вставить("АдресХранилищаСОшибками", АдресХранилищаСОшибками);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "ЗаполнитьКонтрагентовДляСверки";
	
	Результат = ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.МониторСверкиСКонтрагентами.ПолучитьДанныеСверкиСКонтрагентами",
		СтруктураПараметров,
		ПараметрыВыполнения);
		
	ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДаннымиБухгалтерскогоУчетаНаКлиенте(ТихийРежим = Истина, Контрагенты = Неопределено)
	
	Результат = ЗаполнитьПоДаннымБухгалтерскогоУчета(ТихийРежим, Контрагенты);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ЗаполнитьПоДаннымБухгалтерскогоУчетаЗавершение",
		ЭтотОбъект,
		Контрагенты);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(Результат, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДаннымиБухгалтерскогоУчетаНаКлиентеСОжиданием() Экспорт
	ЗаполнитьДаннымиБухгалтерскогоУчетаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымБухгалтерскогоУчетаЗавершение(Результат, Контрагенты) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Запомним текущего контрагента, чтобы потом вернуть курсор на ту же строку
	ТекущийКонтрагент = Неопределено;
	Если Элементы.СверкаСКонтрагентами.ТекущиеДанные <> Неопределено Тогда
		ТекущийКонтрагент = Элементы.СверкаСКонтрагентами.ТекущиеДанные.Контрагент;
	КонецЕсли;
	
	РезультатВыполнения = ЗагрузитьПодготовленныеДанные(Результат, Контрагенты);
	
	Если РезультатВыполнения.Успешно Тогда
		НайденныеСтроки = СверкаСКонтрагентами.НайтиСтроки(Новый Структура("Контрагент", ТекущийКонтрагент));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Элементы.СверкаСКонтрагентами.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
		КонецЕсли;
	Иначе
		ОбщегоНазначенияБПКлиент.ОткрытьФормуОшибокПерепроведения(ЭтотОбъект, АдресХранилищаСОшибками);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьПодготовленныеДанные(Результат, Контрагенты)
	
	СтруктураДанных = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ЗаданиеВыполнено", Истина);
	РезультатВыполнения.Вставить("Успешно", Ложь);
	
	Если ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	РезультатВыполнения.Успешно = СтруктураДанных.Успешно;
	
	Если СтруктураДанных.Успешно Тогда
		
		Если ЗначениеЗаполнено(Контрагенты) Тогда
			// При "точечном" обновлении данных (по выбранным контрагентам) обновляем или дописываем только отдельные строки
			
			СтатусыСверкиАктПодписан = Обработки.МониторСверкиСКонтрагентами.СтатусыСверки().АктСверкиПодписан.Статус;
			ИтогиПоСтатусамСверкиВрем = Новый Соответствие(ИтогиПоСтатусамСверки); // для редактирования
			ОбновитьПорядокСтрок = Ложь;
			
			Для Каждого Контрагент Из Контрагенты Цикл
				
				СтрокиКонтрагента = СверкаСКонтрагентами.НайтиСтроки(Новый Структура("Контрагент", Контрагент));
				СтрокаКонтрагента = Неопределено;
				
				СтрокаНовогоСостоянияКонтрагента = СтруктураДанных.ТаблицаСостояниеСверки.Найти(Контрагент, "Контрагент");
				
				Если СтрокиКонтрагента.Количество() > 0 Тогда
					
					// В таблице только одна строка по контрагенту
					СтрокаКонтрагента = СтрокиКонтрагента[0];
					
					//Здесь вычтем показатели контрагента из общей статистики, а после загрузки данных добавим изменные значения
					
					// Итоги по статусам сверки
					КоличествоКонтрагентов = ИтогиПоСтатусамСверкиВрем.Получить(СтрокаКонтрагента.СтатусСверки);
					Если КоличествоКонтрагентов <> Неопределено Тогда
						ИтогиПоСтатусамСверкиВрем[СтрокаКонтрагента.СтатусСверки] = КоличествоКонтрагентов - 1;
					КонецЕсли;
					
					// Суммы задолженности
					ВсегоДЗ = ВсегоДЗ - СтрокаКонтрагента.ДебиторскаяЗадолженность;
					ВсегоКЗ = ВсегоКЗ - СтрокаКонтрагента.КредиторскаяЗадолженность;
					
					Если СтрокаКонтрагента.СтатусСверки = СтатусыСверкиАктПодписан Тогда
						ПодтвержденнаяДЗ = ПодтвержденнаяДЗ - СтрокаКонтрагента.ДебиторскаяЗадолженность;
						ПодтвержденнаяКЗ = ПодтвержденнаяКЗ - СтрокаКонтрагента.КредиторскаяЗадолженность;
					КонецЕсли;
					
				КонецЕсли;
				
				Если СтрокиКонтрагента.Количество() > 0 И СтрокаНовогоСостоянияКонтрагента = Неопределено Тогда
					// Если контрагент более не соответствует критериям отбора, то удалим строку
					ВсегоКонтрагентов = ВсегоКонтрагентов - 1;
					СверкаСКонтрагентами.Удалить(СтрокиКонтрагента[0]);
					СтрокаКонтрагента = Неопределено;
				ИначеЕсли СтрокиКонтрагента.Количество() = 0 И СтрокаНовогоСостоянияКонтрагента <> Неопределено Тогда
					// Контрагента ранее не было в таблице - добавляем
					СтрокаКонтрагента = СверкаСКонтрагентами.Добавить();
				КонецЕсли;
				
				Если СтрокаКонтрагента <> Неопределено Тогда
					
					ЗаполнитьЗначенияСвойств(СтрокаКонтрагента, СтрокаНовогоСостоянияКонтрагента);
					
					ОбновитьПорядокСтрок = Истина; // если строка не удаляется, то может поменяться сортировка исходя из новых значений
					
					// Обновим строки по контрагенту во вспомогательной таблице
					Для Каждого СтрокаКУдалению Из СчетаРасчетов.НайтиСтроки(Новый Структура("Контрагент", Контрагент)) Цикл
						СчетаРасчетов.Удалить(СтрокаКУдалению);
					КонецЦикла;
					
					Для Каждого СтрокаСчетаРасчетов Из СтруктураДанных.СчетаРасчетов Цикл
						ЗаполнитьЗначенияСвойств(СчетаРасчетов.Добавить(), СтрокаСчетаРасчетов);
					КонецЦикла;
					
					// В режиме рассылки отображаются некоторые специальные реквизиты - их тоже нужно обновить
					Если РежимРассылки Тогда
						ЗаполнитьПредставлениеАктаСверкиКРассылке(СтрокаКонтрагента);
					КонецЕсли;
					
					//Здесь добавим показатели контрагента в общую статистику
					
					// Итоги по статусам сверки
					КоличествоКонтрагентов = ИтогиПоСтатусамСверкиВрем.Получить(СтрокаКонтрагента.СтатусСверки);
					Если КоличествоКонтрагентов <> Неопределено Тогда
						ИтогиПоСтатусамСверкиВрем[СтрокаКонтрагента.СтатусСверки] = КоличествоКонтрагентов + 1;
					КонецЕсли;
					
					// Суммы задолженности
					ВсегоДЗ = ВсегоДЗ + СтрокаКонтрагента.ДебиторскаяЗадолженность;
					ВсегоКЗ = ВсегоКЗ + СтрокаКонтрагента.КредиторскаяЗадолженность;
					
					Если СтрокаКонтрагента.СтатусСверки = СтатусыСверкиАктПодписан Тогда
						ПодтвержденнаяДЗ = ПодтвержденнаяДЗ + СтрокаКонтрагента.ДебиторскаяЗадолженность;
						ПодтвержденнаяКЗ = ПодтвержденнаяКЗ + СтрокаКонтрагента.КредиторскаяЗадолженность;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			ИтогиПоСтатусамСверки = Новый ФиксированноеСоответствие(ИтогиПоСтатусамСверкиВрем);
			
			// Обновим порядок строк исходя из новых данных
			Если ОбновитьПорядокСтрок Тогда
				СверкаСКонтрагентами.Сортировать(Сортировка);
			КонецЕсли;
			
		Иначе
			
			СверкаСКонтрагентами.Загрузить(СтруктураДанных.ТаблицаСостояниеСверки);
			СчетаРасчетов.Загрузить(СтруктураДанных.СчетаРасчетов);
			
			// Итоговые суммы
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураДанных, , "СчетаРасчетов");
			
			// Обновим границу актуальности
			ГраницаАктуальностиСостоянияРассылки = СтруктураДанных.ГраницаАктуальностиДанных;
			
		КонецЕсли;
		
		НастроитьФормуПослеУспешнойЗагрузкиДанных();
		УправлениеФормой(ЭтотОбъект);
		
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьОтборПоСтатусамСверки()
	
	// Прочитаем возможные статусы сверки.
	// Если есть статистика, то пишем ее в наименовании статуса.
	Для Каждого ОписаниеСтатуса Из Обработки.МониторСверкиСКонтрагентами.СтатусыСверки() Цикл
		
		КоличествоКонтрагентов = ИтогиПоСтатусамСверки.Получить(ОписаниеСтатуса.Значение.Статус);
		
		Если ЗначениеЗаполнено(КоличествоКонтрагентов) Тогда
			ПредставлениеСтатуса = СтрШаблон(
				НСтр("ru='%1 (%2)'"),
				ОписаниеСтатуса.Значение.Представление,
				КоличествоКонтрагентов);
		Иначе
			ПредставлениеСтатуса = ОписаниеСтатуса.Значение.Представление;
		КонецЕсли;
		
		ЭлементСписка = ОтборСтатусыСверки.НайтиПоЗначению(ОписаниеСтатуса.Значение.Статус);
		
		Если ЭлементСписка = Неопределено Тогда
			ОтборСтатусыСверки.Добавить(
				ОписаниеСтатуса.Значение.Статус,
				ПредставлениеСтатуса,
				,
				ОписаниеСтатуса.Значение.Картинка);
		Иначе
			ЭлементСписка.Представление = ПредставлениеСтатуса;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДатаНачала    = РезультатВыбора.НачалоПериода;
	Объект.ДатаОкончания = РезультатВыбора.КонецПериода;
	
	ПриИзмененииПериода();
	ПриИзмененииНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПериода()
	
	Если НачалоМесяца(Объект.ДатаНачала) = НачалоМесяца(Объект.ДатаОкончания) Тогда
		Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц");
	ИначеЕсли НачалоМесяца(Объект.ДатаНачала) = ДобавитьМесяц(НачалоМесяца(Объект.ДатаОкончания), -11) Тогда
		Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год");
	Иначе
		// В иных случаях считаем, что периодичность квартал
		Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНастройки()
	
	Если ЗаполнятьСписокПриИзмененииНастроек Тогда
		ОтключитьОбработчикОжидания("ЗаполнитьДаннымиБухгалтерскогоУчетаНаКлиентеСОжиданием");
		ПодключитьОбработчикОжидания("ЗаполнитьДаннымиБухгалтерскогоУчетаНаКлиентеСОжиданием", 1, Истина);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОранизацииСервер()
	ПредставлениеОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "НаименованиеСокращенное");
КонецПроцедуры

&НаКлиенте
Процедура ВвестиКомментарийПоКонтрагенту()
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СверкаСКонтрагентами.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючЗаписи = КлючЗаписиСостояниеСверкиСКонтрагентом(Объект.Организация, ТекущиеДанные.Контрагент);
	
	ПараметрыФормы = Новый Структура;
	Если КлючЗаписи = Неопределено Тогда
		// Передаем значения для заполнения
		ЗначенияЗаполнения = Новый Структура("Организация, Контрагент", Объект.Организация, ТекущиеДанные.Контрагент);
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	Иначе
		// Открываем существующую запись
		ПараметрыФормы.Вставить("Ключ", КлючЗаписи);
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.СостояниеСверкиСКонтрагентами.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КлючЗаписиСостояниеСверкиСКонтрагентом(Организация, Контрагент)
	
	Возврат РегистрыСведений.СостояниеСверкиСКонтрагентами.КлючЗаписиСостояниеСверкиСКонтрагентом(Организация, Контрагент);
	
КонецФункции

&НаСервере
Процедура ЗакрытьБаннер1ССверка()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"ВидимостьБаннера1ССверка",
		"МониторСверкиСКонтрагентами",
		Ложь);
		
	Элементы.ГруппаБаннер.Видимость = Ложь;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидимостьБаннера1ССверка(ИспользуетсяСервисСверкиРасчетов)
	
	Возврат Не ИспользуетсяСервисСверкиРасчетов
		И ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"ВидимостьБаннера1ССверка",
			"МониторСверкиСКонтрагентами",
			Истина);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокНаДату(ТекстЗаголовкаБезДаты, НаДату)
	
	Если Не ЗначениеЗаполнено(НаДату) Тогда
		Возврат ТекстЗаголовкаБезДаты;
	КонецЕсли;
	
	Возврат СтрШаблон(НСтр("ru='%1 на %2'"), ТекстЗаголовкаБезДаты, Формат(НаДату, "ДЛФ=D"));
	
КонецФункции

&НаКлиенте
Функция НовыйОписаниеДействияРасшифровки()
	
	ОписаниеДействия = Новый Структура;
	
	ОписаниеДействия.Вставить("Действие", "");
	ОписаниеДействия.Вставить("ПараметрыРасшифровки", Новый Структура);
	
	Возврат ОписаниеДействия;
	
КонецФункции

&НаКлиенте
Процедура РасшифровкаПослеВыбораИзСписка(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеВыбора = ВыбранноеЗначение.Значение;
	
	Если ЗначениеВыбора.Действие = "ОборотноСальдоваяВедомостьПоСчету" Тогда
		
		Счет = ЗначениеВыбора.ПараметрыРасшифровки.Счет;
		Контрагент = ЗначениеВыбора.ПараметрыРасшифровки.Контрагент;
		
		ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
		ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
		ДополнительныеСвойства.Вставить("Организация",      Объект.Организация);
		ДополнительныеСвойства.Вставить("НачалоПериода",    Объект.ДатаНачала);
		ДополнительныеСвойства.Вставить("КонецПериода",     Объект.ДатаОкончания);
		ДополнительныеСвойства.Вставить("Счет",             Счет);
		ДополнительныеСвойства.Вставить("ПоказательБУ",     Истина);
		ДополнительныеСвойства.Вставить("РежимРасшифровки", Истина);
		ДополнительныеСвойства.Вставить("ПоСубсчетам",      ЗначениеВыбора.ПараметрыРасшифровки.ПоСубсчетам);
		
		// Инициализируем отборы
		ПользовательскиеОтборыДляСчета = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
		ПользовательскиеОтборыДляСчета.ИдентификаторПользовательскойНастройки = "Отбор";
		
		ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
		
		// Группировка передается в отчет как массив структур.
		// Элемент массива содержит структуру описывающую строку таблицы "Группировка" стандартного отчета.
		Группировки = Новый Массив;
		
		Для НомерСубконто = 1 По ДанныеСчета.КоличествоСубконто Цикл
			
			// Отбираем по контрагенту, а по остальным субконто группируем
			ВидСубконто = ДанныеСчета["ВидСубконто" + НомерСубконто];
			Если ВидСубконто = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты") Тогда
				БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(ПользовательскиеОтборыДляСчета, "Субконто" + НомерСубконто, Контрагент);
			Иначе
				ГруппировкаСубконто = Новый Структура;
				ГруппировкаСубконто.Вставить("Поле",           "Субконто" + НомерСубконто);
				ГруппировкаСубконто.Вставить("Представление",  ДанныеСчета["ВидСубконто" + НомерСубконто + "Наименование"]);
				ГруппировкаСубконто.Вставить("Использование",  Истина);
				ГруппировкаСубконто.Вставить("ТипГруппировки", 0);
				Группировки.Добавить(ГруппировкаСубконто);
			КонецЕсли;
			
		КонецЦикла;
		
		ДополнительныеСвойства.Вставить("Группировка", Группировки);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидРасшифровки", 2);
		ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		
		ОткрытьФорму("Отчет.ОборотноСальдоваяВедомостьПоСчету.Форма.ФормаОтчета", ПараметрыФормы, , Истина);
		
	ИначеЕсли ЗначениеВыбора.Действие = "ОткрытьФорму" Тогда
		
		ОткрытьФорму(ЗначениеВыбора.ПараметрыРасшифровки.ИмяФормы, ЗначениеВыбора.ПараметрыРасшифровки.ПараметрыФормы, ЭтотОбъект);
		
	ИначеЕсли ЗначениеВыбора.Действие = "РасшифровкаСервисаСверки" Тогда
		
		ПараметрыОтчета = Новый Структура;
		ПараметрыОтчета.Вставить("РежимРасшифровки", Истина);
		ПараметрыОтчета.Вставить("Организация",   Объект.Организация);
		ПараметрыОтчета.Вставить("Контрагент",    ЗначениеВыбора.ПараметрыРасшифровки.Контрагент);
		ПараметрыОтчета.Вставить("НачалоПериода", Объект.ДатаНачала);
		ПараметрыОтчета.Вставить("КонецПериода",  Объект.ДатаОкончания);
		
		ОткрытьФорму("Отчет.СверкаРасчетовСКонтрагентами.Форма.ФормаОтчета", ПараметрыОтчета);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоЭлектроннойПочтеНастройкаУчетнойЗаписиПредложена(УчетнаяЗаписьНастроена, ДополнительныеПараметры) Экспорт
	
	Если УчетнаяЗаписьНастроена <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПисьма = РаботаСПочтовымиСообщениямиКлиент.ПараметрыОтправкиПисьма();
	ПараметрыПисьма.Получатель = "bp@1c.ru";
	ПараметрыПисьма.Тема = НСтр("ru = 'Отзыв о функциональности ""Монитор сверки с контрагентами""'");
	
	РаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыПисьма);
	
КонецПроцедуры

&НаСервере
Функция КонтрагентДляОбновленияПослеЗаписиАктаСверки(АктСверки)
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		АктСверки,
		"Организация, Контрагент, ДатаНачала, ДатаОкончания");
	
	Если РеквизитыДокумента.Организация = Объект.Организация
		 И РеквизитыДокумента.ДатаНачала <= Объект.ДатаОкончания
		 И РеквизитыДокумента.ДатаОкончания >= Объект.ДатаНачала Тогда
		Возврат РеквизитыДокумента.Контрагент;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПодготовитьСписокДляПечатиНаСервере()
	
	ТабличныйДокумент = Новый ТабличныйДокумент;

	Макет = Обработки.МониторСверкиСКонтрагентами.ПолучитьМакет("ПФ_MXL_СостояниеСверкиСКонтрагентами");
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт; 
	
	ОбластьПечати = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПечати.Параметры.ДатаОкончания = Формат(Объект.ДатаОкончания, "ДЛФ=DD");
	ТабличныйДокумент.Вывести(ОбластьПечати);
	
	ОбластьПечати = Макет.ПолучитьОбласть("РеквизитыОрганизации");
	ОбластьПечати.Параметры.ПредставлениеОрганизации = ПредставлениеОрганизации;
	ТабличныйДокумент.Вывести(ОбластьПечати); 
	
	ОбластьПечати = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Если ПользовательУправляетСчетамиУчета Тогда
		ОбластьПечати.Параметры.ОстатокЗаголовок = ЗаголовокНаДату(НСтр("ru='Остаток'"), Объект.ДатаОкончания);
		ОбластьПечати.Параметры.ДебиторскаяЗадолженностьЗаголовок =  НСтр("ru='Дебет'");
		ОбластьПечати.Параметры.КредиторскаяЗадолженностьЗаголовок = НСтр("ru='Кредит'");
	Иначе
		ОбластьПечати.Параметры.ОстатокЗаголовок = ЗаголовокНаДату(НСтр("ru='Долг'"), Объект.ДатаОкончания);
		ОбластьПечати.Параметры.ДебиторскаяЗадолженностьЗаголовок =  НСтр("ru='Контрагента'");
		ОбластьПечати.Параметры.КредиторскаяЗадолженностьЗаголовок = НСтр("ru='Организации'");
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьПечати);
	
	КонтекстРассылки = РассылкаЗапросовНаСверку.НовыйКонтекстРассылки();
	КонтекстРассылки.ВариантПолучателя = ВариантПолучателяРассылки;
	Если Не ЗначениеЗаполнено(КонтекстРассылки.ВариантПолучателя) Тогда
		КонтекстРассылки.ВариантПолучателя = Перечисления.ВариантыПолучателяЗапросаСверки.ОсновнойEmail;
	КонецЕсли;
	
	КонтекстРассылки.РольКонтактногоЛица = РольКонтактногоЛицаРассылки;
	
	КонтактнаяИнформацияКонтрагентов = РассылкаЗапросовНаСверку.ПолучателиРассылки(
		СверкаСКонтрагентами.Выгрузить(, "Контрагент"));
	РассылкаЗапросовНаСверку.ЗаполнитьКонтактнуюИнформациюПолучателейРассылки(
		КонтактнаяИнформацияКонтрагентов, КонтекстРассылки);
	
	КонтактнаяИнформацияКонтрагентов.Индексы.Добавить("Контрагент");
		
	НомерСтроки = 0;
	
	Для Каждого СтрокаСверки Из СверкаСКонтрагентами Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		ОбластьПечати = Макет.ПолучитьОбласть("СтрокаТаблицы");
		
		КонтактнаяИнформацияКонтрагента = КонтактнаяИнформацияКонтрагентов.Найти(СтрокаСверки.Контрагент, "Контрагент");
		
		Если КонтактнаяИнформацияКонтрагента <> Неопределено Тогда
			ОбластьПечати.Параметры.Заполнить(КонтактнаяИнформацияКонтрагента);
		КонецЕсли;
		
		ОбластьПечати.Параметры.НомерСтроки = НомерСтроки;
		ОбластьПечати.Параметры.Заполнить(СтрокаСверки);
		
		Если Не ЗначениеЗаполнено(СтрокаСверки.СостояниеСверки) Тогда
			ОбластьПечати.Параметры.СостояниеСверки = НСтр("ru='Не выполнялась'");
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьПечати);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

#Область РассылкаЗапросовНаСверку

&НаКлиенте
Процедура ЗапроситьСверкиПослеПросмотраИнструкции(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьПомощникРассылки();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРежимРассылки(Включить, Ошибки = Неопределено)
	
	Если Включить Тогда
		ПодготовитьРассылку(, Ошибки);
	Иначе
		// При выходе из режима рассылки снимем флажки
		Для Каждого СтрокаТЗ Из СверкаСКонтрагентами Цикл
			СтрокаТЗ.Выбран = Ложь;
		КонецЦикла;
		
		УстановитьФильтрПроблемных(ЭтотОбъект, Ложь);
		
	КонецЕсли;
	
	РежимРассылки = Включить;
	НастроитьЭлементыРежимаРассылки(ЭтотОбъект, РежимРассылки);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьРассылку(Контрагент = Неопределено, Ошибки = Неопределено)
	
	Если Контрагент = Неопределено Тогда
		// Все контрагенты
		ТаблицаКонтрагентов = СверкаСКонтрагентами.Выгрузить(, "Контрагент");
		ПолучателиРассылки = РассылкаЗапросовНаСверку.ПолучателиРассылки(ТаблицаКонтрагентов);
	Иначе
		// Только переданный
		ПолучателиРассылки = РассылкаЗапросовНаСверку.ПолучателиРассылки();
		ПолучателиРассылки.Добавить().Контрагент = Контрагент;
	КонецЕсли;
	
	КонтекстРассылки = РассылкаЗапросовНаСверку.НовыйКонтекстРассылки();
	КонтекстРассылки.НастройкаРассылки   = НастройкаРассылки;
	КонтекстРассылки.УчетнаяЗапись       = УчетнаяЗаписьРассылки;
	КонтекстРассылки.ВариантПолучателя   = ВариантПолучателяРассылки;
	КонтекстРассылки.РольКонтактногоЛица = РольКонтактногоЛицаРассылки;
	
	РассылкаЗапросовНаСверку.ЗаполнитьКонтактнуюИнформациюПолучателейРассылки(ПолучателиРассылки, КонтекстРассылки);
	
	СоставНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		НастройкаРассылки,
		"Наименование, ПорядокСверки, ЗапрашиватьОригиналы, СпособЗапросаПоЭДО");
	
	// Кэшируем реквизиты настройки, чтобы далее использовать при обработке событий формы
	ПорядокСверкиРасчетовСКонтрагентами = СоставНастройки.ПорядокСверки;
	Элементы.ЗапроситьСверки.Заголовок = СоставНастройки.Наименование;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		Если Не ПолучателиРассылки.Количество() Тогда
			Возврат;
		КонецЕсли;
		
		СтрокиКонтрагента = СверкаСКонтрагентами.НайтиСтроки(Новый Структура("Контрагент", Контрагент));
		
		Если Не СтрокиКонтрагента.Количество() Тогда
			Возврат;
		КонецЕсли;
		
		ЗаполнитьСпособРассылкиПоКонтрагенту(СтрокиКонтрагента[0] , ПолучателиРассылки[0], СоставНастройки);
		ЗаполнитьПредставлениеАктаСверкиКРассылке(СтрокиКонтрагента[0]);
		
	Иначе
		
		ПолучателиРассылки.Индексы.Добавить("Контрагент");
		
		Для Каждого СтрокаКонтрагента Из СверкаСКонтрагентами Цикл
			ПолучательРассылки = ПолучателиРассылки.Найти(СтрокаКонтрагента.Контрагент, "Контрагент");
			ЗаполнитьСпособРассылкиПоКонтрагенту(СтрокаКонтрагента, ПолучательРассылки, СоставНастройки);
			ЗаполнитьПредставлениеАктаСверкиКРассылке(СтрокаКонтрагента);
		КонецЦикла;
	
	КонецЕсли;
	
	ОбновитьСчетчикВыбранных(ЭтотОбъект);
	ОбновитьСчетчикПроблемных();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпособРассылкиПоКонтрагенту(СтрокаКонтрагента, СтрокаПолучателяРассылки, СоставНастройки)
	
	// Установим значения по умолчанию - ниже скорректируем, если нужно
	СтрокаКонтрагента.СпособРассылки = "";
	СтрокаКонтрагента.СтатусСпособаРассылки = 0;
	СтрокаКонтрагента.Выбран = Ложь;
	СтрокаКонтрагента.СпособРассылкиЕстьПроблема = Ложь; // для УО и фильтра
	
	Если СтрокаПолучателяРассылки = Неопределено Тогда
		СтрокаКонтрагента.СтатусСпособаРассылки = 2; // ошибка
		СтрокаКонтрагента.СпособРассылкиЕстьПроблема = Истина;
		Возврат;
	КонецЕсли;
	
	НастроенЭДО = Обработки.МониторСверкиСКонтрагентами.НастроенЭДО(СтрокаКонтрагента.ЭДО);
	Если НастроенЭДО
		 И СоставНастройки.СпособЗапросаПоЭДО = Перечисления.СпособыЗапросаСверкиЭДО.ОтправитьАктСверки Тогда
		// Акт сверки по ЭДО
		СтрокаКонтрагента.СпособРассылки = Нстр("ru='По ЭДО'");
		СтрокаКонтрагента.СтатусСпособаРассылки = 1;
		СтрокаКонтрагента.Выбран = Истина;
	ИначеЕсли НастроенЭДО
		 И СоставНастройки.СпособЗапросаПоЭДО = Перечисления.СпособыЗапросаСверкиЭДО.НеОтправлять Тогда
		СтрокаКонтрагента.СпособРассылки = Нстр("ru='Не отправлять'");
		СтрокаКонтрагента.СтатусСпособаРассылки = 1;
	Иначе
		// Нужен e-mail (в том числе для тех, у кого настроен ЭДО)
		Если Не ЗначениеЗаполнено(СтрокаПолучателяРассылки.АдресЭлектроннойПочты)
			 И ВариантПолучателяРассылки = Перечисления.ВариантыПолучателяЗапросаСверки.КонтактноеЛицоСРолью Тогда
			СтрокаКонтрагента.СпособРассылки = Нстр("ru='Укажите e-mail для сверки'");
			СтрокаКонтрагента.СтатусСпособаРассылки = 2; // ошибка
			СтрокаКонтрагента.СпособРассылкиЕстьПроблема = Истина; // для УО и фильтра
		ИначеЕсли Не ЗначениеЗаполнено(СтрокаПолучателяРассылки.АдресЭлектроннойПочты) Тогда
			СтрокаКонтрагента.СпособРассылки = Нстр("ru='Укажите e-mail'");
			СтрокаКонтрагента.СтатусСпособаРассылки = 2;
			СтрокаКонтрагента.СпособРассылкиЕстьПроблема = Истина;
		ИначеЕсли ВариантПолучателяРассылки = Перечисления.ВариантыПолучателяЗапросаСверки.КонтактноеЛицоСРолью
			 И СтрокаПолучателяРассылки.ИсточникАдреса <> "КонтактноеЛицоДляСверки" Тогда
			// Указан только общий e-mail
			СтрокаКонтрагента.СпособРассылки = СтрШаблон(
				Нстр("ru='%1 (не найден e-mail для сверки)'"),
				СтрокаПолучателяРассылки.АдресЭлектроннойПочты);
			СтрокаКонтрагента.СтатусСпособаРассылки = 3; // предуреждение
			СтрокаКонтрагента.Выбран = Истина;
			СтрокаКонтрагента.СпособРассылкиЕстьПроблема = Истина;
		Иначе
			СтрокаКонтрагента.СпособРассылки = СтрокаПолучателяРассылки.АдресЭлектроннойПочты;
			СтрокаКонтрагента.Выбран = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеАктаСверкиКРассылке(СтрокаСверки)
	
	Если Не СтрокаСверки.ТребуетсяАктСверки И ЗначениеЗаполнено(СтрокаСверки.АктСверки) Тогда
		СтрокаСверки.АктСверкиКРассылке = СтрокаСверки.АктСверкиПредставление;
	Иначе
		СтрокаСверки.АктСверкиКРассылке = СтрШаблон(
			Нстр("ru='Будет создан по %1'"),
			Формат(Объект.ДатаОкончания, "ДФ=dd.MM.yy;"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьЭлементыРежимаРассылки(Форма, РежимРассылки = Ложь)
	
	Элементы = Форма.Элементы;
	
	Если РежимРассылки Тогда
		Элементы.ГруппаШапка.ЦветФона = Форма.ЦветаФормы.ЦветФонаФормы;
		Элементы.ГруппаБаннер.ЦветФона = Форма.ЦветаФормы.ЦветФонаФормы;
	Иначе
		Элементы.ГруппаШапка.ЦветФона = Форма.ЦветаФормы.БыстрыеОтборыФонГруппы;
		Элементы.ГруппаШапка.ЦветФона = Форма.ЦветаФормы.ЦветБаннера;
	КонецЕсли;
	
	Элементы.ГруппаШапка.Доступность =               Не РежимРассылки;
	Элементы.ГруппаБаннер.Доступность =              Не РежимРассылки;
	
	// Баннер рассылки остается видимым, только если выполняется задание рассылки
	Элементы.ГруппаБаннерСостояниеРассылки.Видимость = 
		ЗначениеЗаполнено(Форма.РассылкаЗапросовНаСверкуПоПочте)
		И Форма.РассылкаЗапросовНаСверкуПоПочте.Статус = "Выполняется";
	
	Элементы.ПанельУправленияРассылкой.Видимость =   РежимРассылки;
	Элементы.ГруппаСортировка.Видимость =            Не РежимРассылки;
	Элементы.КомандыСписка.Видимость =               Не РежимРассылки;
	Элементы.БыстрыеНастройки.Доступность =          Не РежимРассылки;
	
	Элементы.Выбран.Видимость =                      РежимРассылки;
	Элементы.ГруппаСпособРассылки.Видимость =        РежимРассылки;
	Элементы.ГруппаАктСверки.Видимость =             РежимРассылки
		И Форма.ПорядокСверкиРасчетовСКонтрагентами = ПредопределенноеЗначение("Перечисление.ПорядокСверкиРасчетовСКонтрагентами.ОтправитьНашАктСверки");
	
	Элементы.НастроитьРассылку.Видимость = ЗначениеЗаполнено(Форма.НастройкаРассылки);
	Элементы.ЗапуститьРассылку.КнопкаПоУмолчанию =   РежимРассылки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНастройкиРассылки(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		// Пользователь просто закрыл форму, ничего не делаем.
		Возврат;
	КонецЕсли;
	
	// Пользователь выбрал настройку и нажал "Перейти к рассылке".
	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		
		НастройкаРассылки = РезультатЗакрытия.НастройкаРассылки;
		УчетнаяЗаписьРассылки = РезультатЗакрытия.УчетнаяЗапись;
		ВариантПолучателяРассылки = РезультатЗакрытия.ВариантПолучателя;
		РольКонтактногоЛицаРассылки = РезультатЗакрытия.РольКонтактногоЛица;
		
		Ошибки = Новый Массив;
		УстановитьРежимРассылки(Истина, Ошибки);
		Если Ошибки.Количество() > 0 Тогда
			СодержаниеПредупреждения = Новый Массив;
			СодержаниеПредупреждения.Добавить(НСтр("ru='Обнаружены ошибки при подготовке рассылки:'"));
			СодержаниеПредупреждения.Добавить(Символы.ПС);
			СодержаниеПредупреждения.Добавить(СтрСоединить(Ошибки, Символы.ПС));
			ПоказатьПредупреждение(, СтрСоединить(СодержаниеПредупреждения), , НСтр("ru='Ошибки при подготовке рассылки'"));
			УстановитьРежимРассылки(Ложь);
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСчетчикВыбранных(Форма)
	
	Элементы = Форма.Элементы;
	
	Всего = Форма.СверкаСКонтрагентами.Количество();
	Выбрано = Форма.СверкаСКонтрагентами.НайтиСтроки(Новый Структура("Выбран", Истина)).Количество();
	
	ТекстСчетчика = СтрШаблон("Запустить рассылку по %1 из %2 контрагентов", Выбрано, Всего);
	Элементы.ЗапуститьРассылку.Заголовок = ТекстСчетчика;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСчетчикПроблемных()
	
	ТекстСообщения = "";
	ТекстКнопки = "";
	
	Проблемных = СверкаСКонтрагентами.НайтиСтроки(
		Новый Структура("СпособРассылкиЕстьПроблема", Истина)).Количество();
	
	Если ТолькоПроблемные Тогда
		
		ТекстСообщения = НСтр("ru='Показаны только проблемные'");
		ТекстКнопки = НСтр("ru='Показать всех'");
		
	Иначе
		
		ТекстСообщения = СтрШаблон(
			НСтр("ru='Обнаружены проблемы у %1'"),
			ПолучитьСклоненияСтрокиПоЧислу(
				"контрагент",
				Проблемных,
				"",
				"Л= ru_RU; ЧС=Количественное",
				"ПД=Родительный;ПЧ=Число")[0]);
		ТекстКнопки = НСтр("ru='Показать только их'");
		
	КонецЕсли;
	
	Элементы.НадписьОбнаруженыПроблемы.Заголовок = ТекстСообщения;
	Элементы.ПоказатьТолькоПроблемных.Заголовок = ТекстКнопки;
	
	Элементы.ГруппаОбнаруженыПроблемы.Видимость = (Проблемных > 0);
	
	Если Проблемных = 0 Тогда
		УстановитьФильтрПроблемных(ЭтотОбъект, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФильтрПроблемных(Форма, Включить = Истина)
	
	Элементы = Форма.Элементы;
	Форма.ТолькоПроблемные = Включить;
	
	Если Включить Тогда
		Элементы.СверкаСКонтрагентами.ОтборСтрок = Новый ФиксированнаяСтруктура("СпособРассылкиЕстьПроблема", Истина);
	Иначе
		Элементы.СверкаСКонтрагентами.ОтборСтрок = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция АдресДанныхКонтрагентаВоВременномХранилище(ИндексСтроки)
	
	ДанныеКонтрагента = СверкаСКонтрагентами.Выгрузить(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СверкаСКонтрагентами[ИндексСтроки]),
		"Контрагент, НаименованиеКонтрагента, НетОригиналовКоличество, ЭДО, ТребуетсяАктСверки, АктСверки, СервисСверкиИспользуется");
	Возврат ПоместитьВоВременноеХранилище(ДанныеКонтрагента, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ЗапуститьРассылкуНаСервере()
	
	РассылкаЗапросовНаСверкуПоПочте = Неопределено;
	ПодготовкаОбъектовРассылкиЭДОВФоне = Неопределено;
	
	Справочники.РассылкиСообщений.ЗавершитьОтправленныеРассылки();
	
	ТаблицаКонтрагентов = СверкаСКонтрагентами.Выгрузить(
		Новый Структура("Выбран", Истина),
		"Контрагент, НаименованиеКонтрагента, НетОригиналовКоличество, ЭДО, ТребуетсяАктСверки, АктСверки, СервисСверкиИспользуется");
	
	РассылкаПоПочте = ТаблицаКонтрагентов.СкопироватьКолонки();
	РассылкаПоЭДО = ТаблицаКонтрагентов.СкопироватьКолонки("Контрагент, ЭДО, ТребуетсяАктСверки, АктСверки");
	
	ПодключенЭДО = НастройкиЭДО.ИспользуетсяОбменЭлектроннымиДокументами();
	СоставНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		НастройкаРассылки,
		"ПорядокСверки, СпособЗапросаПоЭДО, РазбитьПоДоговорам, ВыводитьПолныеНазванияДокументов, ВыводитьСчетаФактуры");
	
	Для Каждого СтрокаКонтрагента Из ТаблицаКонтрагентов Цикл
		
		НастроенЭДОСКонтрагентом = Обработки.МониторСверкиСКонтрагентами.НастроенЭДО(СтрокаКонтрагента.ЭДО);
		
		Если ПодключенЭДО И НастроенЭДОСКонтрагентом
			 И СоставНастройки.СпособЗапросаПоЭДО = Перечисления.СпособыЗапросаСверкиЭДО.ОтправитьАктСверки Тогда
			ЗаполнитьЗначенияСвойств(РассылкаПоЭДО.Добавить(), СтрокаКонтрагента);
		ИначеЕсли Не ПодключенЭДО Или Не НастроенЭДОСКонтрагентом
			 Или СоставНастройки.СпособЗапросаПоЭДО = Перечисления.СпособыЗапросаСверкиЭДО.ОтправитьПисьмо Тогда 
			ЗаполнитьЗначенияСвойств(РассылкаПоПочте.Добавить(), СтрокаКонтрагента);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщиеПараметрыСверки = Обработки.МониторСверкиСКонтрагентами.ОбщиеПараметрыСверки(
		Объект.Организация,
		Объект.ДатаНачала,
		Объект.ДатаОкончания);
	
	СпециальныеПараметрыРассылки = РассылкаЗапросовНаСверку.НовыйПараметрыРассылки();
	ЗаполнитьЗначенияСвойств(СпециальныеПараметрыРассылки, ОбщиеПараметрыСверки);
	
	СчетаУчетаРасчетов = СчетаРасчетовСПоставщиками.ВыгрузитьЗначения();
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		СчетаУчетаРасчетов,
		СчетаРасчетовСПокупателями.ВыгрузитьЗначения(),
		Истина);
	
	СпециальныеПараметрыРассылки.СчетаУчетаРасчетов = СчетаУчетаРасчетов;
	СпециальныеПараметрыРассылки.НастройкаРассылки = НастройкаРассылки;
	
	ПодготовкаОбъектовРассылкиЭДОВФоне = Неопределено;
	
	Если РассылкаПоЭДО.Количество() Тогда
		
		// Запустим создание актов сверки для отправки по ЭДО 
		ПараметрыПроцедуры = Новый Структура;
		РассылкаПоЭДО.Колонки.Контрагент.Имя = "Получатель";
		ПараметрыПроцедуры.Вставить("Получатели", РассылкаПоЭДО);
		ПараметрыПроцедуры.Вставить("ПараметрыСверки", СпециальныеПараметрыРассылки);
		ПараметрыПроцедуры.Вставить("Настройка", СоставНастройки);
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Создание актов сверки для рассылки по ЭДО.'");
		
		ПодготовкаОбъектовРассылкиЭДОВФоне = ДлительныеОперации.ВыполнитьВФоне(
			"РассылкаЗапросовНаСверку.СоздатьАктыСверкиПоПолучателямРассылкиВФоне",
			ПараметрыПроцедуры,
			ПараметрыВыполнения);
		
	КонецЕсли;
	
	Если РассылкаПоПочте.Количество() Тогда
		
		КонтекстРассылки = РассылкаЗапросовНаСверку.НовыйКонтекстРассылки();
		КонтекстРассылки.НастройкаРассылки   = НастройкаРассылки;
		КонтекстРассылки.УчетнаяЗапись       = УчетнаяЗаписьРассылки;
		КонтекстРассылки.ВариантПолучателя   = ВариантПолучателяРассылки;
		КонтекстРассылки.РольКонтактногоЛица = РольКонтактногоЛицаРассылки;
		
		Ошибки = Новый Массив;
		
		ПолучателиРассылки = РассылкаЗапросовНаСверку.ПолучателиРассылки(РассылкаПоПочте);
		РассылкаЗапросовНаСверку.ЗаполнитьСообщенияПолучателямРассылки(
			ПолучателиРассылки, КонтекстРассылки, ОбщиеПараметрыСверки, Ошибки);
		ПолучателиРассылки.Колонки.Контрагент.Имя = "Получатель";
		
		Если Ошибки.Количество() Тогда
			ВызватьИсключение(НСтр("ru = 'Возникли ошибки при выборке данных получателей рассылки:
				|%1'"), СтрСоединить(Ошибки, Символы.ПС));
		КонецЕсли;
		
		ПараметрыРассылки = РассылкаСообщений.НовыйПараметрыРассылки();
		ПараметрыРассылки.Получатели        = ПолучателиРассылки;
		ПараметрыРассылки.УчетнаяЗапись     = УчетнаяЗаписьРассылки;
		ПараметрыРассылки.ВидРассылки       = Перечисления.ВидыРассылокСообщений.ЗапросНаСверку;
		
		РассылкаЗапросовНаСверкуПоПочте =  РассылкаСообщений.ЗапуститьФоновоеЗаданиеЗаписатьОчередьИОтправитьСообщения(
			ПараметрыРассылки, СпециальныеПараметрыРассылки);
		
		// Иногда задание запускается не сразу (например, в файловой базе может ждать окончания другого фонового задания).
		// И для того, чтобы баннер прогресса всегда был навиду, сразу его выведем. После запуска задания баннер обновится
		// реальным состоянием прогресса.
		ДанныеБаннера = РегистрыСведений.РассылкаСообщений.НовыйДанныеБаннера();
		ДанныеБаннера.ТекстБаннера = НСтр("ru='Ожидание запуска рассылки...'");
		ПоказатьБаннерСостояниеРассылкиЗапросовНаСверку(ДанныеБаннера);
		
	КонецЕсли;
	
	УстановитьРежимРассылки(Ложь);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПередЗапускомРассылки()
	
	ЕстьОшибки = Ложь;
	
	Для Каждого СтрокаКонтрагента Из СверкаСКонтрагентами Цикл
		Если СтрокаКонтрагента.Выбран И СтрокаКонтрагента.СтатусСпособаРассылки = 2 Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru='Невозможно отправить сообщение для %1'"), СтрокаКонтрагента.НаименованиеКонтрагента),
				,
				СтрШаблон("СверкаСКонтрагентами[%1].СпособРассылки", Формат(СверкаСКонтрагентами.Индекс(СтрокаКонтрагента), "ЧН=;")),
				,
				ЕстьОшибки);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаКлиенте
Процедура ПодготовкаОбъектовРассылкиЭДОЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Или Результат.Статус <> "Выполнено" Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураРезультата = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ОбъектыУчета", СтруктураРезультата.АктыСверки);
	ПараметрыОповещения.Вставить("Контрагенты", СтруктураРезультата.Контрагенты);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("РассылкаПоЭДОЗавершение", ЭтотОбъект, ПараметрыОповещения);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Источник", ЭтотОбъект);
	ДополнительныеПараметры.Вставить("Оповещение", ОповещениеОЗавершении);
	
	ЭлектронныеДокументыЭДОКлиент.СформироватьПодписатьОтправитьЭД(СтруктураРезультата.АктыСверки, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура РассылкаПоЭДОЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Свойство("ОшибкиФормирования") И Результат.ОшибкиФормирования.Количество() Тогда
		
		ПараметрыОбработки = ИнтерфейсДокументовЭДОКлиентСервер.НовыеПараметрыПроблемПриОбработкеДокументов();
		ПараметрыОбработки.АдресСведенийОбОшибках = ПоместитьВоВременноеХранилище(Результат.ОшибкиФормирования,
			УникальныйИдентификатор);
		Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
			 И ДополнительныеПараметры.Свойство("ОбъектыУчета") Тогда
			ПараметрыОбработки.СписокДокументовКОтправке = ДополнительныеПараметры.ОбъектыУчета;
		КонецЕсли;
		Оповещение = Новый ОписаниеОповещения("РассылкаПоЭДООбработкаОшибокЗавершение", 
			ЭтотОбъект, ДополнительныеПараметры);
		ИнтерфейсДокументовЭДОКлиент.ПоказатьПроблемыПриОбработкеДокументов(Оповещение, ПараметрыОбработки);
		
	Иначе
		
		ЗаполнитьДаннымиБухгалтерскогоУчетаНаКлиенте(, ДополнительныеПараметры.Контрагенты);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассылкаПоЭДООбработкаОшибокЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	
	Если Результат <> Неопределено Тогда
		ОповещениеЗавершения = Новый ОписаниеОповещения("РассылкаПоЭДОЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(ОповещениеЗавершения, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрогрессВыполненияФоновогоЗаданияРассылки(ПараметрыФоновогоЗадания, ДополнительныеПараметры) Экспорт
	
	Если ПараметрыФоновогоЗадания.Прогресс <> Неопределено Тогда
		
		ОписаниеПрогресса = ПараметрыФоновогоЗадания.Прогресс.ДополнительныеПараметры;
		
		Если ОписаниеПрогресса.Состояние = "НачатаРассылкаСообщений" Тогда
			// Завершена запись очереди - теперь подключим отдельное фоновое задание по отслеживанию прогресса
			// непосредственно отправки сообщений. Но перед этим пересчитаем массив незавершенных рассылок - добавим
			// туда вновь созданную.
			ОбновитьНезавершенныеРассылкиИПроверитьСостояние(ОписаниеПрогресса.РассылкаСообщений);
		Иначе
			// В ином случае обновляем данные баннера - текст состояния
			ПоказатьБаннерСостояниеРассылкиЗапросовНаСверку(ОписаниеПрогресса.Баннер);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускРассылкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Или Результат.Статус <> "Выполнено" Тогда
		Возврат;
	КонецЕсли;
	
	РассылкаЗапросовНаСверкуПоПочте = Неопределено;
	
	РассылкаСообщений = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Если РассылкаСообщений = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Если "промежуточные" сообщения прогресса не успели дойти до клиента, то проверка состояния рассылки не запущена.
	// Запустим ее здесь по окончании длительной операции рассылки.
	Если ПроверкаСостоянияРассылкиЗапросовНаСверкуВФоне = Неопределено Тогда
		ОбновитьНезавершенныеРассылкиИПроверитьСостояние(РассылкаСообщений);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНезавершенныеРассылкиИПроверитьСостояние(ТекущаяРасылка)
	
	ТекущиеРассылки = НезавершенныеРассылки();
	// Если в рассылке немного сообщений, то она может быть уже завершена. В этом случае добавим в массив
	// эту последнюю инициированную из монитора рассылку.
	Если Не ЗначениеЗаполнено(ТекущиеРассылки) Тогда
		ТекущиеРассылки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущаяРасылка);
	ИначеЕсли ТекущиеРассылки.Найти(ТекущаяРасылка) = Неопределено Тогда
		ТекущиеРассылки.Добавить(ТекущаяРасылка);
	КонецЕсли;
	НезавершенныеРассылки = Новый ФиксированныйМассив(ТекущиеРассылки);
	Подключаемый_ЗапуститьПроверкуСостоянияРассылкиЗапросов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросСоздатьАктСверки(Результат, ТекущаяСтрока) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	АктСверки = СоздатьАктСверки(ТекущаяСтрока);
	
	// В целях предвартельного просмотра заполним данные по акту сверки. Ниже могут измениться
	// после обновления данных по контрагенту. 
	СтрокаСверки = СверкаСКонтрагентами.НайтиПоИдентификатору(ТекущаяСтрока);
	СтрокаСверки.АктСверки = АктСверки;
	СтрокаСверки.ТребуетсяАктСверки = Ложь;
	
	ОткрытьПомощникРассылки(ТекущаяСтрока, Истина);
	
	// Запустим обновление строки контрагента с учетом введенного акта сверки.
	ЗаполнитьДаннымиБухгалтерскогоУчетаНаКлиенте(,
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СверкаСКонтрагентами.НайтиПоИдентификатору(ТекущаяСтрока).Контрагент));
	
КонецПроцедуры

&НаСервере
Функция СоздатьАктСверки(ТекущаяСтрока)
	
	Если ТипЗнч(ТекущаяСтрока) = Тип("Число") Тогда
		ТекущиеДанные = СверкаСКонтрагентами.НайтиПоИдентификатору(ТекущаяСтрока);
	Иначе
		ТекущиеДанные = ТекущаяСтрока;
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация",   Объект.Организация);
	ДанныеЗаполнения.Вставить("ДатаНачала",    Объект.ДатаНачала);
	ДанныеЗаполнения.Вставить("ДатаОкончания", Объект.ДатаОкончания);
	ДанныеЗаполнения.Вставить("Контрагент"   , ТекущиеДанные.Контрагент);
	ДанныеЗаполнения.Вставить("ЗаполнитьПоДаннымОрганизации", Истина);
	
	Если Обработки.МониторСверкиСКонтрагентами.НастроенЭДО(ТекущиеДанные) Тогда
		ДанныеЗаполнения.Вставить("ЭтоЭлектронныйДокумент", Истина);
	КонецЕсли;
	
	СчетаУчетаРасчетов = СчетаРасчетовСПоставщиками.ВыгрузитьЗначения();
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		СчетаУчетаРасчетов,
		СчетаРасчетовСПокупателями.ВыгрузитьЗначения(),
		Истина);
	
	ДанныеЗаполнения.Вставить("СчетаУчетаРасчетов", СчетаУчетаРасчетов);
	
	СоставНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		НастройкаРассылки, "РазбитьПоДоговорам, ВыводитьПолныеНазванияДокументов, ВыводитьСчетаФактуры");	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДанныеЗаполнения, СоставНастройки);
	
	АктСверки = Документы.АктСверкиВзаиморасчетов.СоздатьДокумент();
	АктСверки.Заполнить(ДанныеЗаполнения);
	
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(АктСверки,,, РежимЗаписиДокумента.Проведение);
	
	Возврат АктСверки.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьПомощникРассылки(ТекущаяСтрока = Неопределено, ПредварительныйПросмотр = Ложь)
	
	Если ЗначениеЗаполнено(ТекущаяСтрока) Тогда
		ТекущиеДанные = СверкаСКонтрагентами.НайтиПоИдентификатору(ТекущаяСтрока);
	ИначеЕсли СверкаСКонтрагентами.Количество() > 0 Тогда
		// Берем первого контрагента в списке для формирования предпросмотра.
		ТекущиеДанные = СверкаСКонтрагентами[0];
	Иначе
		ПоказатьПредупреждение(, НСтр("ru='Список контрагентов пустой. Настройка рассылки невозможна.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация",             Объект.Организация);
	ПараметрыФормы.Вставить("ДатаНачала",              Объект.ДатаНачала);
	ПараметрыФормы.Вставить("ДатаОкончания",           Объект.ДатаОкончания);
	ПараметрыФормы.Вставить("НастройкаРассылки",       НастройкаРассылки);
	ПараметрыФормы.Вставить("УчетнаяЗапись",           УчетнаяЗаписьРассылки);
	ПараметрыФормы.Вставить("ВариантПолучателя",       ВариантПолучателяРассылки);
	ПараметрыФормы.Вставить("РольКонтактногоЛица",     РольКонтактногоЛицаРассылки);
	
	ПараметрыФормы.Вставить("Контрагент",              ТекущиеДанные.Контрагент);
	ПараметрыФормы.Вставить("НаименованиеКонтрагента", ТекущиеДанные.НаименованиеКонтрагента);
	ПараметрыФормы.Вставить("ПредварительныйПросмотр", ПредварительныйПросмотр);
	
	ИндексСтроки = СверкаСКонтрагентами.Индекс(ТекущиеДанные);
	ПараметрыФормы.Вставить("АдресДанныхКонтрагента",  АдресДанныхКонтрагентаВоВременномХранилище(ИндексСтроки));
	
	Если ПредварительныйПросмотр Тогда
		// Не требуется оповещение
		ОткрытьФорму(
			"Обработка.МониторСверкиСКонтрагентами.Форма.ПомощникРассылки",
			ПараметрыФормы,
			ЭтотОбъект,
			,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОткрытьФорму(
			"Обработка.МониторСверкиСКонтрагентами.Форма.ПомощникРассылки",
			ПараметрыФормы,
			ЭтотОбъект,
			,,,
			Новый ОписаниеОповещения("ПослеВыбораНастройкиРассылки", ЭтотОбъект),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросОстановитьРассылкуЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ОстановитьРассылкуНаСервере();
		Если ПроверкаСостоянияРассылкиЗапросовНаСверкуВФоне = Неопределено Тогда
			Подключаемый_ЗапуститьПроверкуСостоянияРассылкиЗапросов();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОстановитьРассылкуНаСервере()
	
	Если ЗначениеЗаполнено(РассылкаЗапросовНаСверкуПоПочте)
		 И РассылкаЗапросовНаСверкуПоПочте.Статус = "Выполняется" Тогда
		
		ДлительныеОперации.ОтменитьВыполнениеЗадания(РассылкаЗапросовНаСверкуПоПочте.ИдентификаторЗадания);
		РассылкаЗапросовНаСверкуПоПочте = Неопределено;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПодготовкаОбъектовРассылкиЭДОВФоне)
		 И ПодготовкаОбъектовРассылкиЭДОВФоне.Статус = "Выполняется" Тогда
		
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ПодготовкаОбъектовРассылкиЭДОВФоне.ИдентификаторЗадания);
		ПодготовкаОбъектовРассылкиЭДОВФоне = Неопределено;
	
	КонецЕсли;
	
	ТекущиеРассылки = НезавершенныеРассылки();
	НезавершенныеРассылки = Новый ФиксированныйМассив(ТекущиеРассылки);
	Если ТекущиеРассылки.Количество() Тогда
		РассылкаСообщений.ОтменитьРассылку(ТекущиеРассылки);
		Справочники.РассылкиСообщений.ЗавершитьОтправленныеРассылки();
	Иначе
		// Не успели создать рассылку до отмены операции - тогда просто скроем баннер
		Элементы.ГруппаБаннерСостояниеРассылки.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область БаннерСостояниеРассылкиЗапросов

&НаСервереБезКонтекста
Функция НезавершенныеРассылки()
	
	Возврат Справочники.РассылкиСообщений.НезавершенныеРассылки(
		Перечисления.ВидыРассылокСообщений.ЗапросНаСверку);
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ЗапуститьПроверкуСостоянияРассылкиЗапросов() Экспорт
	
	ПроверкаСостоянияРассылкиЗапросовНаСверкуВФоне = СостояниеРассылкиЗапросовНаСверкуВФоне(
		Новый Массив(НезавершенныеРассылки), // конвертируем кэшированный ФиксированныйМассив обратно в Массив
		ГраницаАктуальностиСостоянияРассылки,
		УникальныйИдентификатор);
	
	Если ПроверкаСостоянияРассылкиЗапросовНаСверкуВФоне <> Неопределено Тогда
		ОжидатьЗавершенияПолученияСостоянияРассылкиЗапросовНаСверку(ПроверкаСостоянияРассылкиЗапросовНаСверкуВФоне);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СостояниеРассылкиЗапросовНаСверкуВФоне(НезавершенныеРассылки, ГраницаАктуальности, УникальныйИдентификатор)
	
	Если НезавершенныеРассылки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("НезавершенныеРассылки", НезавершенныеРассылки);
	ПараметрыПроцедуры.Вставить("ВыбиратьИзменения", Истина);
	ПараметрыПроцедуры.Вставить("ГраницаАктуальности", ГраницаАктуальности);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверка состояния рассылки запросов на сверку.'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"РегистрыСведений.РассылкаСообщений.ДанныеСостоянияРассылкиСообщенийВФоне",
		ПараметрыПроцедуры,
		ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОжидатьЗавершенияПолученияСостоянияРассылкиЗапросовНаСверку(ДлительнаяОперация)
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ОповещениеПослеПолученияИнформацииОРассылке = Новый ОписаниеОповещения(
		"ОбработатьРезультатПроверкиСостоянияРассылкиЗапросовНаСверку", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ДлительнаяОперация, ОповещениеПослеПолученияИнформацииОРассылке, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатПроверкиСостоянияРассылкиЗапросовНаСверку(Результат, ДополнительныеПараметры) Экспорт
	
	КонтрагентыКОбновлению = Новый Массив;
	ПрочитатьСостояниеРассылкиЗапросовНаСверку(Результат, КонтрагентыКОбновлению);
	
	Если ИнтервалПроверкиСостоянияРассылкиЗапросовНаСверку > 0 Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ЗапуститьПроверкуСостоянияРассылкиЗапросов",
			ИнтервалПроверкиСостоянияРассылкиЗапросовНаСверку, Истина);
	Иначе
		ОтключитьОбработчикОжидания("Подключаемый_ЗапуститьПроверкуСостоянияРассылкиЗапросов");
	КонецЕсли;
	
	Если КонтрагентыКОбновлению.Количество() Тогда
		ЗаполнитьДаннымиБухгалтерскогоУчетаНаКлиенте(, КонтрагентыКОбновлению);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьСостояниеРассылкиЗапросовНаСверку(Результат, КонтрагентыКОбновлению)
	
	Если Не ЗначениеЗаполнено(Результат) Или Результат.Статус <> "Выполнено" Тогда
		Возврат;
	КонецЕсли;
	
	ПроверкаСостоянияРассылкиЗапросовНаСверкуВФоне = Неопределено;
	
	СостояниеРассылки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Если СостояниеРассылки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьБаннерСостояниеРассылкиЗапросовНаСверку(СостояниеРассылки.Баннер);
	
	Если СостояниеРассылки.ГраницаАктуальности > ГраницаАктуальностиСостоянияРассылки Тогда
		// После последнего обновления таблицы монитора произошли изменения в рассылке
		Для Каждого СтрокаИзменения Из СостояниеРассылки.Изменения Цикл
			Если СтрокаИзменения.Организация = Объект.Организация
				 И СтрокаИзменения.ОтчетныйПериодСообщения >= Объект.ДатаНачала
				 И СтрокаИзменения.ОтчетныйПериодСообщения <= Объект.ДатаОкончания Тогда
				КонтрагентыКОбновлению.Добавить(СтрокаИзменения.Получатель);
			КонецЕсли;
		КонецЦикла;
		ГраницаАктуальностиСостоянияРассылки = СостояниеРассылки.ГраницаАктуальности;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПоказатьБаннерСостояниеРассылкиЗапросовНаСверку(ДанныеБаннера)
	
	Элементы.ГруппаБаннерСостояниеРассылки.Видимость = Истина;
	
	Элементы.БаннерСостояниеРассылкиТекст.Заголовок = ДанныеБаннера.ТекстБаннера;
	Элементы.БаннерСостояниеРассылкиКартинка.Картинка = БиблиотекаКартинок[ДанныеБаннера.ИмяКартинкиБаннера];
	Элементы.ГруппаБаннерСостояниеРассылки.ЦветФона = ДанныеБаннера.ЦветБаннера;
	Элементы.КартинкаЗакрытьБаннерРассылки.Видимость = ДанныеБаннера.КартинкаЗакрытьБаннер;
	
	ИнтервалПроверкиСостоянияРассылкиЗапросовНаСверку = ДанныеБаннера.ИнтервалПроверкиСостоянияРассылкиСообщений;
	
	Если ДанныеБаннера.РассылкаЗавершена Тогда
		Элементы.ОстановитьРассылку.Видимость = Ложь;
	Иначе
		Элементы.ОстановитьРассылку.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция ЭлементФормыПоЗаголовку(КоллекцияЭлементов, СтрокаПоиска)
	// Проверяем только группы и поля формы
	Для Каждого Элемент Из КоллекцияЭлементов Цикл
		Если ТипЗнч(Элемент) = Тип("ГруппаФормы") Тогда
			НайденныйЭлемент = ЭлементФормыПоЗаголовку(Элемент.ПодчиненныеЭлементы, СтрокаПоиска);
			Если НайденныйЭлемент <> Неопределено Тогда
				Возврат НайденныйЭлемент;
			КонецЕсли;
			Если СтрНайти(НРег(Элемент.Заголовок), НРег(СтрокаПоиска)) > 0 Тогда
				Возврат Элемент;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Элемент) = Тип("ПолеФормы") И  СтрНайти(НРег(Элемент.Заголовок), НРег(СтрокаПоиска)) > 0 Тогда
			Возврат Элемент;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
