#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция СсылкиКаналаБизнесСтарт() Экспорт

	ТаблицаСсылок = НоваяТаблицаСсылок();
	ДобавитьСсылку("about", НСтр("ru = 'О программе 1С:БизнесСтарт'"), ТаблицаСсылок);
	ДобавитьСсылку("settings", НСтр("ru = 'Настройка 1С:БизнесСтарт и системы налогообложения'"), ТаблицаСсылок);
	ДобавитьСсылку("initial_balances", НСтр("ru = 'Взнос денег ИП и начальные остатки'"), ТаблицаСсылок);
	ДобавитьСсылку("banks", НСтр("ru = 'Работа с банком'"), ТаблицаСсылок);
	ДобавитьСсылку("documents", НСтр("ru = 'Работа со справочниками и документами'"), ТаблицаСсылок);
	ДобавитьСсылку("suppliers_due_diligence", НСтр("ru = 'Работа с поставщиками и проверка благонадёжности'"), ТаблицаСсылок);
	ДобавитьСсылку("inventory", НСтр("ru = 'Работа с товаром и со складом'"), ТаблицаСсылок);
	ДобавитьСсылку("wholesale", НСтр("ru = 'Оптовая продажа покупателю товаров'"), ТаблицаСсылок);
	ДобавитьСсылку("marketplace", НСтр("ru = 'Работа с маркетплейсами и комиссионными продажами'"), ТаблицаСсылок);
	ДобавитьСсылку("retail", НСтр("ru = 'Розничные продажи'"), ТаблицаСсылок);
	ДобавитьСсылку("production", НСтр("ru = 'Производство товаров и выпуск готовой продукции'"), ТаблицаСсылок, Ложь);
	ДобавитьСсылку("staff", НСтр("ru = 'Прием на работу сотрудников'"), ТаблицаСсылок, Ложь);
	ДобавитьСсылку("salary", НСтр("ru = 'Начисление и выплата зарплаты'"), ТаблицаСсылок, Ложь);
	ДобавитьСсылку("insurance_pay", НСтр("ru = 'Уплата страховых взносов за сотрудников'"), ТаблицаСсылок, Ложь);
	ДобавитьСсылку("reporting", НСтр("ru = 'Подготовка и сдача отчётности'"), ТаблицаСсылок, Ложь);
	ДобавитьСсылку("crm", НСтр("ru = 'Взаимодействие с лидами и покупателями (CRM-система)'"), ТаблицаСсылок, Ложь);
	ДобавитьСсылку("analysis", НСтр("ru = 'Анализ результатов деятельности бизнеса'"), ТаблицаСсылок, Ложь);

	МассивПодстрок = Новый Массив;
	
	Для НомерСтроки = 1 По ТаблицаСсылок.Количество() Цикл
		СвойстваСсылки = ТаблицаСсылок[НомерСтроки - 1];
		Если СвойстваСсылки.Используется Тогда
			МассивПодстрок.Добавить(Новый ФорматированнаяСтрока(СвойстваСсылки.Представление, , , , СвойстваСсылки.Ссылка));
			МассивПодстрок.Добавить(Символы.ПС);
			МассивПодстрок.Добавить(" ");
			МассивПодстрок.Добавить(Символы.ПС);
		КонецЕсли;
	КонецЦикла;
	
	МассивПодстрок.Добавить(СсылкаНаКаналБизнесСтарт());
	
	Возврат Новый ФорматированнаяСтрока(МассивПодстрок);
	
КонецФункции

Функция СсылкаНаКаналБизнесСтарт() Экспорт
	
	Возврат СтроковыеФункции.ФорматированнаяСтрока(
		НСтр("ru = 'Все видеоролики: <a href=""https://its.1c.ru/bmk/youtube/bs/course/"">1С:БизнесСтарт - учебный курс для предпринимателей</a>'"));
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НоваяТаблицаСсылок()
	
	ТаблицаСсылок = Новый ТаблицаЗначений;
	ТаблицаСсылок.Колонки.Добавить("Ссылка", ОбщегоНазначения.ОписаниеТипаСтрока(200));
	ТаблицаСсылок.Колонки.Добавить("Представление", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаСсылок.Колонки.Добавить("Используется", Новый ОписаниеТипов("Булево"));
	
	Возврат ТаблицаСсылок;
	
КонецФункции

Функция ДобавитьСсылку(Идентификатор, Представление, ТаблицаСсылок, Используется = Истина)
	
	ШаблонСсылок = "http://its.1c.ru/bmk/youtube/bs/%1";
	
	СвойстваСсылки = ТаблицаСсылок.Добавить();
	СвойстваСсылки.Ссылка = СтрШаблон(ШаблонСсылок, Идентификатор);
	СвойстваСсылки.Представление = Представление;
	СвойстваСсылки.Используется = Используется;
	
	Возврат СвойстваСсылки;
	
КонецФункции

#КонецОбласти

#КонецЕсли