#Область ПрограммныйИнтерфейс

// (См. ЭлектронноеВзаимодействиеМОТП.ЗаполнитьСведенияОМаркировке)
//   Переопределяет заполнение сведений о маркировке. Установить СтандартнаяОбработка=Ложь для переопределенных вызовов.
// 
Процедура ЗаполнитьСведенияОМаркировке(Приемник, Источник, ДанныеШтрихкодовУпаковок, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если ДанныеШтрихкодовУпаковок = Неопределено
		Или ДанныеШтрихкодовУпаковок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКДаннымДляОшибки = "Объект";
	
	ТаблицаКодов = Новый ТаблицаЗначений;
	ТаблицаКодов.Колонки.Добавить("Код");
	
	СведенияОМаркировке = Новый Структура;
	СведенияОМаркировке.Вставить("ИндивидуальныеУпаковки", ТаблицаКодов);
	Приемник.СведенияОМаркировке = СведенияОМаркировке;
	
	ПараметрыПоиска = Новый Структура("Номенклатура, Обработан");
	ПараметрыПоиска.Номенклатура = Источник.Товар;
	ПараметрыПоиска.Обработан    = Ложь;
	СтрокиУпаковок = ДанныеШтрихкодовУпаковок.НайтиСтроки(ПараметрыПоиска);
	Количество = Источник.Количество;
	Для Каждого СтрокаУпаковки Из СтрокиУпаковок Цикл
		Если (Количество<=0) Тогда
			Прервать;
		КонецЕсли;
		НоваяСтрока = ТаблицаКодов.Добавить();
		НоваяСтрока.Код = СтрокаУпаковки.ЗначениеШтрихКода;
		СтрокаУпаковки.Обработан = Истина;
		Количество = Количество - 1;
	КонецЦикла;
	
КонецПроцедуры

// (См. ЭлектронноеВзаимодействиеИСМП.ЗаполнитьСведенияОМаркировке_2019)
// Переопределяет заполнение сведений о маркировке. Установить СтандартнаяОбработка=Ложь для переопределенных вызовов.
Процедура ЗаполнитьСведенияОМаркировке_2019(Приемник, Источник, ДанныеШтрихкодовУпаковок, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// (См. ЭлектронноеВзаимодействиеИСМП.ЗаполнитьСведенияОМаркировке_5_02)
// Переопределяет заполнение сведений о маркировке. Установить СтандартнаяОбработка=Ложь для переопределенных вызовов.
Процедура ЗаполнитьСведенияОМаркировке_5_02(Приемник, Источник, ДанныеШтрихкодовУпаковок, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// (См. ЭлектронноеВзаимодействиеИСМП.ЗаполнитьСведенияОМаркировкеАктОРасхождениях_2019)
// Переопределяет заполнение сведений о маркировке. Установить СтандартнаяОбработка=Ложь для переопределенных вызовов.
Процедура ЗаполнитьСведенияОМаркировкеАктОРасхождениях_2019(Приемник, Источник, ДанныеШтрихкодовУпаковок, 
	ПолеКоличество, ОтборПоТипуРасхождений, ТипРасхождения, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// (См. ЭлектронноеВзаимодействиеИСМП.ЗаполнитьСведенияОМаркировкеУКД)
// Переопределяет заполнение сведений о маркировке. Установить СтандартнаяОбработка=Ложь для переопределенных вызовов.
Процедура ЗаполнитьСведенияОМаркировкеУКД(Приемник, Источник, ДанныеШтрихкодовУпаковокДо, ДанныеШтрихкодовУпаковокПосле, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// (См. ЭлектронноеВзаимодействиеИСМП.ЗаполнитьСведенияОМаркировкеУКД2020)
// Переопределяет заполнение сведений о маркировке. Установить СтандартнаяОбработка=Ложь для переопределенных вызовов.
Процедура ЗаполнитьСведенияОМаркировкеУКД2020(Приемник, Источник, ДанныеШтрихкодовУпаковокДо, ДанныеШтрихкодовУпаковокПосле, СтандартнаяОбработка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДанныеШтрихкодовУпаковокПосле) 
		ИЛИ Источник.Количество > 0 
		ИЛИ ДанныеШтрихкодовУпаковокДо.Количество() <> ДанныеШтрихкодовУпаковокПосле.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаШтрихкодовУпаковокПосле Из ДанныеШтрихкодовУпаковокПосле Цикл
		СтрокаШтрихкодовУпаковокПосле.Обработан = Истина;
	КонецЦикла;
	
КонецПроцедуры

// Переопределяет заполнение кодов маркировки из сведений о товаре документа ЭДО в переданные таблицы штрихкодов упаковок (факт и расхождения).
// 
// Параметры:
//  ШтрихкодыУпаковок - ТаблицаЗначений - Таблица штрихкодов для заполнения кодов из раздела Факт (См. ТаблицаШтрихкодыУпаковокНоменклатура).
//  ШтрихкодыУпаковокРасхождения - ТаблицаЗначений - Таблица штрихкодов для заполнения кодов из по расхождениям (См. ТаблицаШтрихкодыУпаковокНоменклатура).
//  СведенияОТоваре - СтрокаДереваЗначений - Строка сведений о товаре из документа ЭДО.
Процедура ДобавитьШтрихкодыТаблицыШтрихкодовАктОРасхождениях(ШтрихкодыУпаковок, ШтрихкодыУпаковокРасхождения,
		СведенияОТоваре) Экспорт
	
	Возврат;
	
КонецПроцедуры

//При записи документа ЭДО может измениться статус оформления документа, по которому происходит электронный документооборот:
//   * Для прямого обмена с ИС МП (документ "Отгрузка товаров") указание кодов маркировки требуется или в ЭДО, или в отгрузке.
//   * Подразумевается, что документ ЭДО не может изменить свой документ-основание (API ЭДО v1).
//
// Параметры:
//  ЭлектронныйДокументИсходящийОбъект - ДокументОбъект.ЭлектронныйДокументИсходящий - записываемый документ.
//  ДокументыТребующиеПересчета - Массив Из см. РасчетСтатусовОформленияИСМП.РассчитатьСтатусыОформленияДокументов - 
//   документы, связанные с записываемым электронным, для которых требуется пересчитать статус оформления.
//
Процедура ТребуетсяПересчетСтатусовОформления(ЭлектронныйДокументИсходящийОбъект, ДокументыТребующиеПересчета) Экспорт
	
	Основания = ЭлектронныйДокументИсходящийОбъект.ДокументыОснования;
	ДокументыПоТипам = Новый Соответствие;
	Для Каждого Строка Из Основания Цикл
		ТипОснования = ТипЗнч(Строка.ДокументОснование);
		Элемент = ДокументыПоТипам.Получить(ТипОснования);
		Если Элемент = Неопределено Тогда
			Элемент = Новый Массив;
		КонецЕсли;
		Элемент.Добавить(Строка.ДокументОснование);
		ДокументыПоТипам.Вставить(ТипОснования, Элемент);
	КонецЦикла;
	
	СчетаФактуры = ДокументыПоТипам.Получить(Тип("ДокументСсылка.СчетФактураВыданный"));
	Если СчетаФактуры<>Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", СчетаФактуры);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданныйДокументыОснования.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|ГДЕ
		|	СчетФактураВыданныйДокументыОснования.Ссылка В(&Ссылка)";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ТипОснования = ТипЗнч(Выборка.ДокументОснование);
			Элемент = ДокументыПоТипам.Получить(ТипОснования);
			Если Элемент = Неопределено Тогда
				Элемент = Новый Массив;
			КонецЕсли;
			Элемент.Добавить(Выборка.ДокументОснование);
			ДокументыПоТипам.Вставить(ТипОснования, Элемент);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого Тип Из Метаданные.ОпределяемыеТипы.ОснованиеОтгрузкаТоваровИСМП.Тип.Типы() Цикл
		ДокументыТипа = ДокументыПоТипам.Получить(Тип);
		Если ДокументыТипа<>Неопределено Тогда
			ДокументыТребующиеПересчета.Добавить(ДокументыТипа);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//Предназачена для модификации текста запроса по расчету неоформленных документов ЭДО.
//   Сценарий использования: заменить текст запроса на требуемый (требующие оформления
//   с помощью ЭДО документы продажи с маркируемой продукцией).
//
//Параметры:
//  ТекстЗапроса - Строка - Текст запроса
//
Процедура ПриПолученииТекстаЗапросаНеоформленныхДокументовЭДО(ТекстЗапроса) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СостоянияЭД.СсылкаНаОбъект КАК Ссылка
	|ИЗ
	|	РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияЭД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК ШтрихкодыРеализации
	|		ПО СостоянияЭД.СсылкаНаОбъект = ШтрихкодыРеализации.Ссылка
	|ГДЕ
	|	СостоянияЭД.СостояниеЭДО = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.НеСформирован)
	|	И НЕ ШтрихкодыРеализации.Ссылка ЕСТЬ NULL
	|	И (&БезОтбораПоОрганизации
	|			ИЛИ СостоянияЭД.Организация В (&Организации))";
	
КонецПроцедуры

// Переопределяет параметры открытия панели электронного документооборота.
//
// Параметры:
//  ПараметрыОткрытияОбработкиЭДО - Структура - Параметры открытия формы
//
Процедура ДополнитьПараметрыОткрытияПанелиЭДОИзИСМП(ПараметрыОткрытияОбработкиЭДО) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Дополнить сведения об адресах участников обмена 5_02.
// 
// Параметры:
//  СтруктураДанных  - Структура - возвращается методом ПолучитьДанныеДляЭД учетного документа.
//  Источник                     - ДокументСсылка - ссылка на прикладной документ
//  СтруктураАдресов - см. ЭлектронноеВзаимодействиеИСМП.СтруктураАдресовУчастниковОбмена
//  Отказ                        - Булево - Истина, если в процессе заполнения были обнаружены ошибки
//  ВыводитьСообщение            - Булево - Истина, если нужно выводить сообщение пользователю.
//
Процедура ЗаполнитьСведенияОбАдресахУчастниковОбмена_5_02(СтруктураДанных, Источник, СтруктураАдресов, Отказ, ВыводитьСообщение = Истина) Экспорт
	
	Если Не ТипЗнч(Источник) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
			И Не ТипЗнч(Источник) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		Возврат;
	КонецЕсли;

	Если СтруктураДанных.Свойство("ДанныеШапки") Тогда
		ДанныеШапки = СтруктураДанных.ДанныеШапки;
   	Иначе
		ДанныеШапки = СтруктураДанных.ДанныеДокументаУчета.ДанныеШапки;
	КонецЕсли;
	
	ЭтоИП = Ложь;
	
	ОбъектПокупатель = Неопределено;
	ОбъектПродавец   = Неопределено;
	ВидКИПокупателя  = Неопределено;
	ВидКИПродавца    = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеШапки.Грузополучатель) Тогда
		ОбъектПокупатель                                              = ДанныеШапки.Грузополучатель;
		СтруктураАдресов.Покупатель.УполномоченноеЛицоЗаПоставкуГруза = ОбъектПокупатель;
		ВидКИПокупателя                                               = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
	Иначе
		ОбъектПокупатель = ?(ДанныеШапки.Свойство("Контрагент"), ДанныеШапки.Контрагент, Справочники.Контрагенты.ПустаяСсылка());
		ВидКИПокупателя  = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель) И ТипЗнч(ДанныеШапки.Грузоотправитель) <> Тип("Строка") Тогда
		ОбъектПродавец                                              = ДанныеШапки.Грузоотправитель;
		СтруктураАдресов.Продавец.УполномоченноеЛицоЗаПоставкуГруза = ОбъектПродавец;
		ВидКИПродавца                                               = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
	Иначе
		ОбъектПродавец = ДанныеШапки.Поставщик;
		ВидКИПродавца  = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;
	КонецЕсли;
	
	СтруктураАдресов.Продавец.УчастникОбмена   = Источник.Организация;
	СтруктураАдресов.Покупатель.УчастникОбмена = Источник.Контрагент;
	
	Если ДанныеШапки.Свойство("АдресДоставкиЗначенияПолей") И ЗначениеЗаполнено(ДанныеШапки.АдресДоставкиЗначенияПолей) Тогда
		СтруктураАдресов.Покупатель.АвтоматическоеЗаполнение = Ложь;
		СтруктураАдресов.Покупатель.АдресСтрокой             = ДанныеШапки.АдресДоставки;
		СтруктураАдресов.Покупатель.АдресЗначенияПолей       = ДанныеШапки.АдресДоставкиЗначенияПолей;
	Иначе
		Если ТипЗнч(Источник) = Тип("ДокументСсылка.СчетФактураВыданный") 
			И ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Основание = Источник.ДокументОснование;
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.СчетФактураВыданный") 
			И ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			Основание = УчетНДСПереопределяемый.ПолучитьИсправляемыйДокументРеализации(Источник.ДокументОснование, Истина);
		Иначе
			Основание = Источник;
		КонецЕсли; 
		
		АдресДоставкиЗначение = Неопределено;
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("АдресДоставкиЗначение", Основание.Метаданные()) Тогда
			АдресДоставкиЗначение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "АдресДоставкиЗначение");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(АдресДоставкиЗначение) Тогда
			СтруктураАдресов.Покупатель.АвтоматическоеЗаполнение = Ложь;
			СтруктураАдресов.Покупатель.АдресСтрокой             = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформации(АдресДоставкиЗначение);
			СтруктураАдресов.Покупатель.АдресЗначенияПолей       = АдресДоставкиЗначение;
		Иначе
			СтруктураАдресов.Покупатель.АвтоматическоеЗаполнение     = Истина;
			СтруктураАдресов.Покупатель.ВладелецКонтактнойИнформации = ОбъектПокупатель;
			СтруктураАдресов.Покупатель.ВидКонтактнойИнформации      = ВидКИПокупателя;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Источник)= Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ДокИсточник = Источник;	
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		ДокИсточник = ДанныеШапки.СсылкаНаПервичныйДокумент;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокИсточник.ПодразделениеОрганизации) 
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокИсточник.ПодразделениеОрганизации, "ОбособленноеПодразделение") Тогда
		Если ЗначениеЗаполнено(ДокИсточник.Склад) ТОгда
			ВладелецКИ = ДокИсточник.Склад;
			ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресСклада;
        Иначе
			ВладелецКИ = ДокИсточник.ПодразделениеОрганизации;
			ВидКИ = Справочники.ВидыКонтактнойИнформации.ФактическийАдресПодразделенияОрганизаций;
		КонецЕсли;
	Иначе
		ОбщегоНазначенияИСПереопределяемый.ПартнерОрганизацияЭтоИндивидуальныйПредприниматель(ОбъектПродавец, ЭтоИП);
		Если ЭтоИП Тогда
			ВладелецКИ = ДокИсточник.Склад;
			ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресСклада;
		Иначе
			ВладелецКИ = ОбъектПродавец;
			ВидКИ = ВидКИПродавца;
		КонецЕсли;
	КонецЕсли;
		
	СтруктураАдресов.Продавец.АвтоматическоеЗаполнение     = Истина;
	СтруктураАдресов.Продавец.ВладелецКонтактнойИнформации = ВладелецКИ;
	СтруктураАдресов.Продавец.ВидКонтактнойИнформации      = ВидКИ;
	
КонецПроцедуры

// Добавить сведения о перевозочных документах в формате УПД 5_02.
// 
// Параметры:
//  СтруктураДанных              - Структура - возвращается методом ПолучитьДанныеДляЭД учетного документа.
//  Источник                     - ДокументСсылка - ссылка на прикладной документ
//  ДанныеПеревозочныхДокументов - см. ЭлектронноеВзаимодействиеИСМП.СтруктураДанныхПоПеревозочнымДокументам
Процедура ДобавитьСведенияОПеревозочныхДокументах_5_02(СтруктураДанных, Источник, ДанныеПеревозочныхДокументов) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		ДанныеЭПД = ПолучитьПараметрыЭПД(Источник);
		
		ДанныеПеревозочныхДокументов.ДатаТранспортногоДокумента  = ДанныеЭПД.ДатаДокумента;
		ДанныеПеревозочныхДокументов.НомерТранспортногоДокумента = ДанныеЭПД.НомерДокумента;
		ДанныеПеревозочныхДокументов.ИдентификаторЭПД            = ДанныеЭПД.ИдентификаторЭПД;
		ДанныеПеревозочныхДокументов.РегНомерТС                  = Источник.РегистрационныйЗнакАвтомобиля;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		Если ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			ДокументОснование = Источник.ДокументОснование;
		ИначеЕсли ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			ДокументОснование = УчетНДСПереопределяемый.ПолучитьИсправляемыйДокументРеализации(Источник.ДокументОснование, Истина);
		Иначе
			Возврат;
		КонецЕсли;
		
		ДанныеЭПД = ПолучитьПараметрыЭПД(ДокументОснование);
		
		ДанныеПеревозочныхДокументов.ДатаТранспортногоДокумента  = ДанныеЭПД.ДатаДокумента;
		ДанныеПеревозочныхДокументов.НомерТранспортногоДокумента = ДанныеЭПД.НомерДокумента;
		ДанныеПеревозочныхДокументов.ИдентификаторЭПД            = ДанныеЭПД.ИдентификаторЭПД;
		ДанныеПеревозочныхДокументов.РегНомерТС                  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "РегистрационныйЗнакАвтомобиля");
	Иначе	
		ДанныеПеревозочныхДокументов.ДатаТранспортногоДокумента  = Источник.Дата;
		ДанныеПеревозочныхДокументов.НомерТранспортногоДокумента = Источник.Номер;
	КонецЕсли;
		
КонецПроцедуры

// Заполнить данные по отправителю и получателю при перемещении между МОД в формате УПД 5_02.
// 
// Параметры:
//  СтруктураДанных - см. Документы.ПеремещениеМеждуМОДИСМП.СтруктураДанныхЮрФизЛица
//  Источник - ОпределяемыйТип.УчастникПеремещенияМеждуМОД
//  ДатаСведений - Дата - дата получения данных.
//  ДополнительныеПараметры - Структура - произвольные данные для уточнения данных по отправителю/получателю
Процедура ЗаполнитьДанныеУчастниковПеремещенияМеждуМОД_5_02(СтруктураДанных, Источник, ДатаСведений = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ЭтоИП = Ложь;
	Если ТипЗнч(Источник) = Тип("СправочникСсылка.Организации") Тогда
		Реквизиты = "ЮридическоеФизическоеЛицо, НаименованиеПолное, Наименование, ИНН, КПП, КодПоОКПО";
		Реквизиты = Реквизиты + ", НаименованиеСокращенное, ОГРН, СвидетельствоСерияНомер, СвидетельствоДатаВыдачи";
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		Реквизиты = "НаименованиеПолное, Наименование, КПП, КодПоОКПО";
		
	КонецЕсли;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, Реквизиты);
	ЗаполнитьЗначенияСвойств(СтруктураДанных, ЗначенияРеквизитов);
	Если ТипЗнч(Источник) = Тип("СправочникСсылка.Организации") Тогда
		СтруктураДанных.ЮрФизЛицо = ЗначенияРеквизитов.ЮридическоеФизическоеЛицо;
		Организация = Источник;
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		СтруктураДанных.ИНН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Владелец, "ИНН");
		СтруктураДанных.ЮрФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Владелец, "ЮридическоеФизическоеЛицо");
		Организация = Источник.Владелец;
	КонецЕсли;
	
	СтруктураДанных.ПолноеНаименование      = ?(ЗначениеЗаполнено(ЗначенияРеквизитов.НаименованиеПолное),ЗначенияРеквизитов.НаименованиеПолное, ЗначенияРеквизитов.Наименование);
	СтруктураДанных.СокращенноеНаименование = ?(ЗначениеЗаполнено(ЗначенияРеквизитов.НаименованиеПолное), ЗначенияРеквизитов.НаименованиеПолное, ЗначенияРеквизитов.Наименование);
	
	ОбщегоНазначенияИСПереопределяемый.ПартнерОрганизацияЭтоИндивидуальныйПредприниматель(Организация, ЭтоИП);
	Если ЭтоИП Тогда
		ФИО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "ФамилияИП,ИмяИП,ОтчествоИП"); 
		СтруктураДанных.Фамилия  = ФИО.ФамилияИП;
		СтруктураДанных.Имя      = ФИО.ИмяИП;
		СтруктураДанных.Отчество = ФИО.ОтчествоИП;
	КонецЕсли;

	
КонецПроцедуры

// Процедура осуществляет заполнение переопределяемых данных для формирования электронного документа
//  по документу Перемещение между МОД ИСМП. Осуществляется запись СтруктураДанных данными из номенклатуры.
//
// Параметры:
//  СтруктураДанных - Соответствие из КлючИЗначение:
//  	* Ключ - Число - идентификатор строки из таблицы ТаблицаДляПолученияДанных. Является уникальным идентификатором для
//  		определения полученных данных
//  	* Значение - см. ЭлектронноеВзаимодействиеИСМП.СтруктураДанныхПоНоменклатуреДляФормированияЭД
//  ТаблицаДляПолученияДанных - см. ЭлектронноеВзаимодействиеИСМП.ТаблицаДляПолученияДанныхДляФормированияЭлектронногоДокумента
//  Документ                  - ДокументСсылка.ПеремещениеМеждуМОДИСМП - ссылка на документ.
//
Процедура ПриПолученииДанныхПоНоменклатуреДляФормированияЭлектронногоДокументаПоПеремещениюМеждуМОДИСМП(СтруктураДанных, ТаблицаДляПолученияДанных, Документ) Экспорт
	
	ДанныеНоменклатуры 	= ПолучитьДанныеНоменклатуры(ТаблицаДляПолученияДанных);

	Для Каждого СтрокаТаблицы Из ТаблицаДляПолученияДанных Цикл
		ДанныеДляЗаполнения = ЭлектронноеВзаимодействиеИСМП.СтруктураДанныхПоНоменклатуреДляФормированияЭД();
		СтрокаТаблицы 		= ДанныеНоменклатуры.Найти(СтрокаТаблицы.ИдентификаторСтроки, "ИдентификаторСтроки");
		Если Не СтрокаТаблицы = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ДанныеДляЗаполнения, СтрокаТаблицы); 
			СтруктураДанных.Вставить(СтрокаТаблицы.ИдентификаторСтроки, ДанныеДляЗаполнения);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура осуществляет проверку на заполнение акцизных марок при формировании ЭД.
// 
// Параметры:
//  Источник                  - ДокументСсылка - ссылка на документ
//  Отказ                     - Булево - Истина, если проверка на заполнение акцизных марок не пройдена
//  ВыдаватьСообщенияОбОшибке - Булево - Выдавать сообщения об ошибке
//  СтандартнаяОбработка      - Булево - признак стандартной обработки.
Процедура ПроверитьЗаполнениеЭлектронногоДокументаНаАкцизныеМарки(Источник, Отказ, ВыдаватьСообщенияОбОшибке = Истина, СтандартнаяОбработка = Истина) Экспорт
	
	Возврат;
	
КонецПроцедуры

#Область УстаревшиеПроцедурыИФункции

// Устарела. При необходимости перед формированием документа ЭДО выполняет проверку соответствия маркируемой продукции и
// товарной части документа.
//
// Параметры:
//  Ссылка - ДокументСсылка - проверяемый документ
//  Отказ  - Булево - флаг отказа от дальнейших действий
Процедура ПроверитьМаркируемуюПродукциюДокумента(Ссылка, Отказ) Экспорт

	Возврат;
	
КонецПроцедуры

Функция ПолучитьПараметрыЭПД(ДокументОснование)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭлектроннаяТранспортнаяНакладнаяДокументыОснования.Ссылка.Номер КАК НомерДокумента,
	|	ЭлектроннаяТранспортнаяНакладнаяДокументыОснования.Ссылка.Дата КАК ДатаДокумента,
	|	ЭлектроннаяТранспортнаяНакладнаяДокументыОснования.Ссылка.УИДМинтранс КАК ИдентификаторЭПД,
	|	Ложь КАК ЭтоРеализацияТоваров
	|ИЗ
	|	Документ.ЭлектроннаяТранспортнаяНакладная.ДокументыОснования КАК ЭлектроннаяТранспортнаяНакладнаяДокументыОснования
	|ГДЕ
	|	ЭлектроннаяТранспортнаяНакладнаяДокументыОснования.ДокументОснование = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДокументРеализация.Номер,
	|	ДокументРеализация.Дата,
	|	"""",
	|	Истина
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДокументРеализация
	|ГДЕ
	|	ДокументРеализация.Ссылка= &ДокументОснование");
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Результат = Запрос.Выполнить().Выгрузить()[0];
	Если Результат.ЭтоРеализацияТоваров Тогда
		Результат.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Результат.НомерДокумента, Истина, Ложь);
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результат);
КонецФункции

#КонецОбласти

#КонецОбласти

// Процедуры и функции для работы с другими версиями БЭД
//
#Область СлужебныйПрограммныйИнтерфейс

// Для встраивания УПП
// Предназначена для формирования конструктора параметров обработки ошибок
//
// Параметры:
//  ПараметрыОбработкиОшибки - см. ОбщегоНазначенияБЭДКлиентСервер.НовыеПараметрыОшибки
//  СтандартнаяОбработка     - Булево - признак стандартной обработки (установить Ложь для переопределенных)
//  КлючДанных			     - ЛюбаяСсылка - ключ данных для обработки через сообщение пользователю (см. СообщениеПользователю).
//  ПутьКДанным			     - Строка - путь к данным для обработки через сообщение пользователю (см. СообщениеПользователю).
//  НавигационнаяСсылка	     - Строка - навигационная ссылка, по которой нужно перейти при клике на ошибку.
//  ИмяФормы			     - Строка - имя формы, которую нужно открыть при клике на ошибку.
//  ПараметрыФормы		     - Структура - параметры, передаваемые в форму, открываемую при клике на ошибку.
//  ТекстОшибки			     - Строка - используется для переопределения стандартного текста ошибки.
//
Процедура НовыеПараметрыОбработкиОшибки(ПараметрыОбработкиОшибки, СтандартнаяОбработка, КлючДанных = Неопределено, ПутьКДанным = "", НавигационнаяСсылка = "", ИмяФормы = "",
	ПараметрыФормы = Неопределено, ТекстОшибки = "") Экспорт

	Возврат;

КонецПроцедуры

// Для встраивания УПП
// Предназначена для заполнения обработки ошибок в строке дерева значений
// 
// Параметры:
//  СтрокаДерева             - СтрокаДереваЗначений - строка дерева данных
//  ПараметрыОбработкиОшибок - см. ПараметрыОбработкиОшибки
//  СтандартнаяОбработка - Булево         - признак стандартной обработки (установить Ложь для переопределенных)
//
Процедура ПриЗаполненииПараметровОбработкиОшибокВСтрокеДерева(СтрокаДерева, ПараметрыОбработкиОшибок, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для получения значения из дерева значений по полному пути.
// (См. ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве)
//
// Параметры:
//  ЗначениеРеквизита    - Произвольный   - найденное значения.
//  ДеревоДанных         - ДеревоЗначений - объект поиска.
//  ПолныйПуть           - Строка         - значение поиска.
//  СтандартнаяОбработка - Булево         - признак стандартной обработки (установить Ложь для переопределенных)
// 
Процедура ПриОпределенииЗначенияРеквизитаВДереве(ЗначениеРеквизита, ДеревоДанных, ПолныйПуть, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для получения данных элемента дерева, находящегося по указанному пути.
// (См. ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента)
//
// Параметры:
//  ЗначениеРеквизита    - Произвольный   - найденное значения.
//  ДеревоДанных - ДеревоЗначений - область данных поиска.
//  ПолныйПуть - Строка - полный путь к реквизиту. Составляющие пути разделяются точками.
//  СтандартнаяОбработка - Булево         - признак стандартной обработки (установить Ложь для переопределенных)
// 
Процедура ПриОпределенииДанныхЭлементаДереваЭлектронногоДокумента(ЗначениеРеквизита, ДеревоДанных, ПолныйПуть, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для вывода ошибки заполнения ЭД пользователю
//   (См. ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю)
//
// Параметры:
//   СтрокиТаблицы - Массив из СтрокаТаблицыЗначений, ТаблицаЗначений - см. ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю.СтрокиТаблицы.
//   ПолеТаблицы   - Строка                 - см. ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю.ПолеТаблицы.
//   КлючДанных    - Строка, ЛюбаяСсылка    - см. ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю.КлючДанных.
//   ПутьКДанным   - Строка                 - см. ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю.ПутьКДанным.
//   ТекстОшибки   - Строка                 - см. ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю.ТекстОшибки
//   СтандартнаяОбработка - Булево - признак стандартной обработки (установить Ложь для переопределенных)
//
Процедура ПриВыводеОшибкиЗаполненияПользователю(СтрокиТаблицы, ПолеТаблицы, КлючДанных, ПутьКДанным, ТекстОшибки, СтандартнаяОбработка) Экспорт

	Возврат;

КонецПроцедуры

// Для встраивания УПП
// Записывает данные из структуры в группу дерева значений.
// (См. ЭлектронноеВзаимодействие.ПриЗагрузкеСтруктурыВГруппуДерева)
//
// Параметры:
//  Дерево - ДеревоЗначений - дерево данных, в котором необходимо сохранить данные
//  СтруктураДанных - Структура - данные, которые должны быть загружены в группу
//  Путь - Строка - название группы в дереве.
//   СтандартнаяОбработка - Булево - признак стандартной обработки (установить Ложь для переопределенных)
//
Процедура ПриЗагрузкеСтруктурыВГруппуДерева(Дерево, СтруктураДанных, Путь, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена переопределения имени обработки обмена с контрагентами.
//
//Параметры:
//   Имя - Строка - имя обработки в метаданных.
//
Процедура ПриОпределенииИмениОбработкиОбменаПоЭДО(Имя) Экспорт

	Возврат;

КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения получения установки значения в дереве по полному пути.
// (См. ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево)
//
// Параметры:
//  Дерево - ДеревоЗначений - дерево данных, в котором необходимо сохранить данные.
//  ТаблицаДанных - таблицаЗначений - записываемые в дерево данные. Таблица может предварительно дополняться данными
//                                    для обработки ошибок:
//                                    см. ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю,
//                                    ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезНавигационнуюСсылку,
//                                    ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезОткрытиеФормы.
//  
//  НазваниеТаблицы - Строка - название таблицы в дереве.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ПриЗагрузкеТаблицыВДерево(Дерево, ТаблицаДанных, НазваниеТаблицы, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Преназначена для переопределения установки значения реквизита в дереве.
// (См. ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве)
//
// Параметры:
//  Дерево - ДеревоЗначений, СтрокаДереваЗначений - дерево, содержащее данные электронного документа
//  Реквизит - Строка - содержит полный путь к реквизиту дерева.
//  Значение - Произвольный - сохраняемое в дереве значение.
//  ПараметрыОбработкиОшибок - Строка - используется, чтобы переопределить текст выводимой по реквизиту ошибки
//                                      без указания параметров действий по клику на ошибке.
//                           - Структура - используется для указания указания параметров действий по клику на ошибке,
//                                         формируется функцией ЭлектронноеВзаимодействиеКлиентСервер.НовыеПараметрыОбработкиОшибки.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ПриЗаполненииЗначенияРеквизитаВДереве(Дерево, Реквизит, Значение, ПараметрыОбработкиОшибок, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Возвращает строку дерева значений для заполнения в прикладном решении.
// (См. ЭлектронноеВзаимодействие.СтрокаДерева)
// Параметры:
//  ЗначениеСтроки - Произвольный   - найденное значение.
//  Дерево - ДеревоЗначений - дерево с данными
//  НазваниеПоля - Строка - название поля в дереве, содержащее полный путь к реквизиту
//  НайтиРекурсивно - Булево - если требуется рекурсивный поиск.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ПриПолученииСтрокиДерева(ЗначениеСтроки, Дерево, НазваниеПоля, НайтиРекурсивно, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для добавления записей в таблицу дерева.
// (См. ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева)
//
// Параметры:
//  Дерево - ДеревоЗначений, СтрокаДереваЗначений - дерево, содержащее данные электронного документа
//  НоваяСтрока - Структура, СтрокаТаблицыЗначений - коллекция для сохранения в дереве
//  НазваниеТаблицы - Строка - название таблицы в дереве
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
// 
Процедура ПриДобавленииЗаписиВТаблицуДерева(Дерево, НоваяСтрока, НазваниеТаблицы, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения текста запроса для получения учетной записи ЭДО по установленному отбору.
// 
// Параметры:
// 	Запрос - Запрос - запрос на получение учетной записи по отбору
// 	ТекстыЗапросов - СписокЗначений из Строка - список значений с текстами запроса
// 	ИмяВременнойТаблицы - Строка - имя временной таблицы для выборки учетных записей
// 	Отбор - Структура:
// 		* УчетныеЗаписи - Строка - параметр или выражение для отбора по идентификаторам учетных записей
// 		* Организация - Строка - параметр или выражение для отбора по организации
// 		* СпособОбмена - Строка - параметр или выражение для отбора по способу обмена
// 		* Оператор - Строка - параметр или выражение для отбора по оператору
// 		* ЭтоОблачныйЭДО - Неопределено, Булево - параметр или выражение для отбора по использованию обмена через облачный ЭДО.
// 	СтандартнаяОбработка - Булево - признак стандартной обработки.
// 	
Процедура ПриПолученииУчетныхЗаписейЭДОСОтбором(Запрос, ТекстыЗапросов, ИмяВременнойТаблицы, Отбор, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения проверки поддержки выбранного формата по пространству имен.
// 
// Параметры:
//  ФорматУПД - Строка - пространство имен формата.
//  ЭтоПоддерживаемыйФормат - Булево - Истина, если поддерживается выбранный формат.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ПриОпределенииПоддержкиФорматаЭДО(ФорматУПД, ЭтоПоддерживаемыйФормат, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения получения дерева данных для заполнения или чтения прикладным решением.
// (См. ЭлектронноеВзаимодействие.ДеревоЭлектронногоДокумента)
//
// Параметры:
//   ПутьКМакетуДанныхЭД - Строка - путь к макету в формате "ИмяОбработки.ИмяМакета", например,
//                         "ОбменСКонтрагентами.Акт501_Исполнитель" (см. Обработка.ОбменСКонтрагентами.Макеты).
// 
//   ДеревоДанных - ДеревоЗначений - Дерево электронного документа.
//   СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ПриПолученииДереваЭлектронногоДокумента(ПутьКМакетуДанныхЭД, ДеревоДанных, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения формирования сообщения отправителя.
// 
// Параметры:
//  ДанныеСообщения - Структура из КлючИЗначение:
//  	* Отказ                  - Булево - Истина, если в процессе формирования выявились ошибки
//  	* ТекстОшибки            - Строка - общий текст ошибки
//  	* МассивОшибокЗаполнения - Массив из Строка - массив ошибок формирования
//  	* ДвоичныеДанныеФайла    - ДвоичныеДанные, Неопределено - данные сформированного титула в формате XML
//  	* ИмяФайла               - Строка - имя файла ЭД. - Титул продавца в формате 5_02.
//  ДеревоДанных - ДеревоЗначений - данные сформированного дерева ЭД
//  СтруктураЭД - Структура из КлючИЗначение:
//  	* Функция - Строка - функция ЭД
//  	* ФорматУПД - Строка - пространство имен УПД
//  	* ОбъектУчета - ДокументСсылка - ссылка на документ
//  	* Организация - ОпределяемыйТип.Организация - организация
//  ИдентификаторОтправителя - Строка - идентификатор настройки ЭДО отправителя
//  ИдентификаторПолучателя - Строка - идентификатор настройки ЭДО получателя
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриФормированииДанныхСообщенияОтправителя(ДанныеСообщения, ДеревоДанных, СтруктураЭД, ИдентификаторОтправителя, ИдентификаторПолучателя, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения формирования сообщения получателя.
// 
// Параметры:
//  ДанныеСообщения - Структура из КлючИЗначение:
//  	* Отказ                  - Булево - Истина, если в процессе формирования выявились ошибки
//  	* ТекстОшибки            - Строка - общий текст ошибки
//  	* МассивОшибокЗаполнения - Массив из Строка - массив ошибок формирования
//  	* ДвоичныеДанныеФайла    - ДвоичныеДанные, Неопределено - данные сформированного титула в формате XML
//  	* ИмяФайла               - Строка - имя файла ЭД. - Титул покупателя в формате 5_02.
//  ДанныеОтветногоТитула - Структура из КлючИЗначение:
//  	* ДеревоДанных - ДеревоЗначений - данные сформированного дерева ЭД
//  	* Формат - Строка
//  СтруктураЭД - Структура из КлючИЗначение:
//  	* ОбъектУчета - ДокументСсылка - ссылка на документ
//  	* ДвоичныеДанныеФайла - ДвоичныеДанные - двоичные данные титула продавца
//  	* ИмяФайлаБезРасширения - Строка - имя файла титула продавца
//  ИдентификаторОтправителя - Строка - идентификатор настройки ЭДО отправителя
//  ИдентификаторПолучателя - Строка - идентификатор настройки ЭДО получателя
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриФормированииДанныхСообщенияПолучателя(ДанныеСообщения, ДанныеОтветногоТитула, СтруктураЭД, ИдентификаторОтправителя, ИдентификаторПолучателя, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения процедуры формирования дерева ответного титула покупателя.
// 
// Параметры:
//  СтруктураДанных - Структура из КлючИЗначение:
//		* ДеревоДанных - ДеревоЗначений
//		* Формат - Строка - формат ответного титула.
//  ОбъектУчета - ДокументСсылка - ссылка на документ
//  ИмяФайла - Строка - имя файла титула продавца
//  ДвоичныеДанныеФайла - ДвоичныеДанные - данные файла титула продавца
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриФормированииДереваОтветногоТитулаПокупателя(СтруктураДанных, ОбъектУчета, ИмяФайла, ДвоичныеДанныеФайла, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения заполнения подписанта и ЭП в титулах продавца и покупателя.
// 
// Параметры:
//  Организация - ОпределяемыйТип.Организация
//  ДвоичныеДанные - ДвоичныеДанные - дополненный итоговый ЭД с ЭП и подписантами
//	ОписаниеФайла - Структура из КлючИЗначение:
//		* ДвоичныеДанные - ДвоичныеДанные - данные ЭД
//		* ИмяФайла - Строка - имя файла ЭД
//  СертификатПодписи - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - сертификат подписанта
//  ПодписьПродавца - Неопределено, ДвоичныеДанные - Подпись продавца
//	ВыбраннаяМЧД - Неопределено, СправочникСсылка.МашиночитаемыеДоверенности - МЧД подписанта
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриЗаполненииПодписантаИЭлектроннойПодписи(Организация, ДвоичныеДанные, ОписаниеФайла, СертификатПодписи, ПодписьПродавца, ВыбраннаяМЧД, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения МЧД по сертификату для подписи.
// 
// Параметры:
//  Организация - ОпределяемыйТип.Организация
//  СертификатПодписи - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - сертификат подписанта
//	ВыбраннаяМЧД - Неопределено, СправочникСсылка.МашиночитаемыеДоверенности - МЧД подписанта
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриЗаполненииМашиночитаемойДоверенности(Организация, СертификатПодписи, ВыбраннаяМЧД, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения двоичных данных на основании дерева данных ЭД.
// 
// Параметры:
//  Организация - ОпределяемыйТип.Организация
//  ДвоичныеДанные - ДвоичныеДанные - дополненный итоговый ЭД с ЭП и подписантами
//	ДанныеФайлаЭД - ДеревоЗначений - дерево ЭД
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура СформироватьДвоичныеДанныеИзФайлаЭД(ДвоичныеДанные, ДанныеФайлаЭД, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения получения дерева по объекту учета.
//
// Параметры:
//  ОбъектУчета - ДокументСсылка.ПеремещениеМеждуМОДИСМП
//  СтруктураЭД - Структура из КлючИЗначение:
//  	* Функция - Строка - функция ЭД
//  	* ФорматУПД - Строка - пространство имен формата ЭД
//  	* ОбъектУчета - ДокументСсылка.ПеремещениеМеждуМОДИСМП
//  	* Организация - ОпределяемыйТип.Организация
//  	* ИдентификаторОтправителя - Строка
//  	* ИдентификаторПолучателя - Строка
//  ДеревоДанных - ДеревоЗначений
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриПолученииДереваПоОписаниюДанныхОбъектаУчета(ОбъектУчета, СтруктураЭД, ДеревоДанных, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения сообщения отправителя по электронному документу.
// 
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
//                        - ДокументСсылка.ЭлектронныйДокументВходящийЭДО
//  Сообщение            - ДокументСсылка.СообщениеЭДО
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриПолученииСообщенияОтправителя(ЭлектронныйДокумент, Сообщение, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения двоичных данных представления сообщения.
// 
// Параметры:
//  Сообщение - ДокументСсылка.СообщениеЭДО
//  ДвоичныеДанныеСообщения - ДвоичныеДанные
//  ВызыватьИсключение - Булево
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриПолученииДвоичныхДанныхСообщения(Сообщение, ДвоичныеДанныеСообщения, ВызыватьИсключение, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения статуса документооборота.
// 
// Параметры:
//  Объект - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - ссылка на объект ИБ по которому нужно получить статус документооборота.
//  		 - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - ссылка на исходящий электронный документ.
//  		 - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - ссылка на входящий электронный документ.
// 
// Результат - Структура - описание статуса электронного документооборота:
//   * Статус - Строка - возможные значения:
//     "ЭДОНеНастроен"         - между участниками не завершена процедура настройки ЭДО.
//     "НеНачат"               - электронный документ по учетному не обнаружен.
//     "ВОбработке"            - охватывает время жизни исходящего электронного документа от создания до получения от
//                               контрагента решения (утверждения или отклонения).
//     "Получен"               - входящий электронный документ получен.
//     "ОтклонениеВОбработке"  - для входящих: документ отклонен, но уведомление не подписано или не отправлено.
//                               при аннулировании (и исходящих, и входящих): ответ по предложению об аннулированию
//                               еще не получен.
//     "Отклонен"              - документооборот завершен с отклонением.
//     "УтверждениеВОбработке" - входящий электронный документ утвержден, но ответный титул (ответная подпись)
//                               не подписан или не отправлен.
//     "Утвержден"             - документооборот успешно завершен.
//     "Ошибка"                - при проведении ЭДО произошла ошибка.
//   * ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО, 
//                           ДокументСсылка.ЭлектронныйДокументВходящийЭДО - ссылка на электронный документ. Если в
//                                          параметре "Документ" передан учетный документ, возвращается актуальный
//                                          для него электронный. Если передан электронный - возвращается та же ссылка.
//                           Неопределено - возвращается, если актуальный электронный документ отсутствует.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриПолученииСтатусаДокументооборота(Объект, Результат, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения параметров визуализации электронного документа.
// 
// Параметры:
//  ВозвращаемоеЗначение - Структура - Описание:
// * ВыводитьДопДанные - Булево - признак вывода доп. данных.
// * ВыводитьБанковскиеРеквизиты - Булево - признак вывода банковских реквизитов.
// * ВыводитьКопияВерна - Булево - признак вывода области "Копия верна".
// * ВыводитьШапкуСИдДокумента - Булево - признак, позволяющий отключить в шапке вывод идентификатора документа.
// * ПодсказкаQRКода - Строка - подсказка, которая будет выводиться в QR-коде.
// * ПубличнаяСсылкаQRКода - Строка - ссылка, которая будет выводиться в QR-коде. 
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриОпределенииПараметровВизуализацииЭлектронногоДокумента(ВозвращаемоеЗначение, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопредления визуализации формализованного электронного документа, содержащегося в файле.
// 
// Параметры:
//  СообщениеОтправителя - ДокументСсылка.СообщениеЭДО
// 	ДвоичныеДанныеОсновногоФайла - ДвоичныеДанные - двоичные данные основного файла.
// 	ДвоичныеДанныеОтветногоФайла - ДвоичныеДанные - двоичные данные ответного файла (для 2-х титульных документов)
// 	ПараметрыВизуализации - см. НовыеПараметрыВизуализацииЭлектронногоДокумента.
// 	ТабличныйДокумент - ТабличныйДокумент - табличный документ с визуализацией электронного документа.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриОпределенииПредствленияЭлектронногоДокументаПоФайлу(СообщениеОтправителя, ДвоичныеДанныеОсновногоФайла, ДвоичныеДанныеОтветногоФайла, ПараметрыВизуализации, ТабличныйДокумент, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопредления доступности выполнения действий по формированию ЭД.
// 
// Параметры:
//  ПроверкаДоступностиФормированияЭД - Структура из КлючИЗначение:
//    Структура из КлючИЗначение:
//   * ДоступноФормированиеЭД - Булево - Истина, если доступно выполнение действий по ЭДО
//   * ТекстОшибки - Строка - текст ошибки при обработке проверки.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриОпределенииДоступностиВыполненияДействийПоЭДО(ПроверкаДоступностиФормированияЭД, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

//Получает необходимыеданные для формирования структуры для заполнения документа перемещения между МОД
//Параметры: ТаблицаДанных Тип("ТаблицаЗначений")
//
//Возвращаемое значение Тип("ТаблицаЗначений")
//
Функция ПолучитьДанныеНоменклатуры(ТаблицаДанных)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаДокумента.ИдентификаторСтроки КАК ЧИСЛО(10, 0)) КАК ИдентификаторСтроки,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.Количество КАК ЧИСЛО(15, 3)) КАК Количество
	|ПОМЕСТИТЬ втТоварыДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТоварыДокумента.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	втТоварыДокумента.Номенклатура КАК Номенклатура,
	|	втТоварыДокумента.Номенклатура.Код КАК НоменклатураКод,
	|	втТоварыДокумента.Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
	|	КлассификаторЕдиницИзмерения.Ссылка КАК ЕдиницаИзмерения,
	|	КлассификаторЕдиницИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	КлассификаторЕдиницИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	втТоварыДокумента.Количество КАК Количество,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК НалоговаяСтавка,
	|	ИСТИНА КАК БезНДС,
	|	0 КАК СуммаНалога
	|ИЗ
	|	втТоварыДокумента КАК втТоварыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО втТоварыДокумента.Номенклатура.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка";
	Запрос.УстановитьПараметр("ТаблицаДокумента", ТаблицаДанных);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти
