#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Значение И Не ВариантыПриложений.ЭтоВерсияКОРП() Тогда
		Значение = Ложь;
	КонецЕсли;
	
	НастроитьЗависимыеНаборыСвойств(Значение);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Обработки.ФункциональностьПрограммы.НастроитьАгрегирующуюКонстанту(Метаданные.Константы.РасширенныйФункционалОсновныеСредства.Имя);
	Обработки.ФункциональностьПрограммы.НастроитьАгрегирующуюКонстанту(Метаданные.Константы.РасширенныйФункционалНематериальныеАктивы.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НастроитьЗависимыеНаборыСвойств(Значение)
	
	УчетОбесцененияАктивов.ВключитьНаборыСвойств(Значение);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли