#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	НастройкиЗаполнения = Неопределено;
	
	Если ДанныеЗаполнения = Неопределено Тогда
		НастройкиЗаполнения = Справочники.НастройкиУчетаЗатрат.НовыйБазовыеНастройкиУчетаЗатрат();
		Справочники.НастройкиУчетаЗатрат.ЗаполнитьПоУмолчанию(НастройкиЗаполнения);
	ИначеЕсли Справочники.НастройкиУчетаЗатрат.ЭтоНастройкиУчетаЗатрат(ДанныеЗаполнения) Тогда
		НастройкиЗаполнения = ДанныеЗаполнения;
	КонецЕсли;
	
	Если НастройкиЗаполнения <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ЗаполнитьЗначенияСвойств(
			ЭтотОбъект,
			НастройкиЗаполнения,
			"УстановленыВручную, ОсновнойСчетУчета, ВариантУчетаСтоимостиВыпуска");
		
		ПланСчетов.Очистить();
		
		Для Каждого Счет Из НастройкиЗаполнения.СчетаУчета Цикл
			
			ПланСчетов.Добавить().Счет = Счет;
			
		КонецЦикла;
		
		Справочники.НастройкиУчетаЗатрат.Сохранить(ЭтотОбъект, НастройкиЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьПлановуюСебестоимость = Перечисления.ВариантыУчетаСтоимостиВыпуска.ИспользоватьПлановуюСебестоимость(
		ВариантУчетаСтоимостиВыпуска);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
