#Область ПрограммныйИнтерфейс

// Возвращает признак доступности раздела Лиды
//
// Возвращаемое значение:
//   Булево - Истина, если разрешено
//
Функция РазделЛидыДоступен() Экспорт
	
	Возврат ФункциональностьПрограммы.РазделЛидыДоступен();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает признак использования синхронизации данных с другими программами
//
// Возвращаемое значение:
//  Булево
//
Функция ИспользуетсяСинхронизацияДанных() Экспорт
	
	Возврат Обработки.ФункциональностьПрограммы.ИспользуетсяСинхронизацияДанных();
	
КонецФункции

// Возвращает признак использования договоров с учетом агентского НДС
//
// Возвращаемое значение:
// Булево
//
Функция ДоговорыИсполняютсяОбязанностиНалоговогоАгентаПоНДС() Экспорт

	Возврат Обработки.ФункциональностьПрограммы.РезультатЗапросаИсполняютсяОбязанностиНалоговогоАгентаПоНДС(Ложь);

КонецФункции

// Возвращает признак использования договоров с обратным начислением НДС
//
// Возвращаемое значение:
//  Булево
//
Функция ДоговорыСОбратнымНачислениемНДС() Экспорт

	Возврат Обработки.ФункциональностьПрограммы.РезультатЗапросаОбратноеНачислениеНДС(Ложь);

КонецФункции

// Возвращает признак использования договоров на покупку электронных услуг у иностранных компаний
//
// Возвращаемое значение:
//  Булево
//
Функция ДоговорыСЭлектроннымиУслугамиИностранцев() Экспорт

	Возврат Обработки.ФункциональностьПрограммы.РезультатЗапросаЭлектронныеУслугиИностранцев(Ложь);

КонецФункции

// Возвращает признак использования договоров с обеспечением обязательств и платежей
//
// Возвращаемое значение:
//  Булево
//
Функция ДоговорыСОбеспечениемОбязательствИПлатежей() Экспорт

	Возврат Обработки.ФункциональностьПрограммы.РезультатЗапросаОбеспеченияОбязательствИПлатежей(Ложь);

КонецФункции

// Возвращает признак использования функциональной опции "ИспользоватьПродажиЧерезМаркетплейс"
//
// Возвращаемое значение:
//  Булево - Истина, если опция включена
//
Функция ВключеныПродажиЧерезМаркетплейс() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьПродажиЧерезМаркетплейс");
	
КонецФункции


Функция ОрганизацииИмпортирующиеПодакцизныеТовары() Экспорт

	Возврат Обработки.ФункциональностьПрограммы.ОрганизацииИмпортирующиеПодакцизныеТовары();

КонецФункции 

Функция ОрганизацииПроизводящиеПодакцизныеТовары() Экспорт

	Возврат Обработки.ФункциональностьПрограммы.ОрганизацииПроизводящиеПодакцизныеТовары();

КонецФункции

// Возвращает наименование опции для раздела взаимодействия с лидами, которое отображается в формах для пользователя
//
// Возвращаемое значение:
//   Строка
//
Функция НаименованиеОпцииЛиды() Экспорт
	
	Если ОбщегоНазначенияБП.ЭтоПолныйИнтерфейс() Тогда
		Возврат "ПоказыватьЛидыПолныйИнтерфейс";
	Иначе
		Возврат "ПоказыватьРазделЛидыПростойИнтерфейс";
	КонецЕсли;
	
КонецФункции

#КонецОбласти