
////////////////////////////////////////////////////////////////////////////////
// Универсальные методы для формы записи регистра и формы настройки налогов
//
// Серверные методы формы записи регистра сведений НастройкиУчетаНДФЛ
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ПодготовитьФормуНаСервере(Форма) Экспорт
	
	Запись = Форма.НастройкиУчетаНДФЛ;
	
	Форма.АвансыВключаютсяВДоходыВПериодеПолучения = ?(Запись.АвансыВключаютсяВДоходыВПериодеПолучения, 1, 0);
	
	Форма.ПризнаватьРасходыПоОперациямПрошлогоГода = ?(Запись.ПризнаватьРасходыПоОперациямПрошлогоГода, 1, 0);
	
	Форма.ИспользуютсяПродажиЧерезКомиссионера =
		ПолучитьФункциональнуюОпцию("ОсуществляетсяРеализацияТоваровУслугЧерезКомиссионеров")
		Или ПолучитьФункциональнуюОпцию("ИспользоватьПродажиЧерезМаркетплейс");
	
	НастройкиУчетаНДФЛФормыКлиентСервер.УправлениеФормой(Форма);
	
КонецПроцедуры

#КонецОбласти