#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиОбновления

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ВключитьДляМаркетплейсов");
	
КонецПроцедуры

Процедура ВключитьДляМаркетплейсов() Экспорт
	
	ВключитьКонстантуДляМаркетплейсов = Константы.ИспользоватьПродажиЧерезМаркетплейс.Получить()
		И НЕ Константы.ВедетсяОтгрузкаБезПереходаПраваСобственности.Получить();
		
	Если ВключитьКонстантуДляМаркетплейсов Тогда
		Обработки.ФункциональностьПрограммы.Изменить("ВедетсяОтгрузкаБезПереходаПраваСобственности", ВключитьКонстантуДляМаркетплейсов);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
