// Приказ от 21.03.2017 № ММВ-7-20/229@
// "Об утверждении дополнительных реквизитов фискальных документов и форматов фискальных документов,
// обязательных к использованию"

#Область СлужебныйПрограммныйИнтерфейс

// Конструктор коллекции, содержащей реквизиты, помещаемые в строку QR-кода кассового чека
// 
// Возвращаемое значение:
//  Структура
//
Функция НовыйРеквизитыЧека() Экспорт
	
	ПоляQRКода = Новый Структура;
	ПоляQRКода.Вставить("Дата",          '0001-01-01');
	ПоляQRКода.Вставить("Сумма",         0);
	ПоляQRКода.Вставить("КодУстройства", "");
	ПоляQRКода.Вставить("Номер",         "");
	ПоляQRКода.Вставить("КодПроверки",   "");
	ПоляQRКода.Вставить("ТипОперации",   "");
	
	Возврат ПоляQRКода;
	
КонецФункции

// Имена полей в строке QR-кода кассового чека.
// 
// Возвращаемое значение:
//  Структура - Ключ - имя поля в QR-коде на чеке, Значение - имя поля на естественном языке
//
Функция ИменаПолейQRКода() Экспорт
	
	// Пример строки QR-кода: t=20150720T1638&s=9999999.00&fn=000110000105&i=12345678&fp=123456&n=2
	
	ПоляQRКода = Новый Соответствие;
	ПоляQRКода.Вставить("t",  "Дата");          // date/time - дата и время осуществления расчета в формате ГГГГММДДТЧЧММ
	ПоляQRКода.Вставить("s",  "Сумма");         // сумма расчета в рублях и копейках, разделенных точкой
	ПоляQRКода.Вставить("fn", "КодУстройства"); // заводской номер фискального накопителя
	ПоляQRКода.Вставить("i",  "Номер");         // порядковый номер фискального документа, нулями не дополняется
	ПоляQRКода.Вставить("fp", "КодПроверки");   // фискальный признак документа, нулями не дополняется
	ПоляQRКода.Вставить("n",  "ТипОперации");   // признак расчета
	
	Возврат ПоляQRКода;
	
КонецФункции

#КонецОбласти
