#Область ПрограммныйИнтерфейс

// Подробнее
// См. СообщенияОблачныхПриложений.ПодключитьОблачноеПриложение
//
Процедура ПриПодключенииОблачногоПриложения(Результат, Адрес, Наименование, Вид, НаименованиеВида) Экспорт
	
	Подключение = ЗапросыREST.НовыйПодключение();
	Подключение.АдресСервиса = Адрес;
	Подключение.ПространствоИмен = СообщенияОблачныхПриложений.ПространствоИмен();
	Если Не СообщенияОблачныхПриложений.ДобавитьЗаголовокJWTАутентификации(Подключение) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Структура;
	Запрос.Вставить("ТипЗапроса", СообщенияОтчетностиОблачныхПриложений.ТипЗапросаПодключитьОблачноеПриложение());
	Запрос.Вставить("ВыполнитьСинхронно", Истина);
	
	ИмяРесурса = СообщенияОблачныхПриложений.ИмяРесурса();
	ОтветСервиса = ЗапросыREST.ВыполнитьМетодСервиса(Подключение, "POST", ИмяРесурса, Запрос);
	
	Если ОтветСервиса = Неопределено Тогда
		//Если запрос не удалось выполнить, то ошибку в ЖР запишет метод ЗапросыREST.ВыполнитьМетодСервиса().
		Возврат;
	КонецЕсли;
	
	Содержимое = ?(ОтветСервиса.Содержимое.Свойство("Ответ"),
		ОтветСервиса.Содержимое.Ответ,
		ОтветСервиса.Содержимое);
	
	Если ОтветСервиса.КодСостояния <> ЗапросыREST.КодСтандартногоСостояния()
		Или Не Содержимое.Свойство("ИдентификаторПриложения")
		Или Не Содержимое.Свойство("ДоступныеОрганизации") Тогда
		
		СообщенияОблачныхПриложений.ЗаписатьОшибкуКодСостояния(
			ОтветСервиса,
			НСтр("ru = 'Подключение приложения'", ОбщегоНазначения.КодОсновногоЯзыка()));
		Возврат;
	КонецЕсли;
	
	Идентификатор = Содержимое.ИдентификаторПриложения;
	УстановитьПривилегированныйРежим(Истина);
	Приложение = Справочники.ОблачныеПриложения.СсылкаПриложение(
		Идентификатор,
		Адрес,
		Наименование,
		Вид,
		НаименованиеВида);
	УстановитьПривилегированныйРежим(Ложь);
		
	Если Приложение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеОрганизации = Новый Массив;
	Для Каждого ДанныеОрганизации Из Содержимое.ДоступныеОрганизации Цикл
		
		// Режим совместимости. В ответе может не быть ИНН и КПП.
		ИННОрганизации = Неопределено;
		КППОрганизации = Неопределено;
		ДанныеОрганизации.Свойство("ИНН", ИННОрганизации);
		ДанныеОрганизации.Свойство("КПП", КППОрганизации);
		
		УстановитьПривилегированныйРежим(Истина);
		Организация = Справочники.ОрганизацииОблачныхПриложений.СсылкаОрганизация(
			ДанныеОрганизации.Идентификатор,
			Приложение,
			ДанныеОрганизации.Наименование,
			ИННОрганизации,
			КППОрганизации);
		УстановитьПривилегированныйРежим(Ложь);
			
		Если ЗначениеЗаполнено(Организация) Тогда
			ДоступныеОрганизации.Добавить(Организация);
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Структура("ПриложениеИдентификатор, ПриложениеСсылка, ДоступныеОрганизации",
		Идентификатор, Приложение, ДоступныеОрганизации);
		
КонецПроцедуры

// Подробнее
// См. СообщенияОблачныхПриложений.ДанныеПодключения
//
Процедура ПриЗаполненииДанныхПодключения(Подключение, Приложение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеПриложения = Справочники.ОблачныеПриложения.ДанныеПриложения(Приложение);
	УстановитьПривилегированныйРежим(Ложь);
	
	Подключение.ИсточникЗапроса = Приложение;
	Подключение.АдресСервиса = ДанныеПриложения.Адрес;
	Подключение.ПространствоИмен = СообщенияОблачныхПриложений.ПространствоИмен();
	
	Если Не СообщенияОблачныхПриложений.ДобавитьЗаголовокJWTАутентификации(Подключение) Тогда
		Подключение = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти