#Область ПрограммныйИнтерфейс

// Возвращает фактический адрес торгового объекта для чека ЕГАИС.
//
// Параметры:
//  Адрес          - Строка                              - адрес торгового объекта.
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - ссылка на торговый объект для определения адреса.
Процедура АдресТорговогоОбъекта(Адрес, ТорговыйОбъект) Экспорт
	
	РеквизитыСклада = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТорговыйОбъект, "ПодразделениеОрганизации");
	
	Если ЗначениеЗаполнено(РеквизитыСклада.ПодразделениеОрганизации) Тогда
		Адрес = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
			РеквизитыСклада.ПодразделениеОрганизации,
			Справочники.ВидыКонтактнойИнформации.ФактическийАдресПодразделенияОрганизаций);
	Иначе
		ОрганизацияЕГАИС = Справочники.КлассификаторОрганизацийЕГАИС.НайтиПоРеквизиту("ТорговыйОбъект", ТорговыйОбъект);
		Если ЗначениеЗаполнено(ОрганизацияЕГАИС) Тогда
			Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОрганизацияЕГАИС, "Контрагент");
			Если ЗначениеЗаполнено(Организация) Тогда
				СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация, ОбщегоНазначения.РабочаяДатаПользователя());
				Адрес = СведенияОбОрганизации.ФактическийАдрес; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// В функции нужно определить значения по умолчанию, которые будут подставляться в
// реквизиты не сопоставленных элементов справочника.
//
// Параметры:
//  СобственнаяОрганизация - ОпределяемыйТип.ОрганизацияКонтрагентГосИС - значение по умолчанию для собственной организации,
//  СобственныйТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - значение по умолчанию для собственного торгового объекта,
//  СторонняяОрганизация - ОпределяемыйТип.ОрганизацияКонтрагентГосИС - значение по умолчанию для сторонней организации,
//  СтороннийТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - значение по умолчанию для стороннего торгового объекта.
Процедура ЗначенияПоУмолчаниюНеСопоставленныхОбъектов(
		СобственнаяОрганизация,
		СобственныйТорговыйОбъект,
		СторонняяОрганизация      = Неопределено,
		СтороннийТорговыйОбъект   = Неопределено) Экспорт
	
	СобственнаяОрганизация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	СобственныйТорговыйОбъект = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнойСклад");

	
КонецПроцедуры

// Процедура вызывается перед записью организации в базу.
//
// Параметры:
//  Организация - СправочникОбъект.КлассификаторОрганизацийЕГАИС - загружаемая организация.
Процедура ПриЗагрузкеОрганизации(Организация) Экспорт
	
	Если ЗначениеЗаполнено(Организация.ИНН) И Не Организация.Сопоставлено Тогда
		Контрагент = ЭлектронноеВзаимодействиеБП.СсылкаНаОбъектПоИННКПП("Контрагенты", Организация.ИНН, Организация.КПП);
		
		Если ЗначениеЗаполнено(Контрагент) Тогда
			Организация.Контрагент     = Контрагент;
			Организация.Сопоставлено   = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
