#Область СлужебныйПрограммныйИнтерфейс

// Определяет необходимость перехода на переданную систему налогообложения с начала года
//
// Параметры:
//  СистемаНалогообложения - ПеречислениеСсылка.СистемыНалогообложения
//  Результат - Булево - признак перехода на указанную систему налогообложения только с начала года
//  СтандартнаяОбработка - Булево - Ложь, если результат был изменен в данной процедуре
//
Процедура ПереходНаСистемуНалогообложенияСНачалаГода(СистемаНалогообложения, Результат, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти