
#Область ПрограммныйИнтерфейс


#Область КадровыеДанныеФизическихЛиц

// Определяет поля кадровых данных физических лиц, выводимых в отчетах.
//
// Параметры:
//  ДополнительныеПоляПредставлений - ТаблицаЗначений, см. ЗарплатаКадрыОбщиеНаборыДанных.ПустаяТаблицаДополнительныхПолейПредставлений
//  ПутьКПолямЛичныхДанных          - Строка, определяет группу полей для размещения, по умолчанию "ЛичныеДанные"
//  ИсключаемыеПоля                 - Массив строк, содержит имена кадровых данных, исключаемых из коллекции
//
Процедура ЗаполнитьПоляПредставленийКадровыхДанныхФизическихЛиц(ДополнительныеПоляПредставлений, ПутьКПолямЛичныхДанных, ИсключаемыеПоля) Экспорт
	
	
КонецПроцедуры

#Область ПостоянныеКадровыеДанныеФизическихЛиц

// Определяет отношение поля кадровых данных физического лица к числу постоянных кадровых данных.
//
// Параметры:
//  ИмяКадровыхДанных    - Строка, имя кадровых данных
//  СтандартнаяОбработка - Булево, Ложь означает, что поле относится к числу постоянных кадровых данных.
//
Процедура ПриОпределенииПостоянныхКадровыхДанныхФизическихЛиц(Знач ИмяКадровыхДанных, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

// Добавляет в тесты описания полей запроса путь к постоянным кадровым данным физических лиц.
//
// Параметры:
//   ИмяКадровыхДанных    - Строка, имя кадровых данных
//   ТекстыОписанияПолей  - Строка, фрагмент текста запроса, описывающий выбираемые поля кадровых данных
//   ИсточникиДанных      - Соответствие, коллекция используемых источников данных
//                            * Ключ     - Произвольный, обычно Строка, идентификатор источника данных
//                            * Значение - Массив строк, содержит имена кадровых данных источника
//   СтандартнаяОбработка - Булево
//
Процедура ПриДобавленииПоляПостоянныхКадровыхДанныхФизическихЛиц(ИмяКадровыхДанных, ТекстыОписанияПолей, ИсточникиДанных, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

// Добавляет в результирующий запрос, собирающий постоянные кадровые данные физических лиц:
// - запросы создания временных таблиц получения данных по зарегистрированным источникам данных
// - соединения с этими временными таблицами в результирующем запросе
//
//  Параметры:
//   Запрос             - Запрос, содержит тексты создания всех временных таблиц, получающих кадровые данные
//                         из таблиц базы данных, соединения с этими таблицами для вывода кадровых данных в 
//                         результирующем запросе (последний текст запроса, выбирающего данные), запросы уничтожения
//                         созданных промежуточных временных таблиц.
//   ТолькоРазрешенные  - Булево, определяет то будет ли запрос получения данных, выбирать только разрешенные значения
//   ОписательВТОтборов - см. КадровыйУчет.ОписаниеВременнойТаблицыОтборовФизическихЛиц
//   ИсточникиДанных    - см. описание параметра в ПриДобавленииПоляПостоянныхКадровыхДанныхФизическихЛиц
//
Процедура ПриДобавленииТекстовЗапросовПостоянныхКадровыхДанныхФизическихЛиц(Запрос, ТолькоРазрешенные, ОписательВТОтборов, ИсточникиДанных) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ПериодическиеКадровыеДанныеФизическихЛиц

// Определяет отношение поля кадровых данных физического лица к числу периодических кадровых данных.
//
// Параметры:
//  ИмяКадровыхДанных    - Строка, имя кадровых данных
//  СтандартнаяОбработка - Булево, Ложь означает, что поле относится к числу периодических кадровых данных.
//
Процедура ПриОпределенииПериодическихКадровыхДанныхФизическихЛиц(Знач ИмяКадровыхДанных, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

// Добавляет в тесты описания полей запроса путь к периодических кадровым данным физических лиц.
//
// Параметры:
//   ИмяКадровыхДанных    - Строка, имя кадровых данных
//   ТекстыОписанияПолей  - Строка, фрагмент текста запроса, описывающий выбираемые поля кадровых данных
//   ИсточникиДанных      - Соответствие, коллекция используемых источников данных
//                            * Ключ     - Произвольный, обычно Строка, идентификатор источника данных
//                            * Значение - Массив строк, содержит имена кадровых данных источника
//   СтандартнаяОбработка - Булево
//
Процедура ПриДобавленииПоляПериодическихКадровыхДанныхФизическихЛиц(ИмяКадровыхДанных, ТекстыОписанияПолей, ИсточникиДанных, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

// Добавляет в результирующий запрос, собирающий периодические кадровые данные физических лиц:
// - запросы создания временных таблиц получения данных по зарегистрированным источникам данных
// - соединения с этими временными таблицами в результирующем запросе
//
//  Параметры:
//   Запрос             - Запрос, содержит тексты создания всех временных таблиц, получающих кадровые данные
//                         из таблиц базы данных, соединения с этими таблицами для вывода кадровых данных в 
//                         результирующем запросе (последний текст запроса, выбирающего данные), запросы уничтожения
//                         созданных промежуточных временных таблиц.
//   ТолькоРазрешенные  - Булево, определяет то будет ли запрос получения данных, выбирать только разрешенные значения
//   ОписательВТОтборов - см. КадровыйУчет.ОписаниеВременнойТаблицыОтборовФизическихЛиц
//   ИсточникиДанных    - см. описание параметра в ПриДобавленииПоляПостоянныхКадровыхДанныхФизическихЛиц
//
Процедура ПриДобавленииТекстовЗапросовПериодическихКадровыхДанныхФизическихЛиц(Запрос, ТолькоРазрешенные, ОписательВТОтборов, ПоляОтбораПериодическихДанных, ИсточникиДанных) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область КадровыеДанныеСотрудников

// Определяет поля кадровых данных сотрудников лиц, выводимых в отчетах.
//
// Параметры:
//  ДополнительныеПоляПредставлений - ТаблицаЗначений, см. ЗарплатаКадрыОбщиеНаборыДанных.ПустаяТаблицаДополнительныхПолейПредставлений
//  ПутьКПолямСотрудника            - Строка, определяет группу полей для размещения, по умолчанию "Работа"
//  ПутьКПолямЛичныхДанных          - Строка, определяет группу полей для размещения, по умолчанию "ЛичныеДанные"
//  ИсключаемыеПоля                 - Массив строк, содержит имена кадровых данных, исключаемых из коллекции
//
Процедура ЗаполнитьПоляПредставленийКадровыхДанныхСотрудников(ДополнительныеПоляПредставлений, ПутьКПолямСотрудника, ПутьКПолямЛичныхДанных, ИсключаемыеПоля) Экспорт
	
	
КонецПроцедуры

#Область ПостоянныеКадровыеДанныеСотрудников

// Определяет отношение поля кадровых данных сотрудника к числу постоянных кадровых данных.
//
// Параметры:
//  ИмяКадровыхДанных    - Строка, имя кадровых данных
//  СтандартнаяОбработка - Булево, Ложь означает, что поле относится к числу постоянных кадровых данных.
//
Процедура ПриОпределенииПостоянныхКадровыхДанныхСотрудников(Знач ИмяКадровыхДанных, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

// Добавляет в тесты описания полей запроса путь к постоянным кадровым данным сотрудников.
//
// Параметры:
//   ИмяКадровыхДанных    - Строка, имя кадровых данных
//   ТекстыОписанияПолей  - Строка, фрагмент текста запроса, описывающий выбираемые поля кадровых данных
//   ИсточникиДанных      - Соответствие, коллекция используемых источников данных
//                            * Ключ     - Произвольный, обычно Строка, идентификатор источника данных
//                            * Значение - Массив строк, содержит имена кадровых данных источника
//   СтандартнаяОбработка - Булево
//
Процедура ПриДобавленииПоляПостоянныхКадровыхДанныхСотрудников(ИмяКадровыхДанных, ТекстыОписанияПолей, ИсточникиДанных, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

// Добавляет в результирующий запрос, собирающий постоянные кадровые данные сотрудников:
// - запросы создания временных таблиц получения данных по зарегистрированным источникам данных
// - соединения с этими временными таблицами в результирующем запросе
//
//  Параметры:
//   Запрос             - Запрос, содержит тексты создания всех временных таблиц, получающих кадровые данные
//                         из таблиц базы данных, соединения с этими таблицами для вывода кадровых данных в 
//                         результирующем запросе (последний текст запроса, выбирающего данные), запросы уничтожения
//                         созданных промежуточных временных таблиц.
//   ТолькоРазрешенные  - Булево, определяет то будет ли запрос получения данных, выбирать только разрешенные значения
//   ОписательВТОтборов - см. КадровыйУчет.ОписаниеВременнойТаблицыОтборовСотрудников
//   ИсточникиДанных    - см. описание параметра в ПриДобавленииПоляПостоянныхКадровыхДанныхФизическихЛиц
//
Процедура ПриДобавленииТекстовЗапросовПостоянныхКадровыхДанныхСотрудников(Запрос, ТолькоРазрешенные, ОписательВТОтборов, ИсточникиДанных) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ПериодическиеКадровыеДанныеСотрудников

// Добавляет в тесты описания полей запроса путь к периодическим кадровым данным сотрудников.
//
// Параметры:
//   ИмяКадровыхДанных    - Строка, имя кадровых данных
//   ТекстыОписанияПолей  - Строка, фрагмент текста запроса, описывающий выбираемые поля кадровых данных
//   ИсточникиДанных      - Соответствие, коллекция используемых источников данных
//                            * Ключ     - Произвольный, обычно Строка, идентификатор источника данных
//                            * Значение - Массив строк, содержит имена кадровых данных источника
//   СтандартнаяОбработка - Булево
//
Процедура ПриДобавленииПоляПериодическихКадровыхДанныхСотрудников(ИмяКадровыхДанных, ТекстыОписанияПолей, ИсточникиДанных, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

// Добавляет в результирующий запрос, собирающий периодические кадровые данные сотрудников:
// - запросы создания временных таблиц получения данных по зарегистрированным источникам данных
// - соединения с этими временными таблицами в результирующем запросе
//
//  Параметры:
//   Запрос             - Запрос, содержит тексты создания всех временных таблиц, получающих кадровые данные
//                         из таблиц базы данных, соединения с этими таблицами для вывода кадровых данных в 
//                         результирующем запросе (последний текст запроса, выбирающего данные), запросы уничтожения
//                         созданных промежуточных временных таблиц.
//   ТолькоРазрешенные  - Булево, определяет то будет ли запрос получения данных, выбирать только разрешенные значения
//   ОписательВТОтборов - см. КадровыйУчет.ОписаниеВременнойТаблицыОтборовСотрудников
//   ИсточникиДанных    - см. описание параметра в ПриДобавленииПоляПостоянныхКадровыхДанныхФизическихЛиц
//
Процедура ПриДобавленииТекстовЗапросовПериодическихКадровыхДанныхСотрудников(Запрос, ТолькоРазрешенные, ОписательВТОтборов, ПоляОтбораПериодическихДанных, ФормироватьСПериодичностьДень, ИсточникиДанных) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

 Процедура СоздатьВТОтветственныхЛиц(МенеджерВременныхТаблиц, МассивОбъектов, ПорядокЗаполнения) Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("ДокументСсылка.Отпуск"));
	Массив.Добавить(Тип("ДокументСсылка.БольничныйЛист"));
	Массив.Добавить(Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыВБанк"));
	Массив.Добавить(Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыВКассу"));
	Массив.Добавить(Тип("ДокументСсылка.НачислениеЗарплаты"));
	Массив.Добавить(Тип("ДокументСсылка.ДепонированиеЗарплаты"));
	Массив.Добавить(Тип("ДокументСсылка.СписаниеДепонированнойЗарплаты"));
	
	ТаблицаОтветственных = Новый ТаблицаЗначений;
	ТаблицаОтветственных.Колонки.Добавить("Документ",                    Новый ОписаниеТипов(Массив));
	ТаблицаОтветственных.Колонки.Добавить("Руководитель",                Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаОтветственных.Колонки.Добавить("ДолжностьРуководителя",       Новый ОписаниеТипов("СправочникСсылка.Должности"));
	ТаблицаОтветственных.Колонки.Добавить("ГлавныйБухгалтер",            Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаОтветственных.Колонки.Добавить("ДолжностьГлавногоБухгалтера", Новый ОписаниеТипов("СправочникСсылка.Должности"));
	ТаблицаОтветственных.Колонки.Добавить("Кассир",                      Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаОтветственных.Колонки.Добавить("ДолжностьКассира",            Новый ОписаниеТипов("СправочникСсылка.Должности"));
	ТаблицаОтветственных.Колонки.Добавить("Бухгалтер",                   Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаОтветственных.Колонки.Добавить("ДолжностьБухгалтера",         Новый ОписаниеТипов("СправочникСсылка.Должности"));
	ТаблицаОтветственных.Колонки.Добавить("Исполнитель",                 Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаОтветственных.Колонки.Добавить("ДолжностьИсполнителя",        Новый ОписаниеТипов("СправочникСсылка.Должности"));
	
	Для Каждого СведенияОДокументе ИЗ МассивОбъектов Цикл
		
		ПорядокДозаполнения = Новый Структура();
		
		НоваяСтрока = ТаблицаОтветственных.Добавить();
		НоваяСтрока.Документ = СведенияОДокументе.Ссылка;
		
		Если ПорядокЗаполнения.Свойство("ЗаполнятьРуководителя") Тогда
			
			НоваяСтрока.Руководитель          = СведенияОДокументе.Руководитель;
			НоваяСтрока.ДолжностьРуководителя = СведенияОДокументе.ДолжностьРуководителя;
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.Руководитель) ИЛИ НЕ ЗначениеЗаполнено(НоваяСтрока.ДолжностьРуководителя) Тогда
				ПорядокДозаполнения.Вставить("ЗаполнятьРуководителя");
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПорядокЗаполнения.Свойство("ЗаполнятьГлавногоБухгалтера") Тогда
			
			НоваяСтрока.ГлавныйБухгалтер = СведенияОДокументе.ГлавныйБухгалтер;
			
			Если СведенияОДокументе.ПолучитьОбъект().Метаданные().Реквизиты.Найти("ДолжностьГлавногоБухгалтера") <> Неопределено Тогда
				НоваяСтрока.ДолжностьГлавногоБухгалтера = СведенияОДокументе.ДолжностьГлавногоБухгалтера;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.ГлавныйБухгалтер) ИЛИ НЕ ЗначениеЗаполнено(НоваяСтрока.ДолжностьГлавногоБухгалтера) Тогда
				ПорядокДозаполнения.Вставить("ЗаполнятьГлавногоБухгалтера");
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПорядокЗаполнения.Свойство("ЗаполнятьКассира") Тогда
			
			НоваяСтрока.Кассир = СведенияОДокументе.Кассир;
			
			Если СведенияОДокументе.ПолучитьОбъект().Метаданные().Реквизиты.Найти("ДолжностьКассира") <> Неопределено Тогда
				НоваяСтрока.ДолжностьКассира = СведенияОДокументе.ДолжностьКассира;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.Кассир) ИЛИ НЕ ЗначениеЗаполнено(НоваяСтрока.ДолжностьКассира) Тогда
				ПорядокДозаполнения.Вставить("ЗаполнятьКассира");
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПорядокЗаполнения.Свойство("ЗаполнятьБухгалтера") Тогда
			
			НоваяСтрока.Бухгалтер = СведенияОДокументе.Бухгалтер;
			
			
			Если СведенияОДокументе.ПолучитьОбъект().Метаданные().Реквизиты.Найти("ДолжностьБухгалтера") <> Неопределено Тогда
				НоваяСтрока.ДолжностьБухгалтера = СведенияОДокументе.ДолжностьБухгалтера;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.Бухгалтер) ИЛИ НЕ ЗначениеЗаполнено(НоваяСтрока.ДолжностьБухгалтера) Тогда
				ПорядокДозаполнения.Вставить("ЗаполнятьБухгалтера");
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПорядокЗаполнения.Свойство("ЗаполнятьИсполнителя") Тогда
			
			НоваяСтрока.Исполнитель           = СведенияОДокументе.Исполнитель;
			НоваяСтрока.ДолжностьИсполнителя  = СведенияОДокументе.ДолжностьИсполнителя;
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.Исполнитель) ИЛИ НЕ ЗначениеЗаполнено(НоваяСтрока.ДолжностьИсполнителя) Тогда
				ПорядокДозаполнения.Вставить("ЗаполнятьИсполнителя");
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПорядокДозаполнения.Количество() = 0 Тогда
			Продолжить;
		Иначе
			ОтветственныеЛицаОрганизации = ОтветственныеЛицаБП.ОтветственныеЛица(СведенияОДокументе.Организация, СведенияОДокументе.Дата);
		КонецЕсли;
		
		Если ПорядокДозаполнения.Свойство("ЗаполнятьРуководителя") Тогда
			
			НоваяСтрока.Руководитель          = ?(ЗначениеЗаполнено(НоваяСтрока.Руководитель),
													НоваяСтрока.Руководитель,
													ОтветственныеЛицаОрганизации.Руководитель);
			НоваяСтрока.ДолжностьРуководителя = ?(ЗначениеЗаполнено(НоваяСтрока.ДолжностьРуководителя),
													НоваяСтрока.ДолжностьРуководителя,
													ОтветственныеЛицаОрганизации.РуководительДолжность);
		КонецЕсли;
		
		Если ПорядокДозаполнения.Свойство("ЗаполнятьГлавногоБухгалтера") Тогда
			
			НоваяСтрока.ГлавныйБухгалтер = ?(ЗначениеЗаполнено(НоваяСтрока.ГлавныйБухгалтер),
													НоваяСтрока.ГлавныйБухгалтер,
													ОтветственныеЛицаОрганизации.ГлавныйБухгалтер);
			НоваяСтрока.ДолжностьГлавногоБухгалтера = ?(ЗначениеЗаполнено(НоваяСтрока.ДолжностьГлавногоБухгалтера),
													НоваяСтрока.ДолжностьГлавногоБухгалтера,
													ОтветственныеЛицаОрганизации.ГлавныйБухгалтерДолжность);
		КонецЕсли;
		
		Если ПорядокДозаполнения.Свойство("ЗаполнятьКассира") Тогда
			
			НоваяСтрока.Кассир                = ?(ЗначениеЗаполнено(НоваяСтрока.Кассир),
													НоваяСтрока.Кассир,
													ОтветственныеЛицаОрганизации.Кассир);
													
			НоваяСтрока.ДолжностьКассира      = ?(ЗначениеЗаполнено(НоваяСтрока.ДолжностьКассира),
													НоваяСтрока.ДолжностьКассира,
													ОтветственныеЛицаОрганизации.КассирДолжность);
		КонецЕсли;
		
		Если ПорядокДозаполнения.Свойство("ЗаполнятьБухгалтера") Тогда
			
			НоваяСтрока.ГлавныйБухгалтер = ?(ЗначениеЗаполнено(НоваяСтрока.Бухгалтер),
													НоваяСтрока.Бухгалтер,
													ОтветственныеЛицаОрганизации.ГлавныйБухгалтер);
			НоваяСтрока.ДолжностьГлавногоБухгалтера = ?(ЗначениеЗаполнено(НоваяСтрока.ДолжностьБухгалтера),
													НоваяСтрока.ДолжностьБухгалтера,
													ОтветственныеЛицаОрганизации.ГлавныйБухгалтерДолжность);
		КонецЕсли;
		
		Если ПорядокДозаполнения.Свойство("ЗаполнятьИсполнителя") Тогда
			
			НоваяСтрока.Исполнитель           = ?(ЗначениеЗаполнено(НоваяСтрока.Исполнитель),
													НоваяСтрока.Исполнитель,
													ОтветственныеЛицаОрганизации.ГлавныйБухгалтер);
			НоваяСтрока.ДолжностьИсполнителя  = ?(ЗначениеЗаполнено(НоваяСтрока.ДолжностьИсполнителя),
													НоваяСтрока.ДолжностьИсполнителя,
													ОтветственныеЛицаОрганизации.ГлавныйБухгалтерДолжность);
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаОтветственных", ТаблицаОтветственных);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаОтветственных.Документ,
	|	ТаблицаОтветственных.Руководитель,
	|	ТаблицаОтветственных.ДолжностьРуководителя,
	|	ТаблицаОтветственных.ГлавныйБухгалтер,
	|	ТаблицаОтветственных.ДолжностьГлавногоБухгалтера,
	|	ТаблицаОтветственных.Кассир,
	|	ТаблицаОтветственных.ДолжностьКассира,
	|	ТаблицаОтветственных.Бухгалтер,
	|	ТаблицаОтветственных.ДолжностьБухгалтера,
	|	ТаблицаОтветственных.Исполнитель,
	|	ТаблицаОтветственных.ДолжностьИсполнителя
	|ПОМЕСТИТЬ ВТОтветственныеЛица
	|ИЗ
	|	&ТаблицаОтветственных КАК ТаблицаОтветственных";

	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти