
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастроитьСубконто();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	ПриИзмененииСчетаЗатратСервер();
КонецПроцедуры

&НаКлиенте
Процедура Субконто1ПриИзменении(Элемент)
	УстановитьСвойстваСубконто(ЭтотОбъект, 1);
КонецПроцедуры

&НаКлиенте
Процедура Субконто2ПриИзменении(Элемент)
	УстановитьСвойстваСубконто(ЭтотОбъект, 2);
КонецПроцедуры

&НаКлиенте
Процедура Субконто3ПриИзменении(Элемент)
	УстановитьСвойстваСубконто(ЭтотОбъект, 3);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриИзмененииСчетаЗатратСервер()
	НастроитьСубконто();
КонецПроцедуры

&НаСервере
Процедура НастроитьСубконто()
	
	ПараметрыУстановкиСвойствСубконто = ПараметрыУстановкиСвойствСубконто(ЭтотОбъект);
	
	БухгалтерскийУчетКлиентСервер.УстановитьСвойстваСубконтоШапкиПриИзмененииСчета(
		ЭтотОбъект, Объект, ПараметрыУстановкиСвойствСубконто);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыУстановкиСвойствСубконто(Форма)
	
	ПараметрыУстановкиСвойствСубконто = БухгалтерскийУчетКлиентСервер.ПараметрыУстановкиСвойствСубконтоПоШаблону(
		"Субконто", "Подразделение", "Субконто", "Подразделение", "Счет");

	Возврат ПараметрыУстановкиСвойствСубконто;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваСубконто(Форма, НомерСубконто)

	ПараметрыУстановкиСвойствСубконто = ПараметрыУстановкиСвойствСубконто(Форма);
	
	БухгалтерскийУчетКлиентСервер.УстановитьСвойстваСубконтоШапкиПриИзмененииСубконто(
		Форма, Форма.Объект, НомерСубконто, ПараметрыУстановкиСвойствСубконто);

КонецПроцедуры

#КонецОбласти