
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
	
		Если НЕ ЗначениеЗаполнено(Объект.НомерВходящегоДокумента) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
				НСтр("ru = 'Номер отметки о регистрации заявления о ввозе товаров покупателя из ЕАЭС в налоговом органе своей страны'"));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Номер",, Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
				НСтр("ru = 'Дата отметки о регистрации заявления о ввозе товаров покупателя из ЕАЭС в налоговом органе своей страны'"));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Дата",, Отказ);
		КонецЕсли;
	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрыЗаявленияОВвозеТоваровПолученного = Новый Структура;
	ПараметрыЗаявленияОВвозеТоваровПолученного.Вставить("ЗаявлениеОВвозеТоваровПолученное", Объект.Ссылка);
	ПараметрыЗаявленияОВвозеТоваровПолученного.Вставить("Основания", Новый Массив);
	
	Для Каждого Документ Из Объект.ДокументыОтгрузки Цикл
		ПараметрыЗаявленияОВвозеТоваровПолученного.Основания.Добавить(Документ);
	КонецЦикла;

	Оповестить("Запись_ЗаявлениеОВвозеТоваровПолученное", ПараметрыЗаявленияОВвозеТоваровПолученного);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПодготовитьФормуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения

	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьПометкуНаУдаление(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВопросОПометкеУдаленияЗавершение", ЭтотОбъект);
	Если Объект.ПометкаУдаления Тогда
		ТекстВопроса = СтрШаблон(НСтр("ru='Снять с ""%1"" пометку удаления?'"), Объект.Ссылка);
	Иначе
		ТекстВопроса = СтрШаблон(НСтр("ru='Пометить ""%1"" на удаление?'"), Объект.Ссылка);
	КонецЕсли;

	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВопросОПометкеУдаленияЗавершение(Результат, ДополнительныеСвойства) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Если Объект.ПометкаУдаления Тогда
			Объект.ПометкаУдаления = Ложь;
		Иначе
			Объект.ПометкаУдаления = Истина;
		КонецЕсли;
		
		ПараметрыЗаписи = Новый Структура ("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения);
		ЭтотОбъект.Записать(ПараметрыЗаписи);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	Заголовок = УчетНДСВызовСервера.ПредставлениеДокумента(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	УстановитьСостояниеДокумента();
	УстановитьЗаголовокФормы();
	ОбщегоНазначенияБПКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтотОбъект);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Форма.Элементы.ФормаУстановитьСнятьПометкуНаУдаление.Доступность = ЗначениеЗаполнено(Форма.Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти