#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет настройки заполнения данными из обработки КлассификацияВыручкиПоОКВЭД.
//
// Параметры:
//  АдресРаспределениеВыручки - Строка - адрес во временном хранилище, содержит данные распределения выручки.
//  Организация - СправочникСсылка.Организации - организация, для которой нужно записать настройку.
//  ОбъектНаблюдения - СправочникСсылка.ОбъектыСтатистическогоНаблюдения Или Неопределено.
//  АдресДоступныеКодыПоКлассификатору - Строка - адрес во временном хранилище, содержит данные доступных кодов.
//  НаборЗаписейНастройкаФормСтатистики - РегистрСведенийНаборЗаписей.НастройкаЗаполненияСвободныхСтрокФормСтатистики или Неопределено.
//
Процедура ЗаполнитьРаспределениеВыручкиПоОКВЭД(АдресРаспределениеВыручки, Организация, ОбъектНаблюдения = Неопределено,
	АдресДоступныеКодыПоКлассификатору = Неопределено, СообщенияОбОшибках = Неопределено, НаборЗаписейНастройкаФормСтатистики = Неопределено) Экспорт
	
	Если ПустаяСтрока(АдресРаспределениеВыручки) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбъектНаблюдения = Неопределено Тогда
		ОбъектНаблюдения = ОбъектНаблюденияСДетализациейПоВидамДеятельности();
		Если ОбъектНаблюдения = Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.НастройкиКлассификацииВыручки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписейДо = НаборЗаписейДо(Организация);
	
	ТаблицаРаспределениеВыручки = ПолучитьИзВременногоХранилища(АдресРаспределениеВыручки);
	
	Для Каждого СтрокаТаблицы Из ТаблицаРаспределениеВыручки Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.Организация = Организация;
		Запись.Детализация = Справочники.КлассификаторВидовЭкономическойДеятельности.СсылкаКлассификатор(
			СтрокаТаблицы.ОКВЭДКод, СтрокаТаблицы.ОКВЭДНаименование);
		
		РезультатНастройки = РезультатНастройки(СтрокаТаблицы, ОбъектНаблюдения);
		ЗаполнитьЗначенияСвойств(Запись, РезультатНастройки);
		
		// В приоритете коды ОКВЭД более детальные, не перезаписываем код, если новый выше по иерархии.
		СтрокаНаборЗаписейДо = НаборЗаписейДо.Найти(РезультатНастройки.Настройка, "Настройка");
		Если СтрокаНаборЗаписейДо <> Неопределено Тогда
			КодДо = СтрокаНаборЗаписейДо.ДетализацияКод;
			КодПосле = СтрокаТаблицы.ОКВЭДКод;
			Если СтрДлина(КодДо) > СтрДлина(КодПосле)
				И СтрНайти(КодДо, КодПосле) <> 0 Тогда
				Запись.Детализация = СтрокаНаборЗаписейДо.Детализация;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьЗаписьНастройкиПоОбъектамНаблюдения", Истина);
	НаборЗаписей.Записать();
	
	РегистрыСведений.НастройкаЗаполненияСвободныхСтрокФормСтатистики.ЗаполнитьНастройкиПоОбъектамНаблюдения(
		НаборЗаписей, Организация, ОбъектНаблюдения, АдресДоступныеКодыПоКлассификатору, СообщенияОбОшибках, НаборЗаписейНастройкаФормСтатистики);
	
КонецПроцедуры

// Возвращает настройки по строке данных распределения выручки.
//
// Параметры:
//  СтрокаТаблицы - СтрокаТаблицыЗначений
//  ОбъектНаблюдения - СправочникСсылка.ОбъектыСтатистическогоНаблюдения
// 
// Возвращаемое значение:
//  Структура:
//    Настройка - Строка
//    ПредставлениеНастройки - Строка
//
Функция РезультатНастройки(СтрокаТаблицы, ОбъектНаблюдения) Экспорт
	
	НастройкиКомпоновки = Новый КомпоновщикНастроекКомпоновкиДанных;
	ЗаполнениеФормСтатистики.ИнициализироватьКомпоновщикНастроекПользователя(НастройкиКомпоновки, ОбъектНаблюдения);
	
	ОтборКомпоновки = НастройкиКомпоновки.Настройки.Отбор;
	ГруппаИли = Неопределено;
	РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	ЕстьГруппаИ = СтрокаТаблицы.ПоляГруппировкиНоменклатуры.Свойство("ПорядокГруппыИ");
	ЕстьНесколькоГруппИ = ЕстьГруппаИ И СтрокаТаблицы.ПоляГруппировкиНоменклатуры.ПорядокГруппыИ >= 2;
	
	ПоляОтбора = ПоляОтбора(СтрокаТаблицы.ПоляГруппировкиНоменклатуры);
	// В ТаблицаРаспределениеВыручки могут быть группы И (условия в ней должны выполняться одновременно), таких групп может быть несколько,
	// тогда их нужно объединить в группу Или. Также если в ПоляОтбора содержатся условия, то их тоже нужно объединять в группу Или.
	Если ПоляОтбора.ПоНоменклатурнойГруппе + ПоляОтбора.ПоГруппеНоменклатуры + ПоляОтбора.ПоНоменклатуре + ПоляОтбора.ПоВидуНоменклатуры
		+ ЕстьГруппаИ > 1 Или ЕстьНесколькоГруппИ Тогда
		ГруппаИли = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
			ОтборКомпоновки, "ГруппаИли", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		ГруппаИли.РежимОтображения = РежимОтображения;
		ГруппаИли.Представление = "";
	КонецЕсли;
	
	Если ЕстьГруппаИ Тогда
		Счетчик = 1;
		Пока СтрокаТаблицы.ПоляГруппировкиНоменклатуры.Свойство("ГруппаИ" + Счетчик) Цикл
			
			Группа = ГруппаИли;
			Если ГруппаИли <> Неопределено Или ЕстьНесколькоГруппИ Тогда
				ГруппаИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
					?(ГруппаИли <> Неопределено, ГруппаИли, ОтборКомпоновки), "ГруппаИ", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
				ГруппаИ.РежимОтображения = РежимОтображения;
				ГруппаИ.Представление = "";
				Группа = ГруппаИ;
			КонецЕсли;
			
			ГруппаСтрокиТаблицы = СтрокаТаблицы.ПоляГруппировкиНоменклатуры["ГруппаИ" + Счетчик];
			ПоляОтбораГруппыИ = ПоляОтбора(ГруппаСтрокиТаблицы);
			УстановитьОтборПоСпискуПолей(ПоляОтбораГруппыИ, ГруппаСтрокиТаблицы, ОтборКомпоновки, Группа, РежимОтображения);
			Счетчик = Счетчик + 1;
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьОтборПоСпискуПолей(ПоляОтбора, СтрокаТаблицы.ПоляГруппировкиНоменклатуры, ОтборКомпоновки, ГруппаИли, РежимОтображения);
	
	Возврат ЗаполнениеФормСтатистики.СериализоватьРезультатНастройки(НастройкиКомпоновки);
	
КонецФункции

// Возвращает первый объект наблюдения с детализацией по видам деятельности. Приоритет у объекта наблюдения "Производство и продажи".
// 
// Возвращаемое значение:
//   СправочникСсылка.ОбъектыСтатистическогоНаблюдения
//
Функция ОбъектНаблюденияСДетализациейПоВидамДеятельности() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъектыСтатистическогоНаблюдения.Ссылка КАК ОбъектНаблюдения,
	|	ВЫБОР
	|		КОГДА ОбъектыСтатистическогоНаблюдения.Код = ""ПроизводствоИПродажи""
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Справочник.ОбъектыСтатистическогоНаблюдения КАК ОбъектыСтатистическогоНаблюдения
	|ГДЕ
	|	ОбъектыСтатистическогоНаблюдения.Детализация = ЗНАЧЕНИЕ(Перечисление.ВидыСвободныхСтрокФормСтатистики.ВидыДеятельности)
	|	И НЕ ОбъектыСтатистическогоНаблюдения.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Если несколько объектов наблюдения с детализацией по видам деятельности, выбираем первый с приоритетом "Производство и продажи".
	Возврат Выборка.ОбъектНаблюдения;
	
КонецФункции

// Определяет соответствие номенклатурных групп видам деятельности, исходя из выполненных и сохраненных настроек.
// Настройки анализируются поверхностно: при сложных настройках соответствие может быть не полным.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - Организация, по которой выполнены настройки
//  ДопускаетсяНеполнаяКлассификация - Булево - если Ложь, то выполняется диагностика, сводится ли настройка к описанию перечня номенклатурных групп.
//                                             Если не сводится (другими словами, для классификации используется что-либо, кроме номенклатурных групп),
//                                             то возвращается Неопределено.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - СправочникСсылка.НоменклатурныеГруппы,
//   * Значение - СправочникСсылка.КлассификаторВидовЭкономическойДеятельности
//  Неопределено - настройка не сводится к описанию перечня номенклатурных групп
//
Функция ВидыДеятельностиОпределяемыеНоменклатурнымиГруппами(Организация, ДопускаетсяНеполнаяКлассификация = Истина) Экспорт
	
	ВидыДеятельности = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройки.Детализация КАК ВидДеятельности,
	|	Настройки.Настройка КАК Настройка,
	|	Настройки.Детализация.Код КАК Порядок
	|ИЗ
	|	РегистрСведений.НастройкиКлассификацииВыручки КАК Настройки
	|ГДЕ
	|	Настройки.Организация = &Организация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Отбор = ЗаполнениеФормСтатистики.ПолучитьОтборКомпоновкиДанных(Выборка.Настройка); // ОтборКомпоновкиДанных
		Если Отбор = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоменклатурныеГруппыНастройки = НоменклатурныеГруппыОтбораКомпоновкиДанных(Отбор.Элементы, ДопускаетсяНеполнаяКлассификация);
		Если НоменклатурныеГруппыНастройки = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Для Каждого НоменклатурнаяГруппа Из НоменклатурныеГруппыНастройки Цикл
			
			ВидыДеятельности.Вставить(НоменклатурнаяГруппа, Выборка.ВидДеятельности);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ВидыДеятельности;

КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьОтборПоСпискуПолей(ПоляОтбора, ПоляГруппировкиСтрокиТаблицы, ОтборКомпоновки, Группа, РежимОтображения)
	
	Если ПоляОтбора.ПоНоменклатурнойГруппе Тогда
		УстановитьОтбор(
			ПоляГруппировкиСтрокиТаблицы, "НоменклатурнаяГруппа", "ВидДеятельности", ОтборКомпоновки, Группа, РежимОтображения);
	КонецЕсли;
	Если ПоляОтбора.ПоНоменклатуре Тогда
		УстановитьОтбор(
			ПоляГруппировкиСтрокиТаблицы, "Номенклатура", "НоменклатураВыручки", ОтборКомпоновки, Группа, РежимОтображения);
	КонецЕсли;
	Если ПоляОтбора.ПоГруппеНоменклатуры Тогда
		ВидСравненияКомпоновки = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
		УдалитьЭлементКомпоновки = Не ПоляОтбора.ПоНоменклатуре;
		УстановитьОтбор(ПоляГруппировкиСтрокиТаблицы, "ГруппаНоменклатуры", "НоменклатураВыручки", ОтборКомпоновки, Группа,
			РежимОтображения, ВидСравненияКомпоновки, УдалитьЭлементКомпоновки);
	КонецЕсли;
	Если ПоляОтбора.ПоВидуНоменклатуры Тогда
		УстановитьОтбор(ПоляГруппировкиСтрокиТаблицы, "ВидНоменклатуры", "НоменклатураВыручки.ВидНоменклатуры", ОтборКомпоновки,
			Группа, РежимОтображения);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОтбор(ПоляГруппировки, ИмяПоляГруппировки, ИмяОтбораКомпоновки, ОтборКомпоновки, Группа, РежимОтображения,
	ВидСравненияКомпоновки = Неопределено, УдалитьЭлементКомпоновки = Истина)
	
	Если ВидСравненияКомпоновки <> Неопределено Тогда
		ПравоеЗначение = ПоляГруппировки[ИмяПоляГруппировки];
	Иначе
		Если ПоляГруппировки[ИмяПоляГруппировки].Количество() = 1 Тогда
			ПравоеЗначение = ПоляГруппировки[ИмяПоляГруппировки][0].Значение;
			ВидСравненияКомпоновки = ВидСравненияКомпоновкиДанных.Равно;
		Иначе
			ПравоеЗначение = ПоляГруппировки[ИмяПоляГруппировки];
			ВидСравненияКомпоновки = ВидСравненияКомпоновкиДанных.ВСписке;
		КонецЕсли;
	КонецЕсли;
	
	Если Группа <> Неопределено Тогда
		Если УдалитьЭлементКомпоновки Тогда
			// Удаляем лишний элемент отбора только на верхнем уровне, в группах удалять не нужно.
			УдалитьЭлементОтбора(ОтборКомпоновки, ИмяОтбораКомпоновки);
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			Группа, ИмяОтбораКомпоновки, ВидСравненияКомпоновки, ПравоеЗначение,, Истина, РежимОтображения);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ОтборКомпоновки, ИмяОтбораКомпоновки, ПравоеЗначение, ВидСравненияКомпоновки,,Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция ПоляОтбора(ПоляГруппировкиСтрокиТаблицы)
	
	ПоляОтбора = Новый Структура;
	ПоляОтбора.Вставить("ПоНоменклатурнойГруппе", ПоляГруппировкиСтрокиТаблицы.Свойство("НоменклатурнаяГруппа")
		И ЗначениеЗаполнено(ПоляГруппировкиСтрокиТаблицы.НоменклатурнаяГруппа));
	ПоляОтбора.Вставить("ПоНоменклатуре", ПоляГруппировкиСтрокиТаблицы.Свойство("Номенклатура")
		И ЗначениеЗаполнено(ПоляГруппировкиСтрокиТаблицы.Номенклатура));
	ПоляОтбора.Вставить("ПоГруппеНоменклатуры", ПоляГруппировкиСтрокиТаблицы.Свойство("ГруппаНоменклатуры")
		И ЗначениеЗаполнено(ПоляГруппировкиСтрокиТаблицы.ГруппаНоменклатуры));
	ПоляОтбора.Вставить("ПоВидуНоменклатуры", ПоляГруппировкиСтрокиТаблицы.Свойство("ВидНоменклатуры")
		И ЗначениеЗаполнено(ПоляГруппировкиСтрокиТаблицы.ВидНоменклатуры));
		
	Возврат ПоляОтбора;
	
КонецФункции

Процедура УдалитьЭлементОтбора(ОбластьУдаления, ИмяПоля)
	
	ЗначениеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
	
	МассивЭлементов = Новый Массив;
	Для каждого ЭлементОтбора Из ОбластьУдаления.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если ЭлементОтбора.ЛевоеЗначение = ЗначениеПоиска Тогда
				МассивЭлементов.Добавить(ЭлементОтбора);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Элемент Из МассивЭлементов Цикл
		ОбластьУдаления.Элементы.Удалить(Элемент);
	КонецЦикла;
	
КонецПроцедуры

Функция НаборЗаписейДо(Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиКлассификацииВыручки.Организация КАК Организация,
		|	НастройкиКлассификацииВыручки.Детализация КАК Детализация,
		|	НастройкиКлассификацииВыручки.Детализация.Код КАК ДетализацияКод,
		|	НастройкиКлассификацииВыручки.Настройка КАК Настройка,
		|	НастройкиКлассификацииВыручки.ПредставлениеНастройки КАК ПредставлениеНастройки
		|ИЗ
		|	РегистрСведений.НастройкиКлассификацииВыручки КАК НастройкиКлассификацииВыручки
		|ГДЕ
		|	НастройкиКлассификацииВыручки.Организация = &Организация";
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Индексы.Добавить("Настройка");
	
	Возврат Результат;
	
КонецФункции

#Область НоменклатурныеГруппыВидовДеятельности

Функция НоменклатурныеГруппыОтбораКомпоновкиДанных(ЭлементыОтбора, ДопускаетсяОтборПоДругимПолям)
	
	НоменклатурныеГруппы = Новый Массив;

	ОтборДопустимый = ИзвлечьПравыеЗначенияОтбораКомпоновкиДанных(
		НоменклатурныеГруппы,
		ЭлементыОтбора,
		Новый ПолеКомпоновкиДанных("ВидДеятельности"),
		Тип("СправочникСсылка.НоменклатурныеГруппы"),
		ДопускаетсяОтборПоДругимПолям);
		
	Если Не ОтборДопустимый Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат НоменклатурныеГруппы;
	
КонецФункции

Функция ИзвлечьПравыеЗначенияОтбораКомпоновкиДанных(Значения, ЭлементыОтбора, ЛевоеПоле, ТипЗначений, ДопускаетсяОтборПоДругимПолям)
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		
		Если Не ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ОтборДопустимый = ИзвлечьПравыеЗначенияОтбораКомпоновкиДанных(
				Значения,
				ЭлементОтбора.Элементы,
				ЛевоеПоле,
				ТипЗначений,
				ДопускаетсяОтборПоДругимПолям);
			Если Не ОтборДопустимый Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(ЭлементОтбора) <> Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементОтбора.ЛевоеЗначение <> ЛевоеПоле Тогда
			Если ДопускаетсяОтборПоДругимПолям Тогда
				Продолжить;
			Иначе
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		ЗначенияЭлементаОтбора = Новый Массив;
		Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
			Или ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
			ЗначенияЭлементаОтбора.Добавить(ЭлементОтбора.ПравоеЗначение);
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
			Или ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
				ЗначенияЭлементаОтбора,
				ЭлементОтбора.ПравоеЗначение.ВыгрузитьЗначения());
		ИначеЕсли Не ДопускаетсяОтборПоДругимПолям Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Для Каждого ЗначениеЭлементаОтбора Из ЗначенияЭлементаОтбора Цикл
			Если ТипЗнч(ЗначениеЭлементаОтбора) = ТипЗначений Тогда
				Значения.Добавить(ЗначениеЭлементаОтбора);
			ИначеЕсли ДопускаетсяОтборПоДругимПолям Тогда
				Продолжить;
			Иначе
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли