#Область ОписаниеПеременных

&НаКлиенте
Перем ОткрытыеФормы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МобильныйКлиентАдаптацияФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВидыОплат(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.ВидыОплатОрганизаций.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Валюты(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.Валюты.ФормаСписка", ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскиеСчета(Команда)
	
	ПараметрыФормы = Новый Структура("БанковскиеСчетаОрганизаций", Истина);
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.БанковскиеСчета.ФормаСписка",
		ЭтотОбъект, ПараметрыФормы, , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛимитОстаткаКассы(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("РегистрСведений.ЛимитОстаткаКассыОрганизаций.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Банки(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.Банки.ФормаСписка", ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьиДвиженияДенежныхСредств(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.СтатьиДвиженияДенежныхСредств.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДенежныеДокументы(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.ДенежныеДокументы.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключенныеКассы(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Обработка.ПодключенныеКассы.Форма.ПодключенныеКассы",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиДиректБанка(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы(
		"Справочник.НастройкиОбменСБанками.Форма.ФормаСписка", ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ГосударственныеКонтракты(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.ГосКонтракты.ФормаСписка", ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаЛеваяКолонка,
		"Валюты,Банки,БанковскиеСчета,ГосударственныеКонтракты,СтатьиДвиженияДенежныхСредств,"
		+"ВидыОплат,ДенежныеДокументы, ЛимитОстаткаКассы");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаПраваяКолонка,
		"НастройкаКлиентБанка,НастройкиДиректБанка");
	
КонецПроцедуры

#КонецОбласти