#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЦвет(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_СостоянияРаботыСЛидами");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЦветСерый(Команда)
	
	Объект.ЦветСостояния = ПредопределенноеЗначение("Перечисление.ЦветаСостоянийРаботыСЛидами.Серый");
	УстановитьЦвет(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветГолубой(Команда)
	
	Объект.ЦветСостояния = ПредопределенноеЗначение("Перечисление.ЦветаСостоянийРаботыСЛидами.Голубой");
	УстановитьЦвет(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветЖелтый(Команда)
	
	Объект.ЦветСостояния = ПредопределенноеЗначение("Перечисление.ЦветаСостоянийРаботыСЛидами.Желтый");
	УстановитьЦвет(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветЗеленый(Команда)
	
	Объект.ЦветСостояния = ПредопределенноеЗначение("Перечисление.ЦветаСостоянийРаботыСЛидами.Зеленый");
	УстановитьЦвет(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветЛаймовый(Команда)
	
	Объект.ЦветСостояния = ПредопределенноеЗначение("Перечисление.ЦветаСостоянийРаботыСЛидами.Лаймовый");
	УстановитьЦвет(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветКрасный(Команда)
	
	Объект.ЦветСостояния = ПредопределенноеЗначение("Перечисление.ЦветаСостоянийРаботыСЛидами.Красный");
	УстановитьЦвет(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветОранжевый(Команда)
	
	Объект.ЦветСостояния = ПредопределенноеЗначение("Перечисление.ЦветаСостоянийРаботыСЛидами.Оранжевый");
	УстановитьЦвет(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветРозовый(Команда)
	
	Объект.ЦветСостояния = ПредопределенноеЗначение("Перечисление.ЦветаСостоянийРаботыСЛидами.Розовый");
	УстановитьЦвет(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветСиний(Команда)
	
	Объект.ЦветСостояния = ПредопределенноеЗначение("Перечисление.ЦветаСостоянийРаботыСЛидами.Синий");
	УстановитьЦвет(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветФиолетовый(Команда)
	
	Объект.ЦветСостояния = ПредопределенноеЗначение("Перечисление.ЦветаСостоянийРаботыСЛидами.Фиолетовый");
	УстановитьЦвет(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЦвет(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Элементы.ЦветСерый.Пометка = (Объект.ЦветСостояния = ПредопределенноеЗначение("Перечисление.ЦветаСостоянийРаботыСЛидами.ПустаяСсылка")
								Или Объект.ЦветСостояния = ПредопределенноеЗначение("Перечисление.ЦветаСостоянийРаботыСЛидами.Серый"));
	Элементы.ЦветГолубой.Пометка = Объект.ЦветСостояния = ПредопределенноеЗначение("Перечисление.ЦветаСостоянийРаботыСЛидами.Голубой");
	Элементы.ЦветЖелтый.Пометка = Объект.ЦветСостояния = ПредопределенноеЗначение("Перечисление.ЦветаСостоянийРаботыСЛидами.Желтый");
	Элементы.ЦветЗеленый.Пометка = Объект.ЦветСостояния = ПредопределенноеЗначение("Перечисление.ЦветаСостоянийРаботыСЛидами.Зеленый");
	Элементы.ЦветЛаймовый.Пометка = Объект.ЦветСостояния = ПредопределенноеЗначение("Перечисление.ЦветаСостоянийРаботыСЛидами.Лаймовый");
	Элементы.ЦветКрасный.Пометка = Объект.ЦветСостояния = ПредопределенноеЗначение("Перечисление.ЦветаСостоянийРаботыСЛидами.Красный");
	Элементы.ЦветОранжевый.Пометка = Объект.ЦветСостояния = ПредопределенноеЗначение("Перечисление.ЦветаСостоянийРаботыСЛидами.Оранжевый");
	Элементы.ЦветРозовый.Пометка = Объект.ЦветСостояния = ПредопределенноеЗначение("Перечисление.ЦветаСостоянийРаботыСЛидами.Розовый");
	Элементы.ЦветСиний.Пометка = Объект.ЦветСостояния = ПредопределенноеЗначение("Перечисление.ЦветаСостоянийРаботыСЛидами.Синий");
	Элементы.ЦветФиолетовый.Пометка = Объект.ЦветСостояния = ПредопределенноеЗначение("Перечисление.ЦветаСостоянийРаботыСЛидами.Фиолетовый");
	
КонецПроцедуры

#КонецОбласти
