#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОбособленныеПодразделения 
	|	ПО ОбособленныеПодразделения.ГоловнаяОрганизация = ЭтотСписок.Организация
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ОбособленныеПодразделения.Ссылка)
	|";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Получает описание предопределенных наборов свойств.
//
// Параметры:
//  Наборы - ДеревоЗначений - с колонками:
//     * Имя           - Строка - Имя набора свойств. Формируется из полного имени объекта
//                       метаданных заменой символа "." на "_".
//                       Например, "Документ_ЗаказПокупателя".
//     * Идентификатор - УникальныйИдентификатор - Идентификатор ссылки предопределенного элемента.
//     * Используется  - Неопределено, Булево - Признак того, что набор свойств используется.
//                       Например, можно использовать для скрытия набора по функциональным опциям.
//                       Значение по умолчанию - Неопределено, соответствует значению Истина.
//     * ЭтоГруппа     - Булево - Истина, если набор свойств является группой.
//
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_ЗаявлениеОВвозеТоваровПолученное";
	Набор.Идентификатор = Новый УникальныйИдентификатор("fe14a004-4b3d-4f28-90dd-0b2964cd3006");
	Набор.Используется  = ПолучитьФункциональнуюОпцию("ВедетсяУчетТаможенныхДекларацийЭкспорт");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьДокументНаОсновании(ПараметрыСоздания) Экспорт
	
	ЗаявлениеОВвозеТоваровПолученное = Документы.ЗаявлениеОВвозеТоваровПолученное.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(ЗаявлениеОВвозеТоваровПолученное, ПараметрыСоздания);
	
	Документ = ЗаявлениеОВвозеТоваровПолученное.ДокументыОтгрузки.Добавить();
	Документ.ДокументОтгрузки = ПараметрыСоздания.ДокументОтгрузки;
	
	ЗаявлениеОВвозеТоваровПолученное.Записать(ПараметрыСоздания.РежимЗаписиДокумента);
	
	Возврат ЗаявлениеОВвозеТоваровПолученное.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли