#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбновлениеИнформационнойБазы

Процедура УстановкаКонстантыПриОбновленииИнформационнойБазы() Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ВедетсяУчетОсновныхСредств") Тогда
		НачалоСледующегоГода = НачалоГода(ДобавитьМесяц(ТекущаяДатаСеанса(), 12));
		Установить(НачалоСледующегоГода);
	КонецЕсли;
	
КонецПроцедуры

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("УстановкаКонстантыПриОбновленииИнформационнойБазы");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли