#Область СлужебныйПрограммныйИнтерфейс

// Возвращает представление срока действия права для отображения на форме.
// 
// Параметры:
//  СведенияНМА - СправочникСсылка.НематериальныеАктивы
//              - Структура:
//                 * НачалоДействияПрава - Дата
//                 * СрокДействияПраваДата - Дата
//                 * СрокДействияПраваКоличествоМесяцев - Число
// 
// Возвращаемое значение:
//  Строка - Представление срока действия
//
Функция ПредставлениеСрокаДействияПрава(Знач СведенияНМА) Экспорт
	
	Возврат Справочники.НематериальныеАктивы.ПредставлениеСрокаДействияПрава(СведенияНМА);
	
КонецФункции

// Возвращает значение повышающего коэффициента в налоговом учете, в соответствии с пп. 1, 3 ст. 257 НК РФ,
// п. 7 ст. 262 НК РФ, подп. 26 п. 1 ст. 264 НК РФ.
// Для расходов на НИОКР применение коэффициента автоматизировано до 2025 года, когда действовал коэффициент 1.5,
// поэтому для этого вида расходов коэффициент может возвращать значение 1.5 или в зависимости от периода.
// В остальных случаях возвращается значение коэффициента начиная с 2025 года
// 
// Параметры:
//  Период - Дата
//  ЭтоРасходыНаНИОКР - Булево
// 
// Возвращаемое значение:
//  Число - Значение коэффициента.
//
Функция ПовышающийКоэффициентНалоговогоУчета(Период, ЭтоРасходыНаНИОКР = Ложь) Экспорт
	
	Возврат УчетНМА.ПовышающийКоэффициентНалоговогоУчета(Период, ЭтоРасходыНаНИОКР);
	
КонецФункции

#КонецОбласти
