#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОсновнаяОрганизация = ОбщегоНазначенияБПВызовСервера.ОсновнаяОрганизация();
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(ОсновнаяОрганизация) Тогда
		
		ПараметрыФормы.Вставить("Ключ", ОсновнаяОрганизация);
		
	КонецЕсли;
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием(ПараметрыВыполненияКоманды);
	ПараметрыОткрытия.ИмяФормы = "Справочник.Организации.ФормаОбъекта";
	ПараметрыОткрытия.ЗамерПроизводительности = "ПростойИнтерфейсОрганизация";
	
	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти
