#Область ОписаниеПеременных

&НаКлиенте
Перем ОткрытыеФормы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МобильныйКлиентАдаптацияФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СчетПокупателюОС(Команда)
	
	Отбор = Новый Структура("ВидОперации",
		ПредопределенноеЗначение("Перечисление.ВидыОперацийСчетаПокупателю.ОсновныеСредства"));
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Счета покупателям основных средств'"));
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.СчетНаОплатуПокупателю.ФормаСписка",
		ЭтотОбъект, ПараметрыФормы, , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СписаниеОС(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.СписаниеОС.ФормаСписка", ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовкаКПередачеОС(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПодготовкаКПередачеОС.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередачаОС(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПередачаОС.ФормаСписка", ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрекращениеАренды(Команда)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПрекращениеАренды.ПрекращениеАренды");
	ЗаголовокФормы = НСтр("ru = 'Прекращение аренды'");
	ОткрытьПрекращениеАрендыПоВиду(ВидОперации, ЗаголовокФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрекращениеЛизинга(Команда)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПрекращениеАренды.ПрекращениеЛизинга");
	ЗаголовокФормы = НСтр("ru = 'Прекращение лизинга'");
	ОткрытьПрекращениеАрендыПоВиду(ВидОперации, ЗаголовокФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СписаниеНМА(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.СписаниеНМА.ФормаСписка", ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередачаНМА(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПередачаНМА.ФормаСписка", ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьПрекращениеАрендыПоВиду(ВидОперации, ЗаголовокФормы)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидОперации", ВидОперации);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", ЗаголовокФормы);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	КлючУникальности = Строка(ВидОперации);
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПрекращениеАренды.ФормаСписка",
		ЭтотОбъект, ПараметрыФормы, КлючУникальности, ОткрытыеФормы);
	
КонецПроцедуры

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаОсновныеСредства, "СчетПокупателюОС");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаАрендаЛизинг);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаНематериальныеАктивы);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти