#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием(ПараметрыВыполненияКоманды);
	ПараметрыОткрытия.Заголовок = НСтр("ru = 'Банковские счета'");
	ПараметрыОткрытия.ИмяФормы = "Справочник.БанковскиеСчета.ФормаСписка";

	ПараметрыФормы = Новый Структура;
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Справочник.Организации.Форма.ФормаОрганизации" Тогда
		Отбор = Новый Структура("Владелец", ПараметрКоманды);
		ПараметрыФормы.Вставить("Отбор", Отбор);
	Иначе
		ПараметрыФормы.Вставить("БанковскиеСчетаОрганизаций", Истина);
	КонецЕсли;
	
	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти