#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ВидПодакцизногоТовара.Видимость = Объект.ПодакцизныйТовар;
	Элементы.ВидПодакцизногоТовара.Доступность = Не Объект.Услуга;
	
	Элементы.ВПроизводство.Видимость = Не Объект.Услуга;
	Элементы.ВЭксплуатациюСотрудникам.Видимость = Не Объект.Услуга;
	Элементы.Комплектуем.Видимость = Не Объект.Услуга;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_ВидНоменклатуры", Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	
	Если Объект.ПодакцизныйТовар Тогда
		Объект.Услуга = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Подакцизный товар не может быть услугой", , "Услуга", "Объект");
	КонецЕсли;
	Элементы.ВидПодакцизногоТовара.Доступность = Не Объект.Услуга;
	
	Элементы.ВПроизводство.Видимость = Не Объект.Услуга;
	Элементы.ВЭксплуатациюСотрудникам.Видимость = Не Объект.Услуга;
	Элементы.Комплектуем.Видимость = Не Объект.Услуга;
	
	Если Объект.Услуга Тогда
		Объект.ВЭксплуатациюСотрудникам = Ложь;
		Объект.ВПроизводство = Ложь;
		Объект.Комплектуем = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодакцизныйТоварПриИзменении(Элемент)
	
	Если Объект.Услуга Тогда
		Объект.ПодакцизныйТовар = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Услуга не может быть подакцизным товаром", , "ПодакцизныйТовар", "Объект");
	КонецЕсли;
	Элементы.ВидПодакцизногоТовара.Видимость = Объект.ПодакцизныйТовар;
	Элементы.ВидПодакцизногоТовара.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Объект.ВидПодакцизногоТовара) И Объект.ПодакцизныйТовар;

КонецПроцедуры

&НаКлиенте
Процедура ВидПодакцизногоТовараПриИзменении(Элемент)
	Элементы.ВидПодакцизногоТовара.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Объект.ВидПодакцизногоТовара);
КонецПроцедуры

#КонецОбласти