
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не КомандаДоступна() Тогда
		ТекстСообщения = НСтр("ru='Нет прав на работу с ЭДО. Обратитесь к администратору.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ПростойИнтерфейсЭДО");
	
	ОткрытьФорму(ИнтерфейсДокументовЭДОКлиент.ФормаТекущиеДелаПоЭДО(), ,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция КомандаДоступна()
	
	Возврат ПравоДоступа("Просмотр", Метаданные.Обработки.ИнтерфейсДокументовЭДО);
	
КонецФункции

#КонецОбласти