&НаКлиенте
Перем БыстроеОбновлениеДанных;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	
	// Разрешим выбор только тех организаций, данные которых доступны на чтение.
	ДоступныеОрганизации = ОбщегоНазначенияБПВызовСервераПовтИсп.ОрганизацииДанныеКоторыхДоступныПользователю();
	
	УстановитьПараметрыВыбораОрганизации(ЭтотОбъект, ДоступныеОрганизации);
	
	Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	РеквизитыОрганизации = Организация; // Ссылка, отображаемая при однофирменном учете
	Элементы.РеквизитыОрганизации.Видимость = Истина; // Видимость управляется функциональными опциями
	
	Элементы.Настройка.Видимость = Не ОбщегоНазначенияБП.ЭтоИнтерфейсИнтеграцииСБанком();
	
	ВариантОкругления = 1;
	
	ДанныеОрганизации                = ДанныеОрганизации(Организация);
	ПоказыватьСравнениеСПрошлымГодом = ДанныеОрганизации.ПоказыватьСравнениеСПрошлымГодом;
	ИННОрганизации                   = ДанныеОрганизации.ИНН;
	НужноИскатьСертификат            = ДанныеОрганизации.НужноИскатьСертификат;
	
	ДанныеАктуальны = Истина;
	
	ОбновитьТаблицуБлоков();
	
	МобильныйКлиентАдаптацияФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	БыстроеОбновлениеДанных = Истина;
	
	ЗадержкаПередЗапускомБаннера = 3;
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", ЗадержкаПередЗапускомБаннера, Истина);
	
	ЗадержкаПередЗапускомФоновыхЗаданий = 16;
	ПодключитьОбработчикОжидания("Подключаемый_ОбновлениеДанныхБлоков", ЗадержкаПередЗапускомФоновыхЗаданий, Истина);
	
	// Запланируем обновление на завтра
	Интервал = Макс(ИнтервалОбновленияДанных(ТекущаяДата()), ЗадержкаПередЗапускомФоновыхЗаданий);
	ПодключитьОбработчикОжидания("Подключаемый_ЕжедневноеОбновление", Интервал, Истина);
	
	ЗапуститьПереключениеНовостей();
	
	ТекущийЭлемент = Элементы.Обновить;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		
		Если Организация <> Параметр Тогда
			Организация = Параметр;
			ОрганизацияОбработатьИзменение();
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ИзмененаНастройкаИнформационнойПанели" Тогда
		
		НастройкаИнформационнойПанелиПриИзменении();
		
		// Полное обновление всех блоков
		БыстроеОбновление = Ложь;
		ПрочитатьДанныеСтатическихБлоков = Истина;
		ОбновитьДанныеБлоков(БыстроеОбновление, ПрочитатьДанныеСтатическихБлоков);
		
		ЗапуститьПереключениеНовостей();
		
	ИначеЕсли ИмяСобытия = "ПериодическиеПлатежи_Изменение"
		ИЛИ ИмяСобытия = "СписокЗадачБухгалтера_Изменение" Тогда
		
		// Изменение данных блока задачи
		ИмяБлока = БлокиИнформационнойПанелиКлиентСервер.ИмяБлокаЗадачи();
		
		Если БлокВключен(ИмяБлока) Тогда
			ПрочитатьДанныеБлоков(ИмяБлока);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Новости. Новость прочтена"
		Или   ИмяСобытия = "Новости. Изменена прочтенность списка новостей"
		Или   ИмяСобытия = "Новости. Загружены новости" Тогда
		
		ИмяБлока = БлокиИнформационнойПанелиКлиентСервер.ИмяБлокаНовости();
		Если БлокВключен(ИмяБлока) Тогда
			ПрочитатьДанныеБлоков(ИмяБлока);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ДобавитьБлокИнформационнойПанели" Тогда
		
		ИмяБлока = Строка(Параметр);
		Если Не БлокВключен(ИмяБлока) Тогда
			ДобавитьБлок(ИмяБлока);
		Иначе
			ПрочитатьДанныеБлоков(ИмяБлока);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Запись_Организации" Тогда
		
		// При записи новой организации необходимо добавить ее в список доступных организаций.
		ОбработкаОповещенияЗаписьОрганизации(Параметр, Источник);
		Если Источник = Организация Тогда
			ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 0.1, Истина);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ОбновитьУчетнуюЗапись"
		Или ИмяСобытия = "Изменение признака прочтенности"
		Или ИмяСобытия = "Получены новые сообщения 1С-Отчетности"
		Или ИмяСобытия = "Завершение отправки заявления"
		Или ИмяСобытия = "Закрытие Мастер_ОтправкаЗаявления"
		Или ИмяСобытия = "ЗаполнитьСводнуюИнформациюПоЗаявлениюАбонентаСпецоператораСвязи" Тогда
		// Если подключена 1С-Отчетность - обновляем виджет
		// Если изменился признак прочтенности у объекта - обновляем виджет
		// Если получены новые сообщения 1С-Отчетности - обновляем виджет
		// Если изменилось состояние заявление на подключение 1С-Отчетность - обновляем виджет
		
		ИмяБлока = БлокиИнформационнойПанелиКлиентСервер.ИмяБлокаОтчетность();
		Если БлокВключен(ИмяБлока) Тогда
			ПрочитатьДанныеБлоков(ИмяБлока);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ИзмененоПредупреждениеПриЗагрузкеВыписки" Тогда
		
		ИмяБлока = БлокиИнформационнойПанелиКлиентСервер.ИмяБлокаОстаткиДенежныхСредств();
		Если БлокВключен(ИмяБлока) Тогда
			ПрочитатьДанныеБлоков(ИмяБлока);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ИзменениеУчетнойПолитики" Тогда
		
		Если Организация = Параметр Тогда
			ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 0.1, Истина);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ИзмененоСостояниеИнтеграцииСПлатформойСамозанятые" Тогда
		
		Если Организация = Параметр Тогда
			
			ИмяБлока = БлокиИнформационнойПанелиКлиентСервер.ИмяБлокаМойНалог();
			Если МойНалогДоступен() Тогда
				Если БлокВключен(ИмяБлока) Тогда
					ПрочитатьДанныеБлоков(ИмяБлока);
				Иначе
					ДобавитьБлок(ИмяБлока);
				КонецЕсли;
				ОповещенияПлатформыСамозанятыеКлиент.ПоказатьНовыеОповещения(Организация, Ложь);
			Иначе
				УдалитьБлок(ИмяБлока);
			КонецЕсли;
			
			ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 0.1, Истина);
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ОбсужденияПодключены" Тогда
		
		Если МойНалогДоступен() Тогда
			ИмяБлока = БлокиИнформационнойПанелиКлиентСервер.ИмяБлокаМойНалог();
			Если БлокВключен(ИмяБлока) Тогда
				ПрочитатьДанныеБлоков(ИмяБлока);
			КонецЕсли;
			ОповещенияПлатформыСамозанятыеКлиент.ПослеПодключенияОбсуждений();
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ИнтеграцияАУСН_ИзмененоСостояние" Тогда
		
		Если Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметр, "Организация") Тогда
			ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 0.1, Истина);
		КонецЕслИ;
		
	ИначеЕсли ИмяСобытия = "ИзмененБанковскийСчет" Тогда
		
		Если Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметр, "Владелец") Тогда
			ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 0.1, Истина);
		КонецЕслИ;
		
	ИначеЕсли ИмяСобытия = "КурсыВалют_Изменение" Тогда
		
		Если ИзмененаДоступностьКурсовВалют() Тогда
			ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
		КонецЕсли;
		
		// Изменение данных курсов валют
		ИмяБлока = БлокиИнформационнойПанелиКлиентСервер.ИмяБлокаКурсыВалют();
		Если БлокВключен(ИмяБлока) Тогда
			ПрочитатьДанныеБлоков(ИмяБлока);
		КонецЕсли;
		
		КурсыВалют_ОшибкаЗагрузки = Ложь;
		УправлениеБлокомКурсыВалют(ЭтотОбъект);
		
	ИначеЕсли ИмяСобытия = "Запись_ЗадачаИсполнителя" Тогда
		
		ИмяБлока = БлокиИнформационнойПанелиКлиентСервер.ИмяБлокаМоиЗадачи();
		
		Если БлокВключен(ИмяБлока) Тогда
			ПрочитатьДанныеБлоков(ИмяБлока);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "КоличествоНепрочитанныхОповещенийПлатформыСамозанятые_Изменение"
		И (Параметр = Неопределено Или Организация = Параметр) Тогда
		
		ИмяБлока = БлокиИнформационнойПанелиКлиентСервер.ИмяБлокаМойНалог();
		Если БлокВключен(ИмяБлока) Тогда
			ПрочитатьДанныеБлоков(ИмяБлока);
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "Запись_УзелПланаОбмена" И НеобходимоОбновитьИнтерфейс() Тогда

		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
				
	ИначеЕсли ИмяСобытия = ИнтеграцияСтатусСамозанятогоКлиент.ИменаСобытий().ИспользоватьСтатусСамозанятогоИзменено Тогда
		ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ПерсонализированныеПредложенияСервисовКлиент.ПерейтиПоСсылкеБаннера(
		НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Баннер, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияОбработатьИзменение();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьБаннерНажатие(Элемент)
	
	ОтключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер");
	
	ПерсонализированныеПредложенияСервисовКлиент.ЗакрытьБаннер(ЭтотОбъект, Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущийБаннерНажатие(Элемент)
	
	ОтключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер");
	
	ПерсонализированныеПредложенияСервисовКлиент.УстановитьРежимОжиданияНаБаннере(ЭтотОбъект);
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьПредыдущийБаннер", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СледующийБаннерНажатие(Элемент)
	
	ОтключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер");
	
	ПерсонализированныеПредложенияСервисовКлиент.УстановитьРежимОжиданияНаБаннере(ЭтотОбъект);
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура МойНалог_НепрочитанныеОповещенияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОповещенияПлатформыСамозанятыеКлиент.ОткрытьОбсуждение(Организация);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Настройка(Команда)
	
	СписокБлоков = Новый СписокЗначений;
	Для Каждого Блок Из ТаблицаБлоков Цикл
		СписокБлоков.Добавить(Блок.Имя, Блок.Синоним, Блок.Пометка);
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокБлоков", СписокБлоков);
	
	ОткрытьФорму("ОбщаяФорма.ИнформационнаяПанельНастройка", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	// Быстрое обновление динамических блоков
	БыстроеОбновление = Ложь;
	ПрочитатьДанныеСтатическихБлоков = Ложь;
	ОбновитьДанныеБлоков(БыстроеОбновление, ПрочитатьДанныеСтатическихБлоков);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьУПДТовары(Команда)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", Организация);
	ЗначенияЗаполнения.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.Товары"));
	ЗначенияЗаполнения.Вставить("ЭтоУниверсальныйДокумент", Истина);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьУПДУслуги(Команда)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", Организация);
	ЗначенияЗаполнения.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.Услуги"));
	ЗначенияЗаполнения.Вставить("ЭтоУниверсальныйДокумент", Истина);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#Область ЧастоЗадаваемыеВопросы

&НаКлиенте
Процедура ЧастоЗадаваемыеВопросыВсеВопросыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(НавигационнаяСсылкаФорматированнойСтроки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Задачи

&НаКлиенте
Процедура ЗадачиВсеЗадачиНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("ОткрыватьВНовойЗакладке", Истина);
	
	ОткрытьФорму("ОбщаяФорма.СписокЗадач", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область Задачи

&НаКлиенте
Процедура МоиЗадачиВсеМоиЗадачиНажатие(Элемент)
	
	МоиЗадачиКлиент.ОткрытьМоиЗадачи();
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектроннаяПочта

&НаКлиенте
Процедура ЭлектроннаяПочтаВсеПисьмаНажатие(Элемент)
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием();
	ПараметрыОткрытия.ИмяФормы = "ЖурналДокументов.Взаимодействия.Форма.ФормаСпискаЭлектроннаяПочтаБП";
	ПараметрыОткрытия.Заголовок = НСтр("ru='Почта'");
	ПараметрыОткрытия.ЗамерПроизводительности = "ИнформационнаяПанельПочтовыйКлиент";
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТолькоПочта", Истина);

	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область Отчетность

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеБлокомОтчетность(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Элементы.Отчетность.Родитель = Элементы.БлокиПанели Тогда
		// Блок отключен
		Возврат;
	КонецЕсли;
	
	ОтчетностьПодключена = Форма.Отчетность_ОтчетностьПодключена;
	ВыводитьБаннер = Форма.Отчетность_ПоказыватьБаннер;
	
	Элементы.ГруппаОтчетностьБаннер.Видимость = ВыводитьБаннер;
	Элементы.ГруппаОтчетностьПодключена.Видимость = Не ВыводитьБаннер И ОтчетностьПодключена;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетностьВсеСообщенияНажатие(Элемент)
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.Открыть1СОтчетностьНаЗакладкеНовое();
	
КонецПроцедуры

&НаКлиенте
Процедура Отчетность_ТекстБаннераОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьМастерПодключения" Тогда
		СтандартнаяОбработка = Ложь;
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьФормуМастераЗаявленияНаПодключение(Организация);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьПредложениеПодключитьсяКОтчетности" Тогда
		СтандартнаяОбработка = Ложь;
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ПоказатьФормуПредложениеОформитьЗаявлениеНаПодключение(Организация);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "Открыть1СОтчетность" Тогда
		СтандартнаяОбработка = Ложь;
		
		ОбработкаЗаявленийАбонентаКлиент.Открыть1СОтчетностьНаЗакладкеОтчеты();
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьЗаявление" Тогда
		СтандартнаяОбработка = Ложь;
		
		ОбработкаЗаявленийАбонентаКлиент.ОткрытьЗаявлениеНаПодключение(Отчетность_ЗаявлениеНаПодключение);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОстаткиДенежныхСредств

&НаКлиенте
Процедура ОстаткиДенежныхСредствВсеОстаткиНажатие(Элемент)
	
	ОтбораПоВидуДенежныхСредств = Новый Структура;
	ОтбораПоВидуДенежныхСредств.Вставить("Поле",         "ВидДенежныхСредств");
	ОтбораПоВидуДенежныхСредств.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных.НеРавно);
	ОтбораПоВидуДенежныхСредств.Вставить("Значение",     "Деньги у подотчетных лиц");
	
	ОтборыОтчета = Новый Массив;
	ОтборыОтчета.Добавить(ОтбораПоВидуДенежныхСредств);
	
	КлючВарианта = "ОстаткиДенежныхСредств";

	ОткрытьОтчет("Отчет.ОстаткиДенежныхСредств.Форма", , ОтборыОтчета, , КлючВарианта);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеБлокомОстаткиДенежныхСредств(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Элементы.ОстаткиДенежныхСредств.Родитель = Элементы.БлокиПанели Тогда
		Возврат;
	КонецЕсли;
	
	ИндексИтогов = Форма.ОстаткиДенежныхСредств_ИндексИтога;
	
	БезРамки = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	
	ВГраница = БлокиИнформационнойПанелиКлиентСервер.КоличествоВалютныхОстатков();
	
	ЕстьПредупрежденияПриЗагрузке = ЗначениеЗаполнено(Форма.ОстаткиДенежныхСредств_ПредупрежденияПриЗагрузке);
	Элементы.ОстаткиДенежныхСредств_ПредупрежденияПриЗагрузке.Видимость = ЕстьПредупрежденияПриЗагрузке;
	Элементы.ОстаткиДенежныхСредств_Остаток0.Видимость = НЕ ЕстьПредупрежденияПриЗагрузке;
	// Если выводиться предупреждение при загрузке, то нулевая строка остатков
	// прячется и вывод списка остатков начинается со строки с индексом 1.
	ИндексНачалаВыводаОстатков = ?(ЕстьПредупрежденияПриЗагрузке, 1, 0);
	
	Если Форма.ЭтоМобильныйКлиент Тогда
		Элементы.ОстаткиДенежныхСредств_Остаток0.Видимость = 
			Элементы.ОстаткиДенежныхСредств_Остаток0.Видимость
			И Не ПустаяСтрока(Форма.ОстаткиДенежныхСредств_Остаток0);
		Элементы.ОстаткиДенежныхСредств_Остаток1.Видимость = 
			Не ПустаяСтрока(Форма.ОстаткиДенежныхСредств_Остаток1);
		Элементы.ОстаткиДенежныхСредств_Остаток2.Видимость = 
			Не ПустаяСтрока(Форма.ОстаткиДенежныхСредств_Остаток2);
		Для Индекс = 0 По ВГраница Цикл
			Элемент = Элементы[СтрШаблон("ОстаткиДенежныхСредств_Остаток%1", Индекс)];
			Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		КонецЦикла;
		
		Если ИндексИтогов <> ВГраница Тогда
			ЭлементИтоги = Элементы[СтрШаблон("ОстаткиДенежныхСредств_Остаток%1", ИндексИтогов)];
			ЭлементИтоги.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
		КонецЕсли;
		
		Возврат;
	КонецЕсли;

	Если ИндексИтогов = ИндексНачалаВыводаОстатков Тогда
		
		ЧертаСверху = Новый Рамка(ТипРамкиЭлементаУправления.ЧертаСверху);
		
		ЭлементФормы = Элементы[СтрШаблон("ОстаткиДенежныхСредств_Остаток%1", ИндексНачалаВыводаОстатков)];
		ЭлементФормы.Рамка = ЧертаСверху;// Черта над итоговой строкой
		Для Индекс = 1 По ВГраница Цикл
			ЭлементФормы = Элементы[СтрШаблон("ОстаткиДенежныхСредств_Остаток%1", Индекс)];
			ЭлементФормы.Рамка = БезРамки;
		КонецЦикла;
		
	Иначе
		
		// Подчеркиваем элемент, расположенный над итоговой строкой
		
		Подчеркивание = Новый Рамка(ТипРамкиЭлементаУправления.Подчеркивание);
		
		ЭлементСверху = Элементы.ОстаткиДенежныхСредств_Банк;
		Для Индекс = ИндексНачалаВыводаОстатков По ВГраница Цикл
			ЭлементСверху.Рамка = ?(Индекс = ИндексИтогов, Подчеркивание, БезРамки);
			ЭлементСверху = Элементы[СтрШаблон("ОстаткиДенежныхСредств_Остаток%1", Индекс)];
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиДенежныхСредств_ПредупрежденияПриЗагрузкеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПерейтиВЖурналБанковскихДокументов" Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ПоказатьПредупреждения", Истина);
		Если ЗначениеЗаполнено(Организация) Тогда
			Отбор = Новый Структура("Организация", Организация);
			ПараметрыФормы.Вставить("Отбор", Отбор);
		КонецЕсли;
		Если ПолучитьФункциональнуюОпциюИнтерфейса("ИнтерфейсТаксиПростой") Тогда
			ОткрытьФорму("ЖурналДокументов.Деньги.Форма.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
		Иначе
			ОткрытьФорму("ЖурналДокументов.Деньги.Форма.БанковскиеВыписки", ПараметрыФормы, ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Покупатели

&НаКлиенте
Процедура ПокупателиЗадолженностьНажатие(Элемент)
	
	КлючВарианта = "ЗадолженностьПокупателей";
	
	ОткрытьОтчет("Отчет.ЗадолженностьПокупателей.Форма", , , , КлючВарианта, НачалоМесяца(Период), Период);
	
КонецПроцедуры

&НаКлиенте
Процедура ПокупателиПросроченнаяЗадолженностьНажатие(Элемент)
	
	КлючВарианта = "ЗадолженностьПокупателейПоСрокамДолга";
	
	ОткрытьОтчет("Отчет.ЗадолженностьПокупателейПоСрокамДолга.Форма.ФормаОтчета", , , , КлючВарианта, НачалоМесяца(Период), Период);
	
КонецПроцедуры

&НаКлиенте
Процедура ПокупателиНеоплаченныеСчетаНажатие(Элемент)
	
	КлючВарианта = "НеоплаченныеСчетаПокупателям";
	ОткрытьОтчет("Отчет.АнализНеоплаченныхСчетовПокупателям.Форма", , , , КлючВарианта);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСчет(Команда)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", Организация);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.СчетНаОплатуПокупателю.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАкт(Команда)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", Организация);
	ЗначенияЗаполнения.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.Услуги"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНакладную(Команда)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", Организация);
	ЗначенияЗаполнения.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.Товары"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеБлокомПокупателиПриСозданииНаСервере()
	
	Если Покупатели_ДоступностьРазделов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Счет.Видимость      = Покупатели_ДоступностьРазделов.СозданиеСчета;
	Элементы.Акт.Видимость       = Покупатели_ДоступностьРазделов.СозданиеРеализации;
	Элементы.Накладная.Видимость = Покупатели_ДоступностьРазделов.СозданиеРеализации;
	Элементы.УПД.Видимость       = Покупатели_ДоступностьРазделов.СозданиеРеализации;
	
	ПоказыватьПокупателиЗадолженность = Покупатели_ДоступностьРазделов.ЗадолженностьПокупателей;
	Элементы.ГруппаПокупателиЗадолженность.Видимость = ПоказыватьПокупателиЗадолженность;
	
	ПоказыватьПокупателиПросрочено = Покупатели_ДоступностьРазделов.ЗадолженностьПокупателейПоСрокамДолга;
	Элементы.ГруппаПокупателиПросрочено.Видимость = ПоказыватьПокупателиПросрочено;
	
	ПоказыватьПокупателиНеоплаченныеСчета = Покупатели_ДоступностьРазделов.АнализНеоплаченныхСчетовПокупателям;
	Элементы.ГруппаПокупателиНеоплаченныеСчета.Видимость = ПоказыватьПокупателиНеоплаченныеСчета;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеБлокомПокупатели(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Элементы.Покупатели.Родитель = Элементы.БлокиПанели Тогда
		// Блок отключен
		Возврат;
	КонецЕсли;
	
	ПоказыватьСравнениеСПрошлымГодом = Форма.ПоказыватьСравнениеСПрошлымГодом;
	
	Элементы.Покупатели_ЗадолженностьОтклонение.Видимость             = ПоказыватьСравнениеСПрошлымГодом;
	Элементы.Покупатели_ПросроченнаяЗадолженностьОтклонение.Видимость = ПоказыватьСравнениеСПрошлымГодом;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПлатеж()
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", Организация);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.ПлатежноеПоручение.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область Поставщики

&НаКлиенте
Процедура ПоставщикиЗадолженностьНажатие(Элемент)
	
	КлючВарианта = "ЗадолженностьПоставщикам";
	
	ОткрытьОтчет("Отчет.ЗадолженностьПоставщикам.Форма", , , , КлючВарианта, НачалоМесяца(Период), Период);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикиПросроченнаяЗадолженностьНажатие(Элемент)
	
	КлючВарианта = "ЗадолженностьПоставщикамПоСрокамДолга";
	
	ОткрытьОтчет("Отчет.ЗадолженностьПоставщикамПоСрокамДолга.Форма", , , , КлючВарианта, НачалоМесяца(Период), Период);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикиНеоплаченныеСчетаНажатие(Элемент)
	
	КлючВарианта = "НеоплаченныеСчетаПоставщиков";
	
	ОткрытьОтчет("Отчет.АнализНеоплаченныхСчетовПоставщиков.Форма", , , , КлючВарианта);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеБлокомПоставщикиПриСозданииНаСервере()
	
	Если Поставщики_ДоступностьРазделов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказыватьПоставщикиЗадолженность = Поставщики_ДоступностьРазделов.ЗадолженностьПоставщикам;
	Элементы.ГруппаПоставщикиЗадолженность.Видимость = ПоказыватьПоставщикиЗадолженность;
	
	ПоказыватьПоставщикиПросрочено = Поставщики_ДоступностьРазделов.ЗадолженностьПоставщикамПоСрокамДолга;
	Элементы.ГруппаПоставщикиПросрочено.Видимость = ПоказыватьПоставщикиПросрочено;
	
	ПоказыватьПоставщикиНеоплаченныеСчета = Поставщики_ДоступностьРазделов.АнализНеоплаченныхСчетовПоставщиков;
	Элементы.ГруппаПоставщикиНеоплаченныеСчета.Видимость = ПоказыватьПоставщикиНеоплаченныеСчета;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеБлокомПоставщики(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Элементы.Поставщики.Родитель = Элементы.БлокиПанели Тогда
		// Блок отключен
		Возврат;
	КонецЕсли;
	
	ПоказыватьСравнениеСПрошлымГодом = Форма.ПоказыватьСравнениеСПрошлымГодом;
	
	Элементы.Поставщики_ЗадолженностьОтклонение.Видимость            = ПоказыватьСравнениеСПрошлымГодом;
	Элементы.Поставщки_ПросроченнаяЗадолженностьОтклонение.Видимость = ПоказыватьСравнениеСПрошлымГодом;
	
КонецПроцедуры

#КонецОбласти

#Область Продажи

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеБлокомПродажи(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Элементы.Продажи.Родитель = Элементы.БлокиПанели Тогда
		// Блок отключен
		Возврат;
	КонецЕсли;
	
	ПоказыватьСравнениеСПрошлымГодом = Форма.ПоказыватьСравнениеСПрошлымГодом;
	
	ВГраницаИндекса = БлокиИнформационнойПанелиКлиентСервер.КоличествоПериодовПродаж() - 1;
	Для Индекс = 0 По ВГраницаИндекса Цикл
		ОтклонениеПродаж = БлокиИнформационнойПанелиКлиентСервер.СвойствоОтклонениеПродаж(Индекс);
		Элементы[ОтклонениеПродаж].Видимость = ПоказыватьСравнениеСПрошлымГодом;
	КонецЦикла;
	
	Если Форма.ЭтоМобильныйКлиент Тогда
		Элементы.ГруппаПродажи3.Видимость = 
			Не ПустаяСтрока(Форма.Продажи_Период3);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Продажи_Период0ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Продажи_ПериодОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Продажи_Период1ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Продажи_ПериодОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Продажи_Период2ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Продажи_ПериодОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Продажи_Период3ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Продажи_ПериодОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Продажи_ПериодОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = БлокиИнформационнойПанелиКлиентСервер.ИдентификаторПродажиТекущегоМесяца() Тогда
		
		КонецПериода  = КонецДня(Период);
		НачалоПериода = НачалоМесяца(КонецПериода);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = БлокиИнформационнойПанелиКлиентСервер.ИдентификаторПродажиТекущегоМесяцаСНачалаГода() Тогда
		
		КонецПериода  = КонецДня(Период);
		НачалоПериода = НачалоГода(КонецПериода);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = БлокиИнформационнойПанелиКлиентСервер.ИдентификаторПродажиПрошлогоМесяца() Тогда
		
		КонецПериода  = КонецМесяца(ДобавитьМесяц(Период, -1));
		НачалоПериода = НачалоМесяца(КонецПериода);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = БлокиИнформационнойПанелиКлиентСервер.ИдентификаторПродажиПрошлогоМесяцаСНачалаГода() Тогда
		
		КонецПериода  = КонецМесяца(ДобавитьМесяц(Период, -1));
		НачалоПериода = НачалоГода(КонецПериода);
		
	КонецЕсли;
	
	КлючВарианта = "ПродажиПоКонтрагентам";
	
	ОткрытьОтчет("Отчет.Продажи.Форма", , , , КлючВарианта, НачалоПериода, КонецПериода);
	
КонецПроцедуры

#КонецОбласти

#Область Новости

&НаКлиенте
Процедура НовостиВсеНовостиНажатие(Элемент)
	
	ИмяФормыНовостей = "Справочник.Новости.Форма.ФормаКонтекстныхНовостей";
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяМетаданных",                 "ИнформационнаяПанель");
	ПараметрыФормы.Вставить("ЗаголовокФормы",                НСтр("ru = 'Новости'"));
	ПараметрыФормы.Вставить("РежимОткрытияОкна",             "Независимый");
	ПараметрыФормы.Вставить("ПропуститьЗаполнениеНовостями", Истина);
	ПараметрыФормы.Вставить("СкрыватьКолонкуЛентаНовостей",  Истина);
	ПараметрыФормы.Вставить("СкрыватьКолонкуПодзаголовок",   Истина);
	ПараметрыФормы.Вставить("СкрыватьКолонкуДатаПубликации", Истина);
	ПараметрыФормы.Вставить("ПоказыватьПанельНавигации",     Ложь);
	
	ОткрытьФорму(ИмяФормыНовостей, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Новости_НовостьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если СсылкиНовостей.Количество() > Новости_Индекс Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Новость = СсылкиНовостей[Новости_Индекс].Значение;
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Ключ", Новость);
		ПараметрыОткрытияФормы.Вставить("РежимОткрытияОкна", "БлокироватьОкноВладельца");
		
		ОбработкаНовостейКлиент.ПоказатьНовость(Новость, ПараметрыОткрытияФормы, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Новости_ПереключательНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Индекс = ИндексЭлементаФормы(Элемент.Имя);
	Если Индекс <> Неопределено Тогда
		ПоказатьНовость(Индекс);
	КонецЕсли;
	
	// Перезапускаем обработчик ожидания
	ЗапуститьПереключениеНовостей();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПереключениеНовостей()
	
	ОтключитьОбработчикОжидания("Подключаемый_ПереключениеНовостей");
	Если БлокВключен(БлокиИнформационнойПанелиКлиентСервер.ИмяБлокаНовости()) И ТекстыНовостей.Количество() > 0 Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПереключениеНовостей", БлокиИнформационнойПанелиКлиентСервер.ИнтервалПереключенияНовостей());
	Иначе
		ОтключитьОбработчикОжидания("Подключаемый_ПереключениеНовостей");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПереключениеНовостей()
	
	ВГраницаИндекса = ТекстыНовостей.Количество() - 1;
	Если 0 <= Новости_Индекс И Новости_Индекс < ВГраницаИндекса Тогда
		ИндексНовости = Новости_Индекс + 1;
	Иначе
		ИндексНовости = 0;
	КонецЕсли;
	
	ПоказатьНовость(ИндексНовости);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНовость(ИндексНовости)
	
	Если ТекстыНовостей.Количество() > ИндексНовости Тогда
		Новости_Индекс = ИндексНовости;
		Новости_Текст  = ТекстыНовостей[ИндексНовости].Значение;
	Иначе
		Новости_Индекс = 0;
		Новости_Текст  = БлокиИнформационнойПанелиКлиентСервер.ТекстОтсутствияНовостей();
	КонецЕсли;
	
	УправлениеБлокомНовости(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеБлокомНовости(Форма)
	
	Элементы = Форма.Элементы;
	
	КоличествоНовостей = Форма.ТекстыНовостей.Количество();
	
	ВГраницаИндекса = БлокиИнформационнойПанелиКлиентСервер.КоличествоНовостей() - 1;
	Для Индекс = 0 По ВГраницаИндекса Цикл
		
		ИмяПереключателя = БлокиИнформационнойПанелиКлиентСервер.СвойствоПереключатель(Индекс);
		
		ПереключательДоступен = (Индекс < КоличествоНовостей);
		Элементы[ИмяПереключателя].Доступность = ПереключательДоступен;
		
		Если ПереключательДоступен Тогда
			АктивностьПереключателя = (Индекс = Форма.Новости_Индекс);
			Форма[ИмяПереключателя] = БлокиИнформационнойПанелиКлиентСервер.ИндексКартинкиПереключателя(АктивностьПереключателя);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокНовостей()
	
	Если ПустаяСтрока(Новости_АдресХранилища) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстыНовостей.Очистить();
	СсылкиНовостей.Очистить();
	
	Если ЭтоАдресВременногоХранилища(Новости_АдресХранилища) Тогда
		
		ДанныеНовостей = ПолучитьИзВременногоХранилища(Новости_АдресХранилища);
		Если ТипЗнч(ДанныеНовостей) = Тип("Структура") Тогда
			Для Каждого ТекстНовости Из ДанныеНовостей.ТекстыНовостей Цикл
				ТекстыНовостей.Добавить(ТекстНовости.Значение);
			КонецЦикла;
			Для Каждого СсылкаНовости Из ДанныеНовостей.СсылкиНовостей Цикл
				СсылкиНовостей.Добавить(СсылкаНовости.Значение);
			КонецЦикла;
		КонецЕсли;
		
		УдалитьИзВременногоХранилища(Новости_АдресХранилища);
		Новости_АдресХранилища = "";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПоддержкаСервиса

&НаСервере
Процедура УправлениеБлокомПоддержкаСервисаПриСозданииНаСервере()
	
	ИспользоватьРазделениеПоОбластямДанных = РаботаВМоделиСервиса.РазделениеВключено()
		И РаботаВМоделиСервиса.ДоступноИспользованиеРазделенныхДанных();
	
	ДоступнаИнтеграцияСоСлужбойПоддержки = ИспользоватьРазделениеПоОбластямДанных
		И ИнформационныйЦентрСервер.УстановленаИнтеграцияСоСлужбойПоддержки();
	
	Элементы.ГруппаОбращенияВСлужбуПоддержки.Видимость = ДоступнаИнтеграцияСоСлужбойПоддержки;
	
	ЭтоБизнесСтарт = ОбщегоНазначенияБП.ЭтоБизнесСтарт();
	
	ВыводитьСсылкуНаМагазин = ПолучитьФункциональнуюОпцию("ИспользованиеКаталогаРасширенийВМоделиСервиса")
		И Не ЭтоБизнесСтарт;
	Элементы.ГруппаКаталогРасширений.Видимость = ВыводитьСсылкуНаМагазин;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбращенияВПоддержкуНажатие(Элемент)
	
	ИнформационныйЦентрКлиент.ОткрытьОбращенияВСлужбуПоддержки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦентрИдейНажатие(Элемент)
	
	ИнформационныйЦентрКлиент.ОткрытьЦентрИдей();
	
КонецПроцедуры

&НаКлиенте
Процедура ФорумНажатие(Элемент)
	
	КлючеваяОперация = "ИнформационнаяПанель_ОбсужденияНаФоруме";
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, КлючеваяОперация);
	
	ИнформационныйЦентрКлиент.ОткрытьОбсужденияНаФоруме();
	
КонецПроцедуры

&НаКлиенте
Процедура МагазинРасширенийНажатие(Элемент)
	
	КаталогРасширенийКлиент.ОткрытьКаталогРасширений();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоддержкаСервиса_ТекстСообщенияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// ТехнологияСервиса.ИнформационныйЦентр
	ИнформационныйЦентрКлиент.ПоказатьВсеСообщения();
	// Конец ТехнологияСервиса.ИнформационныйЦентр
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Форма.Элементы.КартинкаФоновоеЗаданиеЗапущено.Видимость = (Форма.ФоновоеЗаданиеЗапущено Или Не Форма.ДанныеАктуальны);
	
	УправлениеБлокомОтчетность(Форма);
	
	УправлениеБлокомНовости(Форма);
	
	УправлениеБлокомОстаткиДенежныхСредств(Форма);
	
	УправлениеБлокомПродажи(Форма);
	
	УправлениеБлокомПокупатели(Форма);
	
	УправлениеБлокомПоставщики(Форма);
	
	УправлениеБлокомСПАРКРиски(Форма);
	
	УправлениеБлокомКурсыВалют(Форма);
	
	УправлениеБлокомЧастоЗадаваемыеВопросы(Форма);
	
	УправлениеБлокомЭлектроннаяПочта(Форма);
	
	УправлениеБлокомЗадачи(Форма);
	
	УправлениеБлокомМоиЗадачи(Форма);
	
	УправлениеБлокомМойНалог(Форма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеБлоков(БыстроеОбновление, ПрочитатьДанныеСтатическихБлоков, ПрочитатьДанныеДинамическихБлоков = Ложь)
	
	Если ПрочитатьДанныеСтатическихБлоков И Не ПустаяСтрока(СтатическиеБлоки) Тогда
		ПрочитатьДанныеБлоков(СтатическиеБлоки);
	КонецЕсли;
	
	Если ФоновоеЗаданиеЗапущено Тогда
		// Текущее фоновое задание неактуально
		ОтменитьВыполнениеЗадания(ОписаниеЗаданияОбновитьБлоки, ФоновоеЗаданиеЗапущено);
	КонецЕсли;
	
	Если ПустаяСтрока(ДинамическиеБлоки) Тогда
		
		ДанныеАктуальны = Истина;
		
	Иначе
		
		Если ПрочитатьДанныеДинамическихБлоков Тогда
			// Принудительное чтение данных до начала выполнения фонового задания
			ПрочитатьДанныеБлоков(ДинамическиеБлоки);
		Иначе
			// Чтение данных после завершения фонового задания
			ИнициализироватьДанныеБлоков(ДинамическиеБлоки);
		КонецЕсли;
		
		БыстроеОбновлениеДанных = БыстроеОбновление;
		
		ПодключитьОбработчикОжидания("Подключаемый_ОбновлениеДанныхБлоков", 0.1, Истина);
		
		ДанныеАктуальны = Ложь;
		
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура РасставитьБлоки()
	
	// Инициализация свойств
	Если ЭтоМобильныйКлиент Тогда
		
		ОбщиеСвойстваБлоков = ОбщиеСвойстваБлоковМК();
		ЭлементыБлоков = Новый Соответствие; // Соответствие элемента формы имени блока
		
		Для Каждого Блок Из ТаблицаБлоков Цикл
			ЭлементФормы = Элементы.Найти(Блок.Имя);
			Если ЭлементФормы <> Неопределено Тогда
				ЭлементыБлоков.Вставить(Блок.Имя, ЭлементФормы);
				ЗаполнитьЗначенияСвойств(ЭлементФормы, ОбщиеСвойстваБлоков);
			КонецЕсли;
		КонецЦикла;
	Иначе
	
		// Инициализация свойств
		
		ОбщиеСвойстваБлоков = ОбщиеСвойстваБлоков();
		
		ЭлементыБлоков = Новый Соответствие; // Соответствие элемента формы имени блока
		
		Для Каждого Блок Из ТаблицаБлоков Цикл
			ЭлементФормы = Элементы.Найти(Блок.Имя);
			Если ЭлементФормы <> Неопределено Тогда
				ЭлементыБлоков.Вставить(Блок.Имя, ЭлементФормы);
				ЭлементФормы.ЦветФона = Блок.ЦветФона;
				ЗаполнитьЗначенияСвойств(ЭлементФормы, ОбщиеСвойстваБлоков);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Возвращаем все блоки в невидимую группу БлокиПанели
	
	Для ИндексСтроки = 0 По ИнформационнаяПанель.КоличествоСтрок() - 1 Цикл
		Для ИндексКолонки = 0 По ИнформационнаяПанель.КоличествоКолонок() - 1 Цикл
			Контейнер = Элементы[ИмяКонтейнераБлока(ИндексСтроки, ИндексКолонки)];
			Для Каждого ПодчиненныйЭлемент Из Контейнер.ПодчиненныеЭлементы Цикл
				Элементы.Переместить(ПодчиненныйЭлемент, Элементы.БлокиПанели)
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	// Распределение блоков по контейнерам
	
	ИндексСтроки  = 0;
	ИндексКолонки = 0;
	
	ВГраницаСтрок   = ИнформационнаяПанель.КоличествоСтрок() - 1;
	ВГраницаКолонок = ИнформационнаяПанель.КоличествоКолонок() - 1;
	
	СтатическиеБлоки  = "";
	ДинамическиеБлоки = "";
	
	Для Каждого Блок Из ТаблицаБлоков Цикл
		
		Если Не Блок.Пометка Тогда
			// Блок выключен
			Продолжить;
		КонецЕсли;
		
		Если ПустаяСтрока(Блок.ПроцедураОбновленияДанных) Тогда
			СтатическиеБлоки = СтатическиеБлоки + ?(ПустаяСтрока(СтатическиеБлоки), "", ",") + Блок.Имя;
		Иначе
			ДинамическиеБлоки = ДинамическиеБлоки + ?(ПустаяСтрока(ДинамическиеБлоки), "", ",") + Блок.Имя;
		КонецЕсли;
		
		// Перемещаем блок из группы БлокиПанели в контейнер
		Контейнер = Элементы[ИмяКонтейнераБлока(ИндексСтроки, ИндексКолонки)];
		Если Контейнер <> Неопределено Тогда
			Элементы.Переместить(ЭлементыБлоков[Блок.Имя], Контейнер);
		КонецЕсли;
		
		Если ИндексКолонки = ВГраницаКолонок Тогда
			ИндексКолонки = 0;
			ИндексСтроки  = ИндексСтроки + 1;
		Иначе
			ИндексКолонки = ИндексКолонки + 1;
		КонецЕсли;
		
		Если ИндексСтроки > ВГраницаСтрок Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбщиеСвойстваБлоков()
	
	Возврат Новый Структура("Ширина,Высота,РастягиватьПоВертикали,РастягиватьПоГоризонтали", 30, 12, Ложь, Ложь);
	
КонецФункции

&НаСервереБезКонтекста
Функция ИмяКонтейнераБлока(ИндексСтроки, ИндексКолонки)
	
	Возврат СтрШаблон("Контейнер%1%2", ИндексСтроки, ИндексКолонки);
	
КонецФункции

&НаСервере
Процедура ИнициализироватьДанныеБлоков(СтрокаОтбора = "")
	
	ПолучитьДанныеБлоков(СтрокаОтбора, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеБлоков(СтрокаОтбора = "")
	
	ПолучитьДанныеБлоков(СтрокаОтбора, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеБлоков(СтрокаОтбора, Инициализация)
	
	ОбновитьЗаголовокФормы();
	
	УстановленОтбор = Не ПустаяСтрока(СтрокаОтбора);
	Если УстановленОтбор Тогда
		ОтборБлоков = СтрРазделить(СтрокаОтбора, ", ", Ложь);
	КонецЕсли;
	
	ПараметрыПолученияДанныхБлока = ИнформационнаяПанель.НовыйПараметрыПолученияДанныхБлока();
	ПараметрыПолученияДанныхБлока.УникальныйИдентификатор = УникальныйИдентификатор;
	ПараметрыПолученияДанныхБлока.Организация = Организация;
	ПараметрыПолученияДанныхБлока.ВариантОкругления = ВариантОкругления;
	ПараметрыПолученияДанныхБлока.ПоказыватьСравнениеСПрошлымГодом = ПоказыватьСравнениеСПрошлымГодом;
	ПараметрыПолученияДанныхБлока.Инициализация = Инициализация;
	
	Для Каждого Блок Из ТаблицаБлоков Цикл
		
		Если Не Блок.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Если УстановленОтбор И (ОтборБлоков.Найти(Блок.Имя) = Неопределено) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеБлока = ИнформационнаяПанель.ДанныеПредопределенногоБлока(Блок, ПараметрыПолученияДанныхБлока);
		Если Не ЗначениеЗаполнено(ДанныеБлока)
			Или ТипЗнч(ДанныеБлока) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Инициализация Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеБлока);
		Иначе
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеБлока, Блок.РеквизитыФормы);
		КонецЕсли;
		
		Если Блок.Имя = "ЭлектроннаяПочта" Тогда
			Если ДанныеБлока.Свойство("ТекстКоманды") Тогда
				Элементы.ЭлектроннаяПочтаВсеПисьма.Заголовок = ДанныеБлока.ТекстКоманды;
			КонецЕсли;
			Если ДанныеБлока.Свойство("НовыхПисемНет") Тогда 
				НовыхПисемНет = ДанныеБлока.НовыхПисемНет;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьСписокНовостей();
	ОбновитьСостояниеЗагрузкиКурсовВалют();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокФормы()
	
	Период = ТекущаяДатаСеанса();
	
	ПредставлениеТекущейДаты = Формат(Период, "Л=ru_RU; ДФ='d MMMM, dddd'");
	
	Заголовок = СтрШаблон(НСтр("ru = 'Сегодня: %1'"), ПредставлениеТекущейДаты);
	
КонецПроцедуры

&НаСервере
Процедура НастройкаИнформационнойПанелиПриИзменении()
	
	ИнформационнаяПанель.ПрименитьНастройки(ТаблицаБлоков);
	
	РасставитьБлоки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработатьИзменение()
	
	РеквизитыОрганизации = Организация;
	
	ДанныеОрганизации                = ДанныеОрганизации(Организация);
	ПоказыватьСравнениеСПрошлымГодом = ДанныеОрганизации.ПоказыватьСравнениеСПрошлымГодом;
	ИННОрганизации                   = ДанныеОрганизации.ИНН;
	НужноИскатьСертификат            = ДанныеОрганизации.НужноИскатьСертификат;
	
	БыстроеОбновление = Ложь;
	ПрочитатьДанныеСтатическихБлоков  = Ложь;
	ПрочитатьДанныеДинамическихБлоков = Истина;
	
	ОбновитьДанныеБлоков(БыстроеОбновление, ПрочитатьДанныеСтатическихБлоков, ПрочитатьДанныеДинамическихБлоков);
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Функция ИндексЭлементаФормы(Знач Имя)
	
	Цифры = "1234567890";
	НомерСтрокой = "";
	
	ДлинаИмени = СтрДлина(Имя);
	
	ВГраница   = ДлинаИмени - 1;
	Для Индекс = 0 По ВГраница Цикл
		Позиция = ДлинаИмени - Индекс;
		Символ = Сред(Имя,Позиция,1);
		Если СтрНайти(Цифры, Символ) = 0 Тогда
			Прервать;
		КонецЕсли;
		НомерСтрокой = Символ + НомерСтрокой;
	КонецЦикла;
	
	Если ПустаяСтрока(НомерСтрокой) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Возврат Число(НомерСтрокой);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьОтчет(Отчет, ГруппировкаОтчета = Неопределено, Отборы = Неопределено, Показатели  = Неопределено, КлючВарианта = Неопределено, НачалоПериода = Неопределено, КонецПериода = Неопределено)
	
	ПользовательскиеНастройки = ПользовательскиеНастройкиДляРасшифровки(НачалоПериода, КонецПериода);
	ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
	
	Если ГруппировкаОтчета <> Неопределено И ТипЗнч(ГруппировкаОтчета) = Тип("Массив") Тогда
		ДополнительныеСвойства.Вставить("Группировка", ГруппировкаОтчета);
	КонецЕсли;
	
	Если ТипЗнч(Отборы) = Тип("Массив") Тогда
		
		НастройкаОтбора = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
		НастройкаОтбора.ИдентификаторПользовательскойНастройки = "Отбор";
		Для Каждого Отбор Из Отборы Цикл
			БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(НастройкаОтбора, Отбор.Поле, Отбор.Значение, Отбор.ВидСравнения);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(Показатели) = Тип("Массив") Тогда
		
		Для Каждого Показатель Из Показатели Цикл
			ДополнительныеСвойства.Вставить(Показатель, Истина);
		КонецЦикла;
		
	КонецЕсли;
	
	Если КлючВарианта <> Неопределено Тогда
		ДополнительныеСвойства.Вставить("КлючВарианта", КлючВарианта);
	КонецЕсли;
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("РежимРасшифровки"         , Истина);
	ПараметрыОтчета.Вставить("ВидРасшифровки"           , 2);
	ПараметрыОтчета.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
	
	ОткрытьФорму(Отчет, ПараметрыОтчета, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Функция ПользовательскиеНастройкиДляРасшифровки(НачалоПериода = Неопределено, КонецПериода = Неопределено)
	
	// Инициализация пользовательских настроек
	// Добавим в настройки все параметры которые могут использоваться в отчетах руководителю
	
	ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	
	ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
	ДополнительныеСвойства.Вставить("РежимРасшифровки", Истина);
	ДополнительныеСвойства.Вставить("Организация", Организация);
	ДополнительныеСвойства.Вставить("Период", Период);
	
	Если НачалоПериода <> Неопределено Тогда
		ДополнительныеСвойства.Вставить("НачалоПериода", НачалоПериода);
	КонецЕсли;
	Если КонецПериода <> Неопределено Тогда
		ДополнительныеСвойства.Вставить("КонецПериода", КонецПериода);
	КонецЕсли;
	
	Если ВариантОкругления = 1000 Тогда
		
		// Установим формат цифр для рублевых сумм
		УсловноеОформление = ПользовательскиеНастройки.Элементы.Добавить(Тип("УсловноеОформлениеКомпоновкиДанных"));
		УсловноеОформление.ИдентификаторПользовательскойНастройки = "УсловноеОформление";
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Представление = НСтр("ru = 'Суммы в тыс.'");
		ЭлементУсловногоОформления.Использование = Истина;
		
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(ЭлементУсловногоОформления.Оформление, "Формат", "ЧДЦ=; ЧС=3");
		
	КонецЕсли;
	
	Возврат ПользовательскиеНастройки;
	
КонецФункции

&НаКлиенте
Функция БлокВключен(ИмяБлока)
	
	ПараметрыОтбора = Новый Структура("Имя", ИмяБлока);
	НайденныеБлоки = ТаблицаБлоков.НайтиСтроки(ПараметрыОтбора);
	
	Если ЭтоМобильныйКлиент Тогда
		Если Не БлокДоступенНаМК(ИмяБлока) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НайденныеБлоки.Количество() > 0 И НайденныеБлоки[0].Пометка;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьБлок(ИмяБлока)
	
	ПараметрыОтбора = Новый Структура("Имя", ИмяБлока);
	НайденныеБлоки = ТаблицаБлоков.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеБлоки.Количество() = 0 Тогда
		ОбновитьТаблицуБлоков();
		НайденныеБлоки = ТаблицаБлоков.НайтиСтроки(ПараметрыОтбора);
	КонецЕсли;
	
	// Включаем блок
	Если НайденныеБлоки.Количество() > 0 И Не НайденныеБлоки[0].Пометка Тогда
		НайденныеБлоки[0].Пометка = Истина;
		СоставИзменен = Истина;
	Иначе
		СоставИзменен = Ложь;
	КонецЕсли;
	
	Если СоставИзменен Тогда
		
		РасставитьБлоки();
		
		// Полное обновление всех блоков
		БыстроеОбновление = Ложь;
		ПрочитатьДанныеСтатическихБлоков = Истина;
		ОбновитьДанныеБлоков(БыстроеОбновление, ПрочитатьДанныеСтатическихБлоков);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьБлок(ИмяБлока)
	
	ПараметрыОтбора = Новый Структура("Имя", ИмяБлока);
	НайденныеБлоки = ТаблицаБлоков.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеБлоки.Количество() > 0 Тогда
		ОбновитьТаблицуБлоков();
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуБлоков()
	
	ТаблицаБлоков.Очистить();
	
	// Инициализация таблицы настроек
	ИнформационнаяПанель.ДобавитьПредопределенныеБлоки(ТаблицаБлоков);
	
	// Накладываем пользовательские настройки
	ИнформационнаяПанель.ПрименитьНастройки(ТаблицаБлоков);
	
	РасставитьБлоки();
	
	ПрочитатьДанныеБлоков();
	
	УправлениеБлокомПокупателиПриСозданииНаСервере();
	УправлениеБлокомПоставщикиПриСозданииНаСервере();
	УправлениеБлокомПоддержкаСервисаПриСозданииНаСервере();
	
КонецПроцедуры

&НаКлиенте
// Вызывается при получении оповещения о записи организации.
// Для новых организаций добавляет их ссылки в отбор параметра выбора, 
// чтобы они были доступны в списке на форме.
//
// Параметры:
//	Параметр - Неопределено, Структура - Параметр, полученный в ОбработкаОповещения().
//		Если имеет тип Структура и содержит ключ "ЭтоНовый", то такое оповещения будет обработано,
//		иначе проигнорировано.
//	Источник - СправочникСсылка.Организации - Ссылка на измененную организацию.
//
Процедура ОбработкаОповещенияЗаписьОрганизации(Параметр, Источник)
	
	Если ТипЗнч(Параметр) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если (Не Параметр.Свойство("ЭтоНовый") Или Не Параметр.ЭтоНовый)
		И Не Параметр.Свойство("ИзменениеВАрхиве") Тогда
		Возврат;
	КонецЕсли;
	
	// При записи новой организации добавим ее в список доступных для выбора организаций на форме.
	ДоступныеОрганизации = Новый Массив;
	ДоступныеОрганизации.Добавить(Источник);
	
	Если Элементы.Организация.ПараметрыВыбора.Количество() > 0 Тогда
		// В качестве значения параметра выбора указан фиксированный массив ссылок организаций, 
		// полученный из ОбщегоНазначенияБПВызовСервераПовтИсп.ОрганизацииДанныеКоторыхДоступныПользователю().
		// Копируем их в новых массив.
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДоступныеОрганизации, Элементы.Организация.ПараметрыВыбора[0].Значение);
	КонецЕсли;
	
	ФиксированныйМассивДоступныхОрганизаций = Новый ФиксированныйМассив(ДоступныеОрганизации);
	
	УстановитьПараметрыВыбораОрганизации(ЭтотОбъект, ДоступныеОрганизации);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрыВыбораОрганизации(Форма, ДоступныеОрганизации)
	
	Элементы = Форма.Элементы;
	
	ПараметрВыбораОтборПоОрганизации = Новый ПараметрВыбора("Отбор.Ссылка", ДоступныеОрганизации);
	
	ПараметрыВыбораОрганизации = Новый Массив();
	ПараметрыВыбораОрганизации.Добавить(ПараметрВыбораОтборПоОрганизации);
	
	Элементы.Организация.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораОрганизации);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НеобходимоОбновитьИнтерфейс()
	
	Возврат ПолучитьФункциональнуюОпцию("ОтображатьПодсистемуЗарплата");
	
КонецФункции

#Область ОбновлениеИнформационнойПанели

&НаКлиенте
Процедура Подключаемый_ОбновлениеДанныхБлоков()
	
	Если ПустаяСтрока(ДинамическиеБлоки) Тогда
		Возврат;
	КонецЕсли;
	
	БыстроеОбновление = (БыстроеОбновлениеДанных = Неопределено Или БыстроеОбновлениеДанных);
	
	Если ЗапуститьОбновлениеДанныхБлоков(БыстроеОбновление) Тогда
		ОжидатьОбновленияДанныхБлоков();
	Иначе
		// Включен монопольный режим, попробуем обновить позже
		ИнтервалМеждуПопыткамиОбновления = 60;
		ПодключитьОбработчикОжидания("Подключаемый_ОбновлениеДанныхБлоков", ИнтервалМеждуПопыткамиОбновления, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЕжедневноеОбновление()
	
	// Полное обновление всех блоков
	БыстроеОбновление = Ложь;
	ПрочитатьДанныеСтатическихБлоков = Истина;
	ОбновитьДанныеБлоков(БыстроеОбновление, ПрочитатьДанныеСтатическихБлоков);
	
	// Запланируем обновление на завтра
	ПодключитьОбработчикОжидания("Подключаемый_ЕжедневноеОбновление", ИнтервалОбновленияДанных(ТекущаяДата()), Истина);
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьОбновлениеДанныхБлоков(БыстроеОбновление = Ложь)
	
	Если МонопольныйРежим() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Возможно, что фоновое задание было запущено раньше, 
	// пользователь дал команду его отменить, однако задание не отменено.
	// В таком случае не следует запускать задание повторно - следует дождаться его выполнения.
	Если ФоновоеЗаданиеЗапущено И ЗначениеЗаполнено(ОписаниеЗаданияОбновитьБлоки) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПараметрыЗадания = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыЗадания.НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление данных блоков Информационной панели'");
	ПараметрыЗадания.ЗапуститьВФоне = Истина;
	
	ПроцедурыОбновленияДанных = Новый Массив;
	Для Каждого Блок Из ТаблицаБлоков Цикл
		Если Блок.Пометка И Не ПустаяСтрока(Блок.ПроцедураОбновленияДанных) Тогда
			ПроцедурыОбновленияДанных.Добавить(Блок.ПроцедураОбновленияДанных);
		КонецЕсли;
	КонецЦикла;
	
	КурсыВалют_АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено);
	КурсыВалют_ОшибкаЗагрузки = Ложь;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("БыстроеОбновление",                БыстроеОбновление);
	СтруктураПараметров.Вставить("Организация",                      Организация);
	СтруктураПараметров.Вставить("ПроцедурыОбновленияДанных",        ПроцедурыОбновленияДанных);
	СтруктураПараметров.Вставить("ПоказыватьСравнениеСПрошлымГодом", ПоказыватьСравнениеСПрошлымГодом);
	СтруктураПараметров.Вставить("АдресРезультатаКурсыВалют",        КурсыВалют_АдресХранилища);
	
	ОписаниеЗаданияОбновитьБлоки = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыЗадания, "ИнформационнаяПанель.ОбновитьДанныеБлоков", СтруктураПараметров);
	
	Если ОписаниеЗаданияОбновитьБлоки.Статус = "Выполнено" Тогда
		ДанныеАктуальны = Истина;
		ОписаниеЗаданияОбновитьБлоки = Неопределено;
		ПрочитатьДанныеБлоков(ДинамическиеБлоки);
	Иначе
		ФоновоеЗаданиеЗапущено = Истина;
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОжидатьОбновленияДанныхБлоков()
	
	Если Не ФоновоеЗаданиеЗапущено Или Не ЗначениеЗаполнено(ОписаниеЗаданияОбновитьБлоки) Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновлениеДанныхБлоковЗавершение", ЭтотОбъект);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ОписаниеЗаданияОбновитьБлоки, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеДанныхБлоковЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт 

	Если РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ФоновоеЗаданиеЗапущено = Ложь;
	ДанныеАктуальны = Истина;
	ПрочитатьДанныеБлоков(ДинамическиеБлоки);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтменитьВыполнениеЗадания(ОписаниеЗадания, ЗаданиеЗапущено)
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ОписаниеЗадания.ИдентификаторЗадания);
	ОписаниеЗадания = Неопределено;
	ЗаданиеЗапущено = Ложь;
	
КонецПроцедуры

&НаКлиенте
Функция ИнтервалОбновленияДанных(ДатаОбновленияДанных)
	
	Возврат (КонецДня(ДатаОбновленияДанных) + 1) - ДатаОбновленияДанных + 59;
	
КонецФункции

#КонецОбласти

#Область ЧастоЗадаваемыеВопросы

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеБлокомЧастоЗадаваемыеВопросы(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ЧастоЗадаваемыеВопросыВсеВопросы.Заголовок =
		БлокиИнформационнойПанелиКлиентСервер.СсылкаНаПлейлистЧастоЗадаваемыеВопросы();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СПАРКРиски

&НаКлиенте
Процедура Сервис1СПАРКРиски_ВсеСобытияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОтчетСобытияМониторингаСПАРКРиски" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СформироватьПриОткрытии"			, Истина);
		ПараметрыФормы.Вставить("СПАРКРискиОтключитьПараметрыОтчета", Истина);
		ПараметрыФормы.Вставить("КлючВарианта"						, "Основной");
	
		ОткрытьФорму("Отчет.СобытияМониторингаСПАРКРиски.Форма", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеБлокомСПАРКРиски(Форма)
	
	Элементы = Форма.Элементы;
	Если ПустаяСтрока(Форма.Сервис1СПАРКРиски_События1) Тогда
		
		Элементы.Сервис1СПАРКРиски_События0.Высота = 3;
		Элементы.Сервис1СПАРКРиски_События1.Высота = 1;
		
	Иначе
		
		Если СтрЧислоСтрок(Форма.Сервис1СПАРКРиски_События0) = 1 Тогда
			
			Элементы.Сервис1СПАРКРиски_События0.Высота = 1;
			Элементы.Сервис1СПАРКРиски_События1.Высота = 3;
			
		Иначе
			
			Элементы.Сервис1СПАРКРиски_События0.Высота = 2;
			Элементы.Сервис1СПАРКРиски_События1.Высота = 2;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Баннер

&НаСервереБезКонтекста
Функция ДанныеОрганизации(Знач Организация)
	
	ДанныеОрганизации = Новый Структура;
	ДанныеОрганизации.Вставить("ИНН",
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ИНН"));
	ДанныеОрганизации.Вставить("ПоказыватьСравнениеСПрошлымГодом", Ложь);
	ДанныеОрганизации.Вставить("НужноИскатьСертификат", 
		ПерсонализированныеПредложенияСервисов.НужноИскатьСертификат(Организация));
	
	ДатаНачалаВеденияУчета = Справочники.Организации.ДатаНачалаВеденияУчета(Организация);
	Если ДатаНачалаВеденияУчета <> Неопределено Тогда
		ДанныеОрганизации.ПоказыватьСравнениеСПрошлымГодом = (ДатаНачалаВеденияУчета < НачалоГода(ТекущаяДатаСеанса()));
	КонецЕсли;
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		ДанныеОрганизации.ПоказыватьСравнениеСПрошлымГодом = Ложь;
		ДанныеОрганизации.НужноИскатьСертификат = Ложь;
	КонецЕсли;
	
	Возврат ДанныеОрганизации;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_УстановитьБаннер()
	
	УстановитьБаннер();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьБаннер(ПоказатьПредыдущий = Ложь)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПоказатьПредыдущий", ПоказатьПредыдущий);
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьБаннерЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	Если НЕ НужноИскатьСертификат Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Неопределено);
	Иначе
		ПерсонализированныеПредложенияСервисовКлиент.ОпределитьНаличиеСертификатовЭлектроннойОтчетности(
			ОписаниеОповещения, ИННОрганизации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьБаннерЗавершение(СторонниеСертификаты, ДополнительныеПараметры) Экспорт
	
	ДлительнаяОперация = ПолучитьБаннерНаСервере(СторонниеСертификаты,
		ДополнительныеПараметры.ПоказатьПредыдущий);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус <> "Ошибка" Тогда
		
		НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
		
		Обработчик = Новый ОписаниеОповещения("ПослеПолученияБаннераВФоне", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияБаннераВФоне(ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		УстановитьБаннерНаФорме(ДлительнаяОперация.АдресРезультата);
		ПодключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер",
			ПерсонализированныеПредложенияСервисовКлиент.ИнтервалПереключенияБаннеров(), Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьБаннерНаСервере(СторонниеСертификаты = Неопределено, ПоказатьПредыдущий)
	
	Если НужноИскатьСертификат И СторонниеСертификаты <> Неопределено Тогда
		НужноИскатьСертификат = Ложь;
		// Сохраним информацию о сторонних сертификатах.
		ПерсонализированныеПредложенияСервисов.ЗаписатьИнформациюОСтороннихСертификатах(Организация, СторонниеСертификаты);
	КонецЕсли;
	
	НастройкиЗапуска = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	НастройкиЗапуска.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение баннера в фоне'");
	НастройкиЗапуска.ЗапуститьВФоне = Истина;
	НастройкиЗапуска.ОжидатьЗавершение = 0;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Организация", Организация);
	СтруктураПараметров.Вставить("Размещение", ПерсонализированныеПредложенияСервисов.ИмяРазмещенияОбщее());
	СтруктураПараметров.Вставить("ПоказатьПредыдущий", ПоказатьПредыдущий);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"ПерсонализированныеПредложенияСервисов.ПолучитьБаннер",
		СтруктураПараметров,
		НастройкиЗапуска);
	
КонецФункции

&НаСервере
Процедура УстановитьБаннерНаФорме(АдресРезультата)
	
	ПерсонализированныеПредложенияСервисов.УстановитьБаннерНаФорме(ЭтотОбъект, АдресРезультата);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьСледующийБаннер()
	
	// Поскольку обработчик может вызываться не только интерактивно пользователем,
	// но и автоматически по таймеру, меняем баннер при условии, что форма находится в фокусе.
	Если НЕ ВводДоступен() Тогда
		ПодключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер",
			ПерсонализированныеПредложенияСервисовКлиент.ИнтервалПереключенияБаннеров(), Истина);
		Возврат;
	КонецЕсли;
	
	УстановитьБаннер();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьПредыдущийБаннер()
	
	УстановитьБаннер(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область КурсыВалют

&НаКлиенте
Процедура ВсеВалютыНажатие(Элемент)
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием();
	ПараметрыОткрытия.ИмяФормы = "Справочник.Валюты.ФормаСписка";
	
	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура КурсыВалют_Валюта0ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ИсторияКурса" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуКурсыВалют(КурсыВалют_ВалютаСсылка0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КурсыВалют_Валюта1ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ИсторияКурса" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуКурсыВалют(КурсыВалют_ВалютаСсылка1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КурсыВалют_Валюта2ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ИсторияКурса" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуКурсыВалют(КурсыВалют_ВалютаСсылка2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КурсыВалют_Валюта3ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ИсторияКурса" Тогда
		ОткрытьФормуКурсыВалют(КурсыВалют_ВалютаСсылка3);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОшибкаЗагрузки" Тогда
		Если ЕстьПравоПросмотраЖурналаРегистрации() Тогда
			ОтборСобытий = Новый Структура;
			ОтборСобытий.Вставить("СобытиеЖурналаРегистрации", НСтр("ru = 'Валюты.Загрузка курсов валют'"));
			ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(ОтборСобытий);
		Иначе
			ТекстПредупреждения = НСтр("ru='При загрузке курсов валют из Интернета возникла ошибка. Обратитесь к администратору.'");
			ПоказатьПредупреждение(, ТекстПредупреждения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьПравоПросмотраЖурналаРегистрации()
	Возврат Пользователи.ЭтоПолноправныйПользователь(, , Ложь);
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуКурсыВалют(Валюта)
	
	ЗначениеОтбора = Новый Структура("Валюта", Валюта);
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("РегистрСведений.КурсыВалют.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Функция ИзмененаДоступностьКурсовВалют()
	
	ПараметрыОтбора = Новый Структура("Имя", БлокиИнформационнойПанелиКлиентСервер.ИмяБлокаКурсыВалют());
	НайденныеБлоки = ТаблицаБлоков.НайтиСтроки(ПараметрыОтбора);
	
	БлокЕстьВТаблице = (НайденныеБлоки.Количество() > 0);
	КурсыВалютДоступны = БлокиИнформационнойПанели.КурсыВалютДоступны();
	
	Возврат (Не БлокЕстьВТаблице И КурсыВалютДоступны) 
		Или (БлокЕстьВТаблице И Не КурсыВалютДоступны);
	
КонецФункции

&НаСервере
Процедура ОбновитьСостояниеЗагрузкиКурсовВалют()
	
	Если ЭтоАдресВременногоХранилища(КурсыВалют_АдресХранилища) Тогда
		
		РезультатЗагрузкиКурсов = ПолучитьИзВременногоХранилища(КурсыВалют_АдресХранилища);
		
		Если ТипЗнч(РезультатЗагрузкиКурсов) = Тип("Структура") Тогда
			
			КурсыВалют_ОшибкаЗагрузки = РезультатЗагрузкиКурсов.ЕстьОшибкиПриЗагрузке;
			Если КурсыВалют_ОшибкаЗагрузки Тогда
				
				ТекстПредупреждения = Новый ФорматированнаяСтрока(НСтр("ru='Не удалось обновить курсы валют'"), 
					ШрифтыСтиля.ШрифтТекстаИнформационнойПанели, ЦветаСтиля.ВажноеСобытие, , "ОшибкаЗагрузки");
				
				КурсыВалют_Валюта3 = ТекстПредупреждения;
				
			КонецЕсли;
			
		КонецЕсли;
		
		УдалитьИзВременногоХранилища(КурсыВалют_АдресХранилища);
		КурсыВалют_АдресХранилища = "";
		
	КонецЕсли;
	
	УправлениеБлокомКурсыВалют(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеБлокомКурсыВалют(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.КурсыВалют_Курс3.Видимость = Не Форма.КурсыВалют_ОшибкаЗагрузки;
	Элементы.КурсыВалют_Отклонение3.Видимость = Не Форма.КурсыВалют_ОшибкаЗагрузки;
	
	Если Форма.ЭтоМобильныйКлиент Тогда
		Элементы.ГруппаКурсыВалют0.Видимость = 
			Не ПустаяСтрока(Форма.КурсыВалют_Валюта0);
		Элементы.ГруппаКурсыВалют1.Видимость = 
			Не ПустаяСтрока(Форма.КурсыВалют_Валюта1);
		Элементы.ГруппаКурсыВалют2.Видимость = 
			Не ПустаяСтрока(Форма.КурсыВалют_Валюта2);
		Элементы.ГруппаКурсыВалют3.Видимость = 
			Не ПустаяСтрока(Форма.КурсыВалют_Валюта3);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область МойНалог

&НаСервереБезКонтекста
Функция МойНалогДоступен()
	
	Возврат БлокиИнформационнойПанели.МойНалогДоступен();
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеБлокомМойНалог(Форма)
	
	Элементы = Форма.Элементы;
	Если Не Форма.ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.МойНалог_Оповещение0.Видимость = 
		Не ПустаяСтрока(Форма.МойНалог_Оповещение0);
	Элементы.МойНалог_Оповещение1.Видимость = 
		Не ПустаяСтрока(Форма.МойНалог_Оповещение1);
	Элементы.МойНалог_Оповещение2.Видимость = 
		Не ПустаяСтрока(Форма.МойНалог_Оповещение2);
	Элементы.МойНалог_Оповещение3.Видимость = 
		Не ПустаяСтрока(Форма.МойНалог_Оповещение3);
	
КонецПроцедуры
#КонецОбласти

#Область ЭлектроннаяПочта

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеБлокомЭлектроннаяПочта(Форма)
	
	Элементы = Форма.Элементы;
	Если Не Форма.ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ЭлектроннаяПочта_Письмо1.Видимость = 
		Не ПустаяСтрока(Форма.ЭлектроннаяПочта_Письмо1);
	Элементы.ЭлектроннаяПочта_Письмо2.Видимость = 
		Не ПустаяСтрока(Форма.ЭлектроннаяПочта_Письмо2);
	Элементы.ЭлектроннаяПочта_Письмо3.Видимость = 
		Не ПустаяСтрока(Форма.ЭлектроннаяПочта_Письмо3);
	
КонецПроцедуры

#КонецОбласти

#Область Задачи

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеБлокомЗадачи(Форма)
	
	Элементы = Форма.Элементы;
	Если Не Форма.ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Задачи_НаименованиеЗадачи0.Видимость = 
		Не ПустаяСтрока(Форма.Задачи_НаименованиеЗадачи0);
	Элементы.Задачи_НаименованиеЗадачи1.Видимость = 
		Не ПустаяСтрока(Форма.Задачи_НаименованиеЗадачи1);
	Элементы.Задачи_НаименованиеЗадачи2.Видимость = 
		Не ПустаяСтрока(Форма.Задачи_НаименованиеЗадачи2);
		
КонецПроцедуры

#КонецОбласти

#Область МоиЗадачи

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеБлокомМоиЗадачи(Форма)
	
	Элементы = Форма.Элементы;
	Если Не Форма.ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.МоиЗадачи_НаименованиеЗадачи2.Видимость = 
		Не ПустаяСтрока(Форма.МоиЗадачи_НаименованиеЗадачи1);
	Элементы.МоиЗадачи_НаименованиеЗадачи3.Видимость = 
		Не ПустаяСтрока(Форма.МоиЗадачи_НаименованиеЗадачи2);
	Элементы.МоиЗадачи_НаименованиеЗадачи4.Видимость = 
		Не ПустаяСтрока(Форма.МоиЗадачи_НаименованиеЗадачи3);
	
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	ПоказыватьПодсказкуСканироватьQRПлатежа = ПоказыватьПодсказкуСканироватьQRПлатежа();
	МобильныйКлиентБПФормаОбъекта.НастроитьФорму(ЭтотОбъект);
	
	АдаптироватьМКШапкаФормы();
	АдаптироватьМККоманднаяПанельФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	АдаптироватьБлоки();
	
	Элементы.Шапка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Элементы.РеквизитыОрганизации.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элементы.Организация.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элементы.РеквизитыОрганизации.АвтоМаксимальнаяШирина = Ложь;
	Элементы.Организация.АвтоМаксимальнаяШирина = Ложь;
	Элементы.РеквизитыОрганизации.МаксимальнаяШирина = 0;
	Элементы.Организация.МаксимальнаяШирина = 0;
	Элементы.РеквизитыОрганизации.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	Элементы.Организация.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	Элементы.РеквизитыОрганизации.РастягиватьПоГоризонтали=Истина;
	Элементы.Организация.РастягиватьПоГоризонтали=Истина;
	
	Элементы.ГруппаМКИнформационнаяПанель.Видимость = Истина;
	
	МобильныйКлиентБПФормаОбъекта.ВстроитьЭлементФормыВГруппаМКФормаВажное(Элементы, Элементы.ГруппаМКИнформационнаяПанель);
	
	Элементы.Переместить(Элементы.ГруппаФоновоеЗаданиеЗапущено,
		Элементы.ГруппаМКПанели);
		
	Элементы.Переместить(Элементы.Шапка,
		Элементы.ГруппаМКПанели);
		
	Элементы.Переместить(Элементы.Контейнеры,
		Элементы.ГруппаМКПанели);
	
	Элементы.Контейнеры.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	Элементы.СтрокаКонтейнеров0.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Элементы.СтрокаКонтейнеров1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Элементы.СтрокаКонтейнеров2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	МобильныйКлиентБПФормаОбъекта.СкрытьЭлементФормы(Элементы, Элементы.ГруппаАкселераторы);
	МобильныйКлиентБПФормаОбъекта.СкрытьЭлементФормы(Элементы, Элементы.ДекорацияОтступСлева0);
	МобильныйКлиентБПФормаОбъекта.СкрытьЭлементФормы(Элементы, Элементы.ДекорацияОтступСлева1);
	МобильныйКлиентБПФормаОбъекта.СкрытьЭлементФормы(Элементы, Элементы.ДекорацияОтступСлева2);
	МобильныйКлиентБПФормаОбъекта.СкрытьЭлементФормы(Элементы, Элементы.ДекорацияОтступСнизу);
	МобильныйКлиентБПФормаОбъекта.СкрытьПрочиеЭлементыФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМККоманднаяПанельФормы()
	
	МобильныйКлиентБПФормаОбъекта.АдаптироватьМККоманднаяПанель(ЭтотОбъект);
	Элементы.Обновить.Отображение = ОтображениеКнопки.Картинка;
	МобильныйКлиентБПФормаОбъекта.ПеренестиКомандыВМККомандыФормы(Элементы, Элементы.КоманднаяПанель.ПодчиненныеЭлементы);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаМКНаписатьРазработчикам(Команда)
	МобильныйКлиентБПКлиент.НачатьОтправкуПисьмаРазработчикам(
		НСтр("ru = 'Поделитесь своими впечатлениями о новом приложении'"));
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбщиеСвойстваБлоковМК()
	
	Возврат Новый Структура("Ширина,Высота,РастягиватьПоВертикали,РастягиватьПоГоризонтали,ЦветФона",
		0,
		0,
		Ложь,
		Истина,
		Новый Цвет());
	
КонецФункции

&НаКлиенте
Процедура ДекорацияНовыйУПДНажатие(Элемент)
	
	СписокВыбораОперации = Новый СписокЗначений;
	СписокВыбораОперации.Добавить("УПД_Товары", "Товары");
	СписокВыбораОперации.Добавить("УПД_Услуги", "Услуги");
	
	ОписаниеЗавершения = Новый ОписаниеОповещения("КомандыМК_Создать_Завершение", ЭтотОбъект);
	ПоказатьВыборИзМеню(ОписаниеЗавершения, СписокВыбораОперации, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура КомандыМК_Создать_Завершение(ВыбранныйЭлемент, ДопПараметры) Экспорт

	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = "УПД_Товары" Тогда
		СоздатьУПДТовары(Неопределено);
	ИначеЕсли ВыбранныйЭлемент.Значение = "УПД_Услуги" Тогда
		СоздатьУПДУслуги(Неопределено);
	ИначеЕсли ВыбранныйЭлемент.Значение = "СчетПокупателю" Тогда
		СоздатьСчет(Неопределено);
	ИначеЕсли ВыбранныйЭлемент.Значение = "Акт" Тогда
		СоздатьАкт(Неопределено);
	ИначеЕсли ВыбранныйЭлемент.Значение = "Накладная" Тогда
		СоздатьНакладную(Неопределено);
	ИначеЕсли ВыбранныйЭлемент.Значение = "Платеж" Тогда
		СоздатьПлатеж();
	ИначеЕсли ВыбранныйЭлемент.Значение = "" Тогда
		//Отступ
	Иначе
		ВызватьИсключение "Неизвестный вид документа";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНоваяНакладнаяНажатие(Элемент)
	СоздатьНакладную(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНовыйАктНажатие(Элемент)
	СоздатьАкт(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНовыйСчетНажатие(Элемент)
	СоздатьСчет(Неопределено);
КонецПроцедуры

&НаСервере
Процедура АдаптироватьБлоки()
	
	ДоступныеРазделыНаМК = БлокиИнформационнойПанелиКлиентСервер.ДоступныеРазделыНаМК();
	Для Каждого Блок Из ТаблицаБлоков Цикл
		Если ДоступныеРазделыНаМК.Найти(Блок.Имя) = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				Блок.Имя,
				"Видимость",
				Ложь);
		Иначе
			АдаптироватьБлокиМК(Блок.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Для ИндексСтроки = 0 По ИнформационнаяПанель.КоличествоКолонок() - 1 Цикл
		Для ИндексКолонки = 0 По ИнформационнаяПанель.КоличествоСтрок() - 1 Цикл
			Контейнер = Элементы[ИмяКонтейнераБлока(ИндексСтроки, ИндексКолонки)];
			Контейнер.Ширина = 0;
			Контейнер.Высота = 0;
			Контейнер.РастягиватьПоГоризонтали = Истина;
			Контейнер.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
		КонецЦикла;
	КонецЦикла;
	
	АдаптироватьМКОстаткиДенежныхСредств();
	АдаптироватьМКПокупатели();
	АдаптироватьМКПоставщики();
	АдаптироватьМКПродажи();
	АдаптироватьМККурсыВалют();
	АдаптироватьМКМойНалог();
	
	Элементы.МоиЗадачиВсеМоиЗадачи.РастягиватьПоВертикали = Ложь;
	Элементы.ЗадачиВсеЗадачи.РастягиватьПоВертикали = Ложь;
	
	ДоступноРаспознавание = ПолучитьФункциональнуюОпцию("ИспользоватьРаспознаваниеДокументов")
		И ПравоДоступа("Просмотр", Метаданные.Обработки.РаспознаваниеДокументов);
	СозданиеСчета = ПравоДоступа("Изменение", Метаданные.Документы.СчетНаОплатуПокупателю);
	СозданиеРеализации = ПравоДоступа("Изменение", Метаданные.Документы.РеализацияТоваровУслуг);
	СозданиеПлатежа = ПравоДоступа("Изменение", Метаданные.Документы.ПлатежноеПоручение);
	
	ДоступныПанелиМК = Не ОбщегоНазначенияБП.ЭтоИнтерфейсИнтеграцииСБанком();
	ДоступнаПанельАкселераторыМК = ДоступныПанелиМК
		И (ДоступноРаспознавание Или СозданиеПлатежа);
	ДоступнаПанельАкселераторыМКДокументы = НЕ ДоступнаПанельАкселераторыМК
		И ДоступныПанелиМК;
		
	Элементы.ГруппаАкселераторыМК.Видимость = ДоступнаПанельАкселераторыМК;
	Элементы.ГруппаАкселераторыМКДокументы.Видимость = ДоступнаПанельАкселераторыМКДокументы;
	
	Элементы.ДекорацияНовыйСчет.Видимость      = СозданиеСчета;
	Элементы.ДекорацияНовыйАкт.Видимость       = СозданиеРеализации;
	Элементы.ДекорацияНоваяНакладная.Видимость = СозданиеРеализации;
	Элементы.ДекорацияНовыйУПД.Видимость       = СозданиеРеализации;
	
	Если ДоступнаПанельАкселераторыМК Тогда
		
		Элементы.ГруппаПлатежиПоШтрихкоду.Видимость = СозданиеПлатежа;	
		Элементы.ГруппаРаспознатьДокументыМК.Видимость = ДоступноРаспознавание;
		
		ВыборДоступныхДокументовМК.Очистить();
		Если СозданиеСчета Тогда
			ВыборДоступныхДокументовМК.Добавить("СчетПокупателю", "+ Счет покупателю");
			ВыборДоступныхДокументовМК.Добавить("", "_____________________");
		КонецЕсли;
		Если СозданиеРеализации Тогда
			ВыборДоступныхДокументовМК.Добавить("Акт", "+ Акт");
			ВыборДоступныхДокументовМК.Добавить("Накладная", "+ Накладная");
			ВыборДоступныхДокументовМК.Добавить("УПД_Товары", "+ УПД(Товары)");
			ВыборДоступныхДокументовМК.Добавить("УПД_Услуги", "+ УПД(Услуги)");
		КонецЕсли;
		Если СозданиеПлатежа Тогда
			ВыборДоступныхДокументовМК.Добавить("", "_____________________");
			ВыборДоступныхДокументовМК.Добавить("Платеж", "+ Платеж");
		КонецЕсли;
	КонецЕсли;
	
	МобильныйКлиентБПФормаОбъекта.СкрытьЭлементФормы(Элементы, Элементы.ДекорацияШапкаОтступСлева);
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьБлокиМК(ИмяЭлементаБлок)
	
	ЭлементБлок = Элементы.Найти(ИмяЭлементаБлок);
	ЭлементБлок.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	ЭлементБлок.Ширина = 0;
	ЭлементБлок.Высота = 0;
	ЭлементБлок.РастягиватьПоГоризонтали = Истина;
	
	ЭлементБлок.ОтображатьЗаголовок = Истина;
	ЭлементБлок.Заголовок = Врег(ЭлементБлок.Заголовок);
	
	ИмяЭлементаЗаголовок = ИмяЭлементаБлок + "_Заголовок";
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		ИмяЭлементаЗаголовок,
		"Видимость",
		Ложь);
	
	ИмяЭлементаОтступ = ИмяЭлементаБлок + "Отступ";
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		ИмяЭлементаОтступ,
		"Отображение",
		ОтображениеОбычнойГруппы.Нет);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		ИмяЭлементаОтступ,
		"РастягиватьПоВертикали",
		Ложь);
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКОстаткиДенежныхСредств()
	Элементы.ОстаткиДенежныхСредств_Остаток0.РастягиватьПоГоризонтали = Истина;
	Элементы.ОстаткиДенежныхСредств_Остаток1.РастягиватьПоГоризонтали = Истина;
	Элементы.ОстаткиДенежныхСредств_Остаток2.РастягиватьПоГоризонтали = Истина;
	Элементы.ОстаткиДенежныхСредствВсеОстатки.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Авто;
	Элементы.ОстаткиДенежныхСредствВсеОстатки.РастягиватьПоВертикали = Ложь;
	Элементы.ОстаткиДенежныхСредств_Остаток2.Высота = 0;
КонецПроцедуры 

&НаСервере
Процедура АдаптироватьМКПокупатели()
	Элементы.ГруппаПокупателиЗадолженность.Объединенная = Истина;
	Элементы.ГруппаПокупателиПросрочено.Объединенная = Истина;
	Элементы.ГруппаПокупателиНеоплаченныеСчета.Объединенная = Истина;

	Элементы.ПокупателиЗадолженность.РастягиватьПоГоризонтали = Истина;
	Элементы.Покупатели_Задолженность.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Право;
	Элементы.ГруппаПокупателиПросрочено.Объединенная = Истина;
	Элементы.Покупатели_ПросроченнаяЗадолженность.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Право;
	
	Элементы.ГруппаПокупателиНеоплаченныеСчета.Объединенная = Истина;
	Элементы.ПокупателиНеоплаченныеСчета.РастягиватьПоГоризонтали=Истина;
	Элементы.Покупатели_НеоплаченныеСчета.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Право;
КонецПроцедуры 

&НаСервере
Процедура АдаптироватьМКПоставщики()
	Элементы.ГруппаПоставщикиЗадолженность.Объединенная = Истина;
	Элементы.ГруппаПоставщикиПросрочено.Объединенная = Истина;
	Элементы.ГруппаПоставщикиНеоплаченныеСчета.Объединенная = Истина;
	
	Элементы.ГруппаПоставщикиЗадолженность.Объединенная = Истина;
	Элементы.ПоставщикиЗадолженность.РастягиватьПоГоризонтали = Истина;
	Элементы.Поставщики_Задолженность.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Право;
	Элементы.ГруппаПоставщикиПросрочено.Объединенная = Истина;
	Элементы.Поставщики_ПросроченнаяЗадолженность.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Право;
	Элементы.ГруппаПоставщикиНеоплаченныеСчета.Объединенная = Истина;
	Элементы.ПоставщикиНеоплаченныеСчета.РастягиватьПоГоризонтали=Истина;
	Элементы.Поставщики_НеоплаченныеСчета.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Право;
КонецПроцедуры 

&НаСервере
Процедура АдаптироватьМКПродажи()
	Элементы.ГруппаПродажи0.Объединенная = Истина;
	Элементы.ГруппаПродажи1.Объединенная = Истина;
	Элементы.ГруппаПродажи2.Объединенная = Истина;
	Элементы.ГруппаПродажи3.Объединенная = Истина;
	МобильныйКлиентБПФормаОбъекта.СкрытьЭлементФормы(Элементы, Элементы.ДекорацияПродажи);
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМККурсыВалют()
	
	Элементы.ГруппаКурсыВалют0.Объединенная = Истина;
	Элементы.ГруппаКурсыВалют1.Объединенная = Истина;
	Элементы.ГруппаКурсыВалют2.Объединенная = Истина;
	Элементы.ГруппаКурсыВалют3.Объединенная = Истина;
	
	Элементы.ГруппаКурсыВалют0.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Элементы.ГруппаКурсыВалют1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Элементы.ГруппаКурсыВалют2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Элементы.ГруппаКурсыВалют3.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	Элементы.КурсыВалют_Валюта0.РастягиватьПоГоризонтали = Истина;
	Элементы.КурсыВалют_Валюта1.РастягиватьПоГоризонтали = Истина;
	Элементы.КурсыВалют_Валюта2.РастягиватьПоГоризонтали = Истина;
	Элементы.КурсыВалют_Валюта3.РастягиватьПоГоризонтали = Истина;
	
	
	Элементы.Переместить(Элементы.ГруппаКурсыВалют3, Элементы.ГруппаКурсыВалют);
	Элементы.Переместить(Элементы.ГруппаКурсыВалютПодвал, Элементы.ГруппаКурсыВалют);
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКМойНалог()
	
	Элементы.МойНалог_НепрочитанныеОповещения.РастягиватьПоВертикали = Ложь;

КонецПроцедуры

&НаКлиенте
Функция БлокДоступенНаМК(ИмяБлока)
	
	Возврат БлокиИнформационнойПанелиКлиентСервер.ДоступныеРазделыНаМК().Найти(ИмяБлока) <> Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ДекорацияНовыйДокументМКНажатие(Элемент)
	
	ОписаниеЗавершения = Новый ОписаниеОповещения("КомандыМК_Создать_Завершение", ЭтотОбъект);
	ПоказатьВыборИзМеню(ОписаниеЗавершения, ВыборДоступныхДокументовМК, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРаспознатьДокументМКНажатие(Элемент)

	ОткрытьФорму(
		"Документ.РаспознанныйДокумент.Форма.ФормаСпискаМК",
		,
		,
		"БП_Документ.РаспознанныйДокумент.Форма.ФормаСпискаМК"
		);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВидаДокумента(ВидДокумента, ДополнительныеПараметры) Экспорт
	
	ОткрытьФорму("Документ.СчетНаОплатуПоставщика.Форма.ФормаДокумента",,ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПлатежПоШтрихкодуНажатие(Элемент)
	
	Если ПоказыватьПодсказкуСканироватьQRПлатежа Тогда
		ЗавершениеПодсказки = Новый ОписаниеОповещения("ЗавершениеПодсказкаСканироватьQRПлатежа", ЭтотОбъект);
		ПоказатьВопрос(ЗавершениеПодсказки, 
			НСтр("ru = 'Считайте QR-код в Счете поставщика или в налоговом уведомлении'"),РежимДиалогаВопрос.ОК,,, "Подсказка");
	Иначе
		НачатьСозданиеПлатежаПоQRКоду();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеПодсказкаСканироватьQRПлатежа(Результат, ДопПараметры) Экспорт
	
	НачатьСозданиеПлатежаПоQRКоду();
	ПоказыватьПодсказкуСканироватьQRПлатежа = Ложь;
	СохранитьНастройкуПоказыватьПодсказкуСканироватьQRПлатежа();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьСозданиеПлатежаПоQRКоду()
	
	ЗавершениеСозданияПлатежа = Новый ОписаниеОповещения("ЗавершениеСканироватьQRПлатежа", ЭтотОбъект);
	МобильныйКлиентБПКлиент.НачатьСозданиеПлатежаПоQRКоду(ЗавершениеСозданияПлатежа);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеСканироватьQRПлатежа(ПлатежноеПоручение, ДопПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ПлатежноеПоручение) Тогда
		
		ПараметрыФормы = Новый Структура("Ключ", ПлатежноеПоручение);
		ОткрытьФорму("Документ.ПлатежноеПоручение.ФормаОбъекта",
			ПараметрыФормы,
			ЭтотОбъект);
			
	КонецЕсли;
	
КонецПроцедуры

// Сохраняет отметку показывать подсказку для текущего пользователя.
&НаКлиенте
Процедура СохранитьНастройкуПоказыватьПодсказкуСканироватьQRПлатежа()
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить(
		"МобильныйКлиентБП",
		"ПоказыватьПодсказкуСканироватьQRПлатежа",
		ПоказыватьПодсказкуСканироватьQRПлатежа,
		,
		ИмяПользователя());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоказыватьПодсказкуСканироватьQRПлатежа()
	
	Возврат ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
		"МобильныйКлиентБП",
		"ПоказыватьПодсказкуСканироватьQRПлатежа",
		Истина,
		,
		ИмяПользователя());
	
КонецФункции

#КонецОбласти
