
#Область СлужебныйПрограммныйИнтерфейс

Функция ТекстЗапросаРасчетТорговогоСбора() Экспорт

	ТекстЗапроса  = 
	"ВЫБРАТЬ // Отберем только те операции по которым нет записей регистра
	|	МАКСИМУМ(РегламентнаяОперация.Ссылка) КАК РегламентнаяОперацияСсылка,
	|	КОНЕЦПЕРИОДА(РегламентнаяОперация.Дата, КВАРТАЛ) КАК ПериодРасчета,
	|	РегламентнаяОперация.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_РегламентныеОперации
	|ИЗ
	|	Документ.РегламентнаяОперация КАК РегламентнаяОперация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасчетТорговогоСбора КАК РасчетТорговогоСбора
	|		ПО РегламентнаяОперация.Ссылка = РасчетТорговогоСбора.Регистратор
	|ГДЕ
	|	НЕ РегламентнаяОперация.ПометкаУдаления
	|	И РегламентнаяОперация.Состояние = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийРегламентныхОпераций.Выполнено)
	|	И РегламентнаяОперация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.РасчетТорговогоСбора)
	|	И РасчетТорговогоСбора.Регистратор ЕСТЬ NULL
	|	И КОНЕЦПЕРИОДА(РегламентнаяОперация.Дата, КВАРТАЛ) = КОНЕЦПЕРИОДА(РегламентнаяОперация.Дата, МЕСЯЦ)
	|СГРУППИРОВАТЬ ПО
	|	РегламентнаяОперация.Организация,
	|	КОНЕЦПЕРИОДА(РегламентнаяОперация.Дата, КВАРТАЛ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ // Выберем параметры торговых точек на момент каждой регоперации
	|	ПараметрыТорговыхТочек.Организация КАК Организация,
	|	ПараметрыТорговыхТочек.ТорговаяТочка КАК ТорговаяТочка,
	|	ВТ_РегламентныеОперации.ПериодРасчета КАК ПериодРасчета,
	|	ПараметрыТорговыхТочек.Период КАК ПериодЗаписи,
	|	ПараметрыТорговыхТочек.Ставка КАК Ставка,
	|	ПараметрыТорговыхТочек.СуммаЛьготы КАК СуммаЛьготы,
	|	ПараметрыТорговыхТочек.СуммаСбора КАК СуммаСбора,
	|	ПараметрыТорговыхТочек.РасшифровкаРасчета КАК РасшифровкаРасчета
	|ПОМЕСТИТЬ ВТ_ПараметрыТорговыхТочекПоПериодам
	|ИЗ
	|	ВТ_РегламентныеОперации КАК ВТ_РегламентныеОперации
	|		// Параметры торговых точек до конца периода регоперации - из них будем брать последнюю
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыТорговыхТочек КАК ПараметрыТорговыхТочек 
	|		ПО ВТ_РегламентныеОперации.ПериодРасчета >= ПараметрыТорговыхТочек.Период
	|			И ВТ_РегламентныеОперации.Организация = ПараметрыТорговыхТочек.Организация
	|		// запись на начало периода - это всегда изменение ставки, она учитывается всегда в текущем периоде
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыТорговыхТочек КАК ПараметрыТорговыхТочекНачалоПериода 
	|		ПО (ПараметрыТорговыхТочекНачалоПериода.Период = НАЧАЛОПЕРИОДА(ВТ_РегламентныеОперации.ПериодРасчета, КВАРТАЛ))
	|			И (ПараметрыТорговыхТочекНачалоПериода.Организация = ПараметрыТорговыхТочек.Организация)
	|			И (ПараметрыТорговыхТочекНачалоПериода.ТорговаяТочка = ПараметрыТорговыхТочек.ТорговаяТочка)
	|ГДЕ
	|	// не берем те записи, сумма сбора которых меньше чем была на начало периода, такие записи будут учитываться только со следующего квартала
	|	(КОНЕЦПЕРИОДА(ПараметрыТорговыхТочек.Период, КВАРТАЛ) <> ВТ_РегламентныеОперации.ПериодРасчета 
	|			ИЛИ ПараметрыТорговыхТочек.СуммаСбора >= ЕСТЬNULL(ПараметрыТорговыхТочекНачалоПериода.СуммаСбора, ПараметрыТорговыхТочек.СуммаСбора))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ТорговаяТочка,
	|	ПериодЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Для каждой регоперации получим дату записи параметров торговой точки для СрезПервых на начало квартала
	|// В дальнейшем получим сумму сбора как максимум от суммы на начало периода и всех записей за период
	|ВЫБРАТЬ
	|	ВТ_ПараметрыТорговыхТочекПоПериодам.Организация КАК Организация,
	|	ВТ_ПараметрыТорговыхТочекПоПериодам.ТорговаяТочка КАК ТорговаяТочка,
	|	ВТ_ПараметрыТорговыхТочекПоПериодам.ПериодРасчета КАК ПериодРасчета, // дата регоперации
	|	МАКСИМУМ(ВТ_ПараметрыТорговыхТочекПоПериодам.ПериодЗаписи) КАК ПериодЗаписи // дата записи 
	|ПОМЕСТИТЬ ВТ_ПараметрыТорговыхТочекСрезПервых
	|ИЗ
	|	ВТ_ПараметрыТорговыхТочекПоПериодам КАК ВТ_ПараметрыТорговыхТочекПоПериодам
	|ГДЕ
	|	ВТ_ПараметрыТорговыхТочекПоПериодам.ПериодЗаписи <= НАЧАЛОПЕРИОДА(ВТ_ПараметрыТорговыхТочекПоПериодам.ПериодРасчета, КВАРТАЛ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПараметрыТорговыхТочекПоПериодам.Организация,
	|	ВТ_ПараметрыТорговыхТочекПоПериодам.ТорговаяТочка,
	|	ВТ_ПараметрыТорговыхТочекПоПериодам.ПериодРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПараметрыТорговыхТочекСрезПервых.Организация КАК Организация,
	|	ВТ_ПараметрыТорговыхТочекСрезПервых.ТорговаяТочка КАК ТорговаяТочка,
	|	ВТ_ПараметрыТорговыхТочекСрезПервых.ПериодРасчета КАК ПериодРасчета,
	|	МАКСИМУМ(ВТ_ПараметрыТорговыхТочекПоПериодам.СуммаСбора) КАК СуммаСбора // сумма сбора - максимальная сумма среди записи на начало периода и всех записей за период
	|ПОМЕСТИТЬ ВТ_СуммаСбораЗаКвартал
	|ИЗ
	|	ВТ_ПараметрыТорговыхТочекСрезПервых КАК ВТ_ПараметрыТорговыхТочекСрезПервых
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыТорговыхТочекПоПериодам КАК ВТ_ПараметрыТорговыхТочекПоПериодам
	|		ПО ВТ_ПараметрыТорговыхТочекСрезПервых.Организация = ВТ_ПараметрыТорговыхТочекПоПериодам.Организация
	|			И ВТ_ПараметрыТорговыхТочекСрезПервых.ТорговаяТочка = ВТ_ПараметрыТорговыхТочекПоПериодам.ТорговаяТочка
	|			И ВТ_ПараметрыТорговыхТочекСрезПервых.ПериодРасчета = ВТ_ПараметрыТорговыхТочекПоПериодам.ПериодРасчета
	|			И ВТ_ПараметрыТорговыхТочекСрезПервых.ПериодЗаписи <= ВТ_ПараметрыТорговыхТочекПоПериодам.ПериодЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПараметрыТорговыхТочекСрезПервых.Организация,
	|	ВТ_ПараметрыТорговыхТочекСрезПервых.ТорговаяТочка,
	|	ВТ_ПараметрыТорговыхТочекСрезПервых.ПериодРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Найдем запись параметров торговой точки из предыдущего шага, чтобы записать в регистр дату установки параметров
	|// Так как записей с такой суммой может быть несколько (например если течении квартала площадь уменьшалась и увеличивалась несколько раз),
	|// то возьмем последнюю из них
	|ВЫБРАТЬ
	|	ВТ_СуммаСбораЗаКвартал.Организация КАК Организация,
	|	ВТ_СуммаСбораЗаКвартал.ТорговаяТочка КАК ТорговаяТочка,
	|	ВТ_СуммаСбораЗаКвартал.ПериодРасчета КАК ПериодРасчета,
	|	МАКСИМУМ(ВТ_ПараметрыТорговыхТочекПоПериодам.ПериодЗаписи) КАК ПериодЗаписи
	|ПОМЕСТИТЬ ВТ_ПараметрыТорговыхТочекСрезПоследних
	|ИЗ
	|	ВТ_СуммаСбораЗаКвартал КАК ВТ_СуммаСбораЗаКвартал
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыТорговыхТочекПоПериодам КАК ВТ_ПараметрыТорговыхТочекПоПериодам
	|		ПО ВТ_СуммаСбораЗаКвартал.Организация = ВТ_ПараметрыТорговыхТочекПоПериодам.Организация
	|			И ВТ_СуммаСбораЗаКвартал.ТорговаяТочка = ВТ_ПараметрыТорговыхТочекПоПериодам.ТорговаяТочка
	|			И ВТ_СуммаСбораЗаКвартал.ПериодРасчета = ВТ_ПараметрыТорговыхТочекПоПериодам.ПериодРасчета
	|			И ВТ_СуммаСбораЗаКвартал.СуммаСбора = ВТ_ПараметрыТорговыхТочекПоПериодам.СуммаСбора
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СуммаСбораЗаКвартал.Организация,
	|	ВТ_СуммаСбораЗаКвартал.ТорговаяТочка,
	|	ВТ_СуммаСбораЗаКвартал.ПериодРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РегламентныеОперации.РегламентнаяОперацияСсылка КАК РегламентнаяОперацияСсылка,
	|	ВТ_ПараметрыТорговыхТочекСрезПоследних.Организация КАК Организация,
	|	ВТ_ПараметрыТорговыхТочекСрезПоследних.ТорговаяТочка КАК ТорговаяТочка,
	|	ВТ_ПараметрыТорговыхТочекСрезПоследних.ПериодРасчета КАК ПериодРасчета, // период регоперации
	|	ВТ_ПараметрыТорговыхТочекСрезПоследних.ПериодЗаписи КАК ДатаРегистрационныхДанных, // дата когда были установлены параметры по которым произведен расчет
	|	ВТ_ПараметрыТорговыхТочекПоПериодам.Ставка КАК Ставка,
	|	ВТ_ПараметрыТорговыхТочекПоПериодам.СуммаЛьготы КАК СуммаЛьготы,
	|	ВТ_ПараметрыТорговыхТочекПоПериодам.СуммаСбора КАК СуммаСбора,
	|	ВТ_ПараметрыТорговыхТочекПоПериодам.РасшифровкаРасчета КАК РасшифровкаРасчета
	|ИЗ
	|	ВТ_ПараметрыТорговыхТочекСрезПоследних КАК ВТ_ПараметрыТорговыхТочекСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыТорговыхТочекПоПериодам КАК ВТ_ПараметрыТорговыхТочекПоПериодам
	|		ПО ВТ_ПараметрыТорговыхТочекСрезПоследних.Организация = ВТ_ПараметрыТорговыхТочекПоПериодам.Организация
	|			И ВТ_ПараметрыТорговыхТочекСрезПоследних.ТорговаяТочка = ВТ_ПараметрыТорговыхТочекПоПериодам.ТорговаяТочка
	|			И ВТ_ПараметрыТорговыхТочекСрезПоследних.ПериодРасчета = ВТ_ПараметрыТорговыхТочекПоПериодам.ПериодРасчета
	|			И ВТ_ПараметрыТорговыхТочекСрезПоследних.ПериодЗаписи = ВТ_ПараметрыТорговыхТочекПоПериодам.ПериодЗаписи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегламентныеОперации КАК ВТ_РегламентныеОперации
	|		ПО ВТ_ПараметрыТорговыхТочекСрезПоследних.Организация = ВТ_РегламентныеОперации.Организация
	|			И ВТ_ПараметрыТорговыхТочекСрезПоследних.ПериодРасчета = ВТ_РегламентныеОперации.ПериодРасчета
	|ИТОГИ ПО
	|	РегламентнаяОперацияСсылка";
	
	Возврат ТекстЗапроса;
КонецФункции 


#КонецОбласти
