#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	Если ПолучитьФункциональнуюОпцию("ИспользуетсяУСНПатент") Тогда
		ДанныеВыбора.Добавить(Патент);
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользуетсяУСН") Тогда
		ДанныеВыбора.Добавить(УСН);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли