#Область СлужебныйПрограммныйИнтерфейс

Функция ДействияСообщений() Экспорт
	
	ДействияСообщений = Новый Структура;
	ДействияСообщений.Вставить("СтатусНеПрочитано", "СтатусНеПрочитано");
	ДействияСообщений.Вставить("СтатусПрочитано", "СтатусПрочитано");
	ДействияСообщений.Вставить("ПерейтиКОплатеНПД", "ПерейтиКОплатеНПД");
	ДействияСообщений.Вставить("ПерейтиВЛичныйКабинетМойНалог", "ПерейтиВЛичныйКабинетМойНалог");
	ДействияСообщений.Вставить("УведомитьОПрочтенииВсех", "УведомитьОПрочтенииВсех");
	
	Возврат ДействияСообщений;
	
КонецФункции

Функция ИнтервалПроверки() Экспорт
	
	Возврат 3600;
	
КонецФункции

#КонецОбласти
