#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Кодировка = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		Документы.ВыплатыСамозанятым.КлючОбъектаВыплатыСамозанятым(),
		Документы.ВыплатыСамозанятым.КлючНастроекВыплатыСамозанятым(),
		Документы.ВыплатыСамозанятым.ИмяКодировкаUTF8()
	);
	
	ВыгружатьБИК = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		Документы.ВыплатыСамозанятым.КлючОбъектаВыплатыСамозанятым(),
		Документы.ВыплатыСамозанятым.КлючНастроекВыплатыСамозанятымБИК(),
		Истина
	);
	
	ВыгружатьСодержание = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		Документы.ВыплатыСамозанятым.КлючОбъектаВыплатыСамозанятым(),
		Документы.ВыплатыСамозанятым.КлючНастроекВыплатыСамозанятымСодержание(),
		Истина
	);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КодировкаПриИзменении(Элемент)
	
	КодировкаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьБИКПриИзменении(Элемент)
	
	ВыгружатьБИКПриИзмененииНаСервере();
	
КонецПроцедуры
 
&НаКлиенте
Процедура ВыгружатьСодержаниеПриИзменении(Элемент)
	
	ВыгружатьСодержаниеПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура КодировкаПриИзмененииНаСервере()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		Документы.ВыплатыСамозанятым.КлючОбъектаВыплатыСамозанятым(),
		Документы.ВыплатыСамозанятым.КлючНастроекВыплатыСамозанятым(),
		Кодировка
	);
	
КонецПроцедуры

&НаСервере
Процедура ВыгружатьБИКПриИзмененииНаСервере()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		Документы.ВыплатыСамозанятым.КлючОбъектаВыплатыСамозанятым(),
		Документы.ВыплатыСамозанятым.КлючНастроекВыплатыСамозанятымБИК(),
		ВыгружатьБИК
	);
	
КонецПроцедуры

&НаСервере
Процедура ВыгружатьСодержаниеПриИзмененииНаСервере()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		Документы.ВыплатыСамозанятым.КлючОбъектаВыплатыСамозанятым(),
		Документы.ВыплатыСамозанятым.КлючНастроекВыплатыСамозанятымСодержание(),
		ВыгружатьСодержание
	);
	
КонецПроцедуры

#КонецОбласти