

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры,
		"ДатаСобытия, Организация, Сотрудник, ФизическоеЛицо, КадровыйДокумент");
	
	ДанныеФизЛица = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, ФизическоеЛицо, "ФамилияИО", ДатаСобытия);
	
	Если ЗначениеЗаполнено(ДанныеФизЛица) Тогда
		
		Заголовок = СтрШаблон(НСтр("ru = 'Регистрация записи электронной трудовой книжки (%1)'"), ДанныеФизЛица[0].ФамилияИО);
		
		ШаблонНачалаТекста = НСтр("ru = 'Не забудьте зарегистрировать и отправить сведения'");
		
		ТекстПодсказки = УчетЗарплаты.ТекстПодсказкиКадровогоМероприятияЭТК(ДатаСобытия, КадровыйДокумент, ШаблонНачалаТекста);
		
		Если Не ЗначениеЗаполнено(ТекстПодсказки) Тогда
			Отказ = Истина;
		КонецЕсли;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗарегистрироватьЗаписьЭлектроннойТрудовойКнижки(Команда)
	
	СоздатьЗаписьЭлектроннойТрудовойКнижки();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СоздатьЗаписьЭлектроннойТрудовойКнижки()
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Сотрудник", ФизическоеЛицо);
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", Новый Структура("Организация", Организация));
	
	ОткрытьФорму("Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ФормаОбъекта", ПараметрыОткрытия);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти