// Содержимое модуля отличается в версиях ПРОФ и КОРП.
// В версии ПРОФ отсутствует:
// - тело экспортных процедур (остаются только сигнатуры методов)
// - неэкспортные процедуры и все функции.
// Поэтому не допускается реализация в модуле экспортных функций: вместо них следует использовать процедуры с возвращаемым параметром.

#Область ПрограммныйИнтерфейс

Процедура ПриИзмененииНоменклатурыКоличества(Форма, ИмяТаблицы, ЭкспортПриРеализации, Импорт = Ложь, ПередачаТоваров = Ложь) Экспорт
	Элементы = Форма.Элементы;
	СтрокаТаблицы = Элементы[ИмяТаблицы].ТекущиеДанные;
	РассчитатьСуммуАкцизаВТабЧасти(СтрокаТаблицы, ЭкспортПриРеализации, Импорт, ПередачаТоваров);
	
КонецПроцедуры

Процедура РассчитатьСуммуАкцизаВТабЧасти(СтрокаТаблицы, ЭкспортПриРеализации, Импорт = Ложь, ПередачаТоваров = Ложь) Экспорт
	Если Не Импорт Тогда
		СчетУчетаЗабалансовый = СтрокаТаблицы.СчетУчетаЗабалансовый;
	Иначе 
		СчетУчетаЗабалансовый = Ложь;
	КонецЕсли;
	Если ЭкспортПриРеализации Или СчетУчетаЗабалансовый Или ПередачаТоваров Тогда
		СтрокаТаблицы.СуммаАкциза = 0;
	Иначе
		СтрокаТаблицы.СуммаАкциза = СтрокаТаблицы.Количество * СтрокаТаблицы.КоэффициентПересчета * СтрокаТаблицы.СтавкаАкциза;
		Если СтрокаТаблицы.ЕдиницаИзмеренияАкциза = "214" Тогда
			СтрокаТаблицы.СуммаАкциза = СтрокаТаблицы.СуммаАкциза / 0.75;
		КонецЕсли;
		Если СтрокаТаблицы.ОкруглятьДоЦелого Тогда
			СтрокаТаблицы.СуммаАкциза = Окр(СтрокаТаблицы.СуммаАкциза);
		КонецЕсли;
			
	КонецЕсли;

КонецПроцедуры

Процедура РассчитатьСуммуАкцизаВТабЧастиПоЗаявлениюОВвозе(СтрокаТаблицы, ЭтоДОПП = Ложь) Экспорт
	
	Если Не ЭтоДОПП И ЗначениеЗаполнено(СтрокаТаблицы.ДоговорКонтрагента) Тогда 
		СтрокаТаблицы.СуммаАкциза = 0;
	Иначе
		СтрокаТаблицы.СуммаАкциза = СтрокаТаблицы.Количество * СтрокаТаблицы.КоэффициентПересчета * СтрокаТаблицы.ТвердаяСтавкаАкциза;
		Если СтрокаТаблицы.ЕдиницаИзмеренияАкциза = "214" Тогда
			СтрокаТаблицы.СуммаАкциза = СтрокаТаблицы.СуммаАкциза / 0.75;
		КонецЕсли;
		Если СтрокаТаблицы.ОкруглятьДоЦелого Тогда
			СтрокаТаблицы.СуммаАкциза = Окр(СтрокаТаблицы.СуммаАкциза);
		КонецЕсли;
		СтрокаТаблицы.НалоговаяБазаАкцизы = СтрокаТаблицы.Количество * СтрокаТаблицы.КоэффициентПересчета;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти