
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Обработки.ПанелиПростойИнтерфейс.ЗадатьВидимостьЭлементовФормы(ЭтотОбъект);
	
	МобильныйКлиентАдаптацияФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбщиеНастройки(Команда)
	
	ОткрытьФорму("Обработка.ПанельАдминистрированияБСП.Форма.ОбщиеНастройки", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыУчета(Команда)
	
	ОткрытьФорму("Обработка.ПанельАдминистрированияБП.Форма.ПараметрыУчета", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатныеФормыОтчетыИОбработки(Команда)
	
	ОткрытьФорму("Обработка.ПанельАдминистрированияБСП.Форма.ПечатныеФормыОтчетыИОбработки", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроведениеДокументов(Команда)
	
	ОткрытьФорму("Обработка.ПанельАдминистрированияБП.Форма.ПроведениеДокументов", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПользователейИПрав(Команда)
	
	ОткрытьФорму("Обработка.ПанельАдминистрированияБСП.Форма.НастройкиПользователейИПрав", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРаботыСФайлами(Команда)
	
	ОткрытьФорму("Обработка.ПанельАдминистрированияБСП.Форма.НастройкиРаботыСФайлами", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРегистровУчета(Команда)
	
	ОткрытьФорму("Обработка.ПанельАдминистрированияБП.Форма.НастройкиРегистровУчета", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОтправкиPushУведомлений(Команда)
	
	ОткрытьФорму("РегистрСведений.НастройкиОтправкиPushУведомлений.ФормаЗаписи", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Производительность(Команда)
	
	ОткрытьФорму("Обработка.ПанельАдминистрированияБП.Форма.Производительность", , ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанели(ЭтотОбъект,
		"ПараметрыУчета");
	
КонецПроцедуры

#КонецОбласти

