
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.НастройкиВоинскогоУчета.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	ЗначениеВРеквизитФормы(МенеджерЗаписи, "НастройкиВоинскогоУчета");
	
	ТолькоПросмотр = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НастройкиВоинскогоУчета);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкиВоинскогоУчетаЗаполнятьТолькоАдресПоПропискеПриИзменении(Элемент)
	
	ЗаписатьИзмененияНепосредственно();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиВоинскогоУчетаУчитыватьВнешнихСовместителейПриИзменении(Элемент)
	
	ЗаписатьИзмененияНепосредственно();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиВоинскогоУчетаИспользоватьНаправлениеДляПостановкиНаВоинскийУчет2019ПриИзменении(Элемент)
	
	ЗаписатьИзмененияНепосредственно();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьИзмененияНепосредственно()
	
	МенеджерЗаписи = РеквизитФормыВЗначение("НастройкиВоинскогоУчета");
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры


#КонецОбласти

