
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("ВидМаркетплейса") Тогда
		Элементы.ДобавитьПодключение.Вид = ВидГруппыФормы.ГруппаКнопок;
		Элементы.ФормаДобавитьOzon.Видимость   = (Параметры.Отбор.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.OZON);
		Элементы.ФормаДобавитьWB.Видимость     = (Параметры.Отбор.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.Wildberries);
		Элементы.ФормаДобавитьЯндекс.Видимость = (Параметры.Отбор.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.ЯндексМаркет);
		
		Если Параметры.Отбор.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.OZON
			И Параметры.Отбор.Свойство("Владелец")
			И ЗначениеЗаполнено(Параметры.Отбор.Владелец) Тогда
			Элементы.ФормаДобавитьOzon.Заголовок = НСтр("ru = 'Добавить новый магазин Ozon'");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	МагазиныOzon = ИнтеграцияOzon.МагазиныOzon();
	Если Не ЗначениеЗаполнено(МагазиныOzon) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого МагазинOzon Из МагазиныOzon Цикл
		СтрокаСписка = Строки.Получить(МагазинOzon.Ключ);
		Если СтрокаСписка <> Неопределено Тогда
			СтрокаСписка.Оформление["Владелец"].УстановитьЗначениеПараметра("Текст", МагазинOzon.Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьOzon(Команда)
	
	ОткрытьНастройкуМаркетплейса(ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.OZON"));
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьWB(Команда)
	
	ОткрытьНастройкуМаркетплейса(ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.Wildberries"));
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЯндекс(Команда)
	
	ОткрытьНастройкуМаркетплейса(ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.ЯндексМаркет"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьНастройкуМаркетплейса(Маркетплейс)
	
	ЗначенияЗаполнения = Новый Структура;
	ОтборПоОрганизации = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(Список.Отбор, "Владелец");
	Если ЗначениеЗаполнено(ОтборПоОрганизации) Тогда
		ЗначенияЗаполнения.Вставить("Владелец", ОтборПоОрганизации[0].ПравоеЗначение);
	КонецЕсли;
	ЗначенияЗаполнения.Вставить("ВидМаркетплейса", Маркетплейс);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОперации", "ЗагрузкаОтчета");
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Справочник.НастройкиИнтеграцииМаркетплейс.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти