
#Область СлужебныйПрограммныйИнтерфейс 

Функция ПараметрыКомпоновки() Экспорт
	
	Результат = Новый Структура("ПараметрыОтчета, СКД, Настройки");
	ПараметрыОтчета = ПараметрыОтчета();

	Результат.ПараметрыОтчета = ПараметрыОтчета;	
	Если ЗначениеЗаполнено(ПоляРасшифровки) Тогда
			
		Результат.СКД = ?(ПоляРасшифровки["Номер"] < 3000,
			ПолучитьМакет("РасшифровкаОтчеты"), 
			ПолучитьМакет("РасшифровкаДокументы"));
		Результат.Настройки = Результат.СКД.НастройкиПоУмолчанию;
		
	Иначе
		
		Результат.СКД = ПолучитьМакет("Основная");
		УстановитьПараметрКомпоновки("Период", Новый СтандартныйПериод(
			ПараметрыОтчета.НачалоПериода,ПараметрыОтчета.КонецПериода));
		Результат.Настройки = КомпоновщикНастроек.ПолучитьНастройки(); 
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные) Тогда
		Результат.Вставить("НаборыДанных", 
			Новый Структура("Данные", ПолучитьИзВременногоХранилища(Данные)));
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПараметрыОтчета()
	
	Результат = Отчеты.СверкаДекларацийПрибыльНДС.ПараметрыРасчета();
	ЗаполнитьЗначенияСвойств(Результат, ЭтотОбъект);
	Результат.Вставить("ПоляРасшифровки", ПоляРасшифровки);
	Результат.Вставить("Данные", Данные);
	Результат.Вставить("ВключатьОбособленныеПодразделения", Ложь);
	Результат.Вставить("ИдентификаторОтчета", Метаданные.Отчеты.СверкаДекларацийПрибыльНДС.Имя);
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьПараметрКомпоновки(Параметр, Значение)
	
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	Параметр = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(Параметр));  
	Параметр.Значение = Значение;
	
КонецПроцедуры

#КонецОбласти

 
