
#Область СлужебныеПроцедурыИФункции

Функция КоличествоДнейОтпуска(Сотрудник, ДатаНачала, ДатаОкончания) Экспорт
	
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ГоловнаяОрганизация");
	КоличествоДнейОтпуска = 0;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ЗарплатаКадрыДляНебольшихОрганизаций.РасчетЗарплаты") Тогда
		МодульРасчетЗарплатыДляНебольшихОрганизаций = ОбщегоНазначения.ОбщийМодуль("РасчетЗарплатыДляНебольшихОрганизаций");
		КоличествоДнейОтпуска = МодульРасчетЗарплатыДляНебольшихОрганизаций.КоличествоДнейОтпуска(ДатаНачала, ДатаОкончания, Организация);
	КонецЕсли;
	Возврат КоличествоДнейОтпуска;
	
КонецФункции

Функция ВладелецЗаявкаСотрудника(Ссылки) Экспорт
	
	Возврат Ложь;
	
КонецФункции

Функция МестаПозицийВСтруктуреПредприятия(Позиции) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Позиции", Позиции);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтатноеРасписание.Ссылка КАК Позиция,
	|	СтруктураПредприятия.Ссылка КАК Подразделение
	|ИЗ
	|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|		ПО ШтатноеРасписание.Подразделение = СтруктураПредприятия.Источник
	|ГДЕ
	|	ШтатноеРасписание.Ссылка В(&Позиции)";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ТипЗаявкаСотрудникаСправкаСМестаРаботы() Экспорт
	
	Возврат Тип("Неопределено");
	
КонецФункции

Функция ТипЗаявкаСотрудникаСправкаОстаткиОтпусков() Экспорт
	
	Возврат Тип("Неопределено");
	
КонецФункции

Функция БанковскийСчетФизическогоЛица(Банк, НомерСчета, ФизическоеЛицо) Экспорт
	
	Возврат Неопределено;

КонецФункции

Функция СпособВыплатыЗарплатыЧерезБанкЗаполнен(Сотрудник, БанковскийСчет) Экспорт

	Возврат Ложь;

КонецФункции

#КонецОбласти