#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устанавливает переданное значение опции "ИспользуютсяАвансовыеПлатежиИностранцевПоНДФЛ"
//
// Параметры:
//  Значение - Булево
//
Процедура УстановитьЗначениеОпцииАвансовыеПлатежиИностранцев(Значение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Установить(Значение);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

// Возвращает признак наличия в базе хотя бы одного проведенного документа "АвансовыйПлатежИностранцаПоНДФЛ"
//
// Возвращаемое значение:
//  Булево
//
Функция ЕстьПлатежи() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЕстьАвансовыеПлатежи
		|ИЗ
		|	Документ.АвансовыйПлатежИностранцаПоНДФЛ КАК АвансовыйПлатежИностранцаПоНДФЛ
		|ГДЕ
		|	АвансовыйПлатежИностранцаПоНДФЛ.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли