
// Возвращает типы контрольно-кассовой техники
//
// Возвращаемое значение:
//  Структура - см. МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования()
//
Функция ТипыКонтрольноКассовойТехники() Экспорт
	ПоддерживаемыеТипыОборудования = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
	ПоддерживаемыеТипыОборудования.ФискальныйРегистратор = Истина;
	ПоддерживаемыеТипыОборудования.ПринтерЧеков          = Истина;
	ПоддерживаемыеТипыОборудования.ККТ                   = Истина;
	ПоддерживаемыеТипыОборудования.ОблачнаяККТ           = Истина;
	
	Возврат ПоддерживаемыеТипыОборудования;
КонецФункции


