#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.РассылкаСообщений) = Тип("Массив") Тогда
		ОтборРассылкаСообщений = Новый СписокЗначений;
		ОтборРассылкаСообщений.ЗагрузитьЗначения(Параметры.РассылкаСообщений);
	ИначеЕсли ТипЗнч(Параметры.РассылкаСообщений) = Тип("ФиксированныйМассив") Тогда
		ОтборРассылкаСообщений = Новый СписокЗначений;
		ОтборРассылкаСообщений.ЗагрузитьЗначения(Новый Массив(Параметры.РассылкаСообщений));
	Иначе
		ОтборРассылкаСообщений = Параметры.РассылкаСообщений;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// После загрузки пользовательских настроек добавим переданный при открытии отбор по рассылкам сообщений
	Если ЗначениеЗаполнено(ОтборРассылкаСообщений) Тогда
		
		// Устанавливаем отбор по переданной рассылке или по списку ссылок
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Равно;
		Если ТипЗнч(ОтборРассылкаСообщений) = Тип("СписокЗначений") Тогда
			ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСписке;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"РассылкаСообщений",
			ОтборРассылкаСообщений,
			ВидСравненияОтбора,
			,
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ,
			"ОтборРассылкаСообщений"
		);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти