
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	НастройкиЗаполнения = Неопределено;
	
	Если ДанныеЗаполнения = Неопределено
		Или Не Справочники.НастройкиСущественностиВнеоборотныхАктивов.ЭтоНастройкаСущественностиВНА(ДанныеЗаполнения) Тогда
		НастройкиЗаполнения = Справочники.НастройкиСущественностиВнеоборотныхАктивов.НовыйНастройкиСущественностиВНА();
	Иначе
		НастройкиЗаполнения = ДанныеЗаполнения;
	КонецЕсли;
	
	Если НастройкиЗаполнения <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ЗаполнитьЗначенияСвойств(
			ЭтотОбъект,
			НастройкиЗаполнения,
			"СпособУказанияЛимита, ЛимитСтоимости");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
