
//Предназначена для конвертации mxl в pdf/xls на мобильном устройстве (мобильная платформа "не умеет" этого)
Функция ПолучитьФайлПечатнойФормыВТребуемомФормате(ПечатнаяФорма, Формат)
	
	ВызватьИсключение НСтр("ru='Сервис устарел и более недоступен. Используйте новое мобильное приложение 1С:Бухгалтерия'");
	
	Возврат Неопределено;
	
КонецФункции

//Предназначена для приема данных из МП, в К-С варианте запускает ФЗ подготовки данных для отправки в МП
Функция НачатьСинхронизацию(ДанныеМобильногоПриложения)
	
	ВызватьИсключение НСтр("ru='Сервис устарел и более недоступен. Используйте новое мобильное приложение 1С:Бухгалтерия'");
	Возврат Неопределено;
	
КонецФункции

//Предназначена для отправки данных в МП, в файловом варианте непосредственно готовит эти данные перед ответом
Функция ПолучитьПодготовленныеДанныеОбмена(ДанныеМобильногоПриложения)
	
	ВызватьИсключение НСтр("ru='Сервис устарел и более недоступен. Используйте новое мобильное приложение 1С:Бухгалтерия'");
	Возврат Неопределено;
	
КонецФункции


