
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ВариантЗагрузкиЭД") Тогда
		Объект.ВариантЗагрузкиЭД = Параметры.ВариантЗагрузкиЭД;
	Иначе
		Отказ = Истина;
		ТекстПредупреждения = НСтр("ru='Обработка не предназначена для непосредственного использования.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения);
	КонецЕсли;
	
	Объект.ГлубинаПоиска = Параметры.ГлубинаПоиска;
	Контрагент           = Параметры.Контрагент;
	
	УчетнаяЗапись = ЗагрузкаПочтовыхСообщений.УчетнаяЗаписьПользователяДляЗагрузкиСообщений();
	
	Элементы.ГлубинаПоиска.Видимость = УправлениеВидимостьюГлубинаПоиска(УчетнаяЗапись);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если НЕ ЗначениеЗаполнено(Настройки.Получить("УчетнаяЗапись")) Тогда
		Настройки.Вставить("УчетнаяЗапись", ЗагрузкаПочтовыхСообщений.УчетнаяЗаписьПользователяДляЗагрузкиСообщений());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторФоновогоЗадания) Тогда
		Элементы.ГлубинаПоиска.Видимость = УправлениеВидимостьюГлубинаПоиска(УчетнаяЗапись);
		ПараметрыОбработчикаОжидания = ИнициализироватьПараметрыОбработчикаОжидания();
		ПрочитатьПисьмаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторФоновогоЗадания) И ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ПрочитатьПисьма();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторФоновогоЗадания) Тогда
		
		КлючеваяОперация = "ЗагрузкаКарточкиКонтрагентаИзЭлектроннойПочты";
		
		Если ЗначениеЗаполнено(КлючеваяОперация) Тогда
			ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, КлючеваяОперация);
		КонецЕсли;
		
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗагрузкиДанных", 1, Истина);
	Иначе
		ТекущаяСтраница = "ГруппаДанныхКарточек";
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы И ЗначениеЗаполнено(ИдентификаторФоновогоЗадания) Тогда
		
		ЗагрузкаДанныхОтменаНаСервере(ИдентификаторФоновогоЗадания);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УчетнаяЗаписьПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		УправлениеФормой(ЭтотОбъект, Истина);
		ПрочитатьПисьма();
	Иначе
		Объект.ДанныеКарточек.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГлубинаПоискаПриИзменении(Элемент)
	
	ПрочитатьПисьма();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеКарточек

&НаКлиенте
Процедура ДанныеКарточекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураРеквизитов = Элемент.ТекущиеДанные.СтруктураРеквизитов;
	ОбработатьВыборЭлектронногоДокумента(СтруктураРеквизитов);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКарточекПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКарточекПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
	Если ТипЗнч(ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
		Если ТекущийЭлемент.Имя = "ДанныеКарточек" Тогда
			СтруктураРеквизитов = Элементы.ДанныеКарточек.ТекущиеДанные.СтруктураРеквизитов;
			ОбработатьВыборЭлектронногоДокумента(СтруктураРеквизитов);
		КонецЕсли;
	Иначе
		СообщениеПользователю = НСтр("ru='Выберите документ для загрузки'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеПользователю);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхОтмена(Команда)
	
	ТекущаяСтраница = "ГруппаДанныхКарточек";
	ЗагрузкаДанныхОтменаНаСервере(ИдентификаторФоновогоЗадания);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОтмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПрочитатьПисьма()
	
	ПараметрыОбработчикаОжидания = ИнициализироватьПараметрыОбработчикаОжидания();
	
	Если НЕ УчетнаяЗаписьНастроенаНаПолучениеПочты(УчетнаяЗапись) Тогда
		ТекстСообщения = НСтр("ru = 'Для работы требуется настройка учетной записи электронной почты на получение сообщений.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			УчетнаяЗапись,
			"ИспользоватьДляПолучения");
		Возврат;
	КонецЕсли;
	
	ПрочитатьПисьмаНаСервере();
	
	Если ЗначениеЗаполнено(ИдентификаторФоновогоЗадания) Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗагрузкиДанных", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПисьмаНаСервере()
	
	Если НЕ УчетнаяЗаписьНастроенаНаПолучениеПочты(УчетнаяЗапись) Тогда
		Возврат;
	КонецЕсли;
	
	ПрочитатьПисьмаСКарточками();
	
	ТекущаяСтраница = "ГруппаВыполняетсяЗагрузкаДанных";
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПрочитанныеДанные()
	
	ПрочитанныеДанные = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(ПрочитанныеДанные) = Тип("ТаблицаЗначений") И ПрочитанныеДанные.Количество() > 0 Тогда
		
		ИдентификаторФоновогоЗадания = Неопределено;
		
		Для Каждого ЭлементДанных Из ПрочитанныеДанные Цикл
			СтрокаДанныхКарточки = Объект.ДанныеКарточек.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДанныхКарточки, ЭлементДанных.ДанныеКарточки);
			СтрокаДанныхКарточки.СтруктураРеквизитов = ЭлементДанных.ДанныеКарточки;
		КонецЦикла;
		ПроверитьДублиИННКонтрагентов(Объект.ДанныеКарточек, Контрагент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗагрузкиДанных()
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторФоновогоЗадания) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗаданиеВыполнено(ИдентификаторФоновогоЗадания) Тогда
		ТекущаяСтраница = "ГруппаДанныхКарточек";
		ЗагрузитьПрочитанныеДанные();
		УправлениеФормой(ЭтотОбъект);
		
	Иначе
		ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания(
			"Подключаемый_ПроверитьВыполнениеЗагрузкиДанных",
			ПараметрыОбработчикаОжидания.ТекущийИнтервал,
			Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИнициализироватьПараметрыОбработчикаОжидания()
	
	Возврат Новый Структура("МинимальныйИнтервал,МаксимальныйИнтервал,ТекущийИнтервал,КоэффициентУвеличенияИнтервала",
		1, 15, 1, 1.4);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВыборЭлектронногоДокумента(СтруктураРеквизитовЭД)
	
	Закрыть(СтруктураРеквизитовЭД);
	
КонецПроцедуры

#Область ЗагрузкаКарточки

&НаСервере
Процедура ПрочитатьПисьмаСКарточками()
	
	Объект.ДанныеКарточек.Очистить();
	
	ИмяЗадания = НСтр("ru = 'Чтение карточек контрагентов'");
	
	НастройкиЧтенияПочты = Новый Структура;
	НастройкиЧтенияПочты.Вставить("ГлубинаПоиска", Объект.ГлубинаПоиска);
	НастройкиЧтенияПочты.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(Новый УникальныйИдентификатор,
					"Обработки.ПрямойОбменЭД.ПрочитатьКарточки",
					НастройкиЧтенияПочты,
					ИмяЗадания);
	
	ИдентификаторФоновогоЗадания = Результат.ИдентификаторЗадания;
	АдресРезультата = Результат.АдресХранилища;
	
	Если Результат.ЗаданиеВыполнено Тогда
		ЗагрузитьПрочитанныеДанные();
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьДублиИННКонтрагентов(ДанныеКарточек, Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИННКонтрагентов", ОбщегоНазначения.ВыгрузитьКолонку(ДанныеКарточек, "ИНН", Истина));
	Запрос.УстановитьПараметр("Контрагент"     , Контрагент);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Контрагенты.ИНН КАК ИННКонтрагентаВБазе
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН В(&ИННКонтрагентов)
	|	И НЕ Контрагенты.Ссылка = &Контрагент";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ДублиКонтрагентов = РезультатЗапроса.Выгрузить();
	
	Отбор = Новый Структура;
	
	Для Каждого ДубльКонтрагента Из ДублиКонтрагентов Цикл
		Отбор.Вставить("ИНН", ДубльКонтрагента.ИННКонтрагентаВБазе);
		КарточкиКонтрагентовСДублемПоИНН = ДанныеКарточек.НайтиСтроки(Отбор);
		Для Каждого КарточкаКонтрагентаСДублемПоИНН Из КарточкиКонтрагентовСДублемПоИНН Цикл
			КарточкаКонтрагентаСДублемПоИНН.ЕстьДубльПоИНН = Истина;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Функция УчетнаяЗаписьНастроенаНаПолучениеПочты(Знач УчетнаяЗапись)
	
	Возврат ЗначениеЗаполнено(УчетнаяЗапись) И УчетнаяЗапись.ПолучитьОбъект() <> Неопределено 
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, "ИспользоватьДляПолучения");
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(Знач ИдентификаторФоновогоЗадания)
	
	Возврат Обработки.ПрямойОбменЭД.ЗаданиеВыполнено(ИдентификаторФоновогоЗадания);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗагрузкаДанныхОтменаНаСервере(Знач ИдентификаторФоновогоЗадания)
	
	Если ЗначениеЗаполнено(ИдентификаторФоновогоЗадания) Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторФоновогоЗадания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма, ПроверятьВидимостьОтборов = Ложь)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
		
	ЭтоГруппаДанных = СтрНайти(Форма.ТекущаяСтраница, "ГруппаВыполняетсяЗагрузкаДанных") = 0;
	Элементы.ГруппаДанные.Видимость						 = ЭтоГруппаДанных;
	Элементы.ГруппаВыполняетсяЗагрузкаДанных.Видимость	 = Не ЭтоГруппаДанных;
	
	Если Объект.ДанныеКарточек.Количество() > 0 Тогда
		Форма.ТекущийЭлемент = Элементы.ДанныеКарточек;
	КонецЕсли;
	
	Если Форма.ТекущаяСтраница = "ГруппаВыполняетсяЗагрузкаДанных" Тогда
		Элементы.ЗагрузкаДанныхОтмена.Видимость = Истина;
		Элементы.ЗагрузкаДанныхОтмена.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.ЗагрузкаДанныхОтмена.Видимость = Ложь;
		Элементы.Заполнить.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	Если ПроверятьВидимостьОтборов Тогда
		Элементы.ГлубинаПоиска.Видимость = УправлениеВидимостьюГлубинаПоиска(Форма.УчетнаяЗапись);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УправлениеВидимостьюГлубинаПоиска(УчетнаяЗапись)
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ПочтовыйПротокол = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, "ПротоколВходящейПочты");
		Результат = ВРег(ПочтовыйПротокол) = "IMAP";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

