#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Если Значение = Константы.УчетЗарплатыИКадровСредствамиБухгалтерии.Получить() Тогда
		Константы.УчетЗарплатыИКадровСредствамиБухгалтерии.Установить(Не Значение);
	КонецЕсли;
	
	ЭтоПростойИнтерфейс = ОбщегоНазначенияБП.ЭтоПростойИнтерфейс();
	ВедетсяУчетЗарплатыКадров = Константы.ВедетсяУчетЗарплатыКадров.Получить();
	Константы.ОтображатьПодсистемуЗарплата.Установить(ЭтоПростойИнтерфейс И ВедетсяУчетЗарплатыКадров И Значение);
	Константы.ОтображатьПодсистемуСотрудники.Установить(ЭтоПростойИнтерфейс И ВедетсяУчетЗарплатыКадров И Не Значение);

КонецПроцедуры

#КонецОбласти

#КонецЕсли