#Область СлужебныйПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ДоступныеОбновленияКлассификаторовВФоне", Истина);
	
КонецПроцедуры

// См. РаботаСКлассификаторами.ДоступныеОбновленияКлассификаторов()
// Это обертка для выполнения этой процедуры в фоне.
Функция ДоступныеОбновленияКлассификаторовВФоне(Идентификаторы) Экспорт
	
	Возврат РаботаСКлассификаторами.ДоступныеОбновленияКлассификаторов(Идентификаторы);
	
КонецФункции

#КонецОбласти

