#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ОсновнаяОрганизация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	
	ОтборОрганизация = ОсновнаяОрганизация;
	ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	
	УстановитьУсловноеОформление();
	
	ЭтоПростойИнтерфейс = ОбщегоНазначенияБП.ЭтоПростойИнтерфейс();
	Элементы.ГруппаПомощник.Видимость = ЭтоПростойИнтерфейс;
	Элементы.ГруппаОтчеты.Видимость = ЭтоПростойИнтерфейс;
	Элементы.ОтчетАнализРНПТДокументовКомандаАнализРНПТДокументов.Видимость = ПроверкаРНПТ.ПроверкаРНПТВключена();
	
	МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Документы.УведомлениеОбОстаткахПрослеживаемыхТоваров);
	Элементы.СписокКонтекстноеМенюИзменитьВыделенные.Видимость = МожноРедактировать;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		ОсновнаяОрганизация = Параметр;
		Если ОсновнаяОрганизация <> ОтборОрганизация Тогда
			ОтборОрганизация = ОсновнаяОрганизация;
			ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
			ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОрганизацияИспользованиеПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ВидыОпераций = ВидыОперацийУведомлений(Строки.ПолучитьКлючи());
	
	Для Каждого ТекущаяСтрока Из Строки Цикл
		
		Данные = ТекущаяСтрока.Значение.Данные;
		НомерНаПечать = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Данные.Номер, Истина, Ложь);
		ПредставлениеТипДокумента = НСтр("ru = 'Уведомление'");
		Если Данные.НомерКорректировки > 0 Тогда
			ПредставлениеТипДокумента = НСтр("ru = 'Корректировочное уведомление'");
			Данные.ПредставлениеНомер = ТекстНомераПреставленияКорректировки(НомерНаПечать, Данные.НомерКорректировки);
		Иначе
			Данные.ПредставлениеНомер = НомерНаПечать;
		КонецЕсли;
		
		Данные.ПредставлениеДата = Формат(Данные.Дата, "ДФ=dd.MM.yyyy");
		
		ТекстОкончаниеДокумента = "";
		Если ТипЗНЧ(Данные.Ссылка) = Тип("ДокументСсылка.УведомлениеОбОстаткахПрослеживаемыхТоваров") Тогда
			ВидОперации = ВидыОпераций.Получить(Данные.Ссылка);
			Если ВидОперации = Перечисления.ВидыОперацийУведомленияОбОстаткахПрослеживаемыхОбъектов.ОсновныеСредства Тогда
				ТекстОкончаниеДокумента = НСтр("ru='об остатках ОС'");
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийУведомленияОбОстаткахПрослеживаемыхОбъектов.КомплектующиеОС Тогда
				ТекстОкончаниеДокумента = НСтр("ru='об остатках комплектующих ОС'");
			Иначе
				ТекстОкончаниеДокумента = НСтр("ru='об остатках'");
			КонецЕсли;
		ИначеЕсли ТипЗНЧ(Данные.Ссылка) = Тип("ДокументСсылка.УведомлениеОВвозеПрослеживаемыхТоваров") Тогда
			ТекстОкончаниеДокумента = НСтр("ru = 'о ввозе'");
		Иначе
			ТекстОкончаниеДокумента = НСтр("ru = 'о перемещении'");
		КонецЕсли;
		
		Данные.ПредставлениеТипДокумента = СтрШаблон("%1 %2", ПредставлениеТипДокумента, ТекстОкончаниеДокумента); 
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьКорректировочноеУведомлениеКонтекстноеМеню(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючНазначенияИспользования",
		?(ПустаяСтрока(КлючНазначенияИспользования), "Уведомления", КлючНазначенияИспользования));
	
		Если ТекущиеДанные <> Неопределено Тогда
			
			ПараметрыФормы.Вставить("Основание", ТекущиеДанные.Ссылка);
			
			Если ТипЗнч(ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.УведомлениеОбОстаткахПрослеживаемыхТоваров") Тогда
			
				ОткрытьФорму("Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.Форма.ФормаДокументаКорректировочная", 
					ПараметрыФормы);
				
			ИначеЕсли ТипЗнч(ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.УведомлениеОВвозеПрослеживаемыхТоваров") Тогда
				
				ОткрытьФорму("Документ.УведомлениеОВвозеПрослеживаемыхТоваров.Форма.ФормаДокументаКорректировочная", 
					ПараметрыФормы);
				
			Иначе
				
				ОткрытьФорму("Документ.УведомлениеОПеремещенииПрослеживаемыхТоваров.Форма.ФормаДокументаКорректировочная", 
					ПараметрыФормы);
				
			КонецЕсли;
			
		КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьУведомлениеОбОстаткахПрослеживаемыхТоваров(Команда)
	
	СтруктураПараметров = 
		ПараметрыФормыДокумента(
			ПредопределенноеЗначение("Перечисление.ВидыОперацийУведомленияОбОстаткахПрослеживаемыхОбъектов.Товары"));
	
	ОткрытьФорму("Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.Форма.ФормаДокументаОсновная",
		СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьУведомлениеОВвозеПрослеживаемыхТоваров(Команда)
	
	СтруктураПараметров = ПараметрыФормыДокумента();
	ОткрытьФорму("Документ.УведомлениеОВвозеПрослеживаемыхТоваров.Форма.ФормаДокументаОсновная",
		СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьУведомлениеОбОстаткахПрослеживаемыхСоставныхОС(Команда)

	СтруктураПараметров = 
		ПараметрыФормыДокумента(
			ПредопределенноеЗначение("Перечисление.ВидыОперацийУведомленияОбОстаткахПрослеживаемыхОбъектов.КомплектующиеОС"));
	
	ОткрытьФорму("Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.Форма.ФормаДокументаОсновная",
		СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьУведомлениеОбОстаткахПрослеживаемыхОС(Команда)

	СтруктураПараметров = 
		ПараметрыФормыДокумента(
			ПредопределенноеЗначение("Перечисление.ВидыОперацийУведомленияОбОстаткахПрослеживаемыхОбъектов.ОсновныеСредства"));
	
	ОткрытьФорму("Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.Форма.ФормаДокументаОсновная",
		СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьУведомлениеОПеремещенииПрослеживаемыхТоваров(Команда)
	
	СтруктураПараметров = ПараметрыФормыДокумента();
	ОткрытьФорму("Документ.УведомлениеОПеремещенииПрослеживаемыхТоваров.Форма.ФормаДокументаОсновная",
		СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПомощникПолученияРНПТ(Команда)
	
	СтруктураПараметров = Новый Структура;
	Если ОтборОрганизацияИспользование Тогда
		СтруктураПараметров.Вставить("Организация", ОтборОрганизация);
	КонецЕсли;
	ОткрытьФорму("Обработка.ПомощникПолученияРНПТ.Форма", СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКорректировочноеУведомлениеОбОстатках(Команда)
	
	СтруктураПараметров = ПараметрыФормыПодбораКорректировки();
	ОткрытьФорму("Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.Форма.ФормаПодбора",
		СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКорректировочноеУведомлениеОВвозе(Команда)
	
	СтруктураПараметров = ПараметрыФормыПодбораКорректировки();
	ОткрытьФорму("Документ.УведомлениеОВвозеПрослеживаемыхТоваров.Форма.ФормаПодбора",
		СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКорректировочноеУведомлениеОПеремещении(Команда)
	
	СтруктураПараметров = ПараметрыФормыПодбораКорректировки();
	ОткрытьФорму("Документ.УведомлениеОПеремещенииПрослеживаемыхТоваров.Форма.ФормаПодбора",
		СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПараметрыФормыДокумента(ВидОперации = Неопределено)
	
	ЗначенияЗаполнения = Новый Структура;
	
	Если ЗначениеЗаполнено(ВидОперации) Тогда
		ЗначенияЗаполнения.Вставить("ВидОперации", ВидОперации);
	КонецЕсли;
	
	Если ОтборОрганизацияИспользование Тогда
		ЗначенияЗаполнения.Вставить("Организация", ОтборОрганизация);
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаКлиенте
Функция ПараметрыФормыПодбораКорректировки()
	
	Отбор = Новый Структура;
	
	Если ОтборОрганизацияИспользование Тогда
		Отбор.Вставить("Организация", ОтборОрганизация);
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("Отбор", Отбор);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстНомераПреставленияКорректировки(Номер, НомерКорректировки)
	
	НомерНаПечать = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер, Истина, Ложь);
	ТекстНомера = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 (корр. %2)'"),
		НомерНаПечать, 
		НомерКорректировки);
		
	Возврат ТекстНомера;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	// Состояние
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Состояние");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Список.Состояние", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныеДанныеЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Не отправлено'"));
	
	// Организация
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Организация");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОтборОрганизацияИспользование", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОтборОрганизация", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидыОперацийУведомлений(Уведомления)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.Ссылка,
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.ВидОперации
	|ИЗ
	|	Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров КАК УведомлениеОбОстаткахПрослеживаемыхТоваров
	|ГДЕ
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.Ссылка В (&Уведомления)";
	Запрос.УстановитьПараметр("Уведомления", Уведомления);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Ссылка, Выборка.ВидОперации);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
