#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Версия формата выгрузки.
//
// Параметры:
//  НаДату - Дата
//  ВыбраннаяФорма - Строка
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ВерсииФорматовВыгрузки
//
Функция ВерсияФорматаВыгрузки(Знач НаДату = Неопределено, ВыбраннаяФорма = Неопределено) Экспорт
	
	Возврат Перечисления.ВерсииФорматовВыгрузки.Версия500;
	
КонецФункции

// Возвращает таблицу форм отчета с реквизитами и периодами действия.
//
// Возвращаемое значение:
//   ТаблицаЗначений - Таблица форм отчета:
//     * ФормаОтчета - Строка
//     * ОписаниеОтчета - Строка
//     * ДатаНачалоДействия - Дата
//     * ДатаКонецДействия - Дата
//     * РедакцияФормы - Строка
//
Функция ТаблицаФормОтчета() Экспорт
	
	Неограниченный = '0001-01-01';
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);
	ТаблицаФормОтчета.Колонки.Добавить("РедакцияФормы",      ОписаниеТиповСтрока, "Редакция формы", 20);
	
	ФормаОтчета = ТаблицаФормОтчета.Добавить();
	ФормаОтчета.ФормаОтчета        = "ФормаОтчета2017Кв3";
	ФормаОтчета.ОписаниеОтчета     = "Финансовая отчетность в Банки";
	ФормаОтчета.РедакцияФормы      = "от 05.10.2011 № 124н.";
	ФормаОтчета.ДатаНачалоДействия = '2011-12-01';
	ФормаОтчета.ДатаКонецДействия  = Неограниченный;
	
	ФормаОтчета = ТаблицаФормОтчета.Добавить();
	ФормаОтчета.ФормаОтчета        = "ФормаОтчета2011Кв4";
	ФормаОтчета.ОписаниеОтчета     = "Утверждена приказом Минфина России от 02.07.2010 г. №66н, в ред. приказа Минфина России от 05.10.2011 № 124н.";
	ФормаОтчета.РедакцияФормы      = "от 05.10.2011 № 124н.";
	ФормаОтчета.ДатаНачалоДействия = '2011-12-01';
	ФормаОтчета.ДатаКонецДействия  = Неограниченный;
	
	Возврат ТаблицаФормОтчета;
	
КонецФункции

// Возвращает сведения об отдельных показателях регламентированного отчета.
//
// Параметры:
//   ЭкземплярРеглОтчета - ДокументСсылка.РегламентированныйОтчет
//
// Возвращаемое значение:
//   Неопределено - получение сведений из отчета не предусмотрено
//
Функция ДанныеРеглОтчета(ЭкземплярРеглОтчета) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает дерево форм и форматов регламентированного отчета.
//
// Возвращаемое значение:
//  ДеревоЗначений:
//    * Код - Строка
//    * ДатаПриказа - Дата
//    * НомерПриказа - Строка
//    * ДатаНачалаДействия - Дата
//    * ДатаОкончанияДействия - Дата
//    * ИмяОбъекта - Строка
//    * Описание - Строка
//
Функция ДеревоФормИФорматов() Экспорт
	
	ФормыИФорматы = РегламентированнаяОтчетность.НовоеДеревоФормИФорматов();
	
	ДобавитьФормуИФорматыФормаОтчета2011Кв4(ФормыИФорматы);
	
	Возврат ФормыИФорматы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВерсионированиеФорм

Функция ВерсияСтруктурыДанных(ИмяФормы) Экспорт
	
	Если ИмяФормы = "ФормаОтчета2017Кв3" Тогда
		Возврат "БРО.2026.04.01";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ОбновитьСтруктурыДанныхСохраненногоОтчета(ОбновляемыеДанныеОтчета) Экспорт
	
	СохраненнаяВерсия = "БРО.2011.09.01"; // Версия формы до использования обновления структур данных
	
	СохраненныеДанные = ОбновляемыеДанныеОтчета.СохраненныеДанные;
	Если СохраненныеДанные.Свойство("ВерсияСтруктурыДанных") Тогда
		СохраненнаяВерсия = СохраненныеДанные.ВерсияСтруктурыДанных;
	КонецЕсли;
	
	ИмяФормы = ОбновляемыеДанныеОтчета.ИмяФормы;
	Если ИмяФормы = "ФормаОтчета2017Кв3" Тогда
		ВыполнитьОбработчикиОбновленияФормаОтчета2017Кв3(ОбновляемыеДанныеОтчета, СохраненнаяВерсия);
		СохраненныеДанные.Вставить("ВерсияСтруктурыДанных", ВерсияСтруктурыДанных(ИмяФормы));
	КонецЕсли;
	
КонецПроцедуры

Функция ВыполнитьПриПереходеНаВерсию(НоваяВерсия, СохраненнаяВерсия)
	
	Возврат ЧисловоеПредставлениеВерсии(НоваяВерсия) > ЧисловоеПредставлениеВерсии(СохраненнаяВерсия);
	
КонецФункции

Функция ЧисловоеПредставлениеВерсии(ВерсияСтруктурыДанных)
	
	ЧисловоеПредставление = СтрЗаменить(ВерсияСтруктурыДанных, "БРО.", "");
	ЧисловоеПредставление = СтрЗаменить(ЧисловоеПредставление, "РО.", "");
	ЧисловоеПредставление = СтрЗаменить(ЧисловоеПредставление, ".", "");
	ЧисловоеПредставление = Число(ЧисловоеПредставление);
	
	Возврат ЧисловоеПредставление;
	
КонецФункции

#Область ОбработчикиОбновленияФормаОтчета2017Кв3

Процедура ВыполнитьОбработчикиОбновленияФормаОтчета2017Кв3(ДанныеОтчета, СохраненнаяВерсия)
	
	Если ВыполнитьПриПереходеНаВерсию("БРО.2026.04.01", СохраненнаяВерсия) Тогда
		ОбновитьСтруктурыФормаОтчета2017Кв3_20260401(ДанныеОтчета);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСтруктурыФормаОтчета2017Кв3_20260401(ДанныеОтчета)
	
	// Добавление данных нового подраздела "Карточка счета 53 «Счет цифрового рубля»"
	// в отчет "Операции по банковским счетам (транзакции)"
	Раздел = ДанныеОтчета.СохраненныеДанные.ДанныеМногоуровневыхРазделов.ОперацииПоБанковскимСчетам;
	Подразделы = Раздел.Строки[0].Строки;
	ВеткаПодраздела = Подразделы.Вставить(2);
	ДанныеПодраздела = ВеткаПодраздела.Строки.Добавить();
	ДанныеПодраздела.Данные = Новый Структура();
	ДанныеПодраздела.ДанныеМногострочныхЧастей = Новый Структура();
	ДанныеПодраздела.Параметры = Новый Структура();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

// Возвращает сведения сохраненного отчета с учетом актуализации структур данных.
// 
// Параметры:
//  СохраненныйДокумент - ДокументСсылка.РегламентированныйОтчет
// 
// Возвращаемое значение:
//  Структура - Сведения отчета:
//   * ИмяФормы - Строка
//   * СохраненныеДанные - Произвольный
//   * ДеревоНастройкиСтраниц - Произвольный
// 
Функция СведенияОтчета(СохраненныйДокумент) Экспорт
	
	ОбновляемыеДанныеОтчета = Новый Структура;
	ОбновляемыеДанныеОтчета.Вставить("ИмяФормы", СохраненныйДокумент.ВыбраннаяФорма);
	ОбновляемыеДанныеОтчета.Вставить("СохраненныеДанные", СохраненныйДокумент.ДанныеОтчета.Получить());
	ОбновляемыеДанныеОтчета.Вставить("ДеревоНастройкиСтраниц", СохраненныйДокумент.ДеревоНастройкиСтраниц.Получить());
	
	ОбновитьСтруктурыДанныхСохраненногоОтчета(ОбновляемыеДанныеОтчета);
	
	Возврат ОбновляемыеДанныеОтчета;
	
КонецФункции

Процедура ДобавитьФормуИФорматыФормаОтчета2011Кв4(ФормыИФорматы)
	
	ФормаОтчета = ФормыИФорматы.Строки.Добавить();
	ФормаОтчета.Код = "710099";
	ФормаОтчета.ДатаПриказа = '2015-04-06';
	ФормаОтчета.НомерПриказа = "57н-Сбербанк";
	ФормаОтчета.ИмяОбъекта = "ФормаОтчета2011Кв4";
	
	ФорматФормы = ФормаОтчета.Строки.Добавить();
	ФорматФормы.Код = "5.06";
	ФорматФормы.ДатаНачалаДействия    = ФормаОтчета.ДатаНачалаДействия;
	ФорматФормы.ДатаОкончанияДействия = ФормаОтчета.ДатаОкончанияДействия;
	
КонецПроцедуры

// Возвращает адрес информационного файла внешней компоненты банка.
// 
// Параметры:
//   Банк - СправочникСсылка.Банки
//   ПараметрыКлиента - Произвольный
// 
// Возвращаемое значение:
//   Строка
//
Функция АдресИнформационногоФайлаВнешнейКомпонентыБанка(Банк, ПараметрыКлиента) Экспорт
	
	ВремФайл = ПолучитьИмяВременногоФайла();
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(ВремФайл);
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("bic");
	ЗаписьJSON.ЗаписатьЗначение(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Банк, "Код"));
	
	ОтчетностьВБанкиСлужебный.ДобавитьДополнительныеПараметры(ЗаписьJSON, ПараметрыКлиента);
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	ЗаписьJSON.Закрыть();
	
	Данные = Новый ДвоичныеДанные(ВремФайл);
	
	Попытка
		УдалитьФайлы(ВремФайл);
	Исключение
		ВидОперации = НСтр("ru = 'Удаление временного файла.'");
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОтчетностьВБанкиСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, ПодробноеПредставлениеОшибки);
	КонецПопытки;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	
	Результат = ОтчетностьВБанкиСлужебный.ОтправитьЗапросНаСервер(
		"https://reportbank.1c.ru", "/api/rest/bank/getSettings/", Заголовки, Данные, Истина, 15);
	
	ТекстСообщения = "";
	ТекстОшибки = "";
	
	Если Результат.Статус Тогда
		ДанныеОтвета = ОтчетностьВБанкиСлужебный.ДанныеИзСтрокиJSON(Результат.Тело);
		Если НЕ ДанныеОтвета = Неопределено Тогда
			Возврат ДанныеОтвета.settings.info_xml_uri;
		КонецЕсли;
		
	Иначе
		Если ЗначениеЗаполнено(Результат.Тело) Тогда
			ДанныеОтвета = ОтчетностьВБанкиСлужебный.ДанныеИзСтрокиJSON(Результат.Тело);
			Если НЕ ДанныеОтвета = Неопределено Тогда
				Если ДанныеОтвета.Свойство("errorText") Тогда
					ТекстСообщения = ДанныеОтвета.errorText;
				Иначе
					ТекстСообщения = НСтр("ru = 'Получена неизвестная ошибка с сервиса https://reportbank.1c.ru.'");
				КонецЕсли;
			КонецЕсли;
			ТекстОшибки = НСтр("ru = 'Ошибка получения данных с сервиса https://reportbank.1c.ru.
				|Код состояния: %1
				|%2'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, Результат.КодСостояния, Результат.Тело);
		Иначе
			ТекстСообщения = Результат.СообщениеОбОшибке;
			ТекстОшибки = НСтр("ru = 'Ошибка получения данных с сервиса https://reportbank.1c.ru.
				|Код состояния: %1'");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) ИЛИ ЗначениеЗаполнено(ТекстСообщения) Тогда
		ВидОперации = НСтр("ru = 'Получения адреса внешней компоненты в сервисе https://reportbank.1c.ru.'");
		ОтчетностьВБанкиСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, ТекстОшибки);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
КонецФункции

// Именованные значения настройки видимости разделов.
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - Значения настройки видимости разделов:
// * Показать - Число - (значение 1) раздел включен в отчет и доступен в настройках;
// * НеПоказывать - Число - (значение 0) раздел исключен из отчета и доступен в настройках;
// * Исключить - Число - (значение -1) раздел исключен из отчета и недоступен в настройках.
// 
Функция ЗначенияНастройкиВидимостиРазделов() Экспорт
	
	ЗначенияВидимости = Новый Структура;
	ЗначенияВидимости.Вставить("Показать", 1); // раздел включен в отчетность
	ЗначенияВидимости.Вставить("НеПоказывать", 0); // раздел не включен в отчетность, но может быть добавлен пользователем
	ЗначенияВидимости.Вставить("Исключить", -1); // раздел не включен в отчетность, возможность добавления отсутствует
	
	Возврат Новый ФиксированнаяСтруктура(ЗначенияВидимости)
	
КонецФункции

#КонецОбласти

#КонецЕсли
