////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции, общие для всех форм отчета.
// Модуль заполняется только при сохранении отчета как внешнего отчета.
// В таком отчете невозможно сохранить модуль менеджера, и его требуется
// перенести в модуль объекта.
// Обращение к процедурам и функциям модулей осуществляется через функцию,
// возвращающую ссылку на доступный модуль отчета.
// см. РегламентированнаяОтчетностьВызовСервера.ОтчетОбъект
// 
////////////////////////////////////////////////////////////////////////////////