
#Область ПрограммныйИнтерфейс

#Область ОтчетностьЗаемщика

// Возвращает пустую структуру с ключами для описания параметров формирования одного отчета
// в составе отчетности заемщика в рамках заявки на кредит.
//
// Возвращаемое значение:
//	Структура - Содержит ключи:
//		* ВидОтчета - Строка - Идентификатор отчета как он определен в БРО.
//		* ДатаНачала - Дата - Начало периода, за который формируется отчет.
//                      Не используется для регламентированных отчетов (баланс, ОФР, налоговые декларации), 
//                      которые строятся за фиксированные периоды, для них дата начала всегда определяется по дате конца периода.
//		* ДатаОкончания - Дата - Конец периода, за который формируется отчет.
//		* Счет - ПланСчетовСсылка.Хозрасчетный - Счет бухгалтерского учета, по которому строится отчет. Используется для отчетов по бухгалтерским счетам.
//		* Банки - Массив - Содержит элементы справочника БанкиУниверсальногоОбмена, для которых требуется отчет.
//
Функция ПараметрыОтчетаЗаемщика() Экспорт

	Результат = Новый Структура();
	Результат.Вставить("ВидОтчета",      "");
	Результат.Вставить("ДатаНачала",     '0001-01-01');
	Результат.Вставить("ДатаОкончания",  '0001-01-01');
	Результат.Вставить("Счет",           ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПустаяСсылка"));
	Результат.Вставить("Банки",          Новый Массив()); 
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ТранзакцииОбмена

// Возвращает ссылки на значения перечислений, которые описывают типы транзакций для указанного сервиса обмена по заявкам.
//
// Параметры:
//	СервисОбменаСБанками - ПеречислениеСсылка.СервисыОбменаСБанками - Сервис обмена.
//
// Возвращаемое значение:
//	Структура - Содержит ключи, в значениях которых указаны ссылки на типы транзакций.
//
Функция ТипыТранзакцийСервисаОбменаСБанками(СервисОбменаСБанками) Экспорт

	Результат = Новый Структура();
	
	Результат.Вставить("Заявка");
	Результат.Вставить("ИзвещениеОПолученииБанкомЗаявки");
	Результат.Вставить("ОтрицательноеКредитноеРешение");
	Результат.Вставить("ПоложительноеКредитноеРешение");
	Результат.Вставить("Акцепт");
	Результат.Вставить("ИзвещениеОПолученииБанкомАкцепта");
	Результат.Вставить("Ошибка");
	
	Если СервисОбменаСБанками = ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ЗаявкиНаКредит") Тогда

		ИмяПеречисления = "Перечисление.ТипыТранзакцийОбменаСБанкамиЗаявкиНаКредит.";
		Результат.Заявка                           = ПредопределенноеЗначение(ИмяПеречисления + "ЗаявкаНаКредит");
		Результат.ИзвещениеОПолученииБанкомЗаявки  = ПредопределенноеЗначение(ИмяПеречисления + "ИзвещениеОПолученииБанкомЗаявки");
		Результат.ОтрицательноеКредитноеРешение    = ПредопределенноеЗначение(ИмяПеречисления + "ОтрицательноеКредитноеРешение");
		Результат.ПоложительноеКредитноеРешение    = ПредопределенноеЗначение(ИмяПеречисления + "ПоложительноеКредитноеРешение");
		Результат.Акцепт                           = ПредопределенноеЗначение(ИмяПеречисления + "АкцептЗаемщика");
		Результат.ИзвещениеОПолученииБанкомАкцепта = ПредопределенноеЗначение(ИмяПеречисления + "ИзвещениеОПолученииБанкомАкцептаЗаемщика");
		Результат.Ошибка                           = ПредопределенноеЗначение(ИмяПеречисления + "Ошибка");
	
	ИначеЕсли СервисОбменаСБанками = ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ЗаявкиНаЛизинг") Тогда

		ИмяПеречисления = "Перечисление.ТипыТранзакцийОбменаСБанкамиЗаявкиНаЛизинг.";
		Результат.Заявка                           = ПредопределенноеЗначение(ИмяПеречисления + "ЗаявкаНаЛизинг");
		Результат.ИзвещениеОПолученииБанкомЗаявки  = ПредопределенноеЗначение(ИмяПеречисления + "ИзвещениеОПолученииБанкомЗаявки");
		Результат.ОтрицательноеКредитноеРешение    = ПредопределенноеЗначение(ИмяПеречисления + "ОтрицательноеКредитноеРешение");
		Результат.ПоложительноеКредитноеРешение    = ПредопределенноеЗначение(ИмяПеречисления + "ПоложительноеКредитноеРешение");
		Результат.Акцепт                           = ПредопределенноеЗначение(ИмяПеречисления + "АкцептКлиента");
		Результат.ИзвещениеОПолученииБанкомАкцепта = ПредопределенноеЗначение(ИмяПеречисления + "ИзвещениеОПолученииБанкомАкцептаКлиента");
		Результат.Ошибка                           = ПредопределенноеЗначение(ИмяПеречисления + "Ошибка");
	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

Функция ПредставлениеСуммыКредита(Сумма) Экспорт 
	
	Если Сумма <= 0 Тогда
		Возврат Строка(Сумма);
	КонецЕсли;
	
	Если Сумма >= 1000000 Тогда
		ПредставлениеСуммы = Окр(Сумма / 1000000, 3);
		Возврат СтрШаблон(НСтр("ru = '%1 млн'"), ПредставлениеСуммы);
	ИначеЕсли Сумма >= 1000 Тогда
		ПредставлениеСуммы = Окр(Сумма / 1000, 3);
		Возврат СтрШаблон(НСтр("ru = '%1 тыс.'"), ПредставлениеСуммы);
	Иначе
		Возврат СтрШаблон(НСтр("ru = '%1 руб.'"), Сумма);
	КонецЕсли;
	
КонецФункции

Функция ПредставлениеСрокаКредита(КоличествоМесяцев) Экспорт 
	
	Возврат СтрШаблон(НСтр("ru = '%1 мес.'"), КоличествоМесяцев);
	
КонецФункции

Функция ПредставлениеЛичныхДанных(ИНН, ДатаРождения, МестоРождения, Адрес, Телефон, ПредставлениеДокумента) Экспорт
	
	Возврат СтрШаблон(НСтр("ru='ИНН: %1. Дата рождения: %2. Место рождения: %3.
	                           |%4.
	                           |Адрес: %5. Телефон: %6.'"),
		?(ЗначениеЗаполнено(ИНН), ИНН, "<...>"),
		?(ЗначениеЗаполнено(ДатаРождения), Формат(ДатаРождения, "ДФ=dd.MM.yyyy"), "<...>"),
		?(ЗначениеЗаполнено(МестоРождения), МестоРождения, "<...>"),
		?(ЗначениеЗаполнено(ПредставлениеДокумента), ПредставлениеДокумента, "<...>"),
		?(ЗначениеЗаполнено(Адрес), Адрес, "<...>"),
		?(ЗначениеЗаполнено(Телефон), Телефон, "<...>"));
	
КонецФункции

#КонецОбласти
	
#КонецОбласти
