
#Область СлужебныйПрограммныйИнтерфейс

// Новые данные интеграции.
// 
// Возвращаемое значение:
//  Структура - Данные интеграции:
// * id_token - Строка - Токен доступа
// * client_id - Строка - Публичная часть ключа доступа
// * client_secret - Строка - Секретная часть ключа доступа
// * Логин - Строка - Логин пользователя ИТС
// * КлючПодключения - Строка - Ключ подключения ИБ
// * ИдентификаторИТС - Строка - Идентификатор пользователя ИТС
// * ДатаПодключенияСИ - Дата - Дата подключения к сервису интеграции
// * ДатаОбновленияТокена - Дата - Дата обновления токена доступа
// * ДоступныеАдреса - Массив из См. ИнтеграцияBNovo.НовыеПараметрыДоступногоАдреса - Доступные адреса
Функция НовыеДанныеИнтеграции() Экспорт
	
	ДанныеИнтеграции = Новый Структура;
	
	ДанныеИнтеграции.Вставить("id_token", "");
	ДанныеИнтеграции.Вставить("client_id", "");
	ДанныеИнтеграции.Вставить("client_secret", "");
	ДанныеИнтеграции.Вставить("Логин", "");
	ДанныеИнтеграции.Вставить("КлючПодключения", "");
	ДанныеИнтеграции.Вставить("ИдентификаторИТС", "");
	ДанныеИнтеграции.Вставить("ДатаПодключенияСИ", Дата(1, 1, 1));
	ДанныеИнтеграции.Вставить("ДатаОбновленияТокена", Дата(1, 1, 1));
	ДанныеИнтеграции.Вставить("ДоступныеАдреса", ДоступныеАдреса());
	
	Возврат ДанныеИнтеграции;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Доступные адреса.
// 
// Возвращаемое значение:
//  Массив из См. ИнтеграцияBNovo.НовыеПараметрыДоступногоАдреса - Доступные адреса
Функция ДоступныеАдреса()
	
	ДоступныеАдреса = Новый Массив;
	
	ПараметрыДоступногоАдреса = ИнтеграцияBnovo.НовыеПараметрыДоступногоАдреса();
	ПараметрыДоступногоАдреса.Текущий = Истина;
	ПараметрыДоступногоАдреса.Адрес = "https://app-586822.1cmycloud.com/applications/bn-gate-prod-1";
	ДоступныеАдреса.Добавить(ПараметрыДоступногоАдреса);
	
	ПараметрыДоступногоАдреса = ИнтеграцияBnovo.НовыеПараметрыДоступногоАдреса();
	ПараметрыДоступногоАдреса.Адрес = "https://app-643656.1cmycloud.com/applications/bn-gate-prod-2";
	ДоступныеАдреса.Добавить(ПараметрыДоступногоАдреса);
	
	ПараметрыДоступногоАдреса = ИнтеграцияBnovo.НовыеПараметрыДоступногоАдреса();
	ПараметрыДоступногоАдреса.Адрес = "https://app-125482.1cmycloud.com/applications/bn-gate-prod-3";
	ДоступныеАдреса.Добавить(ПараметрыДоступногоАдреса);
	
	ПараметрыДоступногоАдреса = ИнтеграцияBnovo.НовыеПараметрыДоступногоАдреса();
	ПараметрыДоступногоАдреса.Адрес = "https://app-659828.1cmycloud.com/applications/bn-gate-prod-4";
	ДоступныеАдреса.Добавить(ПараметрыДоступногоАдреса);
	
	
	Возврат ДоступныеАдреса;
	
КонецФункции

#КонецОбласти