#Область ПрограммныйИнтерфейс

// Переопределяет данные заполнения нового элемента справочника
//
// Параметры:
//  ДанныеЗаполнения - Структура - см. Справочники.РассылкиСообщений.НовыйДанныеЗаполнения()
//  ПараметрыРассылки - Структура - см. РассылкаСообщений.НовыйПараметрыРассылки()
//  СпециальныеПараметрыРассылки - Структура - параметры, специфичные для конкретного вида рассылки.
//
Процедура ПередДобавлениемРассылки(ДанныеЗаполнения, ПараметрыРассылки, СпециальныеПараметрыРассылки = Неопределено) Экспорт

	Если ПараметрыРассылки.ВидРассылки = Перечисления.ВидыРассылокСообщений.ЗапросНаСверку Тогда
		РассылкаЗапросовНаСверку.ПередДобавлениемРассылки(ДанныеЗаполнения, ПараметрыРассылки, СпециальныеПараметрыРассылки);
	КонецЕсли;

КонецПроцедуры

// Переопределяет параметры отправки сообщений
//
// Параметры:
//  ПараметрыОтправки - Структура - см. РассылкаСообщений.НовыйПараметрыОтправкиСообщений()
Процедура ПриИнициализацииПараметровОтправкиСообщений(ПараметрыОтправки) Экспорт

КонецПроцедуры

// Переопределяет обработку порции электронных писем
//
// Параметры:
//  ПорцияСообщений - ТаблицаЗначений - колонки соответствуют измерениям, ресурсам и реквизитам регистра сведений РассылкаСообщений
//
Процедура ПослеВыборкиПорцииПочтовыхСообщений(ПорцияСообщений) Экспорт

КонецПроцедуры

// Переопределяет параметры отправки почтовых сообщений
//
// Параметры:
//  Рассылка - СправочникСсылка - зависит от вида рассылки.
//  ВидРассылки - ПеречислениеСсылка.ВидыРассылокСообщений - вид рассылки.
//  ПараметрыОтправки - Структура - см. РассылкаСообщений.НовыйПараметрыОтправкиСообщений()
//
Процедура ПередОтправкойПочтовыхСообщенийПоРассылке(Рассылка, ВидРассылки, ПараметрыОтправки) Экспорт

КонецПроцедуры

// Переопределяет параметры отправки почтовых сообщений
//
// Параметры:
//  Рассылка - СправочникСсылка - зависит от вида рассылки.
//  ПараметрыОтправки - Структура - см. РассылкаСообщений.НовыйПараметрыОтправкиСообщений()
//
Процедура ПослеОтправкиПочтовыхСообщенийПоРассылке(Рассылка, ПараметрыОтправки) Экспорт

КонецПроцедуры

// Переопределяет параметры почтового сообщения
//
// Параметры:
//  ПараметрыПочтовогоСообщения - Структура - см. РассылкаСообщений.НовыйПараметрыПочтовогоСообщения()
//  ВидРассылки - ПеречислениеСсылка.ВидыРассылокСообщений - вид рассылки.
//
Процедура ПриИнициализацииПараметровПочтовогоСообщения(ПараметрыПочтовогоСообщения, ВидРассылки) Экспорт
	
КонецПроцедуры

// Регистрирует очередь рассылки в регистре сведений
//
// Параметры:
//  ОчередьРассылки - РегистрСведенийНаборЗаписей.РассылкаСообщений - набор записей очереди рассылки.
//                    Запись не требуется - будет выполнена в вызывающем методе.
//  ПараметрыРассылки - Структура - см. РассылкаСообщений.НовыйПараметрыРассылки()
//  СпециальныеПараметрыРассылки - Структура - любые данные, специфичные для конкретного вида рассылки
//
Процедура РегистрацияОчередиРассылки(ОчередьРассылки, ПараметрыРассылки, СпециальныеПараметрыРассылки = Неопределено) Экспорт

	Если ПараметрыРассылки.ВидРассылки = Перечисления.ВидыРассылокСообщений.ЗапросНаСверку Тогда
		РассылкаЗапросовНаСверку.РегистрацияОчередиРассылки(ОчередьРассылки, ПараметрыРассылки, СпециальныеПараметрыРассылки);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти