#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриИзмененииОрганизации();
	СжатьКолонки(Элементы.СписокДокументов, "СписокДокументовОтступ");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	ПриИзмененииОрганизации();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СжатьКолонки(ТаблицаФормы, КолонкаОтступ)

	Для Каждого КолонкаТаблицы Из ТаблицаФормы.ПодчиненныеЭлементы Цикл 
		Если КолонкаТаблицы.Имя = КолонкаОтступ Тогда 
			КолонкаТаблицы.РастягиватьПоГоризонтали = Истина;
		Иначе 
			КолонкаТаблицы.РастягиватьПоГоризонтали = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииОрганизации()

	СписокДокументов.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("ОтборПоОрганизации", Истина);
		
КонецПроцедуры

#КонецОбласти


