#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Справочники.Организации.ДополнитьДанныеЗаполненияПриОднофирменномУчете(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЭтоУдалениеНабораЗаписей(Замещение) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.НалоговыйПериод = РегистрыСведений.РасчетНалогаАУСН.НалоговыйПериод(Запись.НалоговыйПериод);
	КонецЦикла;
	
	СуществующийНабор = ОбщегоНазначения.ЗаписиНабораИзБазыДанных(ЭтотОбъект, Замещение);
	СравниваемыеЗначения = Новый Массив;
	МетаданныеРегистра = Метаданные();
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		СравниваемыеЗначения.Добавить(Измерение.Имя);
	КонецЦикла;
	Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
		СравниваемыеЗначения.Добавить(Ресурс.Имя);
	КонецЦикла;
	ИменаСравниваемыхРеквизитов = СтрСоединить(СравниваемыеЗначения, ",");
	ДополнительныеСвойства.Вставить(
		"ИзмененияОтсутствуют", ОбщегоНазначения.КоллекцииИдентичны(ЭтотОбъект, СуществующийНабор, ИменаСравниваемыхРеквизитов));
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.ИзмененияОтсутствуют Тогда
		Возврат;
	КонецЕсли;
	
	РасчетыАУСН = Новый Соответствие;
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если ДатыЗапретаИзмененияБП.ЗапрещеноРедактированиеПериода(Запись.НалоговыйПериод, Запись.Организация) Тогда
			Продолжить;
		КонецЕсли;
		НайденныйПериод = РасчетыАУСН.Получить(Запись.Организация);
		Если НайденныйПериод = Неопределено Или Запись.НалоговыйПериод < НайденныйПериод Тогда
			РасчетыАУСН.Вставить(Запись.Организация, Запись.НалоговыйПериод);
		КонецЕсли;
	КонецЦикла;
	
	ВидРегламентнойОперации = Перечисления.ВидыРегламентныхОпераций.НачислениеНалогаАУСН;
	НомерГруппы = Перечисления.ВидыРегламентныхОпераций.НомерГруппы(ВидРегламентнойОперации);
	
	Для Каждого ЭлементРасчета Из РасчетыАУСН Цикл
		РегистрыСведений.НеактуальныеРегламентныеОперации.СдвинутьГраницуАктуальностиНазад(
			ЭлементРасчета.Ключ, ЭлементРасчета.Значение, НомерГруппы, ВидРегламентнойОперации, Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
