#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ЗагрузитьДанныеИзСервисаКлассификаторов", Истина);
	
КонецПроцедуры

// Загружает в фоне актуальный перечень уполномоченных банков АУСН из сервиса классификаторов
// 
// Параметры:
//  Параметры - Структура - см. ДлительныеОперации.ПараметрыВыполненияВФоне()
//  АдресРезультата - Строка - адрес временного хранилища, в которое будет помещен результат выполнения
//
Процедура ЗагрузитьДанныеИзСервисаКлассификаторов(Параметры, АдресРезультата) Экспорт
	
	Классификаторы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторВСервисеКлассификаторов());
	РезультатЗагрузки = РаботаСКлассификаторами.ОбновитьКлассификаторы(Классификаторы);
	
	Если Не ПустаяСтрока(РезультатЗагрузки.КодОшибки) Тогда
		
		ШаблонСообщения = НСтр("ru = 'При загрузке перечня уполномоченных банков АУСН из сервиса классификаторов возникла ошибка:
			|%1'", ОбщегоНазначения.КодОсновногоЯзыка());
		
		ТекстСообщения = СтрШаблон(ШаблонСообщения, РезультатЗагрузки.ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление перечня уполномоченных банков АУСН'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.УполномоченныеБанкиАУСН, ,
			ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает идентификатор перечня уполномоченных банков АУСН в сервисе классификаторов
//
// Возвращаемое значение:
//   Строка
//
Функция ИдентификаторВСервисеКлассификаторов() Экспорт 

	Возврат "AuthorizedBanksAUSN";

КонецФункции

// Возвращает таблицу уполномоченных банков АУСН
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица с колонками Банк (СправочникСсылка.КлассификаторБанков) и Наименование (Строка)
//
Функция УполномоченныеБанки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлассификаторБанков.Ссылка КАК Банк,
	|	УполномоченныеБанкиАУСН.Наименование КАК Наименование
	|ИЗ
	|	РегистрСведений.УполномоченныеБанкиАУСН КАК УполномоченныеБанкиАУСН
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
	|		ПО УполномоченныеБанкиАУСН.ИНН = КлассификаторБанков.ИНН
	|		И НЕ КлассификаторБанков.ПометкаУдаления
	|		И НЕ КлассификаторБанков.ДеятельностьПрекращена";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// ИнтернетПоддержкаПользователей.РаботаСКлассификаторами

// См. РаботаСКлассификаторамиПереопределяемый.ПриДобавленииКлассификаторов.
Процедура ПриДобавленииКлассификаторов(Классификаторы) Экспорт
	
	Описание = РаботаСКлассификаторами.ОписаниеКлассификатора();
	Описание.Наименование           = НСтр("ru = 'Перечень уполномоченных кредитных организаций для АУСН'");
	Описание.Идентификатор          = ИдентификаторВСервисеКлассификаторов();
	Описание.ОбновлятьАвтоматически = Истина;
	Описание.ОбщиеДанные            = Истина;

	Классификаторы.Добавить(Описание);
	
КонецПроцедуры

// См. РаботаСКлассификаторамиПереопределяемый.ПриЗагрузкеКлассификатора.
Процедура ПриЗагрузкеКлассификатора(Идентификатор, Версия, Адрес, Обработан) Экспорт
	
	Если Идентификатор <> ИдентификаторВСервисеКлассификаторов() Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ДвоичныеДанныеXML = ПолучитьИзВременногоХранилища(Адрес);
		ДанныеXML = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанныеXML);
		РезультатЧтенияXML = ОбщегоНазначения.ПрочитатьXMLВТаблицу(ДанныеXML);
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Загрузить(РезультатЧтенияXML.Данные);
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
		
		Обработан = Истина;
	Исключение
		Обработан = Ложь;
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление перечня уполномоченных банков АУСН'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.УполномоченныеБанкиАУСН, ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

// Конец ИнтернетПоддержкаПользователей.РаботаСКлассификаторами

#КонецОбласти

#КонецЕсли