
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПутьКНастройке();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьСохранения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПриниматьПриглашенияПриИзменении(Элемент)
	
	УстановитьДоступностьСохранения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройку(Команда)
	
	СохранитьНастройкуНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПримуРешениеПозже(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьСохранения()
	
	Элементы.СохранитьНастройку.Доступность = ПриниматьПриглашения > 0;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПутьКНастройке()
	
	ОсновнойТекст = НСтр("ru = 'Вы можете принять решение позже и изменить настройку в разделе '");
	Если ОбщегоНазначенияБП.ЭтоПростойИнтерфейс() Тогда
		ФормаНастройки = НСтр("ru = 'Настройки - Обмен электронными документами'");
	Иначе
		ФормаНастройки = НСтр("ru = 'Администрирование - Обмен электронными документами'");
	КонецЕсли;
	
	Элементы.ДекорацияПутьКНастройке.Заголовок = Новый ФорматированнаяСтрока(ОсновнойТекст, ФормаНастройки);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкуНаСервере()
	
	ПриниматьПриглашенияВручную = 2;
	Если ПриниматьПриглашения = ПриниматьПриглашенияВручную Тогда
		Константы.ПриниматьПриглашенияЭДОАвтоматически.Установить(Ложь);
	КонецЕсли;
	Константы.ТребуетсяНастройкаАвтоматическогоПриемаПриглашенийЭДО.Установить(Ложь);
	
КонецПроцедуры

#КонецОбласти
