#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Константы.ИнтерфейсЭлектронныхТрудовыхКнижек.Получить() Тогда
		
		Константы.ИспользоватьКадровыйУчетОсновнойИнтерфейс.Установить(Значение);
		
		МенеджерЗаписи = РегистрыСведений.НастройкиКадровогоУчета.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Прочитать();
		Если Не МенеджерЗаписи.Выбран() Или МенеджерЗаписи.ИспользуютсяДанныеСотрудниковВнешнихИсточников <> Значение Тогда
			МенеджерЗаписи.ИспользуютсяДанныеСотрудниковВнешнихИсточников = Значение;
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
	Иначе
		Константы.ИспользоватьКадровыйУчетОсновнойИнтерфейс.Установить(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли