#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ПолучитьДанныеСверкиСКонтрагентами", Истина);
	
КонецПроцедуры

// Процедура подготавливает данные для таблиц СверкаСКонтрагентами, СчетаРасчетов в форме состояния сверки
// 
// Параметры:
//    СтруктураПараметров - Структура - Структура с параметрами для заполнения.
//    АдресХранилища - Строка - Адрес во временном хранилище, куда будет помещен результат выполнения процедуры.
//
Процедура ПолучитьДанныеСверкиСКонтрагентами(СтруктураПараметров, АдресХранилища) Экспорт
	
	СтруктураДанныхЗаполнения = Новый Структура;
	СтруктураДанныхЗаполнения.Вставить("Успешно", Ложь);
	
	Если Не ПроверитьОтложенныеРасчеты(СтруктураПараметров) Тогда
		ПоместитьВоВременноеХранилище(СтруктураДанныхЗаполнения, АдресХранилища);
		Возврат;
	КонецЕсли;
	
	СхемаКомпоновкиДанных = СтруктураПараметров.СхемаКомпоновкиДанных;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(СтруктураПараметров.НастройкиКомпоновкиДанных);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек, "НачалоПериода", СтруктураПараметров.ДатаНачала);
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек, "КонецПериода", КонецДня(СтруктураПараметров.ДатаОкончания));
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек, "Период", Новый Граница(КонецДня(СтруктураПараметров.ДатаОкончания), ВидГраницы.Включая));
	
	УстановитьПривилегированныйРежим(Истина);
	ДатаПолученияДанныхСервисаСверкиРасчетов = РегистрыСведений.СервисСверкиРасчетовОчередьЗапросов.ДатаАктуальностиРасхождений(
		СтруктураПараметров.Организация, СтруктураПараметров.ДатаНачала, СтруктураПараметров.ДатаОкончания);
	УстановитьПривилегированныйРежим(Ложь);
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек, "ДатаПолученияДанныхСервисаСверкиРасчетов", ДатаПолученияДанныхСервисаСверкиРасчетов);
	БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
		КомпоновщикНастроек, "ИспользуетсяСервисСверкиРасчетов", СервисСверкиРасчетов.ИспользуетсяСервисСверкиРасчетов(), ВидСравненияКомпоновкиДанных.Равно);
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ИспользуетсяПочтовыйклиент",
		СтруктураПараметров.ИспользуетсяПочтовыйклиент);
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ПодключенЭДО",
		СтруктураПараметров.ПодключенЭДО);
	
	СтатусыСверки = СтатусыСверки();
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек, "СтатусыСверкиНеВыполнялась", СтатусыСверки.СверкаНеВыполнялась.Статус);
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек, "СтатусыСверкиНеЗавершена", СтатусыСверки.СверкаНеЗавершена.Статус);
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек, "СтатусыСверкиРасхождения", СтатусыСверки.РасхожденияВСверке.Статус);
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек, "СтатусыСверкиАктСверкиГотовКПодписанию", СтатусыСверки.АктСверкиГотовКПодписанию.Статус);
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек, "СтатусыСверкиАктСверкиПодписан", СтатусыСверки.АктСверкиПодписан.Статус);
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек, "СтатусыСверкиЗапрошена", СтатусыСверки.СверкаЗапрошена.Статус);
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек, "СтатусыСверкиПолученОтвет", СтатусыСверки.ПолученОтвет.Статус);
	
	// Отборы по наличию запроса сверки и ответа на него
	КоллекцияОтбор = КомпоновщикНастроек;
	
	Если СтруктураПараметров.ОтборЗапросНеОтправлялся
		 И СтруктураПараметров.ОтборЗапросНетОтвета И ЗначениеЗаполнено(СтруктураПараметров.ОтборНетОтветаДней) Тогда
		// Два условия отбора соединяем по ИЛИ
		КоллекцияОтбор = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		КоллекцияОтбор.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	КонецЕсли;
	
	Если СтруктураПараметров.ОтборЗапросНеОтправлялся Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
			КоллекцияОтбор, "ЗапросСверкиДатаЗапроса", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	КонецЕсли;
	
	// Добавим отбор вида "Нет ответа более [10] дней"
	Если СтруктураПараметров.ОтборЗапросНетОтвета И ЗначениеЗаполнено(СтруктураПараметров.ОтборНетОтветаДней) Тогда
		
		Если ТипЗнч(КоллекцияОтбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			// Внтури группы "ИЛИ" два условия отбора соединяем по "И"
			ГруппаИ = КоллекцияОтбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		Иначе
			// Условия в отборе компоновщика и так соединяются по ИЛИ - не нужно добавялть группу
			ГруппаИ = КомпоновщикНастроек;
		КонецЕсли;
		// Условия по "И"
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
			ГруппаИ, "ЗапросСверкиДатаЗапроса", , ВидСравненияКомпоновкиДанных.Заполнено); // запрос отправлялся
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
			ГруппаИ, "ЗапросСверкиДатаОтвета", , ВидСравненияКомпоновкиДанных.НеЗаполнено); // ответ не получен
		
		День = 24 * 3600;
		ГраницаОтбора = НачалоДня(ТекущаяДатаСеанса() - СтруктураПараметров.ОтборНетОтветаДней * День);
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
			ГруппаИ, "ЗапросСверкиДатаЗапроса", ГраницаОтбора, ВидСравненияКомпоновкиДанных.Меньше); // более указанного количества дней назад
	
	КонецЕсли;
	
	// Отбор по способу отправки запроса сверки (есть или нет ЭДО). Если выбраны все (два), то отбор не устанавливаем.
	Если СтруктураПараметров.ОтборЭДОНеНастроен И Не СтруктураПараметров.ОтборЭДОНастроен Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(КомпоновщикНастроек, "ЭДО", 2, ВидСравненияКомпоновкиДанных.НеРавно);
	ИначеЕсли СтруктураПараметров.ОтборЭДОНастроен И Не СтруктураПараметров.ОтборЭДОНеНастроен Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(КомпоновщикНастроек, "ЭДО", 2, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
	Если Не СтруктураПараметров.Поставщики Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
			КомпоновщикНастроек, "Поставщики", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
	Если Не СтруктураПараметров.Покупатели Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
			КомпоновщикНастроек, "Покупатели", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
	БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
		КомпоновщикНастроек, "СчетаРасчетовСПоставщиками", СтруктураПараметров.СчетаРасчетовСПоставщиками, ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии);
	
	БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
		КомпоновщикНастроек, "СчетаРасчетовСПокупателями", СтруктураПараметров.СчетаРасчетовСПокупателями, ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии);
	
	Если Не СтруктураПараметров.КонтрагентыСОстаткамиПрошлыхПериодов Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
			КомпоновщикНастроек, "ТолькоКонтрагентыСОборотами", Истина, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
	Если Не СтруктураПараметров.КонтрагентыСРасчетамиБезОстатков Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
			КомпоновщикНастроек, "ТолькоКонтрагентыСОстатками", Истина, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("Контрагенты") Тогда
		
		ВидСравненияКонтрагента = ?(
			ТипЗнч(СтруктураПараметров.Контрагенты) = Тип("Массив"),
			ВидСравненияКомпоновкиДанных.ВСписке,
			ВидСравненияКомпоновкиДанных.Равно);
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
			КомпоновщикНастроек, "Контрагент", СтруктураПараметров.Контрагенты, ВидСравненияКонтрагента);
		
	КонецЕсли;
	
	БухгалтерскиеОтчетыВызовСервера.ДобавитьОтборПоОрганизации(СтруктураПараметров, КомпоновщикНастроек);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	// Если доступен монитор, то считаем, что и данные, которые он отображает, должны быть доступны.
	// Поэтому для консистентности данных монитора выполняем компоновку макета и сам запрос (ниже) в привилегированном режиме.
	// Ограничение по RLS (по организации) выполнится через отбор по организации: отбор обязателен, а выбрать можно
	// только доступные организации.
	УстановитьПривилегированныйРежим(Истина);
	
	НастройкиДляКомпоновкиМакета = КомпоновщикНастроек.ПолучитьНастройки();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СхемаКомпоновкиДанных,
		НастройкиДляКомпоновкиМакета,
		,
		,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"),
		Ложь); // игнорируем значения функциональных опций
	
	УстановитьПривилегированныйРежим(Ложь);
	
	// Для сохранения данных временных таблиц и удобства дополнительной обработки строк используем обычный запрос.
	// Текст запроса берем из скомпонованного макета СКД.
	Запрос = Новый Запрос;
	Запрос.Текст = МакетКомпоновки.НаборыДанных.НаборДанных1.Запрос;
	
	// Установим сортировку из параметра
	Сортировка = "";
	СтруктураПараметров.Свойство("Сортировка", Сортировка);
	Если ЗначениеЗаполнено(Сортировка) Тогда
		
		ВыраженияСортировки = СтрРазделить(Сортировка, ",", Ложь);
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
		ПоследнийЗапросПакета = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество()-1];
		ПорядокВЗапросе = ПоследнийЗапросПакета.Порядок;
		ПорядокВЗапросе.Очистить();
		
		Для Каждого ВыражениеСортировки Из ВыраженияСортировки Цикл
			ПоУбыванию = (СтрНайти(ВыражениеСортировки, " Убыв") <> 0);
			ИмяКолонки = СтрЗаменить(ВыражениеСортировки, " Убыв", "");
			ИмяКолонки = СтрЗаменить(ИмяКолонки, " Возр", "");
			КолонкаСортировки = ПоследнийЗапросПакета.Колонки.Найти(ИмяКолонки);
			ВыражениеПорядка = ПорядокВЗапросе.Добавить(
				Новый ВыражениеСхемыЗапроса(Строка(КолонкаСортировки.Поля[0])));
			ВыражениеПорядка.Направление = ?(
				ПоУбыванию,
				НаправлениеПорядкаСхемыЗапроса.ПоУбыванию,
				НаправлениеПорядкаСхемыЗапроса.ПоВозрастанию);
		КонецЦикла;
		
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
		
	КонецЕсли;
	
	Для Каждого Параметр Из МакетКомпоновки.ЗначенияПараметров Цикл
		Запрос.УстановитьПараметр(Параметр.Имя, Параметр.Значение);
	КонецЦикла;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; // для дальнейшего получения данных временных таблиц
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	// Зафиксируем момент времени, на который получены состояния
	СтруктураДанныхЗаполнения.Вставить("ГраницаАктуальностиДанных", ТекущаяУниверсальнаяДатаВМиллисекундах());
	
	ТаблицаСостояниеСверки = Новый ТаблицаЗначений;
	
	Для Каждого КолонкаРезультата Из РезультатЗапроса.Колонки Цикл
		ТаблицаСостояниеСверки.Колонки.Добавить(КолонкаРезультата.Имя, КолонкаРезультата.ТипЗначения);
	КонецЦикла;
	
	// Колонки с текстовой информацией
	ТаблицаСостояниеСверки.Колонки.Добавить("СостояниеСверки",            ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаСостояниеСверки.Колонки.Добавить("НетОригиналовПредставление", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаСостояниеСверки.Колонки.Добавить("АктСверкиПредставление",     Новый ОписаниеТипов("Строка"));
	
	Выборка = РезультатЗапроса.Выбрать();
	
	// Заполним текстовые поля построчно и одновременно посчитаем итоги
	ВсегоКонтрагентов = 0;
	ИтогиПоСтатусамСверки = Новый Соответствие; // ключ - числовой статус сверки, значение - количество контрагентов
	ВсегоДЗ = 0;
	ВсегоКЗ = 0;
	ПодтвержденнаяДЗ = 0;
	ПодтвержденнаяКЗ = 0;
	
	Для Каждого ОписаниеСтатуса Из СтатусыСверки Цикл
		ИтогиПоСтатусамСверки.Вставить(ОписаниеСтатуса.Значение.Статус, 0);
	КонецЦикла;
	
	Пока Выборка.Следующий() Цикл
		
		// Чтобы посчитать статистику в общей массе контрагентов, не отбираем по статусам сразу в запросе.
		// Контрагентов, не проходящих по статусу сверки, ниже не добавляем в итоговую таблицу.
		ВсегоКонтрагентов = ВсегоКонтрагентов + 1;
		ИтогиПоСтатусамСверки[Выборка.СтатусСверки] = ИтогиПоСтатусамСверки[Выборка.СтатусСверки] + 1;
		ВсегоДЗ = ВсегоДЗ + Выборка.ДебиторскаяЗадолженность;
		ВсегоКЗ = ВсегоКЗ + Выборка.КредиторскаяЗадолженность;
		Если Выборка.СтатусСверки = СтатусыСверки.АктСверкиПодписан.Статус Тогда
			ПодтвержденнаяДЗ = ПодтвержденнаяДЗ + Выборка.ДебиторскаяЗадолженность;
			ПодтвержденнаяКЗ = ПодтвержденнаяКЗ + Выборка.КредиторскаяЗадолженность;
		КонецЕсли;
		
		Если СтруктураПараметров.ОтбиратьПоСтатусуСверки 
			 И СтруктураПараметров.СтатусыСверки.НайтиПоЗначению(Выборка.СтатусСверки) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаСверки = ТаблицаСостояниеСверки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСверки, Выборка);
		ЗаполнитьПредставлениеПолейСверки(НоваяСтрокаСверки, СтатусыСверки, СтруктураПараметров);
		
	КонецЦикла;
	
	// Дополним данные по счетам расчетов.
	// Получим счета верхнего уровня и дополнительную информацию для того, чтобы минимизировать количество
	// расшифровочных отчетов.
	СчетаРасчетов = МенеджерВременныхТаблиц.Таблицы.Найти("ДанныеПоСчетамРасчетов").ПолучитьДанные().Выгрузить();
	СчетаРасчетов.Колонки.Добавить("СчетВерхнегоУровня", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	
	КэшПоиска = Новый Соответствие;
	Для Каждого СтрокаСчета Из СчетаРасчетов Цикл
		
		СчетИзКэша = КэшПоиска[СтрокаСчета.Счет];
		Если СчетИзКэша <> Неопределено Тогда
			СтрокаСчета.СчетВерхнегоУровня = СчетИзКэша;
			Продолжить;
		КонецЕсли;
		
		СтрокаСчета.СчетВерхнегоУровня = БухгалтерскийУчетПовтИсп.СчетВерхнегоУровня(СтрокаСчета.Счет);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетаРасчетов.Контрагент,
	|	СчетаРасчетов.Счет,
	|	СчетаРасчетов.СчетВерхнегоУровня
	|ПОМЕСТИТЬ СчетаРасчетов
	|ИЗ
	|	&СчетаРасчетов КАК СчетаРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаРасчетов.Контрагент КАК Контрагент,
	|	СчетаРасчетов.СчетВерхнегоУровня КАК СчетВерхнегоУровня,
	|	МАКСИМУМ(СчетаРасчетов.Счет) КАК Счет,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СчетаРасчетов.Счет) КАК СчетКоличество
	|ИЗ
	|	СчетаРасчетов КАК СчетаРасчетов
	|СГРУППИРОВАТЬ ПО
	|	СчетаРасчетов.Контрагент,
	|	СчетаРасчетов.СчетВерхнегоУровня";
	
	Запрос.УстановитьПараметр("СчетаРасчетов", СчетаРасчетов);
	
	СчетаРасчетов = Запрос.Выполнить().Выгрузить();
	
	// Заполним возвращаемую структуру
	СтруктураДанныхЗаполнения.Вставить("ТаблицаСостояниеСверки", ТаблицаСостояниеСверки);
	СтруктураДанныхЗаполнения.Вставить("СчетаРасчетов", СчетаРасчетов);
	
	СтруктураДанныхЗаполнения.Вставить("ВсегоКонтрагентов", ВсегоКонтрагентов);
	СтруктураДанныхЗаполнения.Вставить("ИтогиПоСтатусамСверки", Новый ФиксированноеСоответствие(ИтогиПоСтатусамСверки));
	СтруктураДанныхЗаполнения.Вставить("ВсегоДЗ", ВсегоДЗ);
	СтруктураДанныхЗаполнения.Вставить("ВсегоКЗ", ВсегоКЗ);
	СтруктураДанныхЗаполнения.Вставить("ПодтвержденнаяДЗ", ПодтвержденнаяДЗ);
	СтруктураДанныхЗаполнения.Вставить("ПодтвержденнаяКЗ", ПодтвержденнаяКЗ);
	
	СтруктураДанныхЗаполнения.Успешно = Истина;
	
	ПоместитьВоВременноеХранилище(СтруктураДанныхЗаполнения, АдресХранилища);
	
КонецПроцедуры

Функция СчетаРасчетовСПоставщиками() Экспорт

	Счета = Новый Массив;

	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);              // 60
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками);       // 76.05
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами);    // 76.09
	Если БухгалтерскийУчетПереопределяемый.ИспользоватьВалютныйУчет() Тогда
		Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиВал);    // 76.25
		Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиВал); // 76.29
		Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиУЕ);     // 76.35
		Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиУЕ);  // 76.39
	КонецЕсли;

	Возврат Счета;

КонецФункции

Функция СчетаРасчетовСПокупателями() Экспорт

	Счета = Новый Массив;

	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками);               // 62
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчиками);        // 76.06
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами);    // 76.09
	Если БухгалтерскийУчетПереопределяемый.ИспользоватьВалютныйУчет() Тогда
		Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчикамиВал);     // 76.26
		Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиВал); // 76.29
		Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчикамиУЕ);      // 76.36
		Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиУЕ);  // 76.39
	КонецЕсли;

	Возврат Счета;

КонецФункции

// Функция - конструктор структуры со статусами сверки по контрагенту. Ключ - строчный ключ статуса,
// значение - структура с числовым значением статуса, представлением и картинкой для вывода пользователю.
// 
// Возвращаемое значение:
//  Структура
//
Функция СтатусыСверки() Экспорт
	
	Статусы = Новый Структура;
	
	Статусы.Вставить("СверкаНеВыполнялась",       ОписаниеСтатусаСверки(0, НСтр("ru='Не выполнялась'"), БиблиотекаКартинок.СветофорСерый));
	Статусы.Вставить("СверкаЗапрошена",           ОписаниеСтатусаСверки(5, НСтр("ru='Запрошена'"), БиблиотекаКартинок.СостояниеСверкиОтправленЗапрос));
	Статусы.Вставить("ПолученОтвет",              ОписаниеСтатусаСверки(6, НСтр("ru='Получен ответ'"), БиблиотекаКартинок.СостояниеСверкиПолученОтвет));
	Статусы.Вставить("СверкаНеЗавершена",         ОписаниеСтатусаСверки(1, НСтр("ru='Не завершена'"), БиблиотекаКартинок.СветофорЖелтый));
	Статусы.Вставить("РасхожденияВСверке",        ОписаниеСтатусаСверки(2, НСтр("ru='Есть расхождения'"), БиблиотекаКартинок.СветофорКрасный));
	Статусы.Вставить("АктСверкиГотовКПодписанию", ОписаниеСтатусаСверки(3, НСтр("ru='Готово к подписанию акта сверки'"), БиблиотекаКартинок.СветофорЗеленый));
	Статусы.Вставить("АктСверкиПодписан",         ОписаниеСтатусаСверки(4, НСтр("ru='Подписан акт сверки'"), БиблиотекаКартинок.СветофорГалка));
	
	Возврат Статусы;
	
КонецФункции

// По числовому статусу определяет смысловой статус подключения ЭДО по контрагенту
// 
// Параметры:
//  СтатусЭДО - Число - числовой статус из монитора сверки
// Возвращаемое значение:
//  Булево - Настроен ЭДО
Функция НастроенЭДО(СтатусЭДО) Экспорт
	Возврат (СтатусЭДО = 2);
КонецФункции

// Формирует общие параметры сверки на основании данных монитора сверки
//
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, для которой заполняются параметры.
//  ДатаНачала - Дата - дата начала отчетного периода.
//  ДатаОкончания - Дата - дата окончания отчетного периода.
//
// Возвращаемое значение:
//  Структура - структура - см. содержание метода
//
Функция ОбщиеПараметрыСверки(Организация, ДатаНачала, ДатаОкончания) Экспорт

	ПараметрыСверки = Новый Структура;
	ПараметрыСверки.Вставить("Организация", Организация);
	ПараметрыСверки.Вставить("ДатаНачала", ДатаНачала);
	ПараметрыСверки.Вставить("ДатаОкончания", ДатаОкончания);
	ПараметрыСверки.Вставить("НаименованиеОрганизации", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		Организация, "НаименованиеСокращенное"));

	Возврат ПараметрыСверки;

КонецФункции

Функция ПредставлениеАктаСверки(СтрокаСверки) Экспорт
	
	ПредставлениеАкта = Новый Массив;
	
	ПредставлениеАкта.Добавить(СтрШаблон(
		НСтр("ru='С %1 по %2'"),
		Формат(СтрокаСверки.АктСверкиДатаНачала, "ДФ=dd.MM.yy;"),
		Формат(СтрокаСверки.АктСверкиДатаОкончания, "ДФ=dd.MM.yy;")));
	
	Если ЗначениеЗаполнено(СтрокаСверки.АктСверкиДоговорНаименование) Тогда
		
		Если СтрНайти(НСтр(СтрокаСверки.АктСверкиДоговорНаименование), "договор") = 0
			 И СтрНайти(НСтр(СтрокаСверки.АктСверкиДоговорНаименование), "дог.") = 0 Тогда
			ПредставлениеАкта.Добавить(СтрШаблон(
				НСтр("ru='договор %1'"),
				СтрокаСверки.АктСверкиДоговорНаименование));
		Иначе
			ПредставлениеАкта.Добавить(СтрокаСверки.АктСверкиДоговорНаименование);
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтрокаСверки.АктСверкиПодписан Тогда
		ПредставлениеАкта.Добавить(НСтр("ru='подписан'"));
	КонецЕсли;
	
	Возврат СтрСоединить(ПредставлениеАкта, ", ");
	
КонецФункции

#Область Расшифровки

Функция СформироватьРасшифровку(ПараметрыОтчета) Экспорт
	
	ИдентификаторРасшифровки = ПараметрыОтчета.ИдентификаторРасшифровки;
	
	СхемаКомпоновкиДанных = ПолучитьМакет(ИдентификаторРасшифровки);
	
	ВариантыНастроек = СхемаКомпоновкиДанных.ВариантыНастроек.Найти("Основной");
	ВариантНастройки = ВариантыНастроек.Настройки;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(ВариантНастройки);
	
	БухгалтерскиеОтчетыВызовСервера.ДобавитьОтборПоОрганизации(ПараметрыОтчета, КомпоновщикНастроек);
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек,
		"НачалоПериода", ПараметрыОтчета.НачалоПериода, Истина);
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек,
		"КонецПериода", ПараметрыОтчета.КонецПериода, Истина);
	УстановитьПараметрыПредставленияДокументов(КомпоновщикНастроек);
	УстановитьПараметрыПредставленияПричиныОтсутствияДокумента(КомпоновщикНастроек);
	
	БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
		КомпоновщикНастроек, "Контрагент", ПараметрыОтчета.Контрагент, ВидСравненияКомпоновкиДанных.Равно);
	
	Если ИдентификаторРасшифровки = "РасшифровкаАктыСверки" Тогда
		
		ДатаПолученияДанныхСервисаСверкиРасчетов = РегистрыСведений.СервисСверкиРасчетовОчередьЗапросов.ДатаАктуальностиРасхождений(
			ПараметрыОтчета.Организация, ПараметрыОтчета.НачалоПериода, ПараметрыОтчета.КонецПериода);
		
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
			КомпоновщикНастроек, "ДатаПолученияДанныхСервисаСверкиРасчетов", ДатаПолученияДанныхСервисаСверкиРасчетов);
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
			КомпоновщикНастроек, "ИспользуетсяСервисСверкиРасчетов", СервисСверкиРасчетов.ИспользуетсяСервисСверкиРасчетов(), ВидСравненияКомпоновкиДанных.Равно);
		
		Если Не ПараметрыОтчета.Поставщики Тогда
			БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
				КомпоновщикНастроек, "Поставщики", Ложь, ВидСравненияКомпоновкиДанных.Равно);
		КонецЕсли;
		
		Если Не ПараметрыОтчета.Покупатели Тогда
			БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
				КомпоновщикНастроек, "Покупатели", Ложь, ВидСравненияКомпоновкиДанных.Равно);
		КонецЕсли;
		
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
			КомпоновщикНастроек, "СчетаРасчетовСПоставщиками", ПараметрыОтчета.СчетаРасчетовСПоставщиками, ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии);
		
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
			КомпоновщикНастроек, "СчетаРасчетовСПокупателями", ПараметрыОтчета.СчетаРасчетовСПокупателями, ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии);
		
	КонецЕсли;
	
	НастройкиДляКомпоновкиМакета = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	Макет = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиДляКомпоновкиМакета, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет,, ДанныеРасшифровки, Истина);
	
	Результат = Новый ТабличныйДокумент;
	
	ПриВыводеЗаголовкаРасшифровки(ИдентификаторРасшифровки, ПараметрыОтчета, Результат);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	// Установим свойства областей гиперссылки
	ОбластьГиперссылки = Результат.НайтиТекст("Подробнее");
	Сч = 0;
	Пока ОбластьГиперссылки <> Неопределено Цикл
		ОбластьГиперссылки.Имя = "ПерейтиВСервисСверки" + Сч;
		ОбластьГиперссылки.Гиперссылка = Истина;
		ОбластьГиперссылки = Результат.НайтиТекст("Подробнее", ОбластьГиперссылки);
		Сч = Сч + 1;
	КонецЦикла;
	
	АдресХранилища = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, ПараметрыОтчета.УникальныйИдентификатор);
	
	РезультатРасшифровка = Новый Структура("Результат, АдресХранилища", Результат, АдресХранилища);
	
	Возврат РезультатРасшифровка;
	
КонецФункции

Функция ПолучитьЗаголовокРасшифровки(ИдентификаторРасшифровки) Экспорт

	Если ИдентификаторРасшифровки = "РасшифровкаНетОригиналов" Тогда
		Возврат НСтр("ru='Документы без оригиналов и с незавершенным ЭДО'");
	ИначеЕсли ИдентификаторРасшифровки = "РасшифровкаАктыСверки" Тогда
		Возврат НСтр("ru='Состояние сверки по контрагенту'");
	КонецЕсли;

КонецФункции

Процедура ПриВыводеЗаголовкаРасшифровки(ИдентификаторРасшифровки, ПараметрыОтчета, Результат) Экспорт
	
	Макет = ПолучитьОбщийМакет("ОбщиеОбластиСтандартногоОтчета");
	ОбластьЗаголовок        = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ОбластьОписаниеНастроек = Макет.ПолучитьОбласть("ОписаниеНастроек");
	
	ПредставлениеПериодаОтчета = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(
		ПараметрыОтчета.НачалоПериода,
		ПараметрыОтчета.КонецПериода,
		Истина);
	ИмяНастроекОтчетаПериод = НСтр("ru='Период: '");
	ТекстОрганизация = БухгалтерскиеОтчетыВызовСервера.ПолучитьТекстОрганизация(ПараметрыОтчета.Организация,
		ПараметрыОтчета.ВключатьОбособленныеПодразделения,
		ПараметрыОтчета.КонецПериода);
	ИмяНастроекОтчетаОрганизация = НСтр("ru='Организация: '");
	СведенияОКонтрагенте = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ПараметрыОтчета.Контрагент,
		ПараметрыОтчета.КонецПериода);
	ТекстКонтрагент = СведенияОКонтрагенте.Представление;
	ИмяНастроекОтчетаКонтрагент = НСтр("ru='Контрагент: '");
	
	// Заголовок
	ОбластьЗаголовок.Параметры.ЗаголовокОтчета = "" + ПолучитьТекстЗаголовкаРасшифровки(ИдентификаторРасшифровки, ПараметрыОтчета);
	Результат.Вывести(ОбластьЗаголовок);
	
	// Настройки
	ОбластьОписаниеНастроек.Параметры.ИмяНастроекОтчета = ИмяНастроекОтчетаОрганизация;
	ОбластьОписаниеНастроек.Параметры.ОписаниеНастроекОтчета = ТекстОрганизация;
	Результат.Вывести(ОбластьОписаниеНастроек);
	
	ОбластьОписаниеНастроек.Параметры.ИмяНастроекОтчета = ИмяНастроекОтчетаКонтрагент;
	ОбластьОписаниеНастроек.Параметры.ОписаниеНастроекОтчета = ТекстКонтрагент;
	Результат.Вывести(ОбластьОписаниеНастроек);
	
	ОбластьОписаниеНастроек.Параметры.ИмяНастроекОтчета = ИмяНастроекОтчетаПериод;
	ОбластьОписаниеНастроек.Параметры.ОписаниеНастроекОтчета = ПредставлениеПериодаОтчета;
	Результат.Вывести(ОбластьОписаниеНастроек);
	
	Результат.Область("R1:R" + Результат.ВысотаТаблицы).Имя = "Заголовок";
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьОтложенныеРасчеты(СтруктураПараметров)

	ДатаОкончания = СтруктураПараметров.ДатаОкончания;
	Если ТипЗнч(ДатаОкончания) = Тип("Граница") Тогда
		ДатаОкончания = ДатаОкончания.Значение;
	КонецЕсли;
	
	ПараметрыРасчета = УчетВзаиморасчетовОтложенноеПроведение.НовыеПараметрыРасчета();
	ЗаполнитьЗначенияСвойств(ПараметрыРасчета, СтруктураПараметров);
	ПараметрыРасчета.ДатаОкончания = ДатаОкончания;
	
	Результат = УчетВзаиморасчетовОтложенноеПроведение.ВыполнитьОтложенныеРасчеты(ПараметрыРасчета);
	
	Возврат (Результат.КоличествоДоговоровСОшибками = 0);

КонецФункции

Функция ОписаниеСтатусаСверки(Статус, Представление, Картинка)
	
	ОписаниеСтатуса = Новый Структура;
	ОписаниеСтатуса.Вставить("Статус",        Статус);
	ОписаниеСтатуса.Вставить("Представление", Представление);
	ОписаниеСтатуса.Вставить("Картинка",      Картинка);
	
	Возврат ОписаниеСтатуса;
	
КонецФункции

Функция ПолучитьТекстЗаголовкаРасшифровки(ИдентификаторРасшифровки, ПараметрыОтчета)
	
	ПредставлениеПериодаОтчета = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(
		ПараметрыОтчета.НачалоПериода,
		ПараметрыОтчета.КонецПериода,
		Ложь);
		
	Если ИдентификаторРасшифровки = "РасшифровкаНетОригиналов" Тогда
		ТекстЗаголовка = НСтр("ru = 'Документы без оригиналов и с незавершенным ЭДО'");
	Иначе
		// РасшифровкаАктыСверки
		ШаблонЗаголовка = НСтр("ru = 'Состояние сверки по %1 %2'");
		ТекстЗаголовка = СтрШаблон(ШаблонЗаголовка,
			ПараметрыОтчета.Контрагент,
			СокрЛП(ПредставлениеПериодаОтчета));
	КонецЕсли;
		
	Возврат ТекстЗаголовка;
	
КонецФункции

Процедура УстановитьПараметрыПредставленияДокументов(КомпоновщикНастроек)
	
	СписокПредставленийДокументов = ОбщегоНазначенияБПКлиентСервер.ПредставленияДокументов();
	Для Каждого Элемент Из СписокПредставленийДокументов Цикл
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек,
			Элемент.Значение,
			Элемент.Представление,
			Истина);
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьПараметрыПредставленияПричиныОтсутствияДокумента(КомпоновщикНастроек)
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек,
		"ПредставлениеНеЗавершенЭДО", НСтр("ru='Не завершен ЭДО'"), Истина);
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек,
		"ПредставлениеНетОригиналовНаБумажномНосителе", НСтр("ru='Нет оригиналов на бумажном носителе'"), Истина);
	
КонецПроцедуры

#Область ЗаполнениеТаблиц

Процедура ЗаполнитьПредставлениеПолейСверки(СтрокаСверки, СтатусыСверки, СтруктураПараметров)
	
	ПредставлениеСверки = Новый Массив;
	ДополнитьРезультатомСервисаСверки = Ложь;
	ДополнитьСтатусомЗапросаСверки = Истина;
	
	КэшАктыСверкиКоличествоТекст = Новый Соответствие; // ключ - количество актов, значение - согласованное строчное представление
	КэшНетОригиналовКоличествоТекст = Новый Соответствие; // ключ - количество документов, значение - согласованное строчное представление
	
	День = 24*3600;
	
	Если СтрокаСверки.ТребуетсяАктСверки И СтрокаСверки.АктыСверкиКоличество > 0 Тогда
		// Акт есть, но он не покрывает все операции (т.е. неактуальный)
		НачалоПериода = ?(ЗначениеЗаполнено(СтрокаСверки.ПериодСверки),
			СтрокаСверки.ПериодСверки + День,
			СтруктураПараметров.ДатаНачала);
		ПредставлениеСверки.Добавить(СтрШаблон(
			НСтр("ru='нет актов за период с %1 по %2'"),
			Формат(НачалоПериода, "ДФ=dd.MM.yy;"),
			Формат(СтрокаСверки.ДатаПоследнейОперации, "ДФ=dd.MM.yy;")));
		ДополнитьРезультатомСервисаСверки = Истина;
		
	ИначеЕсли Не СтрокаСверки.ТребуетсяАктСверки И СтрокаСверки.АктыСверкиКоличество = 1 Тогда
		// В периоде есть один акт сверки, и больше не требуется
		// (оформлен по всем договорам сразу или по единственному, нет операций после периода акта сверки).
		// Описываем состояние сверки.
		Если СтрокаСверки.АктыСверкиВсеПодписаны Тогда
			СтатусАктаСтрокой = НСтр("ru='подписан акт'");
			ДополнитьСтатусомЗапросаСверки = Ложь;
		ИначеЕсли СтрокаСверки.АктыСверкиЕстьРасхождения Тогда
			СтатусАктаСтрокой = НСтр("ru='есть расхождения'");
		ИначеЕсли СтрокаСверки.АктыСверкиВсеСошлись Тогда
			СтатусАктаСтрокой = НСтр("ru='можно подписывать акт'");
		Иначе
			СтатусАктаСтрокой = НСтр("ru='сверка не завершена'");
			ДополнитьРезультатомСервисаСверки = Истина;
		КонецЕсли;
		
		ПредставлениеСверки.Добавить(СтатусАктаСтрокой);
		
	ИначеЕсли Не СтрокаСверки.ТребуетсяАктСверки И СтрокаСверки.АктыСверкиКоличество > 1 Тогда
		// В периоде несколько актов сверки, и больше не требуется.
		// Описываем состояние сверки.
		Если СтрокаСверки.АктыСверкиВсеПодписаны Тогда
			СтатусАктовСтрокой = НСтр("ru='подписаны'");
			ДополнитьСтатусомЗапросаСверки = Ложь;
		ИначеЕсли СтрокаСверки.АктыСверкиЕстьРасхождения Тогда
			СтатусАктовСтрокой = НСтр("ru='есть расхождения'");
		ИначеЕсли СтрокаСверки.АктыСверкиВсеСошлись Тогда
			СтатусАктовСтрокой = НСтр("ru='можно подписывать'");
		Иначе
			СтатусАктовСтрокой = НСтр("ru='сверка не завершена'");
			ДополнитьРезультатомСервисаСверки = Истина;
		КонецЕсли;
		
		АктыСверкиКоличествоПредставление = КэшАктыСверкиКоличествоТекст.Получить(СтрокаСверки.АктыСверкиКоличество);
		Если АктыСверкиКоличествоПредставление = Неопределено Тогда
			АктыСверкиКоличествоПредставление = ПолучитьСклоненияСтрокиПоЧислу(
				"акт",
				СтрокаСверки.АктыСверкиКоличество,
				"",
				"Л= ru_RU; ЧС=Количественное",
				"ПЧ=Число")[0];
			КэшАктыСверкиКоличествоТекст.Вставить(СтрокаСверки.АктыСверкиКоличество, АктыСверкиКоличествоПредставление);
		КонецЕсли;
		
		ПредставлениеСверки.Добавить(СтрШаблон(НСтр("ru='%1 (%2)'"), СтатусАктовСтрокой, АктыСверкиКоличествоПредставление));
		
	Иначе
		
		ДополнитьРезультатомСервисаСверки = Истина;
		
	КонецЕсли;
	
	Если ДополнитьРезультатомСервисаСверки
		 И СтрокаСверки.СервисСверкиИспользуется
		 И СтрокаСверки.СервисСверкиДанныеАктуальны Тогда
		
		Если СтрокаСверки.АктыСверкиКоличество = 0 Тогда
			ПредставлениеСверки.Добавить(?(СтрокаСверки.СервисСверкиЕстьРасхождения,
				НСтр("ru='обнаружены расхождения'"),
				СтатусыСверки.АктСверкиГотовКПодписанию.Представление));
		Иначе
			ПредставлениеСверки.Добавить(?(СтрокаСверки.СервисСверкиЕстьРасхождения,
				НСтр("ru='вероятны расхождения'"),
				НСтр("ru='расхождений не ожидается'")));
		КонецЕсли;
		
	КонецЕсли;
	
	СпособЗапроса = ?(
		ТипЗнч(СтрокаСверки.ЗапросСверкиОтвет) = Тип("ДокументСсылка.ЭлектронныйДокументИсходящийЭДО"),
		НСтр("ru='ЭДО'"),
		НСтр("ru='e-mail'"));
	
	Если ДополнитьСтатусомЗапросаСверки И ЗначениеЗаполнено(СтрокаСверки.ЗапросСверкиДатаОтвета) Тогда
		ПредставлениеСверки.Добавить(СтрШаблон(
			НСтр("ru='получен ответ по %1 (%2)'"),
			СпособЗапроса,
			Формат(СтрокаСверки.ЗапросСверкиДатаОтвета, "ДФ=dd.MM.yy;")));
	ИначеЕсли ДополнитьСтатусомЗапросаСверки И ЗначениеЗаполнено(СтрокаСверки.ЗапросСверкиДатаЗапроса) Тогда
		ПредставлениеСверки.Добавить(СтрШаблон(
			НСтр("ru='отправлен запрос по %1 (%2)'"),
			СпособЗапроса,
			Формат(СтрокаСверки.ЗапросСверкиДатаЗапроса, "ДФ=dd.MM.yy;")));
	ИначеЕсли ДополнитьСтатусомЗапросаСверки
		 И СтрокаСверки.АктСверкиСостояниеЭДО <> Перечисления.СостоянияДокументовЭДО.НеСформирован Тогда
		ПредставлениеСверки.Добавить(СтрШаблон(
			НСтр("ru='ЭДО: %1'"),
			СтрокаСверки.АктСверкиСостояниеЭДО));
	КонецЕсли;
	
	СтрокаСверки.СостояниеСверки = СтрСоединить(ПредставлениеСверки, ", ");
	
	// Первая буква - заглавная
	СтрокаСверки.СостояниеСверки = ВРег(Лев(СтрокаСверки.СостояниеСверки, 1)) + Сред(СтрокаСверки.СостояниеСверки, 2);
	
	Если СтрокаСверки.НетОригиналовКоличество > 0 Тогда
		НетОригиналовПредставление = КэшНетОригиналовКоличествоТекст.Получить(СтрокаСверки.НетОригиналовКоличество);
		Если НетОригиналовПредставление = Неопределено Тогда
			НетОригиналовПредставление = ПолучитьСклоненияСтрокиПоЧислу(
				"документ",
				СтрокаСверки.НетОригиналовКоличество,
				"",
				"Л= ru_RU; ЧС=Количественное",
				"ПЧ=Число")[0];
			КэшНетОригиналовКоличествоТекст.Вставить(СтрокаСверки.НетОригиналовКоличество, НетОригиналовПредставление);
		КонецЕсли;
		СтрокаСверки.НетОригиналовПредставление = НетОригиналовПредставление;
	КонецЕсли;
	
	СтрокаСверки.АктСверкиПредставление = ПредставлениеАктаСверки(СтрокаСверки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли