
#Область СлужебныйПрограммныйИнтерфейс

Функция ТекущемуПользователюДоступныТекущиеДелаПоСЭДО() Экспорт
	
	Возврат УчетЗарплаты.ТекущемуПользователюДоступныТекущиеДелаПоСЭДО();
	
КонецФункции

Функция СоздатьДолжностьПоПараметрам(ОписаниеДолжности) Экспорт
	
	Возврат УчетЗарплаты.СоздатьДолжностьПоПараметрам(ОписаниеДолжности);
	
КонецФункции

Функция ПодобратьДолжностьПоПараметрам(ОписаниеДолжности) Экспорт
	
	Возврат УчетЗарплаты.ПодобратьДолжностьПоПараметрам(ОписаниеДолжности);
	
КонецФункции

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Код");
	Поля.Добавить("КонтрольноеЧисло");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Шаблон = НСтр("ru = '%1.%2'");
	Представление = СтрШаблон(Шаблон, Данные.Код, Данные.КонтрольноеЧисло);
	
КонецПроцедуры

Процедура ПриПолученииФормыОтчетовВоинскогоУчета(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	РасчетЗарплатыДляНебольшихОрганизацийСобытия.ПриПолученииФормыОтчетовВоинскогоУчета(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

Функция СпособВыплатыЗарплаты(ИмяСпособа = "") Экспорт
	
	Если ИмяСпособа = "ДоговорПодряда" Тогда
		Возврат Справочники.СпособыВыплатыЗарплаты.ДоговорПодряда();
	ИначеЕсли ИмяСпособа = "Аванс" Тогда
		Возврат Справочники.СпособыВыплатыЗарплаты.Аванс();
	Иначе
		Возврат Справочники.СпособыВыплатыЗарплаты.ПоУмолчанию();
	Конецесли;
	
КонецФункции

Функция СпособыВыплатыЗарплаты() Экспорт
	
	СпособыВыплатыЗарплаты = Новый Массив;
	СпособыВыплатыЗарплаты.Добавить(Справочники.СпособыВыплатыЗарплаты.Аванс());
	СпособыВыплатыЗарплаты.Добавить(Справочники.СпособыВыплатыЗарплаты.ПоУмолчанию());
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СпособыВыплатыЗарплаты,
		Справочники.СпособыВыплатыЗарплаты.МежрасчетныеВыплаты());
	
	Возврат Новый ФиксированныйМассив(СпособыВыплатыЗарплаты);
	
КонецФункции

Функция СпособыВыплатыДГПХ() Экспорт
	
	СпособыВыплатыЗарплаты = Новый Массив;
	СпособыВыплатыЗарплаты.Добавить(Справочники.СпособыВыплатыЗарплаты.ДоговорПодряда());
	
	Возврат Новый ФиксированныйМассив(СпособыВыплатыЗарплаты);
	
КонецФункции

#КонецОбласти
