#Область ПрограммныйИнтерфейс

// Возвращает список организаций, подключенных к сервису Мой налог.
//
// Возвращаемое значение:
//   Массив из СправочникСсылка.Организации - массив организаций
//
Функция ПодключенныеОрганизации() Экспорт
	
	Возврат РегистрыСведений.СостоянияИнтеграцииСПлатформойСамозанятые.ПодключенныеОрганизации();
	
КонецФункции

// Возвращает признак того, что приложение подключено к сервису Мой налог
//
// Параметры:
//   Организация - СправочникСсылка.Организации - проверяемая организация
//
// Возвращаемое значение:
//   Булево - Истина, если приложение подключено
//
Функция ПриложениеПодключено(Организация) Экспорт
	
	СостояниеПодключения = РегистрыСведений.СостоянияИнтеграцииСПлатформойСамозанятые.ПолучитьСостояниеПодключения(Организация);
	ЦелевоеСостояние = ИнтеграцияСПлатформойСамозанятыеКлиентСервер.СостояниеПодключенияКСервису();
	
	Возврат ЦелевоеСостояние = СостояниеПодключения;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки) Экспорт
	
	ЗаписьЖурналаРегистрации(
		ИнтеграцияСПлатформойСамозанятыеКлиентСервер.ИмяСобытияЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,,,
		ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
