
#Область СлужебныеПроцедурыИФункции

Процедура СоздатьНовыйДокументОтпуск(Форма) Экспорт

	ЗаявкиСотрудниковФормыКлиентБазовый.СоздатьНовыйДокументОтпуск(Форма);

КонецПроцедуры

Функция ПараметрыЗаполненияДокументаОтпускБезОплаты(Форма) Экспорт

	Возврат ЗаявкиСотрудниковФормыКлиентБазовый.ПараметрыЗаполненияДокументаОтпускБезОплаты(Форма);

КонецФункции

Процедура СоздатьНовыйДокументПоОтсутствию(Форма) Экспорт

	ЗаявкиСотрудниковФормыКлиентБазовый.СоздатьНовыйДокументПоОтсутствию(Форма);

КонецПроцедуры

Функция ЗначенияДляВыбораДокументаПоОтсутствию(Форма) Экспорт

	Возврат ЗаявкиСотрудниковФормыКлиентБазовый.ЗначенияДляВыбораДокументаПоОтсутствию(Форма);

КонецФункции

Функция ПараметрыЗаполненияБольничныйЛист(Форма, ПричинаНетрудоспособности) Экспорт

	Возврат ЗаявкиСотрудниковФормыКлиентБазовый.ПараметрыЗаполненияБольничныйЛист(Форма, ПричинаНетрудоспособности);
	
КонецФункции

Процедура ОткрытьФормуБанковскогоСчета(ПараметрыФормы, Владелец, Уникальность, ОписаниеОповещения, Режим) Экспорт

	ЗаявкиСотрудниковФормыКлиентБазовый.ОткрытьФормуБанковскогоСчета(ПараметрыФормы, Владелец, Уникальность, ОписаниеОповещения, Режим);

КонецПроцедуры

Процедура ОткрытьФормуВыбораБанковскогоСчета(ПараметрыФормы, Владелец, ОписаниеОповещения, Режим) Экспорт
	
	ЗаявкиСотрудниковФормыКлиентБазовый.ОткрытьФормуВыбораБанковскогоСчета(ПараметрыФормы, Владелец, ОписаниеОповещения, Режим);
	
КонецПроцедуры

#КонецОбласти