
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = НСтр("ru = 'Список контрагентов для сверки'");
	ДанныеПечати = Параметры.ТабличныйДокумент;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоЭлектроннойПочте(Команда)
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Результат", ДанныеПечати);
	ПараметрыОтчета.Вставить("Заголовок", НСтр("ru = 'Список контрагентов для сверки'"));
	
	ОтправкаПочтовыхСообщенийКлиент.ОтправитьОтчет(ПараметрыОтчета);
	
КонецПроцедуры  

