#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	ПараметрыНабора.Используется = ПолучитьФункциональнуюОпцию("ВедетсяУчетТаможенныхДекларацийЭкспорт");
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_ТаможеннаяДекларацияЭкспорт", ПараметрыНабора);
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_ЗаявлениеОВвозеТоваровПолученное", ПараметрыНабора);

КонецПроцедуры

#КонецОбласти

#КонецЕсли