// Версия модуля kktService 1.0.1.39

// Приказ от 21.03.2017 № ММВ-7-20/229@
// "Об утверждении дополнительных реквизитов фискальных документов и форматов фискальных документов,
// обязательных к использованию"

#Область ПрограммныйИнтерфейс

// Десериализует данные QR-кода.
// Пример строки QR-кода: t=20150720T1638&s=9999999.00&fn=000110000105&i=12345678&fp=123456&n=2
//
// Параметры:
//  QRКод - Строка
// 
// Возвращаемое значение:
//  Структура - см. НовыйРеквизитыЧека
//
Функция РеквизитыЧека(QRКод) Экспорт
	
	РеквизитыЧека = КассовыеЧекиQRКодыКлиентСервер.НовыйРеквизитыЧека();
	ИменаПолей    = КассовыеЧекиQRКодыКлиентСервер.ИменаПолейQRКода();
	
	ПоляQRКода = СтрРазделить(QRКод, "&");
	ТипДата = Тип("Дата");
	
	Для Каждого СодержимоеПоля Из ПоляQRКода Цикл
		
		ЭлементыПоля = СтрРазделить(СодержимоеПоля, "=");
		Если ЭлементыПоля.Количество() <> 2 Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПоля   = ЭлементыПоля[0];
		ТекстПоля = ЭлементыПоля[1];
		
		ИмяПоля = ИменаПолей[ИмяПоля];
		Если ИмяПоля = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭталонноеЗначение = РеквизитыЧека[ИмяПоля];
		ЭталонныйТип      = ТипЗнч(ЭталонноеЗначение);
		
		Если ЭталонныйТип = ТипДата Тогда
			Значение = ОбщегоНазначенияБП.ДесериализоватьДатуISO(ТекстПоля);
		Иначе
			ОписаниеТипов = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЭталонныйТип));
			Значение = ОписаниеТипов.ПривестиЗначение(ТекстПоля);
		КонецЕсли;
		
		РеквизитыЧека[ИмяПоля] = Значение;
		
	КонецЦикла;
	
	Возврат РеквизитыЧека;
	
КонецФункции

// Проверяет заполненность реквизитов чека
//
// Параметры:
//  РеквизитыЧека - Структура - см. НовыйРеквизитыЧека
// 
// Возвращаемое значение:
//  Булево
//
Функция РеквизитыЧекаЗаполнены(РеквизитыЧека) Экспорт
	
	Возврат ЗначениеЗаполнено(РеквизитыЧека.Дата) И ЗначениеЗаполнено(РеквизитыЧека.Номер);
	
КонецФункции

#КонецОбласти