#Область ПрограммныйИнтерфейс

Процедура ВыполнитьОбменСYclients(ПараметрыНастройки, ПараметрыВыполнения) Экспорт
	Форма = ПараметрыВыполнения.Форма;
	
	Результат = ОбменСYclientsВызовСервера.ЗагрузитьПродажи(ПараметрыНастройки, Форма.УникальныйИдентификатор);
	Если Результат.Статус = "Выполняется" Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
		ПараметрыОжидания.Заголовок = ПараметрыВыполнения.Заголовок;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(Результат, ПараметрыВыполнения.ОповещениеОЗавершении, ПараметрыОжидания);
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		ВыполнитьОбработкуОповещения(ПараметрыВыполнения.ОповещениеОЗавершении, Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти