#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УчетЗарплаты.УправлениеФункциональностьюУчетаЗарплатыИКадров(Значение, ДополнительныеСвойства);
	
	ПараметрыУчета = ОбщегоНазначенияБП.ОпределитьПараметрыУчета();
	ПараметрыУчета.Вставить("ВедетсяУчетЗарплатыКадров", ?(Значение, 1, 0));
	ОбщегоНазначенияБП.ПрименитьПараметрыУчета(ПараметрыУчета, Истина, Отказ);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли