#Область ОписаниеПеременных

&НаКлиенте
Перем ОткрытыеФормы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступенОбменСБанкамиПоЗарплатнымПроектам = 
		ПравоДоступа("Просмотр", Метаданные.Обработки.ОбменСБанкамиПоЗарплатнымПроектам);
	
	ДоступнаПубликацияРасчетныхЛистков = 
		ПравоДоступа("Просмотр", Метаданные.Обработки.ПубликацияРасчетныхЛистковКабинетСотрудника);
	
	ДоступныДокументыКадровогоЭДО = 
		ПравоДоступа("Просмотр", Метаданные.Документы.ДокументЭДОБЗК);
	
	Элементы.ОбменСБанкамиЗарплата.Видимость = ДоступенОбменСБанкамиПоЗарплатнымПроектам;
	Элементы.ПубликацияРасчетныхЛистков.Видимость = ДоступнаПубликацияРасчетныхЛистков;
	Элементы.ДокументыКадровогоЭДО.Видимость = ДоступныДокументыКадровогоЭДО;
	Элементы.КонтрольОзнакомленияСРасчетнымиЛистками.Видимость = ДоступныДокументыКадровогоЭДО;
	
	МобильныйКлиентАдаптацияФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбменСБанкамиЗарплата(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Обработка.ОбменСБанкамиПоЗарплатнымПроектам.Форма",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОбменаСБанками(Команда)
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("ЖурналДокументов.ДокументыОбменаСБанкамиПоЗарплатнымПроектам.Форма.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаОткрытиеЛицевыхСчетов(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПубликацияРасчетныхЛистков(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы(
		"Обработка.ПубликацияРасчетныхЛистковКабинетСотрудника.Форма.ПубликацияРасчетныхЛистков",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыКадровогоЭДО(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ДокументЭДОБЗК.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляОформленияНаРаботу(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ДанныеДляОформленияНаРаботу.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольОзнакомленияСРасчетнымиЛистками(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("РасчетныеЛисты", Истина);
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ДокументЭДОБЗК.ФормаСписка",
		ЭтотОбъект, ПараметрыФормы, , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиКабинетСотрудника(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("ЖурналДокументов.ЗаявкиКабинетСотрудника.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводЛицевыхСчетов(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Обработка.ОбменСБанкамиПоЗарплатнымПроектам.Форма.ЛицевыеСчета",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗапросВФНСНаПроверкуСведенийРаботников(Команда)

	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("ОбщаяФорма.ЗапросВФНСНаПроверкуСведенийРаботников",
		ЭтотОбъект, , , ОткрытыеФормы);

КонецПроцедуры

&НаКлиенте
Процедура ИмпортСведенийОТрудовойДеятельности(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Обработка.ИмпортСведенийОТрудовойДеятельности.Форма",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаРегистрацииВИФНС(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Обработка.ПерезаполнениеРегистрацийВНалоговомОргане.Форма",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаЗарплатныеПроекты);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаСервис);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаСервис1СКабинетСотрудника);
	
КонецПроцедуры

#КонецОбласти
