
#Область ОбработчикиСобытий
// Показывает форму недоступной функциональности для форм, неадаптированных к мобильному клиенту
// Источниками для подписки могут быть только объекты метаданных, у которых в указана ФормаСписка или ФормаОбъекта поумолчанию.
//
Процедура МобильныйКлиентБПСобытия(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	ОткрытьДоступнуюНаМобильномФорму(Источник, ВидФормы, Параметры, ВыбраннаяФорма, СтандартнаяОбработка);
КонецПроцедуры

Процедура МобильныйКлиентБПСобытияРегламентированныхОтчетов(Источник, ВидФормы, Параметры, ВыбраннаяФорма,
	ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	ОткрытьДоступнуюФормуРегламентированнойОтчетности(Источник, ВидФормы, Параметры, ВыбраннаяФорма, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("МашиночитаемыйБланкДекларации", Истина);
	
КонецПроцедуры

// Процедура обновляет данные о последнем входя пользователя с использованием мобильного клиента
Процедура ОбновитьСведенияОЗапуске() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Пользователь = Пользователи.ТекущийПользователь();
	ДатаПоследнейАктивности = НачалоДня(ТекущаяДатаСеанса());
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СведенияОПользователяхМК");
	ЭлементБлокировки.УстановитьЗначение("Пользователь", Пользователь);
	
	НаборЗаписей = РегистрыСведений.СведенияОПользователяхМК.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			НаборЗаписей.Добавить();
			НаборЗаписей[0].Пользователь = Пользователь;
		КонецЕсли;
		Если НаборЗаписей[0].ДатаПоследнейАктивности <> ДатаПоследнейАктивности Тогда
			НаборЗаписей[0].ДатаПоследнейАктивности = ДатаПоследнейАктивности;
			НаборЗаписей.Записать();
			ЗафиксироватьТранзакцию();
		КонецЕсли;
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПроверитьИЗарегистроватьСобытиеДляОценки(ИдентификаторОперации, ПоказыватьФормуОценки) Экспорт
	
	Если НЕ ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСобытия = РегистрыСведений.СчетчикСобытийОценкаПриложения.ПараметрыСобытияОценки(ИдентификаторОперации);
	
	ПоказыватьФормуОценки = ПараметрыСобытия.ПоказыватьФормуОценки;
	
	Если ПараметрыСобытия.РегистрироватьСобытие Тогда
		РегистрыСведений.СчетчикСобытийОценкаПриложения.СоздатьЗаписьПоСобытию(ИдентификаторОперации);
	КонецЕсли;
	
КонецПроцедуры

Функция МашиночитаемыйБланкДекларации(ПараметрыФормирования) Экспорт
	
	Перем АдресПараметровПроксиВоВременномХранилище, ПараметрыСформированногоОтчета, СообщениеОбОшибке;
	
	Если НЕ ОбщегоНазначения.РазделениеВключено() Тогда
		ОписаниеОшибки = НСтр("ru = 'Отправка декларации с мобильного недоступна. Сдать отчет можно в версии для компьютера.'");
		
		ЗаписьЖурналаРегистрации("ФормированиеМашиночитаемогоБланкаУСН", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
		
		Возврат Ложь;
	КонецЕсли;
	
	РезультатВыгрузки = ИнтерфейсыВзаимодействияБРО.ВыгрузитьРегламентированныйОтчет(ПараметрыФормирования.Декларация);
	
	Если НЕ РегламентированнаяОтчетностьВызовСервера.ПроверитьВозможностьВыводаМашиночитаемойФормыЧерезВебСервис(АдресПараметровПроксиВоВременномХранилище) Тогда
		ЗаписьЖурналаРегистрации("ВыгрузкаВСервисМашиночитаемыхБланков", УровеньЖурналаРегистрации.Ошибка,,,
			НСтр("ru = 'Недоступен сервис печати машиночитаемых бланков'"));
		
		Возврат Ложь;
	КонецЕсли;
	
	ДвоичныеДанныеXML = ПолучитьИзВременногоХранилища(РезультатВыгрузки.АдресФайлаВыгрузки);
	
	ТекстВыгрузки = Новый ТекстовыйДокумент;
	ЧтениеДанных  = Новый ЧтениеДанных(ДвоичныеДанныеXML);
	
	ЧтениеДанных.КодировкаТекста = РезультатВыгрузки.КодировкаФайлаВыгрузки;
	
	Пока НЕ ЧтениеДанных.ЧтениеЗавершено Цикл
		ТекстВыгрузки.ДобавитьСтроку(ЧтениеДанных.ПрочитатьСтроку());
	КонецЦикла;
	
	АдресФайлаВыгрузкиВоВременномХранилище = РегламентированнаяОтчетностьВызовСервера.ПоместитьФайлВыгрузкиВоВременноеХранилищеНаСервере(
			ТекстВыгрузки.ПолучитьТекст(),
			Строка(ПараметрыФормирования.УникальныйИдентификатор),
			РезультатВыгрузки.КодировкаФайлаВыгрузки);
	
	ФайлВыгрузкиВоВременномХранилище = Новый Структура;
	ФайлВыгрузкиВоВременномХранилище.Вставить("КодировкаФайлаВыгрузки",                 РезультатВыгрузки.КодировкаФайлаВыгрузки);
	ФайлВыгрузкиВоВременномХранилище.Вставить("ИмяФайлаВыгрузки",                       РезультатВыгрузки.ИмяФайлаВыгрузки);
	ФайлВыгрузкиВоВременномХранилище.Вставить("АдресФайлаВыгрузкиВоВременномХранилище", АдресФайлаВыгрузкиВоВременномХранилище);
	
	ИмяФормыОтчета = РегламентированнаяОтчетностьВызовСервера.ПолныйПутьКФорме(ПараметрыФормирования.Декларация.ИсточникОтчета,
		ПараметрыФормирования.Декларация.ВыбраннаяФорма);
	
	ВывестиМашиночитаемуюФормуЧерезВебСервис = РегламентированнаяОтчетностьВызовСервера.ВывестиМашиночитаемуюФормуЧерезВебСервис(
			ИмяФормыОтчета, Неопределено, ФайлВыгрузкиВоВременномХранилище,
			ПараметрыСформированногоОтчета, АдресПараметровПроксиВоВременномХранилище);
			
	ПараметрыСформированногоОтчета.Вставить("АдресПараметровПроксиВоВременномХранилище", АдресПараметровПроксиВоВременномХранилище);
	
	МашиночитаемыйБланкСформирован = МашиночитаемаяФормаПолученаСВебСервиса(ПараметрыСформированногоОтчета);
	
	Если МашиночитаемыйБланкСформирован Тогда
		МашиночитаемыйБланк = Новый Структура;
		
		МашиночитаемыйБланк.Вставить("ФайлМашиночитаемогоБланка", ПолучитьИзВременногоХранилища(ПараметрыСформированногоОтчета.АдресОтчетаВоВременномХранилище));
		МашиночитаемыйБланк.Вставить("ИмяФайлаВыгрузкиXML", ФайлВыгрузкиВоВременномХранилище.ИмяФайлаВыгрузки);
		МашиночитаемыйБланк.Вставить("ТекстXML", ТекстВыгрузки);
	КонецЕсли;
	
	Возврат МашиночитаемыйБланк;
	
КонецФункции

Функция ПечатныйБланкРегламентированногоОтчета(РегламентированныйОтчет) Экспорт
	
	ДанныеДляПечати = ИнтерфейсыВзаимодействияБРО.ПечатныйБланкРегламентированногоОтчета(РегламентированныйОтчет);
	
	ТабличныйДокумент = Новый Структура();
	ТабличныйДокумент.Вставить("ФайлПечатногоБланка", ПолучитьИзВременногоХранилища(ДанныеДляПечати.АдресПечатногоБланка));
	ТабличныйДокумент.Вставить("ИмяФайлаПечатногоБланка", ДанныеДляПечати.ИмяФайлаПечатногоБланка);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОткрытьДоступнуюНаМобильномФорму(Источник, ВидФормы, Параметры, ВыбраннаяФорма, СтандартнаяОбработка)
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ОтключитьПроверкуПриОткрытииФорм")
		И Параметры.ОтключитьПроверкуПриОткрытииФорм Тогда
		Возврат;
	КонецЕсли;
	
	ЧастиИсточника = СтрРазделить(Источник, ".");
	Менеджер = ЧастиИсточника[0];
	ИмяОбъекта = ЧастиИсточника[1];
	
	//Переопределение форм рег. отчетности см. ОткрытьДоступнуюФормуРегламентированнойОтчетности
	//Стандартные формы БРО не адаптированы под мобильный клиент
	Если ИмяОбъекта = "РегламентированныйОтчет" Тогда
		Возврат;
	КонецЕсли;
	
	//Проверяются только основные формы объектов: ФормаОбъекта, ФормаСписка, ФормаВыбора, ОсновнаяФорма
	//В подписку включены все: Документы, ЖурналыДокументов.
	//Отчеты и обработки частично:
	//У которых можно и нужно переопределить основную форму на заглушку
	//Часть недоступных обработок и отчетов - заблокированы в командах в интерфейсе
	
	ФормаДоступнаБезЗапроса = Ложь;
	Если Менеджер = "ЖурналДокументовМенеджер" Тогда
		ФормаДоступнаБезЗапроса = ФормаЖурналаДокументовАдаптирована(ИмяОбъекта, ВидФормы);
	ИначеЕсли Менеджер = "ДокументМенеджер" Тогда
		ФормаДоступнаБезЗапроса = (ВидФормы = "ФормаВыбора")
		Или ФормаДокументаАдаптирована(ИмяОбъекта, ВидФормы);
	КонецЕсли;
	
	МобильныйКлиентБППереопределяемый.ПриОпределенииДоступностиФормы(Менеджер, ИмяОбъекта, ВидФормы, ФормаДоступнаБезЗапроса);
	
	Если ФормаДоступнаБезЗапроса Тогда
		Возврат;
	КонецЕсли;
	
	//Если форма включена в подписку, но не запрещена - покажем предупреждение
	//Запрещенные - явно блокируем
	ФормаДоступнаСПредупреждением = Не ФормаЗапрещенаВМобильном(Менеджер, ИмяОбъекта, ВидФормы);
	
	// Выбираем режим открытия для формы.
	ОткрываемаяФормаУказанаЯвно = (ВыбраннаяФорма <> Неопределено
								И ТипЗнч(ВыбраннаяФорма) <> Тип("Строка"));
	Если ОткрываемаяФормаУказанаЯвно Тогда // форма-объект метаданных

		ИмяФормы = ВыбраннаяФорма.ПолноеИмя();
		
	Иначе // требуется подобрать форму
		
		ОписаниеИсточника = Метаданные.НайтиПоТипу(ТипЗнч(Источник));
		ИмяФормы = ОписаниеИсточника.ПолноеИмя() + "." +
			?(ВыбраннаяФорма = Неопределено, ВидФормы, "Форма." + ВыбраннаяФорма);
			
	КонецЕсли;
	
	ЗаголовокФормы = "";
	Если Не Параметры.Свойство("Заголовок", ЗаголовокФормы) Тогда
		
		Если ОткрываемаяФормаУказанаЯвно Тогда
			
			ЗаголовокФормы = ВыбраннаяФорма.Синоним;
			
		Иначе
			
			Если ВидФормы = "ФормаСписка"
				И Не ПустаяСтрока(ОписаниеИсточника.РасширенноеПредставлениеСписка) Тогда
				
				ЗаголовокФормы = ОписаниеИсточника.РасширенноеПредставлениеСписка;
				
			ИначеЕсли ВидФормы = "ФормаСписка"
				И Не ПустаяСтрока(ОписаниеИсточника.ПредставлениеСписка) Тогда
				
				ЗаголовокФормы = ОписаниеИсточника.ПредставлениеСписка;
				
			Иначе
				
				ЗаголовокФормы = ОписаниеИсточника.Синоним;
				
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	
	Ключ = Неопределено;
	Параметры.Свойство("Ключ", Ключ);
	ОписаниеНедоступногоДействия = ОписаниеНедоступногоДействия(ИмяФормы, ВидФормы, ЗаголовокФормы, Ключ);
	
	СтандартнаяОбработка = Ложь;
	ВыбраннаяФорма = "ОбщаяФорма.НедоступноНаМобильномКлиенте";
	
	ПараметрыОткрываемойФормы = Новый Структура;
	Для каждого ПараметрФормы Из Параметры Цикл
		ПараметрыОткрываемойФормы.Вставить(ПараметрФормы.Ключ, ПараметрФормы.Значение);
	КонецЦикла; 
	
	ПараметрыОткрытия = МобильныйКлиентБПКлиентСервер.НовыйПараметрыОткрытияФормыСПредупреждением();
	ПараметрыОткрытия.ИмяФормы                = ИмяФормы;
	ПараметрыОткрытия.Заголовок               = ЗаголовокФормы;
	ПараметрыОткрытия.ПереопределенаНаСервере = Истина;
	
	Параметры.Очистить();
	
	ПараметрыФормыНедоступно = МобильныйКлиентБПКлиентСервер.НовыйПараметрыФормаНедоступноНаМобильном();
	ПараметрыФормыНедоступно.ОписаниеНедоступногоДействия = ОписаниеНедоступногоДействия;
	ПараметрыФормыНедоступно.ФормаДоступнаСПредупреждением = ФормаДоступнаСПредупреждением;
	
	Параметры.Вставить("ПараметрыФормыНедоступно",  ПараметрыФормыНедоступно);
	Параметры.Вставить("ПараметрыОткрываемойФормы", ПараметрыОткрываемойФормы);
	Параметры.Вставить("ПереопределенаНаСервере",   ПараметрыОткрытия.ПереопределенаНаСервере);
	Параметры.Вставить("ПараметрыОткрытия",         ПараметрыОткрытия);
    
КонецПроцедуры

Процедура ОткрытьДоступнуюФормуРегламентированнойОтчетности(Источник, ВидФормы, Параметры, ВыбраннаяФорма,
	СтандартнаяОбработка)
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФормы = "";
	
	ЧастиИсточника = СтрРазделить(Источник, ".");
	
	Менеджер = ЧастиИсточника[0];
	ИмяОбъекта = ЧастиИсточника[1];
	
	ПараметрыОткрываемойФормы = Новый Структура;
	
	Для каждого ПараметрФормы Из Параметры Цикл
		ПараметрыОткрываемойФормы.Вставить(ПараметрФормы.Ключ, ПараметрФормы.Значение);
	КонецЦикла;
	
	Параметры.Очистить();
	
	ИсточникОтчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОткрываемойФормы.Ключ, "ИсточникОтчета");
	
	Если ИсточникОтчета = "РегламентированныйОтчетУСН" Тогда
		ИмяФормы = "Обработка.ПомощникРасчетаНалогаУСН.Форма.Форма";
		
		ЗначенияРеквизитовДекларации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыОткрываемойФормы.Ключ,
			"ДатаОкончания, Организация");
		
		Параметры.Вставить("КонецПериода", КонецКвартала(ЗначенияРеквизитовДекларации.ДатаОкончания));
		Параметры.Вставить("Организация", ЗначенияРеквизитовДекларации.Организация);
	Иначе
		ИмяФормы = "ОбщаяФорма.НедоступноНаМобильномКлиенте";
		
		ОписаниеИсточника = Метаданные.НайтиПоТипу(ТипЗнч(Источник));
		
		ЗаголовокФормы = ОписаниеИсточника.Синоним;
		
		ОписаниеНедоступногоДействия = ОписаниеНедоступногоДействия(ИмяФормы, ВидФормы, ЗаголовокФормы,
			ПараметрыОткрываемойФормы.Ключ);
		
		ПараметрыФормыНедоступно = МобильныйКлиентБПКлиентСервер.НовыйПараметрыФормаНедоступноНаМобильном();
		ПараметрыФормыНедоступно.ОписаниеНедоступногоДействия = ОписаниеНедоступногоДействия;
		ПараметрыФормыНедоступно.ФормаДоступнаСПредупреждением = Не ФормаЗапрещенаВМобильном(Менеджер,
			ИмяОбъекта, ВидФормы);
		
		Параметры.Вставить("ПараметрыФормыНедоступно", ПараметрыФормыНедоступно);
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ВыбраннаяФорма = ИмяФормы;
	
	ПараметрыОткрытия = МобильныйКлиентБПКлиентСервер.НовыйПараметрыОткрытияФормыСПредупреждением();
	ПараметрыОткрытия.ИмяФормы                = ИмяФормы;
	ПараметрыОткрытия.ПереопределенаНаСервере = Истина;
	
	Параметры.Вставить("ПараметрыОткрываемойФормы", ПараметрыОткрываемойФормы);
	Параметры.Вставить("ПереопределенаНаСервере",   ПараметрыОткрытия.ПереопределенаНаСервере);
	Параметры.Вставить("ПараметрыОткрытия",         ПараметрыОткрытия);
	
КонецПроцедуры

Функция ФормаЗапрещенаВМобильном(Менеджер, ИмяОбъекта, ВидФормы)
	
	ЗапрещеноПоказыватьВМобильном = Ложь;
	Если Менеджер = "ДокументМенеджер" Тогда
		ЗапрещеноПоказыватьВМобильном = 
			ИмяОбъекта = "РегламентированныйОтчет"
			Или ИмяОбъекта = "УведомлениеОСпецрежимахНалогообложения";
	ИначеЕсли Менеджер = "ЖурналДокументовМенеджер" Тогда
		ЗапрещеноПоказыватьВМобильном = Ложь;
	ИначеЕсли Менеджер = "РегистрСведенийМенеджер" Тогда
		//Запретим особенные формы
		ЗапрещеноПоказыватьВМобильном = ИмяОбъекта = "КорреспонденцииСчетов"
			Или ИмяОбъекта = "ЖурналСтатусовФинОтчетностиВБанки";
	ИначеЕсли Менеджер = "ОбработкаМенеджер" Тогда
		//обработки перечисленные в подписке, кроме
		ЗапрещеноПоказыватьВМобильном = Не (ИмяОбъекта = "ВводНачальныхОстатков");
	Иначе //отчеты перечисленные в подписке
		ЗапрещеноПоказыватьВМобильном = Истина;
	КонецЕсли;
	
	Возврат ЗапрещеноПоказыватьВМобильном;
	
КонецФункции

Функция ФормаЖурналаДокументовАдаптирована(ИмяОбъекта, ВидФормы)
	
	ФормаАдаптирована = 
		ИмяОбъекта = "Документы"
		или ИмяОбъекта = "Деньги"
		или ИмяОбъекта = "РозничныеПродажи"
		или ИмяОбъекта = "ЖурналОпераций";
	
	Возврат ФормаАдаптирована;
	
КонецФункции

Функция ФормаДокументаАдаптирована(ИмяОбъекта, ВидФормы)
	
	ФормаАдаптирована =
		ИмяОбъекта = "СчетНаОплатуПокупателю"
		или ИмяОбъекта = "СчетНаОплатуПоставщика"
		или ИмяОбъекта = "ПлатежноеПоручение"
		или ИмяОбъекта = "ПоступлениеНаРасчетныйСчет"
		или ИмяОбъекта = "СписаниеСРасчетногоСчета"
		или ИмяОбъекта = "ПриходныйКассовыйОрдер"
		или ИмяОбъекта = "РасходныйКассовыйОрдер"
		или ИмяОбъекта = "АктСверкиВзаиморасчетов"
		или ИмяОбъекта = "ВозвратТоваровОтПокупателя"
		или ИмяОбъекта = "ВозвратТоваровПоставщику"
		или ИмяОбъекта = "Доверенность"
		или ИмяОбъекта = "КоммерческоеПредложение"
		или ИмяОбъекта = "ПоступлениеТоваровУслуг"
		или ИмяОбъекта = "РеализацияТоваровУслуг"
		или ИмяОбъекта = "РеализацияОтгруженныхТоваров"
		или ИмяОбъекта = "РозничнаяПродажа"
		или ИмяОбъекта = "ОтчетОРозничныхПродажах"
		или ИмяОбъекта = "ОплатаПлатежнойКартой"
		или ИмяОбъекта = "СчетФактураПолученный"
		или ИмяОбъекта = "СчетФактураВыданный"
		или ИмяОбъекта = "ПоступлениеДопРасходов"
		или ИмяОбъекта = "ОперацияСПатентом"
		или ИмяОбъекта = "ИнвентаризацияТоваровНаСкладе"
		или ИмяОбъекта = "ЭлектронноеПисьмоИсходящее"
		или ИмяОбъекта = "ЭлектронноеПисьмоВходящее"
		или ИмяОбъекта = "УведомлениеОбИсчисленныхСуммахНалогов"
		или ИмяОбъекта = "УведомлениеОбУменьшенииНалогаПоПатенту"
		или ИмяОбъекта = "УстановкаЦенНоменклатуры"
		или ИмяОбъекта = "АвансовыйОтчет"
		или ИмяОбъекта = "РасходыПредпринимателя"
		или ИмяОбъекта = "ПутевойЛист"
		или ИмяОбъекта = "ОказаниеУслуг"
		или ИмяОбъекта = "ИнвентаризацияОС"
		или ИмяОбъекта = "ЭлектронныйДокументВходящийЭДО"
		или ИмяОбъекта = "ЭлектронныйДокументИсходящийЭДО"
		//Добавлен для целостности учета, но не адаптирован
		или ИмяОбъекта = "ДокументРасчетовСКонтрагентом"
		или ИмяОбъекта = "ТелефонныйЗвонок"
		или ИмяОбъекта = "Встреча"
		или ИмяОбъекта = "ПрочееВзаимодействие";
	
	Возврат ФормаАдаптирована;
	
КонецФункции

Функция ОписаниеНедоступногоДействия(ИмяФормы, ВидФормы, ЗаголовокФормы, Ключ = Неопределено)
	
	ТекстШаблонаРекомендация = НСтр("ru = '%1 ""%2""'");
	Если ИмяФормы = "Документ.РегламентированныйОтчет.ФормаОбъекта"
		Или ИмяФормы = "Документ.УведомлениеОСпецрежимахНалогообложения.Форма.ФормаДокумента"
		Или СтрНачинаетсяС(ИмяФормы, "Отчет.") Тогда
		ТипСтрокой = "Форма отчета";
		Если Не ЗначениеЗаполнено(Ключ) Тогда
			ПредставлениеОбъекта = ЗаголовокФормы;
		Иначе
			ПредставлениеОбъекта = Строка(Ключ);
		КонецЕсли;
		ТекстПредупреждения = СтрШаблон(ТекстШаблонаРекомендация,
			ТипСтрокой,
			ПредставлениеОбъекта);
	ИначеЕсли СтрНачинаетсяС(ИмяФормы, "Документ.") Тогда
		Если ВидФормы = "ФормаСписка" Тогда
			ТипСтрокой = "Форма списка документов";
		Иначе
			ТипСтрокой = "Форма документа";
		КонецЕсли;
		
		Если ПустаяСтрока(Ключ) Тогда
			ПредставлениеОбъекта = ЗаголовокФормы;
		Иначе
			ПредставлениеОбъекта = Строка(Ключ);
		КонецЕсли;
		ТекстПредупреждения = СтрШаблон(ТекстШаблонаРекомендация,
			ТипСтрокой,
			ПредставлениеОбъекта);
	Иначе
		ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Форма ""%1""'"),
			ЗаголовокФормы);
	КонецЕсли;
	
	Возврат ТекстПредупреждения;
	
КонецФункции

Функция МашиночитаемаяФормаПолученаСВебСервиса(Параметры)
	
	МашиночитаемаяФормаПолученаСВебСервиса = Истина;
	НомерЗапроса = 1;
	
	МинимальноеВремяФормированияОтчета = 5; // минимальное время формирования отчета - 5 секунд.
	ВремяОжиданияДоПолученияОтчета = Параметры.ВремяОжиданияДоПолученияОтчета;
	
	// Фактически отчет может быть сформирован быстрее, выполняем проверку с минимальным интервалом (5 секунд).
	МаксимальноеКоличествоЗапросов = Окр(ВремяОжиданияДоПолученияОтчета / МинимальноеВремяФормированияОтчета);
	Пока Не РегламентированнаяОтчетностьВызовСервера.ПолучитьМашиночитаемуюФормуСВебСервиса(Параметры) Цикл
		Если НомерЗапроса = МаксимальноеКоличествоЗапросов Тогда
			МашиночитаемаяФормаПолученаСВебСервиса = Ложь;
			Прервать;
		КонецЕсли;
		НомерЗапроса = НомерЗапроса + 1;
		
		МинимальноеВремяФормированияОтчета = ?(Окр(МинимальноеВремяФормированияОтчета * 1.4) > 15, 15, Окр(МинимальноеВремяФормированияОтчета * 1.4));
		ОбщегоНазначенияБТС.Пауза(МинимальноеВремяФормированияОтчета);
	КонецЦикла;
	
	Возврат МашиночитаемаяФормаПолученаСВебСервиса;
	
КонецФункции

#КонецОбласти


