#Область ОписаниеПеременных

&НаКлиенте
Перем ОткрытыеФормы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МобильныйКлиентАдаптацияФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеремещениеОС(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПеремещениеОС.ФормаСписка", ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура МодернизацияОС(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.МодернизацияОС.ФормаСписка", ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеРемонтаОС(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ЗавершениеРемонтаОС.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереводОСВМалоценноеОборудование(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПереводОСВМалоценноеОборудование.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыАмортизацииОС(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("ЖурналДокументов.ПараметрыАмортизацииОС.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыАмортизацииНМА(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("ЖурналДокументов.ПараметрыАмортизацииНМА.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередачаОСВАренду(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПередачаОСВАренду.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратОСОтАрендатора(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ВозвратОСОтАрендатора.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеУсловийАренды(Команда)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийИзменениеУсловийАренды.ИзменениеУсловийАренды");
	ЗаголовокФормы = НСтр("ru = 'Изменение условий аренды'");
	ОткрытьИзменениеУсловийАрендыПоВиду(ВидОперации, ЗаголовокФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеУсловийЛизинга(Команда)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийИзменениеУсловийАренды.ИзменениеУсловийЛизинга");
	ЗаголовокФормы = НСтр("ru = 'Изменение условий лизинга'");
	ОткрытьИзменениеУсловийАрендыПоВиду(ВидОперации, ЗаголовокФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыкупПредметовЛизинга(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ВыкупПредметовЛизинга.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьИзменениеУсловийАрендыПоВиду(ВидОперации, ЗаголовокФормы)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидОперации", ВидОперации);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", ЗаголовокФормы);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	КлючУникальности = Строка(ВидОперации);
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ИзменениеУсловийАренды.ФормаСписка",
		ЭтотОбъект, ПараметрыФормы, КлючУникальности, ОткрытыеФормы);
	
КонецПроцедуры


#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаОсновныеСредства);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаАмортизация);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаАрендаЛизинг);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти