
#Область ПрограммныйИнтерфейс

// Подробнее
// См. ВыполнениеЗадачБухгалтераКлиентСервер.ЭтоДокументСЭДО
//
Процедура ПриОпределенииЭтоДокументСЭДО(Признак, Правило) Экспорт
	
	ТипПравила = ТипЗнч(Правило);
	Признак = ТипПравила = Тип("ДокументСсылка.ВходящийЗапросФССДляРасчетаПособия")
		Или ТипПравила = Тип("ДокументСсылка.ИзвещениеФСС")
		Или ТипПравила = Тип("ДокументСсылка.ОтказВВозмещенииВыплатРодителямДетейИнвалидов")
		Или ТипПравила = Тип("ДокументСсылка.УведомлениеОСтатусеВыплатыПособия");
	
КонецПроцедуры

// При определении имени формы проверки основного вида деятельности.
//
// Параметры:
//  ИмяФормы - Строка - имя открываемой формы
//
Процедура ПриОпределенииИмениФормыПроверкиОсновногоВидаДеятельности(ИмяФормы) Экспорт
	
	ИмяФормы = "Обработка.КлассификацияВыручкиПоОКВЭД.Форма";
	
КонецПроцедуры

#КонецОбласти