#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "ПростойИнтерфейсКонтрагентыПокупки");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЭтоКонтрагенты", Истина);

	ОткрытьФорму(
		"Обработка.ПанелиПростойИнтерфейс.Форма.ПанельПокупки",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти