#Область ПрограммныйИнтерфейс

// Запускает получение статуса самозанятого из сервиса в фоне.
// 
// Параметры:
//  Источник - Произвольный - используется в обработке оповещения при завершении длительной операции
//  ФормаВладелец - ФормаКлиентскогоПриложения
//  ИНН - Строка - ИНН физического лица
//  НаДату - Дата - дата в часовом поясе "Europe/Moscow", на которую нужно получить статус
//  
//  Возвращаемое значение:
//   Булево - Истина, если длительная операция запущена
//
Функция НачатьПолучениеСтатусаСамозанятого(Источник, ФормаВладелец, ИНН, НаДату) Экспорт
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МетодВзаимодействия = ИнтеграцияСтатусСамозанятогоКлиентСервер.ИменаМетодовВзаимодействия().СоздатьЗадание;
	ПараметрыМетода = ИнтеграцияСтатусСамозанятогоКлиентСервер.НовыеПараметрыМетодаВзаимодействия(МетодВзаимодействия);
	
	СтрокаСодержанияЗадания = ИнтеграцияСтатусСамозанятогоКлиентСервер.НоваяСтрокаСодержанияЗадания(ИНН, НаДату);
	ПараметрыМетода.СодержаниеЗадания.Добавить(СтрокаСодержанияЗадания);
	
	ДлительнаяОперация = ИнтеграцияСтатусСамозанятогоВызовСервера.ВыполнитьВФоне(
		ПараметрыМетода, ФормаВладелец.УникальныйИдентификатор);
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Ошибка" Тогда
		ПолучитьСтатусСамозанятогоОшибка(
			ДлительнаяОперация.КраткоеПредставлениеОшибки,
			ДлительнаяОперация.ПодробноеПредставлениеОшибки,
			ФормаВладелец);
		Возврат Ложь;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("Источник", Источник);
	Обработчик = Новый ОписаниеОповещения("ПолучитьСтатусСамозанятогоЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ФормаВладелец);
	НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
	
	Возврат (ДлительнаяОперация.Статус = "Выполняется");
	
КонецФункции

// Запускает задание получения списка опций тарифов пользователя
// 
// Параметры:
//  ФормаВладелец - ФормаКлиентскогоПриложения
// 
// Возвращаемое значение:
//  Булево - Истина, если длительная операция запущена
//
Функция ПолучитьСписокОпций(ФормаВладелец) Экспорт
	
	МетодВзаимодействия = ИнтеграцияСтатусСамозанятогоКлиентСервер.ИменаМетодовВзаимодействия().СоздатьЗапросСпискаОпций;
	ПараметрыМетода = ИнтеграцияСтатусСамозанятогоКлиентСервер.НовыеПараметрыМетодаВзаимодействия(МетодВзаимодействия);
	
	ДлительнаяОперация = ИнтеграцияСтатусСамозанятогоВызовСервера.ВыполнитьВФоне(
		ПараметрыМетода, ФормаВладелец.УникальныйИдентификатор);
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Ошибка" Тогда
		ПолучитьСписокОпцийОшибка(
			ДлительнаяОперация.КраткоеПредставлениеОшибки,
			ДлительнаяОперация.ПодробноеПредставлениеОшибки,
			ФормаВладелец);
		Возврат Ложь;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("Источник", ФормаВладелец);
	Обработчик = Новый ОписаниеОповещения("ПолучитьСписокОпцийЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ФормаВладелец);
	НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
	
	Возврат (ДлительнаяОперация.Статус = "Выполняется");
	
КонецФункции

// Запускает задание получения реквизитов обслуживающей организации
// 
// Параметры:
//  ФормаВладелец - ФормаКлиентскогоПриложения
// 
// Возвращаемое значение:
//  Булево - Истина, если длительная операция запущена
//
Функция ПолучитьРеквизитыОбслуживающейОрганизации(ФормаВладелец) Экспорт
	
	ДлительнаяОперация = ИнтеграцияСтатусСамозанятогоВызовСервера.ПолучитьОбслуживающуюОрганизациюВФоне(
		ФормаВладелец.УникальныйИдентификатор);
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("Источник", ФормаВладелец);
	Если ДлительнаяОперация.Статус = "Ошибка" Тогда
		ПолучитьРеквизитыОбслуживающейОшибка(
			ДлительнаяОперация.КраткоеПредставлениеОшибки,
			ДлительнаяОперация.ПодробноеПредставлениеОшибки,
			ФормаВладелец);
		Возврат Ложь;
	КонецЕсли;
	
	Обработчик = Новый ОписаниеОповещения(
		"ПолучитьРеквизитыОбслуживающейЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ФормаВладелец);
	НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
	
	Возврат (ДлительнаяОперация.Статус = "Выполняется");
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СсылкаСтраницыОписанияСервиса() Экспорт
	
	Возврат "https://portal.1c.ru/applications/1C-Self-Employed";
	
КонецФункции

Функция ИменаСобытий() Экспорт
	
	ИменаСобытий = Новый Структура;
	ИменаСобытий.Вставить("СтатусСамозанятогоПолучен", "СтатусСамозанятогоПолучен");
	ИменаСобытий.Вставить("СтатусСамозанятогоОшибка", "СтатусСамозанятогоОшибка");
	ИменаСобытий.Вставить("СписокОпцийПолучен", "СписокОпцийПолучен");
	ИменаСобытий.Вставить("СписокОпцийОшибка", "СписокОпцийОшибка");
	ИменаСобытий.Вставить("ОбслуживающаяОрганизацияПолучена", "ОбслуживающаяОрганизацияПолучена");
	ИменаСобытий.Вставить("ОбслуживающаяОрганизацияОшибка", "ОбслуживающаяОрганизацияОшибка");
	ИменаСобытий.Вставить("ИспользоватьСтатусСамозанятогоИзменено", "ИспользоватьСтатусСамозанятогоИзменено");
	Возврат ИменаСобытий;
	
КонецФункции

// Открывает журнал регистрации с отбором по имени события
//
// Параметры:
//   Владелец - ФормаКлиентскогоПриложения
//   Уровни - Массив из Строка, Неопределено - отбор по уровням
//
Процедура ОткрытьЖурналРегистрации(Владелец, Уровни = Неопределено) Экспорт
	
	Если Не ИнтеграцияСтатусСамозанятогоВызовСервера.ЕстьПравоПросмотраЖурналаРегистрации() Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Для просмотра Журнала регистрации обратитесь к администратору'"));
		Возврат;
	КонецЕсли;
	
	ОтборЖурнала = Новый Структура;
	ОтборЖурнала.Вставить("СобытиеЖурналаРегистрации",
		ИнтеграцияСтатусСамозанятогоКлиентСервер.ИмяСобытияЖурналаРегистрации());
	
	Если Уровни <> Неопределено Тогда
		ОтборЖурнала.Вставить("Уровень", Уровни);
	КонецЕсли;
	
	ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(ОтборЖурнала, Владелец);
	
КонецПроцедуры

Процедура ПолучитьСтатусСамозанятогоЗавершение(ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Источник = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "Источник");
	Если ДлительнаяОперация.Статус <> "Ошибка" Тогда
		Оповестить(
			ИменаСобытий().СтатусСамозанятогоПолучен,
			ИзвлечьСтатусСамозанятого(ДлительнаяОперация.АдресРезультата),
			Источник);
	Иначе
		ПолучитьСтатусСамозанятогоОшибка(
			ДлительнаяОперация.КраткоеПредставлениеОшибки,
			ДлительнаяОперация.ПодробноеПредставлениеОшибки,
			Источник);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьСписокОпцийЗавершение(ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Источник = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "Источник");
	Если ДлительнаяОперация.Статус <> "Ошибка" Тогда
		Оповестить(
			ИменаСобытий().СписокОпцийПолучен,
			ИзвлечьСписокОпций(ДлительнаяОперация.АдресРезультата),
			Источник);
	Иначе
		ПолучитьСписокОпцийОшибка(
			ДлительнаяОперация.КраткоеПредставлениеОшибки,
			ДлительнаяОперация.ПодробноеПредставлениеОшибки,
			Источник);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьРеквизитыОбслуживающейЗавершение(ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Источник = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "Источник");
	Если ДлительнаяОперация.Статус <> "Ошибка" Тогда
		Оповестить(
			ИменаСобытий().ОбслуживающаяОрганизацияПолучена,
			ИзвлечьРеквизитыОбслуживающейОрганизации(ДлительнаяОперация.АдресРезультата),
			Источник);
	Иначе
		ПолучитьРеквизитыОбслуживающейОшибка(
			ДлительнаяОперация.КраткоеПредставлениеОшибки,
			ДлительнаяОперация.ПодробноеПредставлениеОшибки,
			Источник);
	КонецЕсли;
	
КонецПроцедуры

#Область ИнтернетПоддержкаПользователей

// Вызывается при начале обработки ошибки сервиса или портала ИТС.
// Если нужно, показывает форму подключения интернет-поддержки
// или форму ввода одноразового пароля из SMS-сообщения.
// Затем возвращает управление в вызываюшую форму для дальнейшей обработки ошибки.
//
// Параметры:
//  ОповещениеФормыВладельца - ОписаниеОповещения - обработчик оповещения о завершении.
//   Структура ДополнительныеПараметры оповещения должны содержать свойства:
//   * ФормаВладелец - Форма - форма, из которой вызывается процедура.
//   В обработчик оповещения возвращается структура с ключом "Действие". Возможные действия:
//     "Повторить" - нужно повторить запрос к сервису после успешного подключения интернет-поддержки 
//                   или успешного ввода одноразового пароля.
//     "Продолжить" - можно продолжить обработку ошибки в вызывающей форме.
//                    Подключать интернет-поддержку или вводить пароль было не нужно.
//     "Ошибка" - Интернет-поддержка не была подключена или пароль не был введен.
//                Дальнейшая обработка такой ситуации производится в вызывающей форме. 
//
Процедура ОтобразитьПодключениеКПорталу(ОповещениеФормыВладельца) Экспорт
	
	ФормаВладелец = ОповещениеФормыВладельца.ДополнительныеПараметры.ФормаВладелец;
	
	ПараметрыПродолжения = Новый Структура;
	ПараметрыПродолжения.Вставить("Действие", Неопределено);
	ПараметрыПродолжения.Вставить("ОповещениеФормыВладельца", ОповещениеФормыВладельца);
	
	НаименованиеСервиса = ИнтеграцияСтатусСамозанятогоКлиентСервер.НаименованиеСервиса();
	Если ИнтернетПоддержкаПользователейКлиент.ДоступноПодключениеИнтернетПоддержки() Тогда
		ПараметрыПродолжения.Действие = "ИнтернетПоддержка";
		ПараметрыПродолжения.Вставить("ФормаВладелец", ФормаВладелец);
		ОбработчикПродолжения = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержку", 
			ЭтотОбъект, ПараметрыПродолжения);
		ТекстВопроса = СтрШаблон(
			НСтр("ru = 'Для подключения к сервису %1
			|нужно подключить Интернет-поддержку пользователей.
			|Продолжить?'"),
			НаименованиеСервиса);
		ПоказатьВопрос(ОбработчикПродолжения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ПараметрыПродолжения.Действие = "ИнтернетПоддержкаНедоступна";
		ОбработчикПродолжения = Новый ОписаниеОповещения("ПродолжитьБезИнтернетПоддержки", 
			ЭтотОбъект, ПараметрыПродолжения);
		ТекстПредупреждения = СтрШаблон(
			НСтр("ru = 'Для подключения к сервису %1
			|нужно подключить Интернет-поддержку пользователей.
			|Обратитесь к администратору.'"),
			НаименованиеСервиса);
		ПоказатьПредупреждение(ОбработчикПродолжения, ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

// Обработка оповещения на утвердительный ответ вопроса с предложением подключить интернет-поддержку
// 
// Параметры:
//   Ответ - КодВозвратаДиалога
//   ПараметрыПродолжения - Структура:
//     * Действие - Строка, Неопределено - вариант действия
//     * ОповещениеФормыВладельца - ОписаниеОповещения - обработчик оповещения о завершении
//
Процедура ПодключитьИнтернетПоддержку(Ответ, ПараметрыПродолжения) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОбработчикПродолжения = Новый ОписаниеОповещения("ПродолжитьОбработкуОшибки", ЭтотОбъект, ПараметрыПродолжения);
		ИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(
			ОбработчикПродолжения, ПараметрыПродолжения.ФормаВладелец);
	Иначе
		ПродолжитьБезИнтернетПоддержки(ПараметрыПродолжения);
	КонецЕсли;
	
КонецПроцедуры

// Обработка оповещения на отрицательный ответ вопроса с предложением подключить интернет-поддержку
// 
// Параметры:
//   ПараметрыПродолжения - Структура:
//     * Действие - Строка, Неопределено - вариант действия
//     * ОповещениеФормыВладельца - ОписаниеОповещения - обработчик оповещения о завершении
//
Процедура ПродолжитьБезИнтернетПоддержки(ПараметрыПродолжения) Экспорт
	
	ПродолжитьОбработкуОшибки(Неопределено, ПараметрыПродолжения);
	
КонецПроцедуры

// Обработка оповещения, вызываемая после завершения подключения интернет-поддержки
// 
// Параметры:
//   РезультатДействия - Структура, Неопределено - результат подключения
//   ПараметрыПродолжения - Структура:
//     * Действие - Строка, Неопределено - вариант действия
//     * ОповещениеФормыВладельца - ОписаниеОповещения - обработчик оповещения о завершении
//
Процедура ПродолжитьОбработкуОшибки(РезультатДействия, ПараметрыПродолжения) Экспорт
	
	Действие = ПараметрыПродолжения.Действие;
	ОбработчикПродолжения = ПараметрыПродолжения.ОповещениеФормыВладельца;
	
	Результат = Новый Структура("Действие");
	Если Действие = Неопределено Тогда
		Результат.Действие = "Продолжить";
	ИначеЕсли РезультатДействия = Неопределено Тогда
		Результат.Действие = "Ошибка";
	Иначе
		Результат.Действие = "Повторить";
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОбработчикПродолжения, Результат);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПолучитьСтатусСамозанятого

Процедура ПолучитьСтатусСамозанятогоОшибка(КраткоеПредставлениеОшибки, ПодробноеПредставлениеОшибки, Источник)
	
	ИнтеграцияСтатусСамозанятогоВызовСервера.ЗаписатьОшибку(КраткоеПредставлениеОшибки, ПодробноеПредставлениеОшибки);
	Если ЗначениеЗаполнено(КраткоеПредставлениеОшибки) Тогда
		Оповестить(ИменаСобытий().СтатусСамозанятогоОшибка, КраткоеПредставлениеОшибки, Источник);
	Иначе
		Оповестить(ИменаСобытий().СтатусСамозанятогоОшибка, НСтр("ru = 'Неизвестная ошибка'"), Источник);
	КонецЕсли;
	
КонецПроцедуры

Функция ИзвлечьСтатусСамозанятого(АдресРезультата)
	
	Если Не ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		СтрокаТаблицыВыполненияЗадания = ИнтеграцияСтатусСамозанятогоКлиентСервер.НоваяСтрокаРезультатаВыполненияЗадания();
		СтатусыСамозанятости = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			Результат, "СтатусыСамозанятости", Новый Массив);
		Если ЗначениеЗаполнено(СтатусыСамозанятости) Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыВыполненияЗадания, СтатусыСамозанятости[0]);
			ИнтеграцияСтатусСамозанятогоКлиентПереопределяемый.ПриПолученииСтатусовСамозанятости(СтатусыСамозанятости);
		КонецЕсли;
		
		СтатусСамозанятого = Новый Структура;
		СтатусСамозанятого.Вставить("Статус", СтрокаТаблицыВыполненияЗадания);
		СтатусСамозанятого.Вставить("Ошибка", ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Ошибка"));
		СтатусСамозанятого.Вставить("Баланс", ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Баланс"));
	Иначе
		СтатусСамозанятого = Неопределено;
	КонецЕсли;
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Возврат СтатусСамозанятого;
	
КонецФункции

#КонецОбласти

#Область СписокОпций

Процедура ПолучитьСписокОпцийОшибка(КраткоеПредставлениеОшибки, ПодробноеПредставлениеОшибки, Источник)
	
	ИнтеграцияСтатусСамозанятогоВызовСервера.ЗаписатьОшибку(КраткоеПредставлениеОшибки, ПодробноеПредставлениеОшибки);
	Если ЗначениеЗаполнено(КраткоеПредставлениеОшибки) Тогда
		Оповестить(ИменаСобытий().СписокОпцийОшибка, КраткоеПредставлениеОшибки, Источник);
	Иначе
		Оповестить(ИменаСобытий().СписокОпцийОшибка, НСтр("ru = 'Неизвестная ошибка'"), Источник);
	КонецЕсли;
	
КонецПроцедуры

Функция ИзвлечьСписокОпций(АдресРезультата)
	
	Если Не ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СписокОпций = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(СписокОпций) <> Тип("Структура") Тогда
		СписокОпций = Неопределено;
	КонецЕсли;
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Возврат СписокОпций;
	
КонецФункции

#КонецОбласти

#Область РеквизитыОбслуживающейОрганизации

Процедура ПолучитьРеквизитыОбслуживающейОшибка(КраткоеПредставлениеОшибки, ПодробноеПредставлениеОшибки, Источник)
	
	ИнтеграцияСтатусСамозанятогоВызовСервера.ЗаписатьОшибку(КраткоеПредставлениеОшибки, ПодробноеПредставлениеОшибки);
	Если ЗначениеЗаполнено(КраткоеПредставлениеОшибки) Тогда
		Оповестить(ИменаСобытий().ОбслуживающаяОрганизацияОшибка, КраткоеПредставлениеОшибки, Источник);
	Иначе
		Оповестить(ИменаСобытий().ОбслуживающаяОрганизацияОшибка, НСтр("ru = 'Неизвестная ошибка'"), Источник);
	КонецЕсли;
	
КонецПроцедуры

Функция ИзвлечьРеквизитыОбслуживающейОрганизации(АдресРезультата)
	
	Если Не ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыОбслуживающейОрганизации = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(РеквизитыОбслуживающейОрганизации) <> Тип("Структура") Тогда
		РеквизитыОбслуживающейОрганизации = Неопределено;
	КонецЕсли;
	УдалитьИзВременногоХранилища(АдресРезультата);
	Возврат РеквизитыОбслуживающейОрганизации;
	
КонецФункции

#КонецОбласти

#КонецОбласти
