
#Область ПрограммныйИнтерфейс

// Возвращает текст гиперссылки для открытия формы ПечатьАртикулов обработки ПанелиАдминистрированияБП
//
// Возвращаемое значение
//  Строка - текст гиперссылки
//
Функция ГиперссылкаФормыНастройкиПечатиАртикулов() Экспорт
	
	Возврат "e1cib/data/Обработка.ПанельАдминистрированияБП.Форма.ПечатьАртикулов";
	
КонецФункции

// Проверяет по имени подключаемой команды, что это вызов отчета Реестр документов.
//
// Параметры:
//   ИмяКоманды - Строка - имя подключаемой команды
//
// Возвращаемое значение
//  Булево - результат проверки: Истина - это Реестр документов, Ложь - другая команда.
//
Функция ЭтоИмяКомандыРеестрДокументов(ИмяКоманды) Экспорт
	
	Результат = Ложь;
	
	СоставИнтерфейсаКоманды = СтрРазделить(ИмяКоманды, "_", Ложь);
	КоличествоЭлементов = СоставИнтерфейсаКоманды.Количество();
	Если КоличествоЭлементов > 0 И ВРЕГ(СоставИнтерфейсаКоманды[0]) = "ПОДМЕНЮПЕЧАТЬОБЫЧНОЕ" Тогда
		Для инд = 1 По КоличествоЭлементов - 1 Цикл
			Элемент = ВРЕГ(СоставИнтерфейсаКоманды[инд]);
			Если Элемент = "РЕЕСТР" Или СтрНачинаетсяС(Элемент, "РЕЕСТРДОКУМЕНТОВ") Тогда
				Результат = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
