#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Описывает свойства отчета (манифест), декларирующий поддержанные в нем возможности подсистемы,
// включая реализованный программный интерфейс.
//
Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	
	Манифест = Новый Структура;
	Манифест.Вставить("ИспользоватьПередКомпоновкойМакета", Истина);
	Манифест.Вставить("ИспользоватьПослеКомпоновкиМакета",  Истина);
	Манифест.Вставить("ИспользоватьПриВыводеЗаголовка",     Истина);
	Манифест.Вставить("ИспользоватьПослеВыводаРезультата",  Истина);
	СправкиРасчеты.УстановитьОтчетНеИспользуетНаборыСуммовыхПоказателей(Манифест);

	Возврат Манифест;

КонецФункции

// Обработчик события подсистемы БухгалтерскиеОтчеты.
// Вызов определяется параметром ИспользоватьПередКомпоновкойМакета.
//
// Параметры:
//  Контекст  - См. НовыйКонтекстФормированияОтчета
//  Схема - СхемаКомпоновкиДанных - схема отчета.
//  КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - описание связи настроек и схемы отчета.
//
Процедура ПередКомпоновкойМакета(Контекст, Схема, КомпоновщикНастроек) Экспорт
	
	Если ЗначениеЗаполнено(Контекст.НачалоПериода) Тогда
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", НачалоДня(Контекст.НачалоПериода));
	КонецЕсли;
	Если ЗначениеЗаполнено(Контекст.КонецПериода) Тогда
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", КонецДня(Контекст.КонецПериодаДата));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контекст.Организации) Тогда
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
			КомпоновщикНастроек, "Организации", Контекст.Организации);
	КонецЕсли;
		
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СчетаУчетаРБП", КлассификацияЗадолженности.СчетаУчетаРБП());
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СчетаУчетаНМА", БухгалтерскийУчет.СчетаУчетаНазначенияИспользованияНМА());
	
	// добавляем в контекст параметры для вывода группировок в табличный документ и оформления заголовков таблицы
	Контекст.ОписаниеШапкиТаблиц = ОписаниеШапкиТаблиц(Контекст);
	
	// в зависимости от параметров настраиваем структуру отчета
	ИзменитьСтруктуруОтчета(КомпоновщикНастроек, Контекст.ОписаниеШапкиТаблиц);

КонецПроцедуры

// Обработчик события подсистемы БухгалтерскиеОтчеты.
// Вызов определяется параметром ИспользоватьПослеКомпоновкиМакета.
//
// Параметры:
//  Контекст - См. НовыйКонтекстФормированияОтчета
//  МакетКомпоновки - МакетКомпоновкиДанных - сформированный макет компоновки данных.
//
Процедура ПослеКомпоновкиМакета(Контекст, МакетКомпоновки) Экспорт
	
	ДобавитьМакетыТаблиц(Контекст.ОписаниеШапкиТаблиц, МакетКомпоновки);
	
	Для Каждого ОписаниеШапки Из Контекст.ОписаниеШапкиТаблиц Цикл
		ОписаниеШапки = ОписаниеШапки.Значение;
		Если ОписаниеШапки.Макеты <> Неопределено Тогда
			
			РазмещениеМакетовШапкиТаблицы = Новый Соответствие;
			Для Каждого Макет Из ОписаниеШапки.Макеты Цикл
				Если Макет.Значение <> ИмяИтогиГруппировки() Тогда
					РазмещениеМакетовШапкиТаблицы.Вставить(Макет.Ключ, Макет.Значение);
				КонецЕсли;
			КонецЦикла;
			
			Если ОписаниеШапки.Графы <> Неопределено Тогда
				СправкиРасчеты.НастроитьГрафыОтчета(МакетКомпоновки, ОписаниеШапки.Графы, РазмещениеМакетовШапкиТаблицы);
			КонецЕсли;
			
			ОбработатьМакетыТаблиц(МакетКомпоновки, ОписаниеШапки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Обработчик события подсистемы БухгалтерскиеОтчеты.
// Вызов определяется параметром ИспользоватьПослеВыводаРезультата.
//
// Параметры:
//  Контекст - См. НовыйКонтекстФормированияОтчета
//  Результат - ТабличныйДокумент - табличный документ с сформированным отчетом.
//
Процедура ПослеВыводаРезультата(Контекст, Результат) Экспорт
	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	БухгалтерскиеОтчетыВызовСервера.ОбработкаРезультатаОтчета(Контекст.ИдентификаторОтчета, Результат);

КонецПроцедуры

// Обработчик события подсистемы БухгалтерскиеОтчеты.
// Вызов определяется параметром ИспользоватьПриВыводеЗаголовка.
//
// Параметры:
//  Контекст - См. НовыйКонтекстФормированияОтчета
//  КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - описание связи настроек и схемы отчета.
//  Результат - ТабличныйДокумент - табличный документ с сформированным отчетом.
//
Процедура ПриВыводеЗаголовка(Контекст, КомпоновщикНастроек, Результат) Экспорт
	
	ВывестиШапкуОтчета(Результат, Контекст, КомпоновщикНастроек);
	
КонецПроцедуры 

// Возвращает параметры расшифровки ячейки отчета.
//
// Параметры:
//  Адрес - Строка - Адрес временного хранилища с данными расшифровки отчета.
//  ИдентификаторРасшифровки - ИдентификаторРасшифровкиКомпоновкиДанных
//
// Возвращаемое значение:
//  Структура - Содержит ключи (опционально):
//   * ОткрытьОбъект - Булево - Если Истина, то необходимо открыть указанный объект.
//   * ОткрытьФормуПечати - Булево - Если Истина, то необходимо открыть открыть печатную форму по параметрам.
//   * Значение - Произвольный - Значение расшифровывающего объекта.
//   * ПараметрыОткрытияФормы - Структура - параметры, необходимые для формирования печатной формы.
//
Функция ПараметрыРасшифровкиОтчета(Адрес, ИдентификаторРасшифровки) Экспорт
	
	ПараметрыРасшифровки = Новый Структура;
	
	// Заполним соответствие полей которые мы хотим получить из данных расшифровки
	ДанныеОтчета = ПолучитьИзВременногоХранилища(Адрес);
	
	ЗначениеРасшифровки = ДанныеОтчета.ДанныеРасшифровки.Элементы[ИдентификаторРасшифровки];
	Если ТипЗнч(ЗначениеРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда 
		ПолеРасшифровки = ЗначениеРасшифровки.ПолучитьПоля()[0];
		
		Если ЗначениеЗаполнено(ПолеРасшифровки.Значение) И ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПолеРасшифровки.Значение)) Тогда
			ПараметрыРасшифровки.Вставить("ОткрытьОбъект", Истина);
			ПараметрыРасшифровки.Вставить("Значение",  ПолеРасшифровки.Значение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПараметрыРасшифровки;
	
КонецФункции

// Конструктор коллекции, описывающий контекст и данные отчета
// При формировании отчета передается параметром согласно манифесту
//
// Возвращаемое значение:
//  Структура
//
Функция НовыйКонтекстФормированияОтчета() Экспорт 
	
	// Инициализация коллекции
	Контекст = Новый Структура;
	Контекст.Вставить("ИдентификаторОтчета");
	Контекст.Вставить("СинонимОтчета");
	
	Контекст.Вставить("СхемаКомпоновкиДанных");
	Контекст.Вставить("НастройкиКомпоновкиДанных");
	
	Контекст.Вставить("ДанныеРасшифровки");
	
	Контекст.Вставить("Организация");
	Контекст.Вставить("НачалоПериода");
	Контекст.Вставить("КонецПериода");
	Контекст.Вставить("КонецПериодаДата");
	
	Контекст.Вставить("ПредставлениеПериода");
	
	Контекст.Вставить("РежимРасшифровки",                  Ложь);
	Контекст.Вставить("ВключатьОбособленныеПодразделения", Ложь);
	Контекст.Вставить("ВыводитьЕдиницуИзмерения",          Ложь); // Соответствует флагу "Единица измерения" в форме справки-расчета на закладке "Оформление".
	Контекст.Вставить("ВыводитьЗаголовок",                 Ложь); // Соответствует флагу "Заголовок" в форме справки-расчета на закладке "Оформление".
	Контекст.Вставить("ВыводитьПодвал",                    Ложь); // Соответствует флагу "Подписи" в форме справки-расчета на закладке "Оформление".
	Контекст.Вставить("ОтветственноеЛицо");
	Контекст.Вставить("ИспользуетсяВалютныйУчет", БухгалтерскийУчетПереопределяемый.ИспользоватьВалютныйУчет());
	Контекст.Вставить("ЕстьДисконтирование",      УчетнаяПолитика.ПоддерживаетсяДисконтированиеОбязательств());

	Контекст.Вставить("ОписаниеШапкиТаблиц");
	Контекст.Вставить("Организации", Новый Массив);
	
	Возврат Контекст;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выводит шапку отчета.
//
// Параметры:
//  Результат - ТабличныйДокумент - табличный документ, в который выводится отчет
//  Контекст - см. НовыйКонтекстФормированияОтчета
//  КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - описание связи настроек и схемы отчета
//
Процедура ВывестиШапкуОтчета(Результат, Контекст, КомпоновщикНастроек)
	
	Макет = ПолучитьОбщийМакет("ОбщиеОбластиСтандартногоОтчета");
	
	// Организация
	ОбластьВывода = Макет.ПолучитьОбласть("Организация");
	ОбластьВывода.Параметры.НазваниеОрганизации = БухгалтерскиеОтчетыВызовСервера.ПолучитьТекстОрганизация(
		Контекст.Организация,
		Контекст.ВключатьОбособленныеПодразделения,
		Контекст.КонецПериодаДата);
	Результат.Вывести(ОбластьВывода);
	
	// Название отчета
	ОбластьВывода = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ОбластьВывода.Параметры.ЗаголовокОтчета = ЗаголовокОтчета(Контекст);
	Результат.Вывести(ОбластьВывода);
	
	// Организация и название образуют заголовок
	ОбластьЗаголовка = Результат.Область(1, , Результат.ВысотаТаблицы);
	ОбластьЗаголовка.Имя = "Заголовок";
	
	// Единица измерения
	Если Контекст.Свойство("ВыводитьЕдиницуИзмерения")
		И Контекст.ВыводитьЕдиницуИзмерения Тогда
		// Единица измерения - рубль
		ОбластьВывода = Макет.ПолучитьОбласть("ОписаниеЕдиницыИзмерения");
		Результат.Вывести(ОбластьВывода);
	КонецЕсли;
	
	// Отбор
	ТекстОтбор = Строка(КомпоновщикНастроек.Настройки.Отбор);
	
	Если Не ПустаяСтрока(ТекстОтбор) Тогда 
		ОбластьОписаниеНастроек = Макет.ПолучитьОбласть("ОписаниеНастроек");
		ОбластьОписаниеНастроек.Параметры.ИмяНастроекОтчета      = НСтр("ru = 'Отбор:'");
		ОбластьОписаниеНастроек.Параметры.ОписаниеНастроекОтчета = ТекстОтбор;
		
		Результат.Вывести(ОбластьОписаниеНастроек);
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаголовокОтчета(Контекст)
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 на %2", Контекст.СинонимОтчета, Контекст.ПредставлениеПериода);

КонецФункции

Процедура ДобавитьМакетыТаблиц(ОписаниеШапкиТаблиц, МакетКомпоновки)
	
	Для Каждого Тело Из МакетКомпоновки.Тело Цикл
		
		// Обходим элементы, выводимые на верхнем уровне.
		// Макеты каждой таблицы храним списком для дальнешей обработки заголовков и добавления граф
		Если ТипЗнч(Тело) = Тип("ТаблицаМакетаКомпоновкиДанных") Тогда
			
			Макеты = Новый Соответствие;
			Если ЗначениеЗаполнено(Тело.МакетШапки) Тогда
				Макеты.Вставить(Тело.МакетШапки, ИмяГруппировка());
			КонецЕсли;
			Если ЗначениеЗаполнено(Тело.МакетИтоговСтрок) Тогда
				Макеты.Вставить(Тело.МакетИтоговСтрок, ИмяРесурсы());
			КонецЕсли;
			Если ЗначениеЗаполнено(Тело.Строки) Тогда
				ИмяМакетаПодвала = Тело.Строки[0].МакетПодвала.Макет;
				Если ЗначениеЗаполнено(ИмяМакетаПодвала) Тогда
					Макеты.Вставить(ИмяМакетаПодвала, ИмяИтогиГруппировки());
				КонецЕсли;
			КонецЕсли;
			
			ОписаниеШапки = ОписаниеШапкиТаблиц[Тело.Имя];
			Если ОписаниеШапки <> Неопределено Тогда
				ОписаниеШапки.Макеты = Макеты;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьМакетыТаблиц(МакетКомпоновки, ОписаниеШапки)
	
	Для Каждого ОписаниеМакетаОбласти Из ОписаниеШапки.Макеты Цикл
		
		ОписаниеМакета = МакетКомпоновки.Макеты.Найти(ОписаниеМакетаОбласти.Ключ);
		
		Если ОписаниеМакета = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// В табличном документе в шапке таблицы формируется первой строкой заголовок "Итого", группирующий поля ресурсов
		// Так как в шапке он не нужен, то удаляем первый элемент из МакетШапки и МакетИтоговСтрок,
		// чтоб не было смещения по колонкам группировки и ресурсов
		Если ОписаниеМакетаОбласти.Значение <> ИмяИтогиГруппировки() Тогда
			ОписаниеМакета.Макет.Удалить(0);
		КонецЕсли;
		
		//Центрируем заголовки ресурсов во всех ячейках шапки
		Если ОписаниеМакетаОбласти.Значение = ИмяРесурсы() Тогда
			Для Каждого Строка Из ОписаниеМакета.Макет Цикл
				Для Каждого Ячейка Из Строка.Ячейки Цикл
					Ячейка.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Центр);
					Ячейка.Оформление.УстановитьЗначениеПараметра("ВертикальноеПоложение",   ВертикальноеПоложение.Верх);
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;

		Если ОписаниеМакетаОбласти.Значение <> ИмяИтогиГруппировки() Тогда
			// Добавляем новые строки с заголовками Таблиц для вывода в табличный документ
			ЭталоннаяСтрока = ОписаниеМакета.Макет[0];
			ДобавитьСтрокуНадТаблицей(ОписаниеМакетаОбласти, ОписаниеМакета, ОписаниеШапки.ЗаголовокРаздела, ЭталоннаяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСтрокуНадТаблицей(ОписаниеМакетаОбласти, ОписаниеМакета, Заголовок, ЭталоннаяСтрока)
	
	Если Заголовок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = ОписаниеМакета.Макет.Вставить(0,Тип("СтрокаТаблицыОбластиКомпоновкиДанных"));
	
	НоваяСтрока.ИдентификаторТаблицы = ЭталоннаяСтрока.ИдентификаторТаблицы;
	Если ОписаниеМакетаОбласти.Значение <> ИмяРесурсы() Тогда
		
		НоваяЯчейка = НоваяСтрока.Ячейки.Добавить();
		Поле = НоваяЯчейка.Элементы.Добавить(Тип("ПолеОбластиКомпоновкиДанных"));
		Поле.Значение = Заголовок.Текст;
		
		Для Каждого Параметр Из Заголовок.ПараметрыОформления Цикл
			НоваяЯчейка.Оформление.УстановитьЗначениеПараметра(
				Параметр.Ключ,
				Параметр.Значение);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает данные для оформления заголовков таблицы
// Параметры:
//  Контекст  - См. НовыйКонтекстФормированияОтчета
//
// Возвращаемое значение:
//  Структура:
//   Ключ - Строка - имя Таблицы в структуре настроек Схемы компоновки данных
//   Значение - См. НовыйШапкаТаблицы
//
Функция ОписаниеШапкиТаблиц(Контекст)

	ОписаниеШапкиТаблиц = Новый Структура;
	
	ШрифтРаздела    = Новый Шрифт(, 11);
	Отступ = 5;
	
	ТекстыЗаголовковКолонок = ТекстыЗаголовковКолонок(Контекст);
	
	ШаблонРаздела = НСтр("ru = 'Способ списания: %1'");
	
	ПараметрыОформления = Новый Структура;
	ПараметрыОформления.Вставить("Шрифт", ШрифтРаздела);
	ПараметрыОформления.Вставить("ОтступСверху", Отступ);
	ПараметрыОформления.Вставить("ОтступСнизу",  Отступ);
	
	// Способ списания по месяцам
	ЗаголовокРаздела = НовыйЗаголовокТаблицы();
	ЗаголовокРаздела.Текст= СтрШаблон(ШаблонРаздела, Строка(Перечисления.СпособыПризнанияРасходов.ПоМесяцам));
	ЗаголовокРаздела.ПараметрыОформления = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыОформления);

	ШапкаТаблицы = НовыйШапкаТаблицы();
	ШапкаТаблицы.Графы               = ГрафыТаблицыСпособПоМесяцамДням();
	ШапкаТаблицы.ЗаголовкиКолонок    = ЗаголовкиКолонокТаблицыСпособПоМесяцам(ТекстыЗаголовковКолонок);
	ШапкаТаблицы.ЗаголовокРаздела    = ЗаголовокРаздела;
	ОписаниеШапкиТаблиц.Вставить("СпособСписанияПоМесяцам", ШапкаТаблицы);
	
	// Способ списания по дням
	ЗаголовокРаздела = НовыйЗаголовокТаблицы();
	ЗаголовокРаздела.Текст= СтрШаблон(ШаблонРаздела, Строка(Перечисления.СпособыПризнанияРасходов.ПоКалендарнымДням));
	ЗаголовокРаздела.ПараметрыОформления = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыОформления);
	
	ШапкаТаблицы = НовыйШапкаТаблицы();
	ШапкаТаблицы.Графы               = ГрафыТаблицыСпособПоМесяцамДням();
	ШапкаТаблицы.ЗаголовкиКолонок    = ЗаголовкиКолонокТаблицыСпособПоДням(ТекстыЗаголовковКолонок);
	ШапкаТаблицы.ЗаголовокРаздела    = ЗаголовокРаздела;
	ОписаниеШапкиТаблиц.Вставить("СпособСписанияПоДням", ШапкаТаблицы);
	
	// Способ списания в особом порядке
	ЗаголовокРаздела = НовыйЗаголовокТаблицы();
	ЗаголовокРаздела.Текст= СтрШаблон(ШаблонРаздела, Строка(Перечисления.СпособыПризнанияРасходов.ВОсобомПорядке));
	ЗаголовокРаздела.ПараметрыОформления = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыОформления);

	ШапкаТаблицы = НовыйШапкаТаблицы();
	ШапкаТаблицы.Графы               = ГрафыТаблицыСпособВОсобомПорядке();
	ШапкаТаблицы.ЗаголовкиКолонок    = ЗаголовкиКолонокТаблицыСпособВОсобомПорядке(ТекстыЗаголовковКолонок);
	ШапкаТаблицы.ЗаголовокРаздела    = ЗаголовокРаздела;
	ОписаниеШапкиТаблиц.Вставить("СпособСписанияВОсобомПорядке", ШапкаТаблицы);
	
	Возврат ОписаниеШапкиТаблиц;
	
КонецФункции

Функция НовыйШапкаТаблицы()

	Шапка = Новый Структура;
	Шапка.Вставить("Макеты");
	Шапка.Вставить("Графы");
	Шапка.Вставить("ЗаголовкиКолонок");
	Шапка.Вставить("ЗаголовокРаздела"); // см. НовыйЗаголовок
	
	Возврат Шапка;
	
КонецФункции

Функция НовыйЗаголовокТаблицы()

	Заголовок = Новый Структура;
	Заголовок.Вставить("Текст");
	Заголовок.Вставить("ПараметрыОформления", Новый Соответствие);

	Возврат Заголовок;
	
КонецФункции

Функция НовыйЗаголовкиКолонок()

	ЗаголовкиКолонок = Новый Структура;
	ЗаголовкиКолонок.Вставить("Группы"); //ГруппаВыбранныхПолейКомпоновкиДанных
	ЗаголовкиКолонок.Вставить("Поля"); //ВыбранноеПолеКомпоновкиДанных
	
	Возврат ЗаголовкиКолонок;
	
КонецФункции

Функция ТекстыЗаголовковКолонок(Контекст)
	
	ПараметрыТекста = Новый Структура;
	ПараметрыТекста.Вставить("ДатаНачалаКраткосрочногоПериода", Формат(КонецМесяца(Контекст.КонецПериодаДата) + 1,"ДЛФ=D"));
	ПараметрыТекста.Вставить("ДатаНачалаДолгосрочногоПериода", Формат(КонецМесяца(ДобавитьМесяц(Контекст.КонецПериодаДата, 12)) + 1,"ДЛФ=D"));
		
	ТекстыЗаголовков = Новый Структура;
	ТекстыЗаголовков.Вставить("КоличествоМесяцев",           НСтр("ru = 'Количество месяцев'"));
	ТекстыЗаголовков.Вставить("КоличествоДней",              НСтр("ru = 'Количество дней'"));
	ТекстыЗаголовков.Вставить("КоличествоМесяцевДней", СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
																	НСтр("ru = 'с [ДатаНачалаКраткосрочногоПериода] до даты,
																	|указанной в гр. 5'"),
																	ПараметрыТекста));
	ТекстыЗаголовков.Вставить("КоличествоМесяцевДнейДолгосрочногоПериода", СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
																	НСтр("ru = 'с [ДатаНачалаДолгосрочногоПериода] до даты,
																	|указанной в гр.5'"),
																	ПараметрыТекста));
	ТекстыЗаголовков.Вставить("Сумма",              НСтр("ru = 'Сумма задолженности'"));
	ТекстыЗаголовков.Вставить("СуммаДолгосрочная",  НСтр("ru = 'Сумма долгосрочной задолженности'"));
	ТекстыЗаголовков.Вставить("СуммаКраткосрочная", НСтр("ru = 'Сумма краткосрочной задолженности'"));
	
	Возврат ТекстыЗаголовков;
	
КонецФункции

Функция ЗаголовкиКолонокТаблицыСпособПоМесяцам(ТекстыЗаголовков)
	
	ЗаголовкиКолонок = НовыйЗаголовкиКолонок();
	
	// графы колонок - см. ГрафыТаблицыСпособПоМесяцамДням
	Формулы = Новый Структура;
	Формулы.Вставить("СуммаДолгосрочная",   НСтр("ru = '(гр.8 * гр.7 / гр.6)'"));
	Формулы.Вставить("СуммаКраткосрочная",  НСтр("ru = '(гр.8 - гр.9)'"));
	
	ТекстыСФормулами = ТекстыСФормулами(ТекстыЗаголовков, Формулы);
	
	// поля
	Поля = Новый Структура;
	Поля.Вставить("КоличествоМесяцевДней",  ТекстыСФормулами.КоличествоМесяцевДней);
	Поля.Вставить("КоличествоМесяцевДнейДолгосрочногоПериода",  ТекстыСФормулами.КоличествоМесяцевДнейДолгосрочногоПериода);
	Поля.Вставить("Сумма",  ТекстыСФормулами.Сумма);
	Поля.Вставить("СуммаДолгосрочная",  ТекстыСФормулами.СуммаДолгосрочная);
	Поля.Вставить("СуммаКраткосрочная", ТекстыСФормулами.СуммаКраткосрочная);
	ЗаголовкиКолонок.Поля = Поля;
	
	// группы
	Группы = Новый Массив;

	// Количество месяцев
	ОписаниеПоляГруппы = Новый Структура;
	ОписаниеПоляГруппы.Вставить("Заголовок", ТекстыСФормулами.КоличествоМесяцев);
	ОписаниеПоляГруппы.Вставить("ПолеГруппы", "КоличествоМесяцевДней");
	Группы.Добавить(ОписаниеПоляГруппы);
	ЗаголовкиКолонок.Группы = Группы;
	
	Возврат ЗаголовкиКолонок;

КонецФункции

Функция ЗаголовкиКолонокТаблицыСпособПоДням(ТекстыЗаголовков)
	
	ЗаголовкиКолонок = НовыйЗаголовкиКолонок();
	
	Формулы = Новый Структура;
	Формулы.Вставить("СуммаДолгосрочная",   НСтр("ru = '(гр.8 * гр.7 / гр.6)'"));
	Формулы.Вставить("СуммаКраткосрочная",  НСтр("ru = '(гр.8 - гр.9)'"));
	
	ТекстыСФормулами = ТекстыСФормулами(ТекстыЗаголовков, Формулы);
	
	// поля
	Поля = Новый Структура;
	Поля.Вставить("КоличествоМесяцевДней",  ТекстыСФормулами.КоличествоМесяцевДней);
	Поля.Вставить("КоличествоМесяцевДнейДолгосрочногоПериода",  ТекстыСФормулами.КоличествоМесяцевДнейДолгосрочногоПериода);
	Поля.Вставить("Сумма",  ТекстыСФормулами.Сумма);
	Поля.Вставить("СуммаДолгосрочная",  ТекстыСФормулами.СуммаДолгосрочная);
	Поля.Вставить("СуммаКраткосрочная", ТекстыСФормулами.СуммаКраткосрочная);
	ЗаголовкиКолонок.Поля = Поля;
	
	// группы
	Группы = Новый Массив;

	// Количество месяцев
	ОписаниеПоляГруппы = Новый Структура;
	ОписаниеПоляГруппы.Вставить("Заголовок", ТекстыСФормулами.КоличествоДней);
	ОписаниеПоляГруппы.Вставить("ПолеГруппы", "КоличествоМесяцевДней");
	Группы.Добавить(ОписаниеПоляГруппы);
	ЗаголовкиКолонок.Группы = Группы;
	
	Возврат ЗаголовкиКолонок;

КонецФункции

Функция ЗаголовкиКолонокТаблицыСпособВОсобомПорядке(ТекстыЗаголовков)
	
	ЗаголовкиКолонок = НовыйЗаголовкиКолонок();
	
	// поля
	Поля = Новый Структура;
	Поля.Вставить("Сумма",  ТекстыЗаголовков.Сумма);
	Поля.Вставить("СуммаДолгосрочная",  ТекстыЗаголовков.СуммаДолгосрочная);
	Поля.Вставить("СуммаКраткосрочная", ТекстыЗаголовков.СуммаКраткосрочная);
	ЗаголовкиКолонок.Поля = Поля;
	
	Возврат ЗаголовкиКолонок;

КонецФункции

// Дополняем тексты заголовков формулами
//
Функция ТекстыСФормулами(ТекстыЗаголовков, Формулы)
	
	Тексты = Новый Структура;
	Для Каждого ТекстЗаголовка Из ТекстыЗаголовков Цикл
		ЧастиЗаголовка = Новый Массив;
		ЧастиЗаголовка.Добавить(ТекстЗаголовка.Значение);
		Если Формулы.Свойство(ТекстЗаголовка.Ключ) Тогда
			ЧастиЗаголовка.Добавить(Формулы[ТекстЗаголовка.Ключ]);
		КонецЕсли;
		Тексты.Вставить(ТекстЗаголовка.Ключ, СтрСоединить(ЧастиЗаголовка, Символы.ПС));
	КонецЦикла;
	
	Возврат Тексты;
	
КонецФункции

Процедура ИзменитьСтруктуруОтчета(КомпоновщикНастроек, ОписаниеШапкиТаблиц)
	
	// Ключ ОписаниеШапкиТаблиц - имя Таблицы в структуре настроек Схемы компоновки данных
	Для Каждого Таблица Из КомпоновщикНастроек.Настройки.Структура Цикл
		
		Если ТипЗнч(Таблица) <> Тип("ТаблицаКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеШапки = ОписаниеШапкиТаблиц[Таблица.Имя];
		Если ОписаниеШапки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОписаниеШапки.ЗаголовкиКолонок = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаголовкиПолей = ОписаниеШапки.ЗаголовкиКолонок.Поля;
		ЗаголовкиГрупп = ОписаниеШапки.ЗаголовкиКолонок.Группы;
		
		УстановитьЗаголовкиКолонок(Таблица.Строки, ЗаголовкиГрупп, ЗаголовкиПолей);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЗаголовкиКолонок(ЭлементыТаблицы, ЗаголовкиГрупп, ЗаголовкиПолей)
	
	Для Каждого ЭлементТаблицы Из ЭлементыТаблицы Цикл
		
		Для Каждого Поле Из ЭлементТаблицы.Выбор.Элементы Цикл
			
			Если Не Поле.Использование Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(Поле) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
				Для Каждого ПолеЭлемента Из Поле.Элементы Цикл
					УстановитьЗаголовокПоля(ПолеЭлемента, ЗаголовкиПолей);
				КонецЦикла;
				
				УстановитьЗаголовокГруппы(Поле, ЗаголовкиГрупп);
			КонецЕсли;
			
			УстановитьЗаголовокПоля(Поле, ЗаголовкиПолей);
			
		КонецЦикла;
		
		// Используется рекурсия для случая:
		// Если в группировке и в детальных записях одинаковый набор полей компоновки данных объединен в группы
		// и эти поля должны находиться в колонках друг под другом, тогда таким группам устанавливается одинаковый заголовок.
		// В ином случае группа детальных записей пристыковывается справа в табличном документе.
		Если ЗначениеЗаполнено(ЭлементТаблицы.Структура)Тогда
			УстановитьЗаголовкиКолонок(ЭлементТаблицы.Структура, ЗаголовкиГрупп, ЗаголовкиПолей);
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

Процедура УстановитьЗаголовокГруппы(ПолеГруппы, ЗаголовкиГрупп)
	
	Если ЗаголовкиГрупп = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из ЗаголовкиГрупп Цикл
		Для Каждого ПолеЭлемента Из ПолеГруппы.Элементы Цикл
			Если Строка(ПолеЭлемента.Поле) = Элемент.ПолеГруппы Тогда
				ПолеГруппы.Заголовок = Элемент.Заголовок;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЗаголовокПоля(ПолеЭлемента, ИменаПолей)
	
	Если ТипЗнч(ПолеЭлемента) = Тип("ВыбранноеПолеКомпоновкиДанных")Тогда
		ИмяПоля = СтрЗаменить(Строка(ПолеЭлемента.Поле), ".", "");
		Если ИменаПолей.Свойство(ИмяПоля) Тогда
			ПолеЭлемента.Заголовок = ИменаПолей[ИмяПоля];
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ГрафыТаблицыСпособПоМесяцамДням()
	
	Разделы = Новый Соответствие;
	
	// Заголовки группировок
	ГрафыРаздела = Новый Массив;
	ГрафыРаздела.Добавить(НСтр("ru = '1'"));  // Счет
	ГрафыРаздела.Добавить(НСтр("ru = '2'"));  // Аналитика
	ГрафыРаздела.Добавить(НСтр("ru = '3'"));  // СтатьяРБП
	ГрафыРаздела.Добавить(НСтр("ru = '4'"));  // Дата начала списания
	ГрафыРаздела.Добавить(НСтр("ru = '5'"));  // Дата окончания списания
	Разделы.Вставить(
		ИмяГруппировка(),
		ГрафыРаздела);
		
	//Заголовки ресурсов
	ГрафыРаздела = Новый Массив;
	ГрафыРаздела.Добавить(НСтр("ru = '6'"));  // Количество месяцев / дней текущего периода
	ГрафыРаздела.Добавить(НСтр("ru = '7'"));  // Количество месяцев / дней долгосрочного периода
	ГрафыРаздела.Добавить(НСтр("ru = '8'"));  // Сумма задолженности
	ГрафыРаздела.Добавить(НСтр("ru = '9'"));  // Сумма долгосрочной задолженности
	ГрафыРаздела.Добавить(НСтр("ru = '10'"));  // Сумма краткосрочной задолженности
	
	Разделы.Вставить(
		ИмяРесурсы(),
		ГрафыРаздела);
		
	Возврат Разделы;
	
КонецФункции

Функция ГрафыТаблицыСпособВОсобомПорядке()
	
	Разделы = Новый Соответствие;
	
	// Заголовки группировок
	ГрафыРаздела = Новый Массив;
	ГрафыРаздела.Добавить(НСтр("ru = '1'"));  // Счет
	ГрафыРаздела.Добавить(НСтр("ru = '2'"));  // Аналитика
	ГрафыРаздела.Добавить(НСтр("ru = '3'"));  // СтатьяРБП
	ГрафыРаздела.Добавить(НСтр("ru = '4'"));  // Дата начала списания
	ГрафыРаздела.Добавить(НСтр("ru = '5'"));  // Дата окончания списания
	Разделы.Вставить(
		ИмяГруппировка(),
		ГрафыРаздела);
		
	//Заголовки ресурсов
	ГрафыРаздела = Новый Массив;
	ГрафыРаздела.Добавить(НСтр("ru = '6'"));  // Сумма задолженности
	ГрафыРаздела.Добавить(НСтр("ru = '7'"));  // Сумма долгосрочной задолженности
	ГрафыРаздела.Добавить(НСтр("ru = '8'"));  // Сумма краткосрочной задолженности
	
	Разделы.Вставить(
		ИмяРесурсы(),
		ГрафыРаздела);
		
	Возврат Разделы;
	
КонецФункции

// Используется для соответствия макетов таблиц в структуре настроек Схемы компоновки данных
//
Функция ИмяГруппировка()
	
	Возврат "Группировка";
	
КонецФункции

// Используется для соответствия макетов таблиц в структуре настроек Схемы компоновки данных
//
Функция ИмяРесурсы()
	
	Возврат "Ресурсы";
	
КонецФункции

// Используется для соответствия макетов таблиц в структуре настроек Схемы компоновки данных
//
Функция ИмяИтогиГруппировки()
	
	Возврат "ИтогиГруппировки";
	
КонецФункции

#КонецОбласти

#КонецЕсли