#Область ОписаниеПеременных

&НаКлиенте
Перем ОткрытыеФормы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступенСервис1СКабинетСотрудника = 
		ПравоДоступа("Просмотр", Метаданные.Обработки.ИнтеграцияКабинетСотрудника);
	
	Элементы.Сервис1СКабинетСотрудника.Видимость = ДоступенСервис1СКабинетСотрудника;
	
	МобильныйКлиентАдаптацияФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкиЗарплаты(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("ОбщаяФорма.НастройкиЗарплаты",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛица(Команда)

	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.ФизическиеЛица.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатныеПроекты(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.ЗарплатныеПроекты.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Сервис1СКабинетСотрудника(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Обработка.ИнтеграцияКабинетСотрудника.Форма.Интеграция",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Должности(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.Должности.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикиРаботы(Команда)

	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.Календари.Форма.ФормаСпискаПростая",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаЭДОБЗК(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Обработка.ПанельНастроекЭДОБЗК.Форма",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Сотрудники(Команда)
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.Сотрудники.Форма.ФормаСписка", ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиВоинскогоУчета(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("РегистрСведений.НастройкиВоинскогоУчета.Форма.НастройкиВоинскогоУчета",
		ЭтотОбъект, , , ОткрытыеФормы);

КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанели(ЭтотОбъект,
		"НастройкиЗарплаты,Сотрудники,ФизическиеЛица,Должности");
	
КонецПроцедуры

#КонецОбласти
