#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПытатьсяПодключитьсяПриПроверке = Ложь;
	ПодключеноКСервисуРаспознавания = РаспознаваниеДокументов.ПодключеноКСервисуРаспознавания(ПытатьсяПодключитьсяПриПроверке);
	АккаунтАктивирован = РаспознаваниеДокументов.АккаунтАктивирован();
	ТекущиеНастройки = РегистрыСведений.ОбщиеНастройкиРаспознаваниеДокументов.ТекущиеНастройки();
	
	АдресЭлПочты = ТекущиеНастройки.АдресЭлПочты;
	
	Если Параметры.Свойство("ДанныеЗаполнения") И ТипЗнч(Параметры.ДанныеЗаполнения) = Тип("Массив") Тогда
		Для Каждого Запись Из Параметры.ДанныеЗаполнения Цикл
			НоваяСтрока = СписокФайлов.Добавить();
			НоваяСтрока.ИмяФайла = Запись.ИмяФайла;
			ДанныеФайлаНаСервере = ПоместитьФайлНаСервере(Запись.ИмяФайла,
				Запись.ДвоичныеДанные,
				УникальныйИдентификатор);
			НоваяСтрока.АдресКартинки = ДанныеФайлаНаСервере.АдресКартинки;
			НоваяСтрока.ИндексПиктограммы = ДанныеФайлаНаСервере.ИндексПиктограммы;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗакрытьФорму Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаНаВопросОЗакрытии", ЭтотОбъект);
	ТекстЗаголовка = НСтр("ru = 'Отменить?';en = 'Cancel?'");
	ТекстВопроса =
		НСтр("ru='Список файлов будет очищен';
		     |en='Files set will be cleared'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, ТекстЗаголовка);
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПерерисоватьПоСостоянию();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Данные = СписокФайлов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	РаспознаваниеДокументовМККлиент.ОткрытьФайлДляПросмотра(Данные.АдресКартинки, Данные.ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	УдалитьТекущуюСтроку(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресЭлПочтыИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Ошибка = Не ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(Текст);
	Элементы.ТекстНеверныйАдресЭлПочты.Видимость = Ошибка;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Авторизация(Команда)
	
	ВыполнитьАвторизацию();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьАдресЭлПочты(Команда)
	
	Ошибка = Не ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(АдресЭлПочты);
	Если Ошибка Тогда
		Возврат;
	КонецЕсли;
		
	Попытка
		СохранитьАдресЭлПочтыНаСервере();
		
		ПараметрыВопроса = РаспознаваниеДокументовСлужебныйКлиент.ПараметрыВопросаПользователю();
		ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
		ПараметрыВопроса.Картинка = БиблиотекаКартинок.УспешнаяОтправка;
		ПараметрыВопроса.Заголовок = НСтр("ru = 'Подписка оформлена'");
		
		РаспознаваниеДокументовСлужебныйКлиент.ПоказатьВопросПользователю(
			Неопределено,
			НСтр("ru = 'Адрес электронной почты подписан на уведомления'"),
			РежимДиалогаВопрос.ОК,
			ПараметрыВопроса
		);
	Исключение
		ПоказатьИнформациюОбОшибке(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКОбработкеДокументов(Команда)
	
	Закрыть(?(СписокПуст(), 0, 1));
	
КонецПроцедуры

&НаКлиенте
Процедура Сфотографировать(Команда)
	
#Если МобильноеПриложениеКлиент Или МобильныйКлиент Тогда
	
	Обработчик = Новый ОписаниеОповещения("ПослеПолученияСпискаФайлов", ЭтотОбъект);
	РаспознаваниеДокументовМККлиент.СканироватьДокументы(Обработчик);
	
#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	Обработчик = Новый ОписаниеОповещения("ПослеПолученияСпискаФайлов", ЭтотОбъект);
	РаспознаваниеДокументовМККлиент.ВыбратьФайлы(Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	Если СписокПуст() Тогда
		РаспознаваниеДокументовМККлиент.ПоказатьСообщение(
			НСтр("ru='Необходимо добавить файл для отправки';
			     |en='Please add a file to send'"));
		Возврат;
	КонецЕсли;
	
	ВыполнитьОтправкуФайлов();
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьФайл(Команда)
	
	Данные = СписокФайлов.НайтиПоИдентификатору(Элементы.СписокФайлов.ТекущаяСтрока);
	РаспознаваниеДокументовМККлиент.ОткрытьФайлДляПросмотра(Данные.АдресКартинки, Данные.ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОтправкуФайлов()
	
	ФоновоеЗадание = ЗапуститьФоновуюОтправкуФайлов();
	
	ОбработчикПрогресса = Новый ОписаниеОповещения("ПриПрогрессеОтправкиФайлов", ЭтотОбъект);
	
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
	НастройкиОжидания.ОповещениеОПрогрессеВыполнения = ОбработчикПрогресса;
	
	Обработчик = Новый ОписаниеОповещения("ПослеОтправкиФайлов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ФоновоеЗадание, Обработчик, НастройкиОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьФоновуюОтправкуФайлов()
	
	ОтправляемыеФайлы = Новый Массив;
	
	Для каждого ФайлДляОтправки Из СписокФайлов Цикл
		
		ОписаниеФайла = Новый Структура;
		ОписаниеФайла.Вставить("ИмяФайла", ФайлДляОтправки.ИмяФайла);
		ОписаниеФайла.Вставить("ДатаИзменения", ТекущаяДата());
		ОписаниеФайла.Вставить("Каталог");
		ОписаниеФайла.Вставить("ДвоичныеДанные",
			ПолучитьИзВременногоХранилища(ФайлДляОтправки.АдресКартинки));
		
		ОтправляемыеФайлы.Добавить(ОписаниеФайла);
	КонецЦикла;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Отправка файлов в сервиса распознавания документов'");
	
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"Обработки.РаспознаваниеДокументов.ОтправитьФайлыНаРаспознавание",
		ОтправляемыеФайлы
	);
	
	Возврат ФоновоеЗадание;
	
КонецФункции

 &НаКлиенте
Процедура ПриПрогрессеОтправкиФайлов(Результат, Контекст) Экспорт
	
	Если Результат.Статус = "Выполняется" Тогда
		Прогресс = ПрочитатьПрогресс(Результат.ИдентификаторЗадания);
		Если Прогресс <> Неопределено Тогда
			ТекстОписанияОтправки = Прогресс.Текст;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрочитатьПрогресс(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ПрочитатьПрогресс(ИдентификаторЗадания);
	
КонецФункции

&НаКлиенте
Процедура ПослеОтправкиФайлов(Задание, Контекст) Экспорт
	
	Если Задание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Задание.Статус = "Выполнено" Тогда
		ЗакрыватьАвтоматически = Истина;
		
		Если ЗакрыватьАвтоматически Тогда
			ЗакрытьФорму = Истина;
			Закрыть(?(СписокПуст(), 0, 1));
		Иначе
			Элементы.ОжиданиеОтправкиПрогресс.Видимость = Ложь;
			Элементы.ОжиданиеОтправкиЗагрузкаЗавершена.Видимость = Истина;
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(, Задание.КраткоеПредставлениеОшибки);
		Элементы.ШагиОтправки.ТекущаяСтраница = Элементы.ПодборФайлов;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеОтветаНаВопросОЗакрытии(Результат, Контекст) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗакрытьФорму = Истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияСпискаФайлов(Результат, Контекст) Экспорт
	
	Для Каждого Файл Из Результат Цикл
		ДанныеФайлаНаСервере = ПоместитьФайлНаСервере(Файл.ИмяФайла, Файл.ДвоичныеДанные, УникальныйИдентификатор);
		
		НоваяСтрока = СписокФайлов.Добавить();
		НоваяСтрока.ИмяФайла = Файл.ИмяФайла;
		НоваяСтрока.АдресКартинки = ДанныеФайлаНаСервере.АдресКартинки;
		НоваяСтрока.ИндексПиктограммы = ДанныеФайлаНаСервере.ИндексПиктограммы;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоместитьФайлНаСервере(ИмяФайла, ДвоичныеДанные, УникальныйИдентификатор)
	ФайлИнфо = Новый Файл(ИмяФайла);
	Расширение = ФайлИнфо.Расширение;
	
	ДанныеФайлаНаСервере = Новый Структура;
	ДанныеФайлаНаСервере.Вставить("АдресКартинки",
		ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор));
	ДанныеФайлаНаСервере.Вставить("ИндексПиктограммы",
		РаботаСФайламиСлужебныйКлиентСервер.ИндексПиктограммыФайла(Расширение));
	Возврат ДанныеФайлаНаСервере;
КонецФункции

&НаСервере
Функция СписокПуст()
	
	Возврат СписокФайлов.Количество() = 0;
	
КонецФункции

&НаКлиенте
Асинх Процедура УдалитьТекущуюСтроку(Элемент) Экспорт
	
	ТекущаяСтрока = Элемент.ТекущаяСтрока;
	
	ТекстЗаголовка = НСтр("ru = 'Удалить?';en = 'Delete?'");
	ТекстВопроса = НСтр("ru = 'Строка будет удалена';en = 'Row will be deleted'");
	Если Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ТекстЗаголовка) = КодВозвратаДиалога.Да Тогда
		Индекс = СписокФайлов.Индекс(СписокФайлов.НайтиПоИдентификатору(ТекущаяСтрока));
		СписокФайлов.Удалить(Индекс);
	КонецЕсли;
	
КонецПроцедуры

#Область КомандыДействий

&НаКлиенте
Процедура ВыполнитьАвторизацию()
	
	Обработчик = Новый ОписаниеОповещения("ПослеПроверкиПодключенияКСервисуРаспознавания", ЭтотОбъект);
	РаспознаваниеДокументовКлиент.ПоказатьАвторизациюИТС(Обработчик, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиПодключенияКСервисуРаспознавания(Результат, Контекст) Экспорт
	
	Если Результат Тогда 
		ПроверитьПодключение(ПодключеноКСервисуРаспознавания, АккаунтАктивирован);
		ПерерисоватьПоСостоянию();
		Оповестить("РаспознанныйДокумент_ОбновитьПредставлениеБаланса");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьПодключение(ПодключеноКСервисуРаспознавания, АккаунтАктивирован)
	
	ПодключеноКСервисуРаспознавания = РаспознаваниеДокументовСлужебныйВызовСервера.ПодключеноКСервисуРаспознавания();
	АккаунтАктивирован = РаспознаваниеДокументов.АккаунтАктивирован();
	
КонецФункции

 &НаКлиенте
Процедура ПерерисоватьПоСостоянию()
	
	Если Не ПодключеноКСервисуРаспознавания Тогда
		Элементы.ШагиОтправки.ТекущаяСтраница = Элементы.ПроверкаАвторизации;
		Возврат;
	КонецЕсли;
	
	Если Не АккаунтАктивирован Тогда
		Элементы.ШагиОтправки.ТекущаяСтраница = Элементы.ОжиданиеАктивации;
		Возврат;
	КонецЕсли;
	
	Элементы.ШагиОтправки.ТекущаяСтраница = Элементы.ПодборФайлов;
	
	ЕстьЗагруженныеФайлы = (Не СписокПуст());
	
КонецПроцедуры

&НаСервере
Процедура СохранитьАдресЭлПочтыНаСервере()
	
	РаспознаваниеДокументовSDK.УстановитьАдресЭлектроннойПочты(АдресЭлПочты);
	
	МенеджерЗаписи = РегистрыСведений.ОбщиеНастройкиРаспознаваниеДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.АдресЭлПочты = АдресЭлПочты;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти
#КонецОбласти