#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает ссылку на элемент справочника КлассификаторВидовЭкономическойДеятельности.
// Если по коду элемент не найден, то создается новый элемент справочника.
//
// Параметры:
//  Код - Строка - код ОКВЭД
//  Наименование - Строка - наименование ОКВЭД
// 
// Возвращаемое значение:
//  СправочникСсылка.КлассификаторВидовЭкономическойДеятельности
//
Функция СсылкаКлассификатор(Код, Наименование) Экспорт
	
	СсылкаКлассификатор = Справочники.КлассификаторВидовЭкономическойДеятельности.НайтиПоКоду(Код);
	Если Не ЗначениеЗаполнено(СсылкаКлассификатор) Тогда
		
		НачатьТранзакцию();
		
		Попытка
			
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.КлассификаторВидовЭкономическойДеятельности");
			БлокировкаДанных.Заблокировать();
			
			СправочникОбъект = Справочники.КлассификаторВидовЭкономическойДеятельности.СоздатьЭлемент();
			СправочникОбъект.Код = Код;
			СправочникОбъект.Наименование = Наименование;
			СправочникОбъект.НаименованиеПолное = СправочникОбъект.Наименование;
			СправочникОбъект.Записать();
			СсылкаКлассификатор = СправочникОбъект.Ссылка;
			
			ЗафиксироватьТранзакцию();
		Исключение
			
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Классификатор видов экономической деятельности (ОКВЭД)'"),
				УровеньЖурналаРегистрации.Ошибка, , , 
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат СсылкаКлассификатор;
	
КонецФункции

Функция ДополнятьКодПриЧтенииДанныхКлассификатора() Экспорт
	
	Возврат Ложь;	
	
КонецФункции	

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
		
	Если Параметры.Свойство("ДанныеКлассификатора") И Параметры.ДанныеКлассификатора Тогда 
		
		СтандартнаяОбработка = Ложь;
		
		ВыбраннаяФорма = "ОбщаяФорма.ДобавлениеЭлементовВКлассификатор";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли