#Область ПрограммныйИнтерфейс

Процедура ПослеНачалаРаботыСистемы(ТекущийИдентификаторПолучателя) Экспорт
	
	#Если МобильныйКлиент Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаУведомлений", ЭтотОбъект);
		ДоставляемыеУведомления.ПодключитьОбработчикУведомлений(ОписаниеОповещения);
		
		ОбновитьИдентификаторыПолучателейУведомлений(ТекущийИдентификаторПолучателя);
	#КонецЕсли
	
КонецПроцедуры

// Обработчик push-уведомлений и локальных уведомлений.
//
Процедура ОбработкаУведомлений(Уведомление, Локальное, Показано, Параметры) Экспорт
	
	Если Уведомление.Данные = "ЗадачиОрганизации" Тогда
		ЗадачиБухгалтераКлиентПереопределяемый.ОткрытьСписокЗадач();
	Иначе
		Если Не Показано Тогда
			ПоказатьОповещениеПользователя(Уведомление.Текст,,,,СтатусОповещенияПользователя.Важное);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Получает новый идентификатор подписчика. Если он изменился, сохраняет в регистр сведений "ПолучателиPushУведомлений".
//
Процедура ОбновитьИдентификаторыПолучателейУведомлений(ТекущийИдентификаторПолучателяXML) Экспорт
	
	#Если МобильныйКлиент Тогда
		Попытка
			НовыйИдентификатор = ДоставляемыеУведомления.ПолучитьИдентификаторПодписчикаУведомлений();
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			PushУведомленияВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
			
			Возврат;
		КонецПопытки;
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(ТекущийИдентификаторПолучателяXML);
		
		ТекущийИдентификаторПолучателя = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
		
		Если ТекущийИдентификаторПолучателя <> НовыйИдентификатор Тогда
			PushУведомленияВызовСервера.ОбновитьИдентификаторыПолучателейУведомленийНаСервере(НовыйИдентификатор);
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти