
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Обработки.ПанелиПростойИнтерфейс.ЗадатьВидимостьЭлементовФормы(ЭтотОбъект);
	
	МобильныйКлиентАдаптацияФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СверткаИнформационнойБазы(Команда)
	
	ОткрытьФорму("Обработка.СверткаИнформационнойБазы.Форма", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗаписейРегистраБухгалтерии(Команда)
	
	ОткрытьФорму("Обработка.ПроверкаЗаписейРегистраБухгалтерии.Форма", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПереходаНаФСБУ6(Команда)
	
	ОткрытьФорму("Обработка.ПроверкаПереходаНаФСБУ6.Форма", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаДатИзмененияПроцентныхСтавокПоЗаймам(Команда)
	
	ОткрытьФорму("Обработка.ПроверкаДатИзмененияПроцентныхСтавокПоЗаймам.Форма", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПомощникИсключенияИзПрослеживаемости(Команда)
	
	ОткрытьФорму("Обработка.ПомощникИсключенияНоменклатурыИзПрослеживаемости.Форма", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УничтожениеПерсональныхДанных(Команда)
	
	ОткрытьФорму("Обработка.УничтожениеПерсональныхДанных.Форма", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПомощникПоПереходуНаУСН(Команда)
	
	ОткрытьФорму("Обработка.ПомощникПоПереходуНаУСН.Форма", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводОстатковПриИзмененииОбъектаУСН(Команда)
	
	ОткрытьФорму("Обработка.ВводОстатковПриИзмененииОбъектаУСН.Форма", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаЦенНоменклатуры(Команда)
	
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсправлениеРеквизитаБезЗакрывающих(Команда)
	
	ОткрытьФорму("Обработка.ИсправлениеРеквизитаБезЗакрывающихДокументов.Форма", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРаспознаванияДокументов(Команда)
	
	ОткрытьФорму("Обработка.ПанельАдминистрированияБРД.Форма.НастройкиРаспознаванияДокументов", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботаСНоменклатурой(Команда)
	
	ОткрытьФорму("Обработка.РаботаСНоменклатурой.Форма.ПанельАдминистрирования", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиБиллинга(Команда)
	
	ОткрытьФорму("Обработка.НастройкиБиллинга.Форма.НастройкиБиллинга", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПроверкиРНПТ(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ВключениеПроверкиРНПТ", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Сервис1СКабинетСотрудника(Команда)
	
	ОткрытьФорму("Обработка.ИнтеграцияКабинетСотрудника.Форма.Интеграция", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключение1ССверка20(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ИнтеграцияССервисомСверкиРасчетов", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаИз1СПредприятия77(Команда)
	
	ОткрытьФорму("Обработка.ПереносДанныхИзИнформационныхБаз1СПредприятия77.Форма.ФормаЗагрузкаИзФайла", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхИзТиС(Команда)
	
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзТиС.Форма", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаИзДругойУчетнойСистемы(Команда)
	
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзДругойУчетнойСистемы.Форма", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПомощникПереходаСУСННаОСНО(Команда)
	
	ОткрытьФорму("Обработка.ПомощникПереходаСУСННаОСНО.Форма", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереоценкаТоваровВРознице(Команда)
	
	ОткрытьФорму("Документ.ПереоценкаТоваровВРознице.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменСПодключаемымОборудованиемOffline(Команда)
	
	ОткрытьФорму("Обработка.ОбменСОфлайнОборудованием.Форма", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповоеПерепроведениеДокументов(Команда)
	
	ОткрытьФорму("Обработка.ГрупповоеПерепроведениеДокументов.Форма", , ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаОбработки,
		"УстановкаЦенНоменклатуры");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаНастройки,
		"РаботаСНоменклатурой");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаТипыИнструментов);
	
КонецПроцедуры

#КонецОбласти
