#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЧтениеОбъектаРазрешено(Ссылка)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// для документа ИнвентаризацияОС
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ1";
	КомандаПечати.Представление = НСтр("ru = 'Инвентаризационная опись ОС (ИНВ-1)'");
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияОС";
	КомандаПечати.ТипыОбъектовПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Тип("ДокументСсылка.ИнвентаризацияОС"));
		
		КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ18";
	КомандаПечати.Представление = НСтр("ru = 'Сличительная ведомость (ИНВ-18)'");
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияОС";
	КомандаПечати.ТипыОбъектовПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Тип("ДокументСсылка.ИнвентаризацияОС"));
		
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ22";
	КомандаПечати.Представление = НСтр("ru = 'Приказ о проведении инвентаризации (ИНВ-22)'");
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияОС";
	КомандаПечати.ТипыОбъектовПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Тип("ДокументСсылка.ИнвентаризацияОС"));
		
	// для документа ИнвентаризацияНМА
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ1а";
	КомандаПечати.Представление = НСтр("ru = 'Инвентаризационная опись НМА (ИНВ-1а)'");
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияНМА";
	КомандаПечати.ТипыОбъектовПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Тип("ДокументСсылка.ИнвентаризацияНМА"));
		
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ18";
	КомандаПечати.Представление = НСтр("ru = 'Сличительная ведомость (ИНВ-18)'");
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияНМА";
	КомандаПечати.ТипыОбъектовПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Тип("ДокументСсылка.ИнвентаризацияНМА"));
		
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ22";
	КомандаПечати.Представление = НСтр("ru = 'Приказ о проведении инвентаризации (ИНВ-22)'");
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияНМА";
	КомандаПечати.ТипыОбъектовПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Тип("ДокументСсылка.ИнвентаризацияНМА"));
		
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ВедомостьПрав";
	КомандаПечати.Представление = НСтр("ru = 'Ведомость прав на результаты интеллектуальной деятельности'");
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияНМА";
	КомандаПечати.ТипыОбъектовПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Тип("ДокументСсылка.ИнвентаризацияНМА"));
	
	// для документа ИнвентаризацияТоваровНаСкладе
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИнвентаризацияТоваровНаСкладе";
	КомандаПечати.Представление = НСтр("ru = 'Инвентаризация товаров на складе'");
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияТоваровНаСкладе";
	КомандаПечати.ТипыОбъектовПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Тип("ДокументСсылка.ИнвентаризацияТоваровНаСкладе"));
		
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ3";
	КомандаПечати.Представление = НСтр("ru = 'Инвентаризационная опись товаров (ИНВ-3)'");
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияТоваровНаСкладе";
	КомандаПечати.ТипыОбъектовПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Тип("ДокументСсылка.ИнвентаризацияТоваровНаСкладе"));
		
		КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ19";
	КомандаПечати.Представление = НСтр("ru = 'Сличительная ведомость (ИНВ-19)'");
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияТоваровНаСкладе";
	КомандаПечати.ТипыОбъектовПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Тип("ДокументСсылка.ИнвентаризацияТоваровНаСкладе"));

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ22";
	КомандаПечати.Представление = НСтр("ru = 'Приказ о проведении инвентаризации (ИНВ-22)'");
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияТоваровНаСкладе";
	КомандаПечати.ТипыОбъектовПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Тип("ДокументСсылка.ИнвентаризацияТоваровНаСкладе"));
		
	// для документа ИнвентаризацияРасчетовСКонтрагентами
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ17";
	КомандаПечати.Представление = НСтр("ru = 'Акт инвентаризации расчетов (ИНВ-17)'");
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияРасчетовСКонтрагентами";
	КомандаПечати.ТипыОбъектовПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Тип("ДокументСсылка.ИнвентаризацияРасчетовСКонтрагентами"));
		
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СправкаИНВ17";
	КомандаПечати.Представление = НСтр("ru = 'Справка к акту ИНВ-17'");
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияРасчетовСКонтрагентами";
	КомандаПечати.ТипыОбъектовПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Тип("ДокументСсылка.ИнвентаризацияРасчетовСКонтрагентами"));
		
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ22";
	КомандаПечати.Представление = НСтр("ru = 'Приказ о проведении инвентаризации (ИНВ-22)'");
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияРасчетовСКонтрагентами";
	КомандаПечати.ТипыОбъектовПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Тип("ДокументСсылка.ИнвентаризацияРасчетовСКонтрагентами"));
		
	// для документа ИнвентаризацияКассы
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ15";
	КомандаПечати.Представление = НСтр("ru = 'Акт инвентаризации наличных денежных средств (ИНВ-15)'");
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияКассы";
	КомандаПечати.ТипыОбъектовПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Тип("ДокументСсылка.ИнвентаризацияКассы"));
		
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ22";
	КомандаПечати.Представление = НСтр("ru = 'Приказ о проведении инвентаризации (ИНВ-22)'");
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияКассы";
	КомандаПечати.ТипыОбъектовПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Тип("ДокументСсылка.ИнвентаризацияКассы"));
		
	// для документа ИнвентаризацияОбъектовУчета
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ";
	КомандаПечати.Представление = НСтр("ru = 'Акт инвентаризации'");
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияОбъектовУчета";
	КомандаПечати.ТипыОбъектовПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Тип("ДокументСсылка.ИнвентаризацияОбъектовУчета"));
		
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ22";
	КомандаПечати.Представление = НСтр("ru = 'Приказ о проведении инвентаризации (ИНВ-22)'");
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияОбъектовУчета";
	КомандаПечати.ТипыОбъектовПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Тип("ДокументСсылка.ИнвентаризацияОбъектовУчета"));
		
	// для документа ИнвентаризацияНЗП
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ";
	КомандаПечати.Представление = НСтр("ru = 'Акт инвентаризации'");
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияНЗП";
	КомандаПечати.ТипыОбъектовПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Тип("ДокументСсылка.ИнвентаризацияНЗП"));
		
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ22";
	КомандаПечати.Представление = НСтр("ru = 'Приказ о проведении инвентаризации (ИНВ-22)'");
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияНЗП";
	КомандаПечати.ТипыОбъектовПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Тип("ДокументСсылка.ИнвентаризацияНЗП"));
		
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реестр";
	КомандаПечати.Представление = НСтр("ru = 'Реестр документов'");
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Реестр документов ""Документы по инвентаризации""'");
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.Порядок = 100;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли