
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	Если Не ЗначениеЗаполнено(Параметры.СтрокаПоиска) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЗначениеПеречисления Из Метаданные.Перечисления.ВидыТранспортныхСредств.ЗначенияПеречисления Цикл
		Представление = СтрНайтиИВыделитьОформлением(ЗначениеПеречисления.Синоним, Параметры.СтрокаПоиска);
		Если Представление <> Неопределено Тогда
			ДанныеВыбора.Добавить(Перечисления.ВидыТранспортныхСредств[ЗначениеПеречисления.Имя], Представление);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
