#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяФайла = ПолучитьИмяВременногоФайла("pdf");
	
	Если Параметры.Режим = "Рассылка_ПервоеОткрытие"  Тогда
		ИмяМакета = "Инструкция_Рассылка_ПервоеОткрытие_PDF";
	ИначеЕсли Параметры.Режим = "Рассылка" Тогда
		ИмяМакета = "Инструкция_Рассылка_PDF";
		Элементы.Продолжить.Заголовок = Нстр("ru='Ок'");
	ИначеЕсли Параметры.Режим = "РольКонтактногоЛица" Тогда
		ИмяМакета = "Инструкция_РольКонтактногоЛица_PDF";
		Заголовок = НСтр("ru='Инструкция: как настроить роль контактного лица для сверки'");
		Элементы.Продолжить.Заголовок = Нстр("ru='Ок'");
	КонецЕсли;
	
	Обработки.МониторСверкиСКонтрагентами.ПолучитьМакет(ИмяМакета).Записать(ИмяФайла);
	Инструкция.Прочитать(ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если Не ВебКлиент Тогда
	Элементы.Инструкция.Масштаб = 125;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не Отказ Тогда
		ОсвободитьВременныйФайл();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Ок(Команда)
	
	Закрыть(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныепроцедурыИФункции

&НаСервере
Процедура ОсвободитьВременныйФайл()
	
	Инструкция = Новый ДокументPDF;
	УдалитьФайлы(ИмяФайла);
	
КонецПроцедуры

#КонецОбласти