#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытийФормы

// Вызывается во всех созданных формах при вызове метода Оповестить.
//
// Параметры:
//  Форма      - ФормаКлиентскогоПриложения - оповещаемая форма,
//  ИмяСобытия - Строка           - имя события,
//  Параметр   - Произвольный     - параметр сообщения. Могут быть переданы любые необходимые данные,
//  Источник   - Произвольный     - источник события.
Процедура ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт
	
	Если ИмяСобытия = "ИзменениеСтатусаКонтрагентаИСМП" 
		И Форма.ИмяФормы = "Обработка.ПроверкаИПодборПродукцииИСМП.Форма.ПроверкаИПодбор" 
		И Форма.КонтрагентБП = Параметр Тогда
	
		Форма.КонтрагентНадпись = ИнтеграцияИСМПБПВызовСервера.КонтрагентНадпись(Параметр, Форма.ВидМаркируемойПродукции);
	КонецЕсли; 
	ДополнительныеПараметры = Неопределено;
	СобытияФормИСКлиент.ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры);
	
КонецПроцедуры

// Возникает на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Форма           - ФормаКлиентскогоПриложения - форма записываемого объекта,
//  Отказ           - Булево           - признак отказа от записи,
//  ПараметрыЗаписи - Структура        - структура, содержащая параметры записи.
Процедура ПередЗаписью(Форма, Отказ, ПараметрыЗаписи) Экспорт
		
	Если Форма.ИмяФормы = "РегистрСведений.НастройкиОбменаЕГАИС.Форма.ФормаЗаписи" Тогда
		ИнтеграцияЕГАИСБПВызовСервера.УстановитьНапоминаниеПоОрганизации(Форма.Запись.ИдентификаторФСРАР);
	КонецЕсли;
	
КонецПроцедуры

// В процедуре нужно реализовать алгоритм преобразования данных из подсистемы подключаемого оборудования.
//
// Параметры:
//  Результат - Структура - со свойствами Штрихкод, Количество
//  Параметр  - Массив    - входящие данные.
Процедура ПреобразоватьДанныеСоСканераВСтруктуру(Результат, Параметр) Экспорт
	
	ЗаполнитьЗначенияСвойств(
		Результат, 
		МенеджерОборудованияКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиДействийФорм

// Устанавливается имя открываемой формы.
// 
// Параметры:
//  ИмяФормыНастройкиИСМП - Строка - Имя формы, которые необходимо открыть
Процедура ПриПереходеПоКомментарийОЗапретеИзмененияНастройки(ИмяФормыНастройкиИСМП) Экспорт

	Возврат
	
КонецПроцедуры 

#КонецОбласти

#КонецОбласти
