//@skip-check module-region-empty
//@skip-check module-structure-top-region
#Область Описание

// Модуль содержит прикладные правила заполнения бухгалтерской отчетности.
//
// Бухгалтерская отчетность включает в себя несколько разделов (отчетов),
// в составе которых содержатся показатели (их могут называть "строками"),
// которые объединяются в группы показателей.
//
// Как правило один показатель входит в одну группу, но может входить и в несколько -
// в этом случае должны быть описаны правила зачета показателя, то есть, включения их в конкретные группы.
// Например, финансовый результат от продажи основных средств может быть положительным - и тогда войдет в группу показателей с доходами -
// или отрицательным, и тогда войдет в группу с расходами.
//
// Состав показателей задается по умолчанию - см. ЗаполнитьНастройкиПоУмолчанию, может быть уточнен динамически по данным информационной базы,
// или настроен вручную.
//
// Заполнение отчета выполняется алгоритмами заполнения.
// Алгоритм обычно описывает некоторую часть отчета (набор показателей), опирающиеся на однотипные данные
// и сходным образом выводимые в отчет.
// Например, алгоритмом может быть информация о прочих доходах и расходах:
// она выбирается как обороты по счету 91 в разрезе одной и той же аналитики (статей, реализуемых объектов),
// имеет одинаковые правила зачета.
//
// Подробнее см. Описание в области АлгоритмыЗаполнения программного интерфейса.
//

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Содержит описание структуры раздела отчета и правил его заполнения
//
// Параметры:
//  Процессор - см. ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.НовыйПроцессорОписанияЗаполняемыеПоказатели
//          Заполняемая коллекция
//
Процедура ЗаполнитьНастройкиПоУмолчанию(Процессор) Экспорт
	
	ВыполненоПереопределение = Ложь;
	ЗаполнениеБухгалтерскойОтчетностиПереопределяемый.ЗаполнитьНастройкиПоУмолчанию(ВыполненоПереопределение, Процессор);
	Если ВыполненоПереопределение Тогда
		Возврат;
	КонецЕсли;
	
	Если Процессор.Раздел = "ОФР" Тогда
		ЗаполнитьНастройкиПоУмолчаниюОФР(Процессор);
	ИначеЕсли Процессор.Раздел = "ОДДС" Тогда
		ЗаполнитьНастройкиПоУмолчаниюОДДС(Процессор);
	КонецЕсли;
	
КонецПроцедуры

#Область АлгоритмыЗаполнения

#Область Описание

// Процедуры этой области представляют собой роутеры для алгоритмов заполнения.
// Каждый алгоритм заполнения должен быть в них описан - содержать вызовы методов алгоритма.
//
// Сам код алгоритмов размещен в служебной части модуля, см. область АлгоритмыЗаполнения.
//
// Алгоритм обеспечивает как собственно подготовку числовых данных отчета (извлечение из базы данных, численную обработку, описание порядка заполнения),
// так и возможности автоматической или пользовательской настройки.
//
// Часть алгоритмов основана на классификации в показателях отчета тех или иных объектов ("классифицируемых объектов") -
// например, статей расходов.
// С применением их может выполняться настройка показателей, их зачет, они же выводятся и в расшифровку.
//
// Работа с такими объектами должна быть описана в методах
// - ТипЗначенияКлассифицируемыхОбъектов
// - СоздатьКлассифицируемыеОбъекты
// - КлассифицируемыеОбъекты
//
// Правила классификации могут редактироваться пользователем.
// Работа с ними должна быть описана в методах
// - РазрешенаНастройкаПользователем
// - ЗаполнитьОтборКлассифицируемымиОбъектами
//
// Программная настройка заполнения может выполняться как в терминах классифицируемых объектов, так и других значений.
// Например, первоначально правила заполнения описываются в терминах видов статей расходов, а при редактировании пользователем -
// в терминах статей.
// 
// Также поддерживается и иерархия классифицируемых объектов. В этом случае настройка заполнения преимущественно выполняется
// с точностью до уточняемых объектов (например, групп справочника), при необходимости может быть уточнена объектами более низкого уровня
// (например, элементов). Однако, для целей интерактивной настройки и уточняющие и уточняемые объекты должны иметь одинаковый тип.
// Работа с такой иерархией должна быть описана в методах:
// - УстановитьПрименяетсяУточнениеОбъектов
// - УстановитьВыборГруппЭлементовИерархияОбъектов
// - ЭтоУточняющийОбъект
//
// Показатели с одинаковым алгоритмом отличаются правилом заполнения, которое
// - как правило, включает в себя Отбор в терминах классифицируемых объектов (например, список статей или вид статьи, см. ДополнитьОтборАлгоритма)
// - может включать другие свойства - см. ИнициализироватьЗаполнениеПоказателя
//
// Состав и свойства выводимых в отчет показателей могут быть определены динамически, в зависимости от данных в периодах, выводимых в отчет.
// А именно, можно динамически
// - добавить показатели в группу показателей (т.е. детализировать показатель, представив его в виде группы) - см. ДетализироватьГруппуПоказателей
// - настроить свойства показателей, например их Вывод в отчет - см. НастроитьПоказатели
//
// Последовательность заполнения следующая:
// 1. Выбираются все однородные данные, т.е. данные всех показателей, например, все данные по счету 91 - см. ПолучитьДанныеУчета
// 2. При необходимости они зачитываются, т.е. значение показателя может быть распределено между группами, в которые он входит - см. ЗачестьПоказатели
// 3. Для каждого показателя определяется, как представлять эти данные - см. ОписатьПорядокЗаполненияПоказателя
// 4. Для каждого классифицируемого объекта может быть уточнено, как его представлять в расшифровке - см. ОписатьЗаполняемоеЗначение

#КонецОбласти

#Область ИдентификаторыАлгоритмов

// Для некоторых алгоритмов предполагается пользовательская настройка.
// В объектах, выполняющих такую настройку, может понадобиться их различать.
//
// Как правило, идентификаторы алгоритмов - перед методами, реализующими алгоритм.

// Определяет идентификатор алгоритма заполнения.
// 
// Возвращаемое значение:
//  ПланСчетовСсылка.Хозрасчетный
//
Функция ИдентификаторАлгоритмаПрочиеДоходыРасходы() Экспорт
	Возврат ПланыСчетов.Хозрасчетный.ПрочиеДоходыИРасходы;
КонецФункции

#КонецОбласти

// Определяет тип значения классификатора, используемого алгоритмом.
// Может применяться при пользовательской настройке.
// Для указанных алгоритмов должна быть реализована СоздатьКлассифицируемыеОбъекты
//
// Параметры:
//  Алгоритм - Строка, ЛюбаяСсылка - идентификатор алгоритма заполнения
// 
// Возвращаемое значение:
//  - ОписаниеТипов
//  - Неопределено - алгоритм не использует классификатор
//
Функция ТипЗначенияКлассифицируемыхОбъектов(Алгоритм) Экспорт
	
	Если Алгоритм = ИдентификаторАлгоритмаВыручка() Или Алгоритм = ИдентификаторАлгоритмаСебестоимостьПродаж() Тогда
		Возврат ТипЗначенияКлассифицируемыхОбъектовПродажи();
	ИначеЕсли Алгоритм = ИдентификаторАлгоритмаПрочиеДоходыРасходы() Тогда
		Возврат ТипЗначенияКлассифицируемыхОбъектовПрочиеДоходыРасходы();
	ИначеЕсли Алгоритм = ИдентификаторАлгоритмаДенежныеПотоки() Тогда
		Возврат ТипЗначенияКлассифицируемыхОбъектовДенежныеПотоки();
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Определяет, возможна ли интерактивная настройка состава классифицируемых объектов.
// Для указанных алгоритмов должна быть реализована ЗаполнитьОтборКлассифицируемымиОбъектами
//
// Параметры:
//  Алгоритм - Строка, ЛюбаяСсылка - идентификатор алгоритма заполнения
// 
// Возвращаемое значение:
//  - Булево - Истина, если разрешена
//
Функция РазрешенаНастройкаПользователем(Алгоритм) Экспорт
	
	Возврат Алгоритм = ИдентификаторАлгоритмаВыручка()
		Или Алгоритм = ИдентификаторАлгоритмаСебестоимостьПродаж()
		Или Алгоритм = ИдентификаторАлгоритмаПрочиеДоходыРасходы();
	
КонецФункции

// Заполняет отбор правила заполнения исходя из списка классифицируемых объектов.
// Следует вызывать только, если отбор действительно нужен - то есть, когда этот список не пустой.
// Другими словами, не следует вызывать для показателей, используемых по умолчанию (основных).
//
// Параметры:
//  Отбор - Структура - заполняемый отбор; состав свойств определяется алгоритмом. Описывается в начале каждого раздела с алгоритмом
//  Алгоритм - Строка, ЛюбаяСсылка - идентификатор алгоритма заполнения
//  КлассифицируемыеОбъекты - СписокЗначений из см. ТипЗначенияКлассифицируемыхОбъектов - тип объектов определяется алгоритмом;
//      Пометкой отмечены уточняющие объекты. См. также ЭтоУточняющийОбъект
//
Процедура ЗаполнитьОтборКлассифицируемымиОбъектами(Отбор, Алгоритм, КлассифицируемыеОбъекты) Экспорт
	
	Если ЭтоАлгоритмПродажи(Алгоритм) Тогда
		ЗаполнитьОтборКлассифицируемымиОбъектамиПродажи(Отбор, КлассифицируемыеОбъекты);
	ИначеЕсли Алгоритм = ИдентификаторАлгоритмаПрочиеДоходыРасходы() Тогда
		ЗаполнитьОтборКлассифицируемымиОбъектамиПрочиеДоходыРасходы(Отбор, КлассифицируемыеОбъекты);
	КонецЕсли;
	
КонецПроцедуры

// Извлекает из информационной базы (помещает в создаваемые временные таблицы) информацию о значениях классификатора,
// используемого алгоритмом.
// Создаваемые таблицы далее используются в КлассифицируемыеОбъекты и ПолучитьДанныеУчета.
// То есть, наличие, состав и содержимое таблиц определяется этими методами.
// Предполагается, что таблицы содержат соответствие классифицируемых объектов (и, при необходимости, их свойств)
// и идентификаторов показателей, в которые включаются сведения об этих объектах.
// При этом в таблице должен быть полный перечень объектов.
// Для основных показателей считается допустимым значение NULL в поле с идентификатором показателя.
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - для помещения создаваемых таблиц
//  Алгоритм - Строка, ЛюбаяСсылка - идентификатор алгоритма заполнения
//  Показатели - Массив из СтрокаТаблицыЗначений из см. БухгалтерскаяОтчетностьБРО.НовыйЗаполняемыеПоказателиРаздела.Показатели - показатели с указанным алгоритмом
// 
Процедура СоздатьКлассифицируемыеОбъекты(МенеджерВременныхТаблиц, Алгоритм, Показатели) Экспорт
	
	Если ЭтоАлгоритмПродажи(Алгоритм) Тогда
		СоздатьТаблицыКлассифицируемыхОбъектовПродажи(МенеджерВременныхТаблиц, Показатели);
	ИначеЕсли Алгоритм = ИдентификаторАлгоритмаПрочиеДоходыРасходы() Тогда
		СоздатьКлассифицируемыеОбъектыПрочиеДоходыРасходы(МенеджерВременныхТаблиц, Показатели);
	ИначеЕсли Алгоритм = ИдентификаторАлгоритмаДенежныеПотоки() Тогда
		СоздатьКлассифицируемыеОбъектыДенежныхПотоков(МенеджерВременныхТаблиц, Показатели);
	КонецЕсли;
	
КонецПроцедуры

// Определяет объекты учета, составляющие каждый показатель алгоритма.
// Такие объекты используются при настройке и выводятся в расшифровку порядка заполнения.
// См. также ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.КлассифицируемыеОбъектыДляВывода
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - см. СоздатьКлассифицируемыеОбъекты
//  Алгоритм - Строка, ЛюбаяСсылка - идентификатор алгоритма заполнения
//  ТолькоНастраиваемыеОбъекты - Булево - если Истина, то выборку нужно ограничить только настраиваемыми объектами.
//      Это применимо, если применяются уточняющие объекты - их не следует использовать для настройки без необходимости.
//  ПрименяетсяУточнениеОбъектов - Булево - Истина, если уточняющие объекты фактически применяются
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//    * Показатель - Число - идентификатор показателя
//    * Объект - ЛюбаяСсылка - классифицируемый объект, тип см. в ТипЗначенияКлассифицируемыхОбъектов
//    * Представление - Строка - представление объекта
//    * Активный - Булево - Истина у тех объектов, которые выводятся даже при отсутствии значения (поясняя тем самым порядок заполнения)
//  Итоги по Показатель, упорядочивание по Объект.
//
Функция КлассифицируемыеОбъекты(МенеджерВременныхТаблиц, Алгоритм, ТолькоНастраиваемыеОбъекты, ПрименяетсяУточнениеОбъектов) Экспорт
	
	Если Алгоритм = ИдентификаторАлгоритмаПрочиеДоходыРасходы() Тогда
		Возврат КлассифицируемыеОбъектыПрочиеДоходыРасходы(МенеджерВременныхТаблиц);
	ИначеЕсли ЭтоАлгоритмПродажи(Алгоритм) Тогда
		Возврат КлассифицируемыеОбъектыПродажи(МенеджерВременныхТаблиц, ТолькоНастраиваемыеОбъекты, ПрименяетсяУточнениеОбъектов);
	КонецЕсли;
	
КонецФункции

// Определяет, применяется ли фактически уточнение объектов - для конкретной совокупности классифицируемых объектов, имеющихся в базе данных.
// 
// Параметры:
//  ПрименяетсяУточнениеОбъектов - Булево - Возвращаемый, следует установить в Истина, если применяется
//  Алгоритм - Строка, ЛюбаяСсылка - идентификатор алгоритма заполнения 
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - содержит таблицы, созданные в СоздатьКлассифицируемыеОбъекты
Процедура УстановитьПрименяетсяУточнениеОбъектов(ПрименяетсяУточнениеОбъектов, Алгоритм, МенеджерВременныхТаблиц) Экспорт
	Если ЭтоАлгоритмПродажи(Алгоритм) Тогда
		ПрименяетсяУточнениеОбъектов = ПрименяетсяУточнениеОбъектовПродажи(МенеджерВременныхТаблиц);
	КонецЕсли;
КонецПроцедуры

// Определяет возможность выбора групп справочника для настройки в терминах классифицируемых объектов.
// 
// Параметры:
//  ВыборГруппЭлементов - ГруппыИЭлементы - возвращаемый, следует установить, если отличается от ГруппыИЭлементы.Элементы
//  Алгоритм - Строка, ЛюбаяСсылка - идентификатор алгоритма заполнения
Процедура УстановитьВыборГруппЭлементовИерархияОбъектов(ВыборГруппЭлементов, Алгоритм) Экспорт
	
	Если Алгоритм = ИдентификаторАлгоритмаВыручка() Или Алгоритм = ИдентификаторАлгоритмаСебестоимостьПродаж() Тогда
		ВыборГруппЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
	КонецЕсли;
	
КонецПроцедуры

// Определяет, является ли конкретный объект уточняющим. См. также СоздатьКлассифицируемыеОбъекты
// Вызывается при условии УстановитьПрименяетсяУточнениеОбъектов
// 
// Параметры:
//  Объект - ЛюбаяСсылка - см. ТипЗначенияКлассифицируемыхОбъектов
//  Алгоритм - Строка, ЛюбаяСсылка - идентификатор алгоритма заполнения
// 
// Возвращаемое значение:
//  Булево - Истина, если это уточняющий объект
Функция ЭтоУточняющийОбъект(Объект, Алгоритм) Экспорт
	
	Если Алгоритм = ИдентификаторАлгоритмаВыручка() Или Алгоритм = ИдентификаторАлгоритмаСебестоимостьПродаж() Тогда
		Возврат Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "ЭтоГруппа");
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Инициализирует прикладную (определяемую алгоритмом заполнения) часть настройки заполнения показателя.
//
// Параметры:
//  НастройкиАлгоритма - Структура - для инициализации
//  Алгоритм - Строка, ЛюбаяСсылка - идентификатор алгоритма заполнения
//
Процедура ИнициализироватьЗаполнениеПоказателя(НастройкиАлгоритма, Алгоритм) Экспорт
	
	Если Алгоритм = ИдентификаторАлгоритмаПрочиеДоходыРасходы() Тогда
		ИнициализироватьЗаполнениеПоказателяПрочиеДоходыРасходы(НастройкиАлгоритма);
	ИначеЕсли Алгоритм = ИдентификаторАлгоритмаДенежныеПотоки() Тогда
		ИнициализироватьЗаполнениеПоказателяДенежныеПотоки(НастройкиАлгоритма);
	КонецЕсли;
	
КонецПроцедуры

// Определяет состав динамических групп по умолчанию - на основании данных информационной базы.
// Такие группы первоначально (в ЗаполнитьНастройкиПоУмолчанию) описываются как группы из одного показателя ("имени себя").
// Перед заполнением или перед настройкой конкретного отчета такие группы могут динамически дополняться детализирующими показателями
// (исходный показатель останется на дне группы как основной).
// Ограничение: в каждой группе, объединенной общим алгоритмом, должен быть свой алгоритм заполнения.
//
// Параметры:
//  Шаблон      - ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.НовыйШаблонДинамическойГруппы -
//                заполнение состава показателей выполняется опосредованно, через шаблон.
//                То есть, здесь, в прикладной части мы заполняем простой шаблон, не погружаясь в тонкости работы с коллекцией показателей.
//  ОбщийШаблон - Массив из Строка, ЛюбаяСсылка - массив из идентификаторов алгоритма заполнения;
//                позволяет указать (вернуть) набор алгоритмов, для которых нужно создать идентичный состав показателей.
//                Для указанных в параметре алгоритмов повторный вызов метода не выполняется.
//  Алгоритм    - Строка, ЛюбаяСсылка - идентификатор выполняемого алгоритма заполнения
//  Контекст    - см. БухгалтерскаяОтчетностьБРО.НовыйКонтекстОтчета
//  КодЯзыка    - Строка - код языка наименования показателей
//
Процедура ДетализироватьГруппуПоказателей(Шаблон, ОбщийШаблон, Алгоритм, Контекст, КодЯзыка) Экспорт
	
	Если Алгоритм = ИдентификаторАлгоритмаВыручка() Или Алгоритм = ИдентификаторАлгоритмаСебестоимостьПродаж() Тогда
		ОбщийШаблон.Добавить(ИдентификаторАлгоритмаВыручка());
		ОбщийШаблон.Добавить(ИдентификаторАлгоритмаСебестоимостьПродаж());
		ДетализироватьГруппуПоказателейПродажи(Шаблон, Контекст, КодЯзыка);
	КонецЕсли;
	
КонецПроцедуры

// Позволяет выполнить тонкую настройку свойств показателей при их установке по умолчанию
//
// Параметры:
//  Показатели  - Массив из СтрокаТаблицыЗначений из БухгалтерскаяОтчетностьБРО.НовыйЗаполняемыеПоказателиРаздела.Показатели - модифицируемые показатели с указанным алгоритмом
//  Алгоритм    - Строка, ЛюбаяСсылка - идентификатор выполняемого алгоритма заполнения
//  Контекст    - см. БухгалтерскаяОтчетностьБРО.НовыйКонтекстОтчета
//
Процедура НастроитьПоказатели(Показатели, Алгоритм, Контекст) Экспорт
	
	Если Алгоритм = ИдентификаторАлгоритмаНалоги() Тогда
		
		НастроитьПоказателиНалоги(Показатели, Контекст);
		
	КонецЕсли;
	
КонецПроцедуры

// Получает все данные информационной базы, необходимые для определения значений показателей и описания порядка их определения.
//
// Параметры:
//  Процессор - ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.НовыйПроцессорЗаполненияОтчета - дополняемая коллекция.
//
//   Метод должен выполнить основной запрос данных и поместить его результат в ДанныеУчета.
//   Запрос должен выбрать все данные, связанные с этим алгоритмом, то есть,
//   совокупность всех алгоритмов должна выбирать все данные без пропусков.
//   Данные выбираются в привязке к показателям. Если показатель определить не удается, то допустимо выбрать Null -
//   такие значения будут сопоставлены показателю по умолчанию.
//   Запрос должен содержать поля Показатель (идентификатор), Организация, Значение (числовое),
//   а также поля со значениями слагаемых, описанные в ОписатьПорядокЗаполненияПоказателя.
//   Для оптимизации получения представлений их можно получить в запросе - 
//   соответствующие поля должны иметь имена по шаблону из ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.ИмяПредставления.
//   Запрос должен содержать итоги по полю Показатель и полям, задаваемым в ОписатьПорядокЗаполненияПоказателя
//   В итоги включается сумма и представления, если последние не доступны на соответствующем уровне итогов.
//   Данные в запросе должны быть отсортированы для вывода пользователю.
//   
//   Метод может поместить в ДанныеАлгоритма произвольные данные для использования в
//   ЗачестьПоказатели, ОписатьПорядокЗаполненияПоказателя, ОписатьЗаполняемоеЗначение, ОписатьСуммирующиеПоказатели.
//   Этой возможностью следует пользоваться для оптимизации производительности - т.е. получать данные и их представления один раз,
//   исключать их получение в вызываемых циклично методах.
//
Процедура ПолучитьДанныеУчета(Процессор) Экспорт
	
	ВыполненоПереопределение = Ложь;
	ЗаполнениеБухгалтерскойОтчетностиПереопределяемый.ПолучитьДанныеУчета(ВыполненоПереопределение, Процессор);
	Если ВыполненоПереопределение Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоАлгоритмПродажи(Процессор.Алгоритм) Тогда
		
		ПолучитьДанныеУчетаПродажи(Процессор);
		
	ИначеЕсли Процессор.Алгоритм = ИдентификаторАлгоритмаПрочиеДоходыРасходы() Тогда
		
		ПолучитьДанныеУчетаПрочиеДоходыРасходы(Процессор);
		
	ИначеЕсли Процессор.Алгоритм = ИдентификаторАлгоритмаНалоги() Тогда
		
		ПолучитьДанныеУчетаНалоги(Процессор);
		
	ИначеЕсли Процессор.Алгоритм = ИдентификаторАлгоритмаРезультатПереоценкиВнеоборотныхАктивов() Тогда
		
		ПолучитьДанныеУчетаРезультатПереоценкиВнеоборотныхАктивов(Процессор);
		
	ИначеЕсли Процессор.Алгоритм = ИдентификаторАлгоритмаДенежныеСредства() Тогда
		
		ПолучитьДанныеУчетаДенежныеСредства(Процессор);
		
	ИначеЕсли Процессор.Алгоритм = ИдентификаторАлгоритмаДенежныеПотоки() Тогда
		
		ПолучитьДанныеУчетаДенежныеПотоки(Процессор);
		
	КонецЕсли;
	
КонецПроцедуры

// Описывает порядок заполнения показателя - как для пользователя, так и для вычисления состава слагаемых,
// в частности, описывает, как нужно поступить с запросом, выполненным в ПолучитьДанныеУчета.
//
// В общем случае значение показателя описывается набором значений - по субсчетам и/или по аналитике.
// Такие значения перед выводом в отчет так или иначе суммируются, поэтому их можно назвать "слагаемыми".
// 
// Параметры:
//  Описание - ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.НовыйОписаниеПорядкаЗаполненияПоказателя - 
//             в него следует поместить тексты для пользователя, инструкции по использованию результата запроса и настройки отчета.
//             В частности
//             - следует заполнить Текст и можно заполнить Разъяснение
//             - координированно с текстом запроса следует дополнить ШагиРасчета, определив состав (иерархию) слагаемых.
//               Например, данные выбираем в разрезе счетов, далее статей расхода, далее - объектов реального мира.
//               Каждый шаг соответствует уровню иерархии прикладных данных в запросе из ПолучитьДанныеУчета.
//               Имя поля иерархии указывается в представлении списка значений.
//               Порядок шагов должен быть таким же как в запросе - при необходимости можно пропускать шаги, объявленные в запросе,
//               но нельзя менять взаимное положение.
//               В качестве значения можно указать перечень значений классификатора или плана счетов,
//               которые следует вывести в отчет обязательно (даже если запросом они не выбраны).
//             - можно заполнить шаблон для дальнейшей расшифровки слагаемых отчетом - см. Отчет
//  Показатель             - СтрокаТаблицыЗначений из БухгалтерскаяОтчетностьБРО.НовыйЗаполняемыеПоказателиРаздела.Показатели
//  ЭтоОсновнойПоказатель  - Булево
//  Процессор - ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.НовыйПроцессорЗаполненияОтчета - содержит, в частности,
//              ДанныеАлгоритма, полученные в ПолучитьДанныеУчета
//
Процедура ОписатьПорядокЗаполненияПоказателя(Описание, Показатель, ЭтоОсновнойПоказатель, Процессор) Экспорт

	ВыполненоПереопределение = Ложь;
	ЗаполнениеБухгалтерскойОтчетностиПереопределяемый.ОписатьПорядокЗаполненияПоказателя(
		ВыполненоПереопределение,
		Описание,
		Показатель,
		ЭтоОсновнойПоказатель,
		Процессор);
	Если ВыполненоПереопределение Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоАлгоритмПродажи(Процессор.Алгоритм) Тогда
		ОписатьПорядокЗаполненияПоказателяПродажи(Описание, Показатель, ЭтоОсновнойПоказатель, Процессор.ДанныеАлгоритма, Процессор.КодЯзыка);
	ИначеЕсли Процессор.Алгоритм = ИдентификаторАлгоритмаПрочиеДоходыРасходы() Тогда
		ОписатьПорядокЗаполненияПоказателяПрочиеДоходыРасходы(Описание, Показатель, ЭтоОсновнойПоказатель, Процессор);
	ИначеЕсли Процессор.Алгоритм = ИдентификаторАлгоритмаНалоги() Тогда
		ОписатьПорядокЗаполненияПоказателяНалоги(Описание, Показатель, Процессор.ДанныеАлгоритма, Процессор.КодЯзыка);
	ИначеЕсли Процессор.Алгоритм = ИдентификаторАлгоритмаРезультатПереоценкиВнеоборотныхАктивов() Тогда
		ОписатьПорядокЗаполненияПоказателяРезультатПереоценкиВнеоборотныхАктивов(Описание, Показатель, Процессор.ДанныеАлгоритма, Процессор.КодЯзыка);
	ИначеЕсли Процессор.Алгоритм = ИдентификаторАлгоритмаДенежныеСредства() Тогда
		ОписатьПорядокЗаполненияПоказателяДенежныеСредства(Описание, Показатель, Процессор.ДанныеАлгоритма, Процессор.КодЯзыка);
	ИначеЕсли Процессор.Алгоритм = ИдентификаторАлгоритмаДенежныеПотоки() Тогда
		ОписатьПорядокЗаполненияПоказателяДенежныеПотоки(Описание, Показатель, Процессор.ДанныеАлгоритма, Процессор.КодЯзыка);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет нетривиальный (отличающийся от порядка по умолчанию) порядок зачета показателей в случаях,
// когда показатель включается в несколько групп показателей и его значение "распределяется" между группами.
// Можно провести аналогию с вектором, где значение показателя - это модуль вектора, но его можно спроецировать на базис,
// образованный совокупностью групп.
// Подробнее см. комментарий в области ЗачетПоказателей модуля ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.
//
// Параметры:
//  КомпонентыЗачета   - ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.НовыйКомпонентыЗачетаПоказателя - 
//                       в ней можно указать значения в разрезе групп, в которые входит показатель, снабдив пояснениями.
//  Показатель         - СтрокаТаблицыЗначений из БухгалтерскаяОтчетностьБРО.НовыйЗаполняемыеПоказателиРаздела.Показатели - 
//                       "распределяемый" показатель
//  ЗначенияПоказателя - СтрокаДереваЗначений - вычисленные ранее значения показателя и его слагаемых
//  Процессор - ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.НовыйПроцессорЗаполненияОтчета - содержит, в частности,
//              ДанныеАлгоритма, полученные в ПолучитьДанныеУчета
// 
// Возвращаемое значение:
//  Булево - Истина, если зачет выполнен; Ложь, если следует выполнить стандартный алгоритм.
//
Функция ЗачестьПоказатели(КомпонентыЗачета, Показатель, ЗначенияПоказателя, Процессор) Экспорт
	
	Если Процессор.Алгоритм = ИдентификаторАлгоритмаПрочиеДоходыРасходы() Тогда
		
		Возврат ЗачестьПрочиеДоходыРасходы(
			КомпонентыЗачета,
			Показатель.Заполнение.НастройкиАлгоритма.ЗачетПоказателей,
			ЗначенияПоказателя,
			Процессор.ДанныеАлгоритма,
			Процессор.КодЯзыка);
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Позволяет детально описать для пользователя порядок расчета конкретных слагаемых, в частности, модифицировать описание и/или отчет.
// Описание, выполненное в ОписатьПорядокЗаполненияПоказателя, наследуется до всех слагаемых.
// В этом методе можно выполнить тонкую настройку.
//
// Параметры:
//  ЗаписьРасчет       - СтрокаДереваЗначений из ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.НовыйЗначенияПоказателей - 
//                                        описание значений "донастраиваемого" слагаемого
//  СоставШагаРасчета  - Структура - значения аналитики, доступной на уровне этого слагаемого, то есть, самого слагаемого и всех вышестоящих:
//                                       * Ключ - имя шага, как задано в ШагиРасчета в ОписатьПорядокЗаполненияПоказателя
//                                       * Значение - значение аналитики
//  КешПредставлений   - Структура - представления значений из СоставШагаРасчета:
//                                       * Ключ - имя шага, как задано в ШагиРасчета в ОписатьПорядокЗаполненияПоказателя
//                                       * Значение - представление значения
//  ОписаниеПорядкаЗаполненияПоказателя - ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.НовыйОписаниеПорядкаЗаполненияПоказателя - заданное в ОписатьПорядокЗаполненияПоказателя
//  Процессор - ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.НовыйПроцессорЗаполненияОтчета - содержит, в частности,
//              ДанныеАлгоритма, полученные в ПолучитьДанныеУчета
//
Процедура ОписатьЗаполняемоеЗначение(ЗаписьРасчет, СоставШагаРасчета, КешПредставлений, ОписаниеПорядкаЗаполненияПоказателя, Процессор) Экспорт
	
	ВыполненоПереопределение = Ложь;
	ЗаполнениеБухгалтерскойОтчетностиПереопределяемый.ОписатьЗаполняемоеЗначение(
		ВыполненоПереопределение,
		ЗаписьРасчет,
		СоставШагаРасчета,
		КешПредставлений,
		ОписаниеПорядкаЗаполненияПоказателя,
		Процессор);
	Если ВыполненоПереопределение Тогда
		Возврат;
	КонецЕсли;
	
	Если Процессор.Алгоритм = ИдентификаторАлгоритмаНалоги() Тогда
		ОписатьЗаполняемоеЗначениеНалоги(ЗаписьРасчет, КешПредставлений, Процессор.КодЯзыка);
	ИначеЕсли Процессор.Алгоритм = ИдентификаторАлгоритмаРезультатПереоценкиВнеоборотныхАктивов() Тогда
		ОписатьЗаполняемоеЗначениеРезультатПереоценкиВнеоборотныхАктивов(ЗаписьРасчет, КешПредставлений, Процессор.КодЯзыка);
	ИначеЕсли Процессор.Алгоритм = ИдентификаторАлгоритмаДенежныеПотоки() Тогда
		ОписатьЗаполняемоеЗначениеДенежныеПотоки(ЗаписьРасчет, СоставШагаРасчета, Процессор.ДанныеАлгоритма, Процессор.КодЯзыка);
	КонецЕсли;
	
КонецПроцедуры

// Позволяет описать алгоритм расчета суммирующих показателей - то есть, основанных не напрямую на выбранных данных,
// а на значениях других показателей.
// Суммирующие показатели следует применять в исключительных случаях, так как в обычных случаях суммирование обеспечивается механизмом авторасчета в БРО.
//
// Параметры:
//  СуммирующиеПоказатели - Соответствие - следует указать правила суммирования:
//           * Ключ - Число - идентификатор показателя, представляющего собой сумму других ("суммирующего")
//           * Значение - Массив из Число - идентификаторы показателей, выступающих как слагаемые ("суммируемых")
//  Алгоритм    - Строка, ЛюбаяСсылка - идентификатор выполняемого алгоритма заполнения
//  ДанныеАлгоритма - Структура - см. ПолучитьДанныеУчета
//
Процедура ОписатьСуммирующиеПоказатели(СуммирующиеПоказатели, Алгоритм, ДанныеАлгоритма) Экспорт
	
	Если Алгоритм = ИдентификаторАлгоритмаНалоги() Тогда
		ОписатьСуммирующиеПоказателиНалоги(СуммирующиеПоказатели, ДанныеАлгоритма);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет и помещает Счета денежных средств в данные алгоритма
//
// Параметры:
//  ДанныеАлгоритма - Структура - см. ПолучитьДанныеУчета
//
Процедура УстановитьСчетаДенежныеСредства(ДанныеАлгоритма) Экспорт
	
	ДанныеАлгоритма.Вставить("Счета", Новый Структура);
	ДанныеАлгоритма.Счета.Вставить("Описание",         Новый СписокЗначений);
	ДанныеАлгоритма.Счета.Вставить("Деньги",           Новый Массив);
	ДанныеАлгоритма.Счета.Вставить("ДеньгиСводно",     Новый Массив);
	ДанныеАлгоритма.Счета.Вставить("ДеньгиДетально",   Новый Массив);
	ДанныеАлгоритма.Счета.Вставить("ДеньгиОбменВалют", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетаДенег",                ПредопределенныеСчетаДенег());
	Запрос.УстановитьПараметр("СчетаДенежныхИнструментов", ПредопределенныеСчетаДенежныхИнструментов());
	Запрос.УстановитьПараметр("СчетаОбменВалют",           ПредопределенныеСчетаОбменВалют());
	Запрос.УстановитьПараметр("МультивалютныйУчет",        БухгалтерскийУчетПереопределяемый.ИспользоватьВалютныйУчет());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Ссылка,
	|	Хозрасчетный.Представление КАК Представление,
	|	Хозрасчетный.Порядок КАК Порядок,
	|	НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|		И (&МультивалютныйУчет
	|			ИЛИ НЕ Хозрасчетный.Валютный) КАК Активный,
	|	&МультивалютныйУчет
	|		И Хозрасчетный.Ссылка В ИЕРАРХИИ (&СчетаОбменВалют) КАК ВалютноОбменный
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(&СчетаДенег)
	|	И НЕ Хозрасчетный.Ссылка В ИЕРАРХИИ (&СчетаДенежныхИнструментов)
	|	И НЕ Хозрасчетный.Забалансовый
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеАлгоритма.Счета.Описание.Добавить(Выборка.Ссылка, Выборка.Представление, Выборка.Активный);
		Если Выборка.ВалютноОбменный Тогда
			ДанныеАлгоритма.Счета.ДеньгиОбменВалют.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеАлгоритма.Счета.Деньги = ДанныеАлгоритма.Счета.Описание.ВыгрузитьЗначения();
	
	Аналитика = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДвиженияДенежныхСредств;
	ДанныеАлгоритма.Счета.ДеньгиДетально = СчетаПрименяетсяАналитика(ДанныеАлгоритма.Счета.Деньги, Аналитика);
	
	ДанныеАлгоритма.Счета.ДеньгиСводно = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		ДанныеАлгоритма.Счета.Деньги,
		ДанныеАлгоритма.Счета.ДеньгиДетально);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтруктураОтчета

// Методы этого раздела содержат высокоуровневое "методическое" описание порядка заполнения отчетов.

// Хранит описание настроек ОФР по умолчанию.
//
// Параметры:
//  Процессор - ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.НовыйПроцессорОписанияЗаполняемыеПоказатели - управляющая коллекция
//
Процедура ЗаполнитьНастройкиПоУмолчаниюОФР(Процессор)
	
	КодЯзыка = ОбщегоНазначения.КодОсновногоЯзыка(); // Значения могут записываться в базу данных
	
	// Операционная деятельность:
	
	ДобавитьГруппу(Процессор, "2110"); // Выручка
	УстановитьАлгоритм(Процессор, ПланыСчетов.Хозрасчетный.Выручка);
	
	ДобавитьГруппу(Процессор, "2120"); // Себестоимость продаж
	УстановитьАлгоритм(Процессор, ПланыСчетов.Хозрасчетный.СебестоимостьПродаж);
	
	ДобавитьГруппу(Процессор, "2210"); // Коммерческие расходы
	УстановитьАлгоритм(Процессор, ПланыСчетов.Хозрасчетный.Продажи_РасходыНаПродажу);
	
	ДобавитьГруппу(Процессор, "2220"); // Управленческие расходы
	УстановитьАлгоритм(Процессор, ПланыСчетов.Хозрасчетный.Продажи_УправленческиеРасходы);
	
	// Инвестиционная и финансовая деятельность:
	
	НачатьАлгоритм(Процессор, ИдентификаторАлгоритмаПрочиеДоходыРасходы());
	
	ДобавитьГруппу(Процессор, "2310"); // Доходы от участия в других организациях
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.УчастиеВДругихОрганизациях);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.ДолевоеУчастиеВРоссийскихОрганизациях);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.ДолевоеУчастиеВИностранныхОрганизациях);
	
	КодГруппыПроцентыКУплате = "2330";
	Если Процессор.КонтекстОтчета.Упрощенная Тогда
		// В формате упрощенной отчетности используется нестандартный (не описанный в ФСБУ 4) код.
		// Для корректной выгрузки в формат для нумерации ячеек формы используется нестандартный код,
		// при этом соответствующие показатели визуализируются как в БРО, так и в ГИРБО стандартным кодом.
		// Поэтому применяем его и при заполнении.
		КодГруппыПроцентыКУплате = "2130";
	КонецЕсли;
	
	ДобавитьГруппу(Процессор, "2320"); // Проценты к получению
	Если Не ИспользуетсяУстаревшийВариантУчетаПроцентныхДоходовРасходов() Тогда
		
		ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.ПроцентыКПолучению);
		ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.ПроцентыПоГосударственнымЦеннымБумагам);
		ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.ПроцентыПоГосударственнымЦеннымБумагамПоСтавке0);
		
		ДобавитьГруппу(Процессор, КодГруппыПроцентыКУплате); // Проценты к уплате
		ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.ПроцентыКУплате);
		ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.ПроцентыНачисленныеПоСт269);
		
	Иначе
		
		// В одной из следующих версий предполагается удаление этого - устаревшего - варианта.
		
		// Он позволяет совместить устаревшее поведение (до начала применения ФСБУ 4) и актуальное.
		// Устаревшее поведение заключается в том, что для учета процентных доходов и процентных расходов
		// используется одна и та же статья. Соответственно, при заполнении отчета данные по ней нужно представлять развернуто.
		// В этом случае используется вид ПроцентыКПолучениюУплате.
		// Актуальное поведение заключается в том, что доходы и расходы, как правило, отражаются на разных статьях, в том числе, с разными видами -
		// ПроцентыКПолучению и ПроцентыКУплате соответственно.
		// При этом, если проценты получаются и уплачиваются в рамках одного или нескольких аналогичных фактов хозяйственной жизни
		// (например, в рамках кеш-менеджмента), достаточно отражать их на одной статье, с тем, чтобы в отчете они были представлены свернуто.
		
		ДобавитьПоказатель(Процессор, НСтр("ru = 'Проценты к получению'", КодЯзыка)); // Только доходы
		ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.ПроцентыКПолучению);
		ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.ПроцентыПоГосударственнымЦеннымБумагам);
		ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.ПроцентыПоГосударственнымЦеннымБумагамПоСтавке0);
	
		ДобавитьГруппуОтрицательныхЗначений(Процессор, КодГруппыПроцентыКУплате); // Проценты к уплате
		ДобавитьПоказатель(Процессор, НСтр("ru = 'Проценты к получению (уплате)'", КодЯзыка)); // Общий для доходов и расходов
		УстановитьЗачетПоказателейПрочиеДоходыРасходы(Процессор, "Нет");
		ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.ПроцентыКПолучениюУплате);
		
		ДобавитьПоказательРасходы(Процессор, НСтр("ru = 'Проценты к уплате'", КодЯзыка)); // Только расходы
		ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.ПроцентыКУплате);
		ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.ПроцентыНачисленныеПоСт269);
		
	КонецЕсли;
	
	ДобавитьГруппу(Процессор, "2340"); // Прочие доходы
	ДобавитьГруппуОтрицательныхЗначений(Процессор, "2350"); // Прочие расходы
	
	ДобавитьПоказатель(Процессор, НСтр("ru = 'Операции с инструментами финансового рынка'", КодЯзыка));
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.РеализацияЦенныхБумаг);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделок);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделокОР);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.РазницаМеждуПервоначальнойИНоминальнойСтоимостьюПоДолговымЦеннымБумагам);
	
	ДобавитьПоказатель(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.СдачаИмуществаВАрендуИлиСубаренду);
	УстановитьЗачетПоказателейПрочиеДоходыРасходы(Процессор, "СтатьиОбъекты");
	
	ДобавитьПоказатель(Процессор, НСтр("ru = 'Реализация и ликвидация внеоборотных активов'", КодЯзыка));
	УстановитьЗачетПоказателейПрочиеДоходыРасходы(Процессор, "СтатьиОбъекты");
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.РеализацияОсновныхСредств);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.РеализацияНематериальныхАктивов);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.РеализацияОбъектовСтроительства);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.ЛиквидацияОсновныхСредств);
	
	ДобавитьПоказательРасходы(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.РасходыОтСниженияСтоимостиАктивов);
	
	ДобавитьПоказательРасходы(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.ОтчисленияВОценочныеРезервы);
	
	ДобавитьПоказатель(Процессор, НСтр("ru = 'Реализация иного имущества, прав требования, прочих работ и услуг'", КодЯзыка));
	УстановитьЗачетПоказателейПрочиеДоходыРасходы(Процессор, "СтатьиОбъекты");
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.РеализацияПрочегоИмущества);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияКакОказанияФинансовыхУслуг);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияДоНаступленияСрокаПлатежа);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияПослеНаступленияСрокаПлатежа);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравКромеПраваТребования);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравПоОбъектамОбслуживающихПроизводствИХозяйств);
	
	ДобавитьПоказатель(Процессор, НСтр("ru = 'Результаты инвентаризации'", КодЯзыка));
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.ИзлишкиПриИнвентаризации);
	// Выделенной статьи для недостач не предусмотрено. При существенности следует использовать отдельную статью и включить ее в этот показатель.
	
	ДобавитьПоказатель(Процессор, НСтр("ru = 'Иная операционная деятельность'", КодЯзыка));
	УстановитьЗачетПоказателейПрочиеДоходыРасходы(Процессор, "СтатьиОбъекты");
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.ПрочиеОперационныеДоходыРасходы);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.СписаниеДебиторскойКредиторскойЗадолженности);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.НДСПоСписаннойКредиторскойЗадолженности);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.РасходыПоПередачеТоваровБезвозмездноИДляСобственныхНужд);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.БезвозмездноеПолучениеИмуществаРаботУслугИмущественныхПрав);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.РасходыНаУслугиБанков);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.НалогиИСборы);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.ПремияПокупателю);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.ПрочиеКосвенныеРасходы);
	
	ДобавитьПоказатель(Процессор, НСтр("ru = 'Курсовые разницы'", КодЯзыка));
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.КурсовыеРазницы);
	ДополнитьОтбор(Процессор, Перечисления.ВидыПрочихДоходовИРасходов.КурсовыеРазницыПоРасчетамВУЕ);
	
	ДобавитьОсновнойПоказатель(Процессор, НСтр("ru = 'Статьи, не включенные ни в один другой показатель отчета'", КодЯзыка));
	УстановитьЗачетПоказателейПрочиеДоходыРасходы(Процессор, "СтатьиОбъекты");
	
	// Налоги на доход (прибыль):
	
	НачатьАлгоритм(Процессор, ИдентификаторАлгоритмаНалоги());
	
	ДобавитьГруппу(Процессор, "2410"); // Налог на прибыль организаций
	ДополнитьОтбор(Процессор, ПланыСчетов.Хозрасчетный.ПрибылиИУбытки_НалогНаПрибыль);
	
	ДобавитьГруппу(Процессор, "2411"); // Текущий налог на прибыль организаций
	ДобавитьГруппу(Процессор, "2412"); // Отложенный налог на прибыль организаций
	ДополнитьОтбор(Процессор, ПланыСчетов.Хозрасчетный.ОтложенныйНалогНаПрибыль);
	
	ДобавитьГруппу(Процессор, "2410", НСтр("ru = 'Налог при упрощенной системе налогообложения'", КодЯзыка));
	ДополнитьОтбор(Процессор, ПланыСчетов.Хозрасчетный.ЕНприУСН);
	
	ДобавитьГруппу(Процессор, "2410", НСтр("ru = 'Налог при Автоматизированной упрощенной системе налогообложения'", КодЯзыка));
	ДополнитьОтбор(Процессор, ПланыСчетов.Хозрасчетный.НалогПриАУСН);
	
	ДобавитьГруппу(Процессор, "2410", НСтр("ru = 'Налог на профессиональный доход'", КодЯзыка));
	ДополнитьОтбор(Процессор, ПланыСчетов.Хозрасчетный.НалогНаПрофессиональныйДоход);
	
	ДобавитьГруппу(Процессор, "2410", НСтр("ru = 'НДФЛ индивидуального предпринимателя'", КодЯзыка));
	ДополнитьОтбор(Процессор, ПланыСчетов.Хозрасчетный.НДФЛ_ИП);
	
	// Прекращаемая деятельность:
	
	ДобавитьГруппу(Процессор, "2420"); // Прибыль (убыток) от прекращаемой деятельности (за вычетом относящегося к ней налога на прибыль организаций)
	ДобавитьПоказатель(Процессор, НСтр("ru = 'Прибыль (убыток) от прекращаемой деятельности'", КодЯзыка));
	УстановитьАлгоритм(Процессор, ПланыСчетов.Хозрасчетный.ПрочиеДоходыИРасходы);
	ДобавитьПоказатель(Процессор, НСтр("ru = 'Налог на прибыль, относящийся к прекращаемой деятельности'", КодЯзыка));
	УстановитьАлгоритм(Процессор, Неопределено); // Пока не умеем определять
	
	// Не включаемые в чистую прибыль:
	
	НачатьАлгоритм(Процессор, ИдентификаторАлгоритмаРезультатПереоценкиВнеоборотныхАктивов());
	
	ДобавитьГруппу(Процессор, "2510"); // Результат переоценки внеоборотных активов, не включаемый в чистую прибыль (убыток)
	ДобавитьПоказатель(Процессор, НСтр("ru = 'Прирост стоимости основных средств'", КодЯзыка));
	ДополнитьОтбор(Процессор, ПланыСчетов.Хозрасчетный.ПриростСтоимостиИмуществаПоПереоценке);
	ДобавитьПоказатель(Процессор, НСтр("ru = 'Прирост стоимости нематериальных активов'", КодЯзыка));
	ДополнитьОтбор(Процессор, ПланыСчетов.Хозрасчетный.ПриростСтоимостиНМАПоПереоценке);
	ДобавитьОсновнойПоказатель(Процессор, НСтр("ru = 'Прирост стоимости прочих активов'", КодЯзыка));
	
	ДобавитьГруппу(Процессор, "2530"); // Налог на прибыль организаций, относящийся к результатам переоценки внеоборотных активов и прочих операций, не включаемых в чистую прибыль (убыток)
	ДополнитьОтбор(Процессор, "ОтложенныйНалог");
	
КонецПроцедуры

// Хранит описание настроек ОДДС по умолчанию.
//
// Параметры:
//  Процессор - ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.НовыйПроцессорОписанияЗаполняемыеПоказатели - управляющая коллекция
//
Процедура ЗаполнитьНастройкиПоУмолчаниюОДДС(Процессор)
	
	// См. ПБУ 23, IAS 7
	
	КодЯзыка = ОбщегоНазначения.КодОсновногоЯзыка(); // Значения могут записываться в базу данных
	
	// ОСТАТКИ
	ДобавитьГруппу(Процессор, "4450"); // Остаток денежных средств и денежных эквивалентов на начало периода
	УстановитьАлгоритм(Процессор, ИдентификаторАлгоритмаДенежныеСредства());
	
	// ОБОРОТЫ
	НачатьАлгоритм(Процессор, ИдентификаторАлгоритмаДенежныеПотоки());
	ДобавитьСворачиваемыйДенежныйПоток(Процессор, "НДС"); // подп. 16(б) ПБУ 23; по умолчанию применяем везде
	
	РаспределятьЕдиныйНалоговыйПлатеж = РаспределятьЕдиныйНалоговыйПлатеж(Процессор.КонтекстОтчета);
	
	// Операционная деятельность
	// - Поступления
	
	ДобавитьГруппу(Процессор, "4111"); // От продажи продукции, товаров, работ и услуг
	ДобавитьПоказатель(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.СредстваПолученныеОтПокупателейИЗаказчиков);
	
	// подп. 16(а) ПБУ 23:
	// -- деньги от комитента на закупку условно считаем ушедшими продавцам товаров транзитом
	Если ПолучитьФункциональнуюОпцию("ОсуществляетсяРеализацияТоваровУслугКомитентов") Тогда
		ДобавитьСворачиваемыйДенежныйПоток(Процессор, "АгентПокупателя");
	КонецЕсли;
	// -- платежи комитенту условно считаем полученными от покупателей - они тоже транзитные
	Если ПолучитьФункциональнуюОпцию("ОсуществляетсяЗакупкаТоваровУслугДляКомитентов") Тогда
		ДобавитьПоказательСвернутогоДенежногоПотока(Процессор, "АгентПродавца", НСтр("ru = 'Исключены суммы продаж в интересах комитента'", КодЯзыка));
	КонецЕсли;
	
	ДобавитьПоказательДенежногоПотокаПоСчету(
		Процессор,
		НСтр("ru = 'Поступления от продаж по платежным картам'", КодЯзыка),
		ПланыСчетов.Хозрасчетный.ПродажиПоПлатежнымКартам);
	
	ДобавитьГруппу(Процессор, "4112"); // Арендных платежей, лицензионных платежей, роялти, комиссионных и иных аналогичных платежей
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.АрендныеПлатежиРоялтиЛицензионныеПлатежиГонорарыКомиссионные);
	
	ДобавитьГруппу(Процессор, "4113"); // От перепродажи финансовых вложений
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ПоступленияОтПерепродажиФинансовыхВложений);
	
	ДобавитьГруппу(Процессор, "4114"); // Процентов по дебиторской задолженности покупателей
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ПоступлениеПроцентовПоДебиторскойЗадолженностиПокупателей);
	
	ДобавитьГруппу(Процессор, "4119"); // Прочие поступления
	ДобавитьПоказатель(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ПрочиеПоступленияПоТекущейДеятельности);
	ПоказательЕдиныйНалоговыйПлатеж = Неопределено;
	Если Не РаспределятьЕдиныйНалоговыйПлатеж Тогда
		ПоказательЕдиныйНалоговыйПлатеж = ДобавитьПоказатель(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ЕдиныйНалоговыйПлатеж);
		// Сальдируем его с налогом, уплачиваемым посредством расчетов с контрагентами
		ДобавитьЗначениеСвернутогоДенежногоПотока(
			Процессор,
			"НДС",
			НСтр("ru = 'Налог на добавленную стоимость в составе расчетов с контрагентами'", КодЯзыка));
		// Общий показатель не включаем в общем порядке в группу отрицательных значений - см. ДобавитьГруппуОтрицательныхЗначенийЕдиныйНалоговыйПлатеж
	КонецЕсли;
	НачатьДобавлениеПоказателейПоложительныхЗначений(Процессор); // См. ДополнитьГруппуОтрицательныхЗначений
	ДобавитьПоказательСвернутогоДенежногоПотока(Процессор, "ОбменВалют", НСтр("ru = 'Выгоды и потери от валютно-обменных операций'", КодЯзыка));
	Если ПоказательЕдиныйНалоговыйПлатеж = Неопределено Тогда
		
		РаспределитьДенежныйПоток(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ЕдиныйНалоговыйПлатеж);
		ОграничитьСворачиваемыйДенежныйПоток(Процессор, "НДС");
		
		ДобавитьПоказательСвернутогоДенежногоПотока(Процессор, "НДС", НСтр("ru = 'Налог на добавленную стоимость'", КодЯзыка)); // Включает часть ЕНП
		
	КонецЕсли;
	ДобавитьОсновнойПоказатель(Процессор, НСтр("ru = 'Статьи, не включенные ни в один другой показатель отчета'", КодЯзыка));
	ДобавитьСворачиваемыйДенежныйПоток(Процессор, "КурсовыеРазницы");
	
	// - Платежи
	
	ДобавитьГруппу(Процессор, "4121"); // Поставщикам (подрядчикам) за сырье, материалы, работы, услуги
	ДобавитьПоказатель(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ОплатаОборотныхАктивов);
	// подп. 16(а) ПБУ 23:
	// -- платежи комитенту условно считаем полученными от покупателей
	Если ПолучитьФункциональнуюОпцию("ОсуществляетсяЗакупкаТоваровУслугДляКомитентов") Тогда
		ДобавитьСворачиваемыйДенежныйПоток(Процессор, "АгентПродавца");
	КонецЕсли;
	// -- деньги от комитента на закупку условно считаем ушедшими продавцам товаров
	Если ПолучитьФункциональнуюОпцию("ОсуществляетсяРеализацияТоваровУслугКомитентов") Тогда
		ДобавитьПоказательСвернутогоДенежногоПотока(
			Процессор,
			"АгентПокупателя",
			НСтр("ru = 'Исключены суммы приобретений в интересах комитента'", КодЯзыка));
	КонецЕсли;
	
	ДобавитьГруппу(Процессор, "4122"); // В связи с оплатой труда работников
	ДобавитьПоказатель(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ОплатаТруда);
	ОграничитьСворачиваемыйДенежныйПоток(Процессор, "НДС");
	
	Если ПоказательЕдиныйНалоговыйПлатеж = Неопределено Тогда
		
		ДобавитьПоказательРаспределенныйЕдиныйНалоговыйПлатеж(
			Процессор,
			НалоговыеПлатежиНДФЛОплатыТруда(),
			НСтр("ru = 'НДФЛ с оплаты труда в составе единого налогового платежа'", КодЯзыка));
		ДобавитьПоказательРаспределенныйЕдиныйНалоговыйПлатеж(
			Процессор,
			Перечисления.ВидыНалогов.НалоговыеПлатежиСтраховыеВзносыОплатыТруда(),
			НСтр("ru = 'Страховые взносы с оплаты труда в составе единого налогового платежа'", КодЯзыка));
		
	КонецЕсли;
	
	ДобавитьГруппу(Процессор, "4123"); // Процентов по долговым обязательствам
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ВыплатаПроцентовПоДолговымОбязательствам);
	
	ДобавитьГруппу(Процессор, "4124"); // Налога на прибыль организаций
	ДобавитьПоказатель(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.НалогНаПрибыль);
	ОграничитьСворачиваемыйДенежныйПоток(Процессор, "НДС");
	Если ПоказательЕдиныйНалоговыйПлатеж = Неопределено Тогда
		
		ДобавитьПоказательРаспределенныйЕдиныйНалоговыйПлатеж(
			Процессор,
			Перечисления.ВидыНалогов.НалоговыеПлатежиНалогНаПрибыль(),
			НСтр("ru = 'Налог на прибыль в составе единого налогового платежа'", КодЯзыка));
		
	Иначе
		
		ДобавитьГруппуОтрицательныхЗначенийЕдиныйНалоговыйПлатеж(
			Процессор,
			"4124",
			НСтр("ru = 'Налоги (сборы, взносы) в составе единого налогового платежа'", КодЯзыка),
			ПоказательЕдиныйНалоговыйПлатеж);
		// В образце наименования групп являются продолжением фразы "в том числе [платежи]:".
		УстановитьНаименованиеГруппыИзОбразца(НСтр("ru = 'налогов (сборов, взносов) в составе единого налогового платежа'", КодЯзыка), Процессор);
		
	КонецЕсли;
	
	ДобавитьГруппу(Процессор, "4129"); // Прочие платежи
	ДобавитьПоказатель(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ПрочиеРасходыПоТекущейДеятельности);
	ДополнитьГруппуОтрицательныхЗначений(Процессор);
	
	// Инвестиционная деятельность
	// - Поступления
	ДобавитьГруппу(Процессор, "4211"); // От продажи внеоборотных активов (кроме финансовых вложений)
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ВыручкаОтПродажиВнеоборотныхАктивовКромеФинансовых);
	
	ДобавитьГруппу(Процессор, "4212"); // От продажи акций других организаций (долей участия)
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ПоступленияОтПродажиАкцийДругихОрганизаций);
	
	ДобавитьГруппу(Процессор, "4213"); // От возврата предоставленных займов, от продажи долговых ценных бумаг (прав требования денежных средств к другим лицам)
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ПоступленияОтПогашенияЗаймовПродажиДолговыхЦенныхБумаг);
	
	ДобавитьГруппу(Процессор, "4214"); // Дивидендов, процентов по долговым финансовым вложениям и аналогичных поступлений от долевого участия в других организациях
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ПоступлениеОтДивидендовПроцентовПоДолговымФинансовымВложениям);
	
	ДобавитьГруппу(Процессор, "4219"); // Прочие поступления
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ПрочиеПоступленияПоИнвестиционнойДеятельности);
	
	// - Платежи
	ДобавитьГруппу(Процессор, "4221"); // В связи с приобретением, созданием, модернизацией, реконструкцией и подготовкой к использованию внеоборотных активов
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ПриобретениеСозданиеМодернизацияРеконструкцияВнеоборотныхАктивов);
	
	ДобавитьГруппу(Процессор, "4222"); // В связи с приобретением акций других организаций (долей участия)
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ПриобретениеАкцийДругихОрганизаций);
	
	ДобавитьГруппу(Процессор, "4223"); // В связи с приобретением долговых ценных бумаг (прав требования денежных средств к другим лицам), предоставление займов другим лицам
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ПриобретениеДолговыхЦенныхБумагПредоставлениеЗаймов);
	
	ДобавитьГруппу(Процессор, "4224"); // Процентов по долговым обязательствам, включаемым в стоимость инвестиционного актива
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ВыплатаПроцентовВСвязиСоСтроительством);
	
	ДобавитьГруппу(Процессор, "4229"); // Прочие платежи
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ПрочиеРасходыПоИнвестиционнойДеятельности);

	// Финансовая деятельность
	// - Поступления
	ДобавитьГруппу(Процессор, "4311"); // Получение кредитов и займов
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ПоступленияОтЗаймовИКредитовПредоставленныхДругимиОрганизациями);
	
	ДобавитьГруппу(Процессор, "4312"); // Денежных вкладов собственников (участников)
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ПоступлениеДенежныхВкладовСобственников);
	
	ДобавитьГруппу(Процессор, "4313"); // От выпуска акций, увеличения долей участия
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ПоступленияОтЭмиссииАкций);
	
	ДобавитьГруппу(Процессор, "4314"); // От выпуска облигаций, векселей и других долговых ценных бумаг
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ВыпускДолговыхИнструментов);
	
	ДобавитьГруппу(Процессор, "4319"); // Прочие поступления
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ПрочиеПоступленияПоФинансовойДеятельности);
	
	// - Платежи
	ДобавитьГруппу(Процессор, "4321"); // Собственникам (участникам) в связи с выкупом у них акций (долей участия) организации или их выходом из состава участников
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ПлатежиСобственникамВСвязиСВыкупомАкцийИлиПриВыходеИзСоставаУчастников);
	
	ДобавитьГруппу(Процессор, "4322"); // На уплату дивидендов и иных платежей по распределению прибыли в пользу собственников (участников)
	ДобавитьПоказатель(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ВыплатаДивидендов);
	Если ПоказательЕдиныйНалоговыйПлатеж = Неопределено Тогда
		ДобавитьПоказательРаспределенныйЕдиныйНалоговыйПлатеж(
			Процессор,
			Перечисления.ВидыНалогов.НалоговыеПлатежиНалогНаПрибыльДивидендов(),
			НСтр("ru = 'Налог на прибыль, удержанный при выплате дивидендов'", КодЯзыка));
		ДобавитьПоказательРаспределенныйЕдиныйНалоговыйПлатеж(
			Процессор,
			НалоговыеПлатежиНДФЛДивидендов(),
			НСтр("ru = 'НДФЛ, удержанный при выплате дивидендов'", КодЯзыка));
	КонецЕсли;
	
	ДобавитьГруппу(Процессор, "4323"); // В связи с погашением (выкупом) векселей и других долговых ценных бумаг, возврат кредитов и займов
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ПогашениеДолговыйЦенныхБумагВозвратКредитовИЗаймов);
	
	ДобавитьГруппу(Процессор, "4329"); // Прочие платежи
	ДополнитьОтбор(Процессор, Перечисления.ВидыДвиженийДенежныхСредств.ПрочиеРасходыПоФинансовойДеятельности);
	
	// Величина влияния изменения курса иностранной валюты по отношению к рублю
	ДобавитьГруппу(Процессор, "4490");
	ДобавитьПоказательСвернутогоДенежногоПотока(Процессор, "КурсовыеРазницы", НСтр("ru = 'Изменения курса иностранной валюты по отношению к рублю'", КодЯзыка));
	
КонецПроцедуры

#КонецОбласти

#Область АлгоритмыЗаполнения

#Область Продажи

// Набор схожих алгоритмов

// В описаниях показателей с этим алгоритмом свойство Заполнение.Отбор может содержать один из следующих ключей:
//   * НоменклатурнаяГруппа - Массив Из СправочникСсылка.НоменклатурныеГруппы (допускаются группы и элементы)

#Область СчетаУчета

Функция ИдентификаторыАлгоритмовПродажи()
	
	Алгоритмы = Новый Массив;
	
	Алгоритмы.Добавить(ИдентификаторАлгоритмаВыручка());
	Алгоритмы.Добавить(ИдентификаторАлгоритмаСебестоимостьПродаж());
	Алгоритмы.Добавить(ИдентификаторАлгоритмаРасходыНаПродажу());
	Алгоритмы.Добавить(ИдентификаторАлгоритмаУправленческиеРасходы());
	
	Возврат Алгоритмы;
	
КонецФункции

Функция ИдентификаторАлгоритмаВыручка()
	Возврат ПланыСчетов.Хозрасчетный.Выручка;
КонецФункции

Функция ИдентификаторАлгоритмаСебестоимостьПродаж()
	Возврат ПланыСчетов.Хозрасчетный.СебестоимостьПродаж;
КонецФункции

Функция ИдентификаторАлгоритмаРасходыНаПродажу()
	Возврат ПланыСчетов.Хозрасчетный.Продажи_РасходыНаПродажу;
КонецФункции

Функция ИдентификаторАлгоритмаУправленческиеРасходы()
	Возврат ПланыСчетов.Хозрасчетный.Продажи_УправленческиеРасходы;
КонецФункции

Функция ЭтоАлгоритмПродажи(Алгоритм)
	АлгоритмыПродажи = ИдентификаторыАлгоритмовПродажи();
	Возврат АлгоритмыПродажи.Найти(Алгоритм) <> Неопределено;
КонецФункции

Функция СчетаПродажи(Алгоритм)
	
	Если Алгоритм = ИдентификаторАлгоритмаВыручка() Тогда
		Возврат СубсчетаОсновногоСчетаПродаж(Алгоритм, ВидСчета.Активный);
	ИначеЕсли Алгоритм = ИдентификаторАлгоритмаСебестоимостьПродаж() Тогда
		Возврат СубсчетаОсновногоСчетаПродаж(Алгоритм, ВидСчета.Пассивный);
	Иначе
		Возврат СубсчетаОсновногоСчетаПродаж(Алгоритм, Неопределено);
	КонецЕсли;
	
КонецФункции

Функция СубсчетаОсновногоСчетаПродаж(Алгоритм, Знач ВидРегулирующихСчетов)
	
	Запрос = Новый Запрос;
	
	ИсключаемыеСчета = ИдентификаторыАлгоритмовПродажи();
	ИсключаемыеСчета.Добавить(ПланыСчетов.Хозрасчетный.ПрибыльУбытокОтПродаж);
	
	ЗаданВидРегулирующихСчетов = Истина;
	Если Не ЗначениеЗаполнено(ВидРегулирующихСчетов) Тогда
		ЗаданВидРегулирующихСчетов = Ложь;
		ВидРегулирующихСчетов = ВидСчета.АктивноПассивный; // Для обеспечения совместимости типов в запросе
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВедущийСчет",                Алгоритм);
	Запрос.УстановитьПараметр("ЗаданВидРегулирующихСчетов", ЗаданВидРегулирующихСчетов);
	Запрос.УстановитьПараметр("ВидРегулирующихСчетов",      ВидРегулирующихСчетов);
	Запрос.УстановитьПараметр("ИсключаемыеСчета",           ИсключаемыеСчета);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновнойСчет.Ссылка КАК Счет,
	|	ОсновнойСчет.Порядок КАК Порядок
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК ОсновнойСчет
	|ГДЕ
	|	ОсновнойСчет.Ссылка В ИЕРАРХИИ(&ВедущийСчет)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РегулирующиеСчета.Ссылка,
	|	РегулирующиеСчета.Порядок
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК РегулирующиеСчета
	|ГДЕ
	|	&ЗаданВидРегулирующихСчетов
	|	И РегулирующиеСчета.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи))
	|	И НЕ РегулирующиеСчета.Ссылка В ИЕРАРХИИ (&ИсключаемыеСчета)
	|	И РегулирующиеСчета.Вид = &ВидРегулирующихСчетов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	Счет";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
КонецФункции

Функция ОбязательныеСчетаПродажи()
	
	ОбязательныеСчета = Новый Массив;
	
	ОбязательныеСчета.Добавить(ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД);
	ОбязательныеСчета.Добавить(ПланыСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД);
	ОбязательныеСчета.Добавить(ПланыСчетов.Хозрасчетный.Продажи_НДС);
	ОбязательныеСчета.Добавить(ПланыСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД);
	ОбязательныеСчета.Добавить(ПланыСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД);
	
	Возврат СоответствиеИзМассива(ОбязательныеСчета);
	
КонецФункции

#КонецОбласти

#Область КлассифицируемыеОбъекты

Функция ТипЗначенияКлассифицируемыхОбъектовПродажи()
	
	Возврат Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы");
	
КонецФункции

Процедура ЗаполнитьОтборКлассифицируемымиОбъектамиПродажи(Отбор, КлассифицируемыеОбъекты)
	
	Отбор.Вставить("НоменклатурнаяГруппа", КлассифицируемыеОбъекты.ВыгрузитьЗначения());
	
КонецПроцедуры

Процедура СоздатьТаблицыКлассифицируемыхОбъектовПродажи(МенеджерВременныхТаблиц, Показатели)
	
	Настройки = НастройкиОбъектовПродажи(Показатели);
	
	СоздатьНастройкиОбъектовПродажи(МенеджерВременныхТаблиц, Настройки);
	СоздатьИерархияНастроенныхОбъектовПродажи(МенеджерВременныхТаблиц);
	СоздатьНастроенныеОбъектыПродажи(МенеджерВременныхТаблиц);
	СоздатьКлассифицируемыеОбъектыПродажи(МенеджерВременныхТаблиц);
	
КонецПроцедуры

Функция НастройкиОбъектовПродажи(Показатели)
	
	Настройки = Новый ТаблицаЗначений;
	Настройки.Колонки.Добавить("Объект", Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));
	Настройки.Колонки.Добавить("Идентификатор", ТипИдентификаторПоказателя());
	Настройки.Колонки.Добавить("Порядок", ТипИдентификаторПоказателя());
	
	Для Каждого Показатель Из Показатели Цикл
		Отбор = Показатель.Заполнение.Отбор;
		Если Не ЗначениеЗаполнено(Отбор) Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого НоменклатурнаяГруппа Из Отбор.НоменклатурнаяГруппа Цикл
			Настройка = Настройки.Добавить();
			Настройка.Идентификатор = БухгалтерскаяОтчетностьБРО.ИдентификаторПоказателя(Показатель);
			Настройка.Объект = НоменклатурнаяГруппа;
			Настройка.Порядок = Настройки.Количество();
		КонецЦикла;
	КонецЦикла;
	
	Возврат Настройки;
	
КонецФункции

Процедура СоздатьНастройкиОбъектовПродажи(МенеджерВременныхТаблиц, Настройки)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Настройки", Настройки);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройки.Объект КАК Объект,
	|	Настройки.Идентификатор КАК Настройка,
	|	Настройки.Порядок КАК Порядок
	|ПОМЕСТИТЬ ВТ_Настройки
	|ИЗ
	|	&Настройки КАК Настройки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Настройки.Объект КАК Объект,
	|	МИНИМУМ(Настройки.Настройка) КАК Настройка,
	|	МИНИМУМ(Настройки.Порядок) КАК Порядок
	|ПОМЕСТИТЬ НастройкиОбъектовПродажи
	|ИЗ
	|	ВТ_Настройки КАК Настройки
	|СГРУППИРОВАТЬ ПО
	|	Настройки.Объект
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Настройки";
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьИерархияНастроенныхОбъектовПродажи(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	// Обходим иерархию "сверху-вниз", от групп верхнего уровня.
	// На каждый уровень - отдельный запрос
	КоличествоЗаписей = 0;
	УровеньИерархии = 1;
	
	Запрос.УстановитьПараметр("Уровень", УровеньИерархии);
	// Тип для НастройкаИсключения установлен, чтобы избежать неверного вычисления для константы размерности запросом с ключевым словом ДОБАВИТЬ
	// Описание типа - см. ТипИдентификаторПоказателя
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Объекты.Ссылка КАК Объект,
	|	&Уровень КАК Уровень,
	|	Настройки.Объект ЕСТЬ НЕ NULL КАК ЭтоПредметНастройки,
	|	ЛОЖЬ КАК ЭтоТривиальнаяНастройка,
	|	Настройки.Настройка КАК Настройка,
	|	ВЫБОР
	|		КОГДА Настройки.Настройка ЕСТЬ НЕ NULL
	|			ТОГДА &Уровень
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК УровеньНастройки,
	|	ВЫРАЗИТЬ(-1 КАК ЧИСЛО(10, 0)) КАК НастройкаИсключения,
	|	Настройки.Порядок КАК Порядок
	|ПОМЕСТИТЬ ИерархияНастроенныхОбъектовПродажи
	|ИЗ
	|	Справочник.НоменклатурныеГруппы КАК Объекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиОбъектовПродажи КАК Настройки
	|		ПО Объекты.Ссылка = Настройки.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатурныеГруппы КАК Родители
	|		ПО Объекты.Родитель = Родители.Ссылка
	|ГДЕ
	|	Объекты.ЭтоГруппа
	|	И Родители.Ссылка ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект";

	Запрос.Выполнить();
	
	Пока ЕстьПриростЗаписейИерархияНастроенныхОбъектовПродажи(МенеджерВременныхТаблиц, КоличествоЗаписей) Цикл
		
		УровеньИерархии = УровеньИерархии + 1;
		
		Запрос.УстановитьПараметр("Уровень", УровеньИерархии);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Объекты.Ссылка КАК Объект,
		|	&Уровень КАК Уровень,
		|	Настройки.Настройка ЕСТЬ НЕ NULL КАК ЭтоПредметНастройки,
		|	Настройки.Настройка ЕСТЬ НЕ NULL
		|	И Родители.Настройка ЕСТЬ НЕ NULL
		|	И Настройки.Настройка = Родители.Настройка КАК ЭтоТривиальнаяНастройка,
		|	ВЫБОР
		|		КОГДА Настройки.Настройка ЕСТЬ НЕ NULL
		|			ТОГДА Настройки.Настройка
		|		ИНАЧЕ Родители.Настройка
		|	КОНЕЦ КАК Настройка,
		|	ВЫБОР
		|		КОГДА Настройки.Настройка ЕСТЬ НЕ NULL
		|			ТОГДА &Уровень
		|		ИНАЧЕ Родители.УровеньНастройки
		|	КОНЕЦ КАК УровеньНастройки,
		|	ЕСТЬNULL(ВЫБОР
		|		КОГДА Настройки.Настройка ЕСТЬ НЕ NULL
		|			ТОГДА Родители.Настройка
		|	КОНЕЦ, -1) КАК НастройкаИсключения,
		|	ВЫБОР
		|		КОГДА Настройки.Настройка ЕСТЬ НЕ NULL
		|			ТОГДА Настройки.Порядок
		|		ИНАЧЕ Родители.Порядок
		|	КОНЕЦ КАК Порядок
		|ДОБАВИТЬ ИерархияНастроенныхОбъектовПродажи
		|ИЗ
		|	Справочник.НоменклатурныеГруппы КАК Объекты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИерархияНастроенныхОбъектовПродажи КАК Родители
		|		ПО Объекты.Родитель = Родители.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиОбъектовПродажи КАК Настройки
		|		ПО Объекты.Ссылка = Настройки.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИерархияНастроенныхОбъектовПродажи КАК КонтрольЗацикливания
		|		ПО Объекты.Ссылка = КонтрольЗацикливания.Объект
		|ГДЕ
		|	Объекты.ЭтоГруппа
		|	И КонтрольЗацикливания.Объект ЕСТЬ NULL";
		
		//@skip-check query-in-loop
		// Определение иерархии; количество уровней иерархии не предполагается большим
		Запрос.Выполнить();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьПриростЗаписейИерархияНастроенныхОбъектовПродажи(Знач МенеджерВременныхТаблиц, ПредыдущееКоличествоЗаписей)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК КоличествоЗаписей
	|ИЗ
	|	ИерархияНастроенныхОбъектовПродажи КАК Записи";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	НовоеКоличествоЗаписей = Выборка.КоличествоЗаписей;
	ЕстьПрирост = (НовоеКоличествоЗаписей > ПредыдущееКоличествоЗаписей);
	ПредыдущееКоличествоЗаписей = Выборка.КоличествоЗаписей;
	
	Возврат ЕстьПрирост;
	
КонецФункции

Процедура СоздатьНастроенныеОбъектыПродажи(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Объекты.Ссылка КАК Объект,
	|	НастройкиЭлементов.Объект ЕСТЬ НЕ NULL КАК ЭтоПредметНастройки,
	|	ВЫБОР
	|		КОГДА НастройкиЭлементов.Объект ЕСТЬ НЕ NULL
	|		И (НастройкиГрупп.Настройка ЕСТЬ NULL
	|		ИЛИ НастройкиГрупп.Настройка <> НастройкиЭлементов.Настройка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ НастройкиГрупп.ЭтоТривиальнаяНастройка
	|	КОНЕЦ КАК ЭтоТривиальнаяНастройка,
	|	ВЫБОР
	|		КОГДА НастройкиЭлементов.Объект ЕСТЬ НЕ NULL
	|			ТОГДА НастройкиЭлементов.Настройка
	|		ИНАЧЕ НастройкиГрупп.Настройка
	|	КОНЕЦ КАК Настройка,
	|	ВЫБОР
	|		КОГДА НастройкиЭлементов.Объект ЕСТЬ НЕ NULL
	|		И НастройкиГрупп.Объект ЕСТЬ НЕ NULL
	|			ТОГДА НастройкиГрупп.Настройка
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК НастройкаИсключения,
	|	ЕСТЬNULL(НастройкиЭлементов.Порядок, НастройкиГрупп.Порядок) КАК Порядок
	|ПОМЕСТИТЬ НастроенныеОбъектыПродажи
	|ИЗ
	|	Справочник.НоменклатурныеГруппы КАК Объекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИерархияНастроенныхОбъектовПродажи КАК НастройкиГрупп
	|		ПО Объекты.Родитель = НастройкиГрупп.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиОбъектовПродажи КАК НастройкиЭлементов
	|		ПО Объекты.Ссылка = НастройкиЭлементов.Объект
	|ГДЕ
	|	НЕ Объекты.ЭтоГруппа
	|	И (НЕ НастройкиГрупп.Объект ЕСТЬ NULL
	|	ИЛИ НЕ НастройкиЭлементов.Объект ЕСТЬ NULL)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьКлассифицируемыеОбъектыПродажи(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиГрупп.Объект КАК Объект,
	|	НастройкиГрупп.Настройка КАК Показатель,
	|	НастройкиГрупп.ЭтоПредметНастройки КАК ЭтоПредметНастройки,
	|	НастройкиГрупп.Порядок КАК Порядок,
	|	ИСТИНА КАК Уточняемый
	|ПОМЕСТИТЬ КлассифицируемыеОбъектыПродажи
	|ИЗ
	|	ИерархияНастроенныхОбъектовПродажи КАК НастройкиГрупп
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НастройкиЭлементов.Объект,
	|	НастройкиЭлементов.Настройка,
	|	НастройкиЭлементов.ЭтоПредметНастройки,
	|	НастройкиЭлементов.Порядок,
	|	ЛОЖЬ
	|ИЗ
	|	НастроенныеОбъектыПродажи КАК НастройкиЭлементов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Объекты.Ссылка КАК Объект,
	|	NULL,
	|	ЛОЖЬ,
	|	0,
	|	Объекты.ЭтоГруппа
	|ИЗ
	|	Справочник.НоменклатурныеГруппы КАК Объекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИерархияНастроенныхОбъектовПродажи КАК НастройкиГрупп
	|		ПО Объекты.Ссылка = НастройкиГрупп.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастроенныеОбъектыПродажи КАК НастройкиЭлементов
	|		ПО Объекты.Ссылка = НастройкиЭлементов.Объект
	|ГДЕ
	|	НастройкиГрупп.Объект ЕСТЬ NULL
	|	И НастройкиЭлементов.Объект ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО НАБОРАМ
	|(
	|	(Объект),
	|	(Уточняемый)
	|)";
	
	Запрос.Выполнить();

КонецПроцедуры

Функция ПрименяетсяУточнениеОбъектовПродажи(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Объекты.Уточняемый
	|ИЗ
	|	КлассифицируемыеОбъектыПродажи КАК Объекты
	|ГДЕ Объекты.Уточняемый";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Функция КлассифицируемыеОбъектыПродажи(МенеджерВременныхТаблиц, ТолькоНастраиваемыеОбъекты, ПрименяетсяУточнениеОбъектов)
	
	// При наличии уточняемых объектов (групп в справочнике) настройку выполняем преимущественно на уровне групп.
	// При этом расшифровку выводим с детализацией до номенклатурных групп, поэтому группы справочника без явных значений по умолчанию не выводятся
	// (не активны).
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПрименяетсяУточнениеОбъектов", ПрименяетсяУточнениеОбъектов);
	
	ШаблонТекстаЗапроса =
	"ВЫБРАТЬ
	|	Объекты.Показатель КАК Показатель,
	|	Объекты.Объект КАК Объект,
	|	ПРЕДСТАВЛЕНИЕ(Объекты.Объект) КАК Представление,
	|	Объекты.Порядок КАК ПорядокНастройки,
	|	Свойства.Наименование КАК ПорядокОбъектов,
	|	НЕ Свойства.ПометкаУдаления
	|	И (НЕ &ПрименяетсяУточнениеОбъектов
	|	ИЛИ НЕ Объекты.Уточняемый
	|	И Объекты.ЭтоПредметНастройки) КАК Активный,
	|	Объекты.Уточняемый КАК Уточняемый
	|ИЗ
	|	КлассифицируемыеОбъектыПродажи КАК Объекты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатурныеГруппы КАК Свойства
	|		ПО Объекты.Объект = Свойства.Ссылка
	|ГДЕ
	|	Объекты.ЭтоПредметНастройки
	|	ИЛИ Объекты.Уточняемый
	|	ИЛИ Свойства.Родитель = ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Показатель,
	|	Активный УБЫВ,
	|	ПорядокНастройки,
	|	Уточняемый УБЫВ,
	|	ПорядокОбъектов,
	|	Объект
	|ИТОГИ
	|ПО
	|	Показатель";
	
	Если ТолькоНастраиваемыеОбъекты Тогда
		Запрос.Текст = ШаблонТекстаЗапроса;
	Иначе
		МодификацияЗапроса = СхемыЗапросов.НайтиЗапросРезультата(ШаблонТекстаЗапроса);
		Для Каждого Оператор Из МодификацияЗапроса.Запрос.Операторы Цикл
			Оператор.Отбор.Очистить();
		КонецЦикла;
		Запрос.Текст = МодификацияЗапроса.Схема.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции

Функция ТипИдентификаторПоказателя()
	Возврат ОбщегоНазначения.ОписаниеТипаЧисло(10);
КонецФункции


#КонецОбласти

#Область ДетализацияПоУмолчанию

Функция ПараметрыДетализацииПродажи()
	
	Параметры = Новый Структура;
	Параметры.Вставить("ЛимитКоличестваПоказателей", 10);
	Параметры.Вставить("МаксимальныйОхват",        0.95);
	Возврат Параметры;
	
КонецФункции

Процедура ДетализироватьГруппуПоказателейПродажи(Шаблон, Контекст, КодЯзыка)
	
	Шаблон.НаименованиеОсновногоПоказателя = НСтр("ru = 'Номенклатурные группы, не приведенные выше'", КодЯзыка);
	
	ПараметрыДетализации = ПараметрыДетализацииПродажи();
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	СоздатьНоменклатурныеГруппыВыручки(МенеджерВременныхТаблиц, Контекст);
	
	НастройкиКлассификацииВыручки = РегистрыСведений.НастройкиКлассификацииВыручки.ВидыДеятельностиОпределяемыеНоменклатурнымиГруппами(
		Контекст.Организация,
		ПолучитьФункциональнуюОпцию("РасширенныйФункционал"));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Если Не ЗначениеЗаполнено(НастройкиКлассификацииВыручки) Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Выручка.Объект КАК ВидДеятельности,
		|	Выручка.Объект КАК Объект,
		|	Выручка.Объект.Наименование КАК Представление,
		|	Выручка.Сумма КАК Сумма
		|ИЗ
		|	НоменклатурныеГруппыВыручки КАК Выручка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатурныеГруппы КАК Отбор
		|		ПО Выручка.Объект = Отбор.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сумма УБЫВ,
		|	Представление,
		|	ВидДеятельности
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	ОБЩИЕ,
		|	ВидДеятельности ТОЛЬКО ИЕРАРХИЯ,
		|	Объект";
		
	Иначе
	
		НастройкиКлассификацииВыручкиТаблица = Новый ТаблицаЗначений;
		НастройкиКлассификацииВыручкиТаблица.Колонки.Добавить(
			"ВидДеятельности",
			Новый ОписаниеТипов("СправочникСсылка.КлассификаторВидовЭкономическойДеятельности"));
		НастройкиКлассификацииВыручкиТаблица.Колонки.Добавить(
			"НоменклатурнаяГруппа",
			Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));
		Для Каждого НастройкаКлассификации Из НастройкиКлассификацииВыручки Цикл
			ЗаписьНастройки = НастройкиКлассификацииВыручкиТаблица.Добавить();
			ЗаписьНастройки.ВидДеятельности = НастройкаКлассификации.Значение;
			ЗаписьНастройки.НоменклатурнаяГруппа = НастройкаКлассификации.Ключ;
		КонецЦикла;
	
		Запрос.УстановитьПараметр("НастройкиКлассификацииВыручки", НастройкиКлассификацииВыручкиТаблица);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Настройки.ВидДеятельности КАК Справочник.КлассификаторВидовЭкономическойДеятельности) КАК ВидДеятельности,
		|	Настройки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
		|ПОМЕСТИТЬ ВТ_НастройкиКлассификацииВыручки
		|ИЗ
		|	&НастройкиКлассификацииВыручки КАК Настройки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НоменклатурнаяГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Выручка.Объект КАК Объект,
		|	Настройки.ВидДеятельности КАК ВидДеятельности,
		|	Настройки.ВидДеятельности.Наименование КАК Представление,
		|	Настройки.ВидДеятельности.Код КАК Порядок,
		|	Выручка.Сумма КАК Сумма
		|ИЗ
		|	НоменклатурныеГруппыВыручки КАК Выручка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатурныеГруппы КАК Ссылки
		|		ПО Выручка.Объект = Ссылки.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НастройкиКлассификацииВыручки КАК Настройки
		|		ПО Выручка.Объект = Настройки.НоменклатурнаяГруппа
		|ГДЕ
		|	НЕ Ссылки.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сумма УБЫВ,
		|	Порядок,
		|	ВидДеятельности,
		|	Объект
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	ОБЩИЕ,
		|	ВидДеятельности,
		|	Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_НастройкиКлассификацииВыручки";
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Итог = 0;
	Пока Выборка.Количество() = 1 Цикл
		Выборка.Следующий();
		Итог = Выборка.Сумма;
		ВыборкаСледующегоУровня = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "ВидДеятельности");
		Если ВыборкаСледующегоУровня.Количество() = 0 Тогда
			// Иерархия отсутствует, попробуем элементы (следующий уровень - Объект)
			Выборка = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			Прервать;
		Иначе
			Выборка = ВыборкаСледующегоУровня;
		КонецЕсли;
	КонецЦикла;
	
	Если Итог = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Охват = 0;
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.ВидДеятельности) Тогда
			Продолжить;
		КонецЕсли;
		
		ШаблонПоказателя = Шаблон.ДетальныеПоказатели.Добавить();
		ШаблонПоказателя.Наименование = Выборка.Представление;
		ШаблонПоказателя.Отбор.Вставить("НоменклатурнаяГруппа", Новый Массив);
		
		Если ТипЗнч(Выборка.ВидДеятельности) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
			ШаблонПоказателя.Отбор.НоменклатурнаяГруппа.Добавить(Выборка.ВидДеятельности);
		Иначе
			ВыборкаОбъектов = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Объект");
			Пока ВыборкаОбъектов.Следующий() Цикл
				ШаблонПоказателя.Отбор.НоменклатурнаяГруппа.Добавить(ВыборкаОбъектов.Объект);
			КонецЦикла;
		КонецЕсли;
		
		Охват = Охват + Выборка.Сумма;
		
		Если Охват / Итог >= ПараметрыДетализации.МаксимальныйОхват Тогда
			Прервать;
		КонецЕсли;
		
		Если Шаблон.ДетальныеПоказатели.Количество() >= ПараметрыДетализации.ЛимитКоличестваПоказателей Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

Процедура СоздатьНоменклатурныеГруппыВыручки(МенеджерВременныхТаблиц, Контекст)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СчетаВыручки",  СчетаПродажи(ИдентификаторАлгоритмаВыручка()));
	Запрос.УстановитьПараметр("НачалоПериода", Контекст.ОтчетныйПериод.Начало);
	Запрос.УстановитьПараметр("КонецПериода",  Контекст.ОтчетныйПериод.Конец);
	Запрос.УстановитьПараметр("Организации",   Справочники.Организации.ВсяОрганизация(Контекст.Организация));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ВЫРАЗИТЬ(Выручка.Субконто1 КАК Справочник.НоменклатурныеГруппы), ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)) КАК Объект,
	|	СУММА(ВЫБОР
	|			КОГДА Выручка.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				ТОГДА -Выручка.СуммаОборотДт
	|			КОГДА Выручка.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|				ТОГДА Выручка.СуммаОборотКт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма
	|ПОМЕСТИТЬ НоменклатурныеГруппыВыручки
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В (&СчетаВыручки), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы), Организация В (&Организации), , ) КАК Выручка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВЫРАЗИТЬ(Выручка.Субконто1 КАК Справочник.НоменклатурныеГруппы), ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка))";
	
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#Область ДанныеУчета

Процедура ПолучитьДанныеУчетаПродажи(Процессор)
	
	КлассифицируемыеОбъекты = ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.КлассифицируемыеОбъектыДляВывода(
		Процессор.МенеджерВременныхТаблиц,
		Процессор.Алгоритм,
		Процессор.ОсновнойПоказатель);
	Процессор.ДанныеАлгоритма.Вставить("НоменклатурныеГруппы", КлассифицируемыеОбъекты.ОбъектыПоказателей);
		
	Если Процессор.ДанныеАлгоритма.НоменклатурныеГруппы.Количество() = 1 Тогда
		// В тривиальном случае детализация не важна
		Процессор.ДанныеАлгоритма.НоменклатурныеГруппы.Очистить();
	КонецЕсли;
	
	Процессор.ДанныеАлгоритма.Вставить("ОписаниеНастроек", Новый Соответствие); // Ключ - идентификатор показателя, Значение - см. НовыйОписаниеНастройкиПродажи
	Если ЗначениеЗаполнено(Процессор.ДанныеАлгоритма.НоменклатурныеГруппы) Тогда
		ЗаполнитьОписаниеНастроекПродажи(Процессор.ДанныеАлгоритма.ОписаниеНастроек, Процессор.МенеджерВременныхТаблиц);
	КонецЕсли;
	
	Процессор.ДанныеАлгоритма.Вставить("Счета", СчетаПродажи(Процессор.Алгоритм));
	
	ОписаниеСчетов = ОписаниеСчетовУчета(Процессор.ДанныеАлгоритма.Счета, ОбязательныеСчетаПродажи());
	Процессор.ДанныеАлгоритма.Вставить("ОписаниеСчетов",      ОписаниеСчетов);
	Процессор.ДанныеАлгоритма.Вставить("ПредставлениеСчетов", ПредставлениеСпискаСчетов(ОписаниеСчетов));
	
	Аналитика = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы;
	Процессор.ДанныеАлгоритма.Вставить("СчетаДетально", СчетаПрименяетсяАналитика(Процессор.ДанныеАлгоритма.Счета, Аналитика));
	
	СчетаСводно = ОбщегоНазначенияКлиентСервер.РазностьМассивов(Процессор.ДанныеАлгоритма.Счета, Процессор.ДанныеАлгоритма.СчетаДетально);
	
	Запрос = НачатьЗапрос(Процессор);
	Запрос.УстановитьПараметр("СчетаСводно",   СчетаСводно);
	Запрос.УстановитьПараметр("СчетаДетально", Процессор.ДанныеАлгоритма.СчетаДетально);
	Запрос.УстановитьПараметр("Аналитика",     Аналитика);
	
	// Поскольку речь о доходах и расходах, суммы кредитового оборота представляются положительными (доход), дебетового - отрицательными (расход)
	ШаблонТекстаЗапроса =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ОборотыДетально.Субконто1 КАК Справочник.НоменклатурныеГруппы),
	|		ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)) КАК Объект,
	|	ОборотыДетально.Счет КАК Счет,
	|	ВЫБОР
	|		КОГДА ОборотыДетально.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|			ТОГДА -ОборотыДетально.СуммаОборотДт
	|		КОГДА ОборотыДетально.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|			ТОГДА ОборотыДетально.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма,
	|	ОборотыДетально.Организация КАК Организация
	|ПОМЕСТИТЬ ОборотыПродажи
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода,, Счет В (&СчетаДетально), &Аналитика,
	|		Организация В (&Организации),,) КАК ОборотыДетально
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка),
	|	ОборотыСводно.Счет,
	|	ВЫБОР
	|		КОГДА ОборотыСводно.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|			ТОГДА -ОборотыСводно.СуммаОборотДт
	|		КОГДА ОборотыСводно.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|			ТОГДА ОборотыСводно.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ОборотыСводно.Организация
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода,, Счет В (&СчетаСводно),, Организация В
	|	(&Организации),,) КАК ОборотыСводно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Объекты.Показатель КАК Показатель,
	|	Объекты.Объект КАК НоменклатурнаяГруппа,
	|	ПРЕДСТАВЛЕНИЕ(Объекты.Объект) КАК НоменклатурнаяГруппаПредставление,
	|	Объекты.Объект.Наименование КАК НоменклатурнаяГруппаПорядок,
	|	Обороты.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(Обороты.Организация) КАК ОрганизацияПредставление,
	|	Обороты.Организация.Наименование КАК ОрганизацияПорядок,
	|	Обороты.Счет КАК Счет,
	|	Обороты.Счет.Код КАК СчетПредставление,
	|	Обороты.Счет.Порядок КАК СчетПорядок,
	|	Обороты.Сумма КАК Значение,
	|	ВЫБОР
	|		КОГДА Обороты.Сумма < 0
	|			ТОГДА -Обороты.Сумма
	|		ИНАЧЕ Обороты.Сумма
	|	КОНЕЦ КАК МодульЗначения
	|ИЗ
	|	ОборотыПродажи КАК Обороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ КлассифицируемыеОбъектыПродажи КАК Объекты
	|		ПО Обороты.Объект = Объекты.Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОрганизацияПорядок,
	|	СчетПорядок,
	|	Счет,
	|	МодульЗначения УБЫВ,
	|	Значение УБЫВ,
	|	НоменклатурнаяГруппаПорядок
	|ИТОГИ
	|	СУММА(Значение),
	|	СУММА(МодульЗначения)
	|ПО
	|	Показатель,
	|	Организация,
	|	Счет,
	|	НоменклатурнаяГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОборотыПродажи";

	ИмяОпциональнойТаблицы = "КлассифицируемыеОбъектыПродажи";
	ПсевдонимОпциональнойТаблицы = "Объекты";
	Если Процессор.МенеджерВременныхТаблиц.Таблицы.Найти(ИмяОпциональнойТаблицы) <> Неопределено Тогда
		Запрос.Текст = ШаблонТекстаЗапроса;
	Иначе
		// Удалим обращения к опциональной таблице - сначала к связанным полям, потом к самой таблице
		ОписаниеЗапроса = СхемыЗапросов.НайтиЗапросРезультата(ШаблонТекстаЗапроса);
		Для Каждого Оператор Из ОписаниеЗапроса.Запрос.Операторы Цикл
			
			Для ИндексПоля = 0 По Оператор.ВыбираемыеПоля.Количество() - 1 Цикл
				Поле = Оператор.ВыбираемыеПоля[ИндексПоля];
				Если СтрНайти(Поле, СтрШаблон("%1.", ПсевдонимОпциональнойТаблицы)) = 0 Тогда
					Продолжить;
				КонецЕсли;
				Оператор.ВыбираемыеПоля.Установить(ИндексПоля, Новый ВыражениеСхемыЗапроса("NULL"));
			КонецЦикла;
			
			Оператор.Источники.Удалить(ПсевдонимОпциональнойТаблицы);
			
		КонецЦикла;
		Запрос.Текст = ОписаниеЗапроса.Схема.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	Процессор.ДанныеУчета = Запрос.Выполнить();
	
КонецПроцедуры

// Конструктор описания настройки продажи - содержит данные для вывода в расшифровке порядка заполнения показателя.
// 
// Возвращаемое значение:
//  Структура:
// * Элементы - СписокЗначений из СправочникСсылка.НоменклатурныеГруппы - перечень элементов, для которых настройка выполнена явно
// * Группы - СписокЗначений из СправочникСсылка.НоменклатурныеГруппы - перечень групп, для которых настройка выполнена явно и не является тривиальной
// * Исключения - СписокЗначений из СправочникСсылка.НоменклатурныеГруппы - группы или элементы, отнесенные к другим показателям.
// Везде СписокЗначений содержит представления номенклатурных групп.
//
Функция НовыйОписаниеНастройкиПродажи()
	
	Описание = Новый Структура;
	Описание.Вставить("Элементы", Новый СписокЗначений);
	Описание.Вставить("Группы", Новый СписокЗначений);
	Описание.Вставить("Исключения", Новый СписокЗначений);
	Возврат Описание;
	
КонецФункции

Процедура ЗаполнитьОписаниеНастроекПродажи(ОписаниеНастроек, МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиГрупп.Настройка КАК Настройка,
	|	ЛОЖЬ КАК ЭтоИсключение,
	|	НастройкиГрупп.Объект КАК Объект,
	|	НастройкиГрупп.Объект.ЭтоГруппа КАК ЭтоГруппа,
	|	ПРЕДСТАВЛЕНИЕ(НастройкиГрупп.Объект) КАК Представление,
	|	НастройкиГрупп.Порядок КАК Порядок
	|ИЗ
	|	ИерархияНастроенныхОбъектовПродажи КАК НастройкиГрупп
	|ГДЕ
	|	НастройкиГрупп.ЭтоПредметНастройки
	|	И НЕ НастройкиГрупп.ЭтоТривиальнаяНастройка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсключенияГрупп.НастройкаИсключения,
	|	ИСТИНА,
	|	ИсключенияГрупп.Объект,
	|	ИсключенияГрупп.Объект.ЭтоГруппа,
	|	ПРЕДСТАВЛЕНИЕ(ИсключенияГрупп.Объект),
	|	ИсключенияГрупп.Порядок КАК Порядок
	|ИЗ
	|	ИерархияНастроенныхОбъектовПродажи КАК ИсключенияГрупп
	|ГДЕ
	|	ИсключенияГрупп.ЭтоПредметНастройки
	|	И НЕ ИсключенияГрупп.ЭтоТривиальнаяНастройка
	|	И ЕСТЬNULL(ИсключенияГрупп.НастройкаИсключения, -1) >= 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НастройкиЭлементов.Настройка КАК Настройка,
	|	ЛОЖЬ КАК ЭтоИсключение,
	|	НастройкиЭлементов.Объект КАК Объект,
	|	НастройкиЭлементов.Объект.ЭтоГруппа КАК ЭтоГруппа,
	|	ПРЕДСТАВЛЕНИЕ(НастройкиЭлементов.Объект) КАК Представление,
	|	НастройкиЭлементов.Порядок КАК Порядок
	|ИЗ
	|	НастроенныеОбъектыПродажи КАК НастройкиЭлементов
	|ГДЕ
	|	НастройкиЭлементов.ЭтоПредметНастройки
	|	И НЕ НастройкиЭлементов.ЭтоТривиальнаяНастройка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсключенияЭлементов.НастройкаИсключения,
	|	ИСТИНА,
	|	ИсключенияЭлементов.Объект,
	|	ИсключенияЭлементов.Объект.ЭтоГруппа,
	|	ПРЕДСТАВЛЕНИЕ(ИсключенияЭлементов.Объект),
	|	ИсключенияЭлементов.Порядок КАК Порядок
	|ИЗ
	|	НастроенныеОбъектыПродажи КАК ИсключенияЭлементов
	|ГДЕ
	|	ИсключенияЭлементов.ЭтоПредметНастройки
	|	И НЕ ИсключенияЭлементов.ЭтоТривиальнаяНастройка
	|	И ЕСТЬNULL(ИсключенияЭлементов.НастройкаИсключения, -1) >= 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|ИТОГИ
	|ПО
	|	Настройка";

	
	ВыборкаНастройка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНастройка.Следующий() Цикл
		
		ОписаниеНастройки = НовыйОписаниеНастройкиПродажи();
		
		ОписаниеНастроек.Вставить(ВыборкаНастройка.Настройка, ОписаниеНастройки);
		
		ВыборкаОбъект = ВыборкаНастройка.Выбрать();
		
		Пока ВыборкаОбъект.Следующий() Цикл
			
			Список = ОписаниеНастройки.Элементы;
			Если ВыборкаОбъект.ЭтоИсключение Тогда
				Список = ОписаниеНастройки.Исключения;
			ИначеЕсли ВыборкаОбъект.ЭтоГруппа Тогда
				Список = ОписаниеНастройки.Группы;
			КонецЕсли;
			
			Список.Добавить(ВыборкаОбъект.Объект, ВыборкаОбъект.Представление);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОписатьПорядокЗаполненияПоказателяПродажи(Описание, Показатель, ЭтоОсновнойПоказатель, ДанныеАлгоритма, КодЯзыка)
	
	ИдентификаторПоказателя = БухгалтерскаяОтчетностьБРО.ИдентификаторПоказателя(Показатель);
	
	Описание.ШагиРасчета.Добавить(ДанныеАлгоритма.ОписаниеСчетов, "Счет"); // Счет идет первым, чтобы и при отсутствии оборотов он выводился для расшифровки отчетом
	
	Субсчета = ДанныеАлгоритма.ОписаниеСчетов.ВыгрузитьЗначения();
	
	ДетализироватьНоменклатурныеГруппыРасшифровки = Ложь;
	ДетализироватьНоменклатурныеГруппыОтчета = Ложь;
	
	ОписаниеНастройки = Неопределено;
	ОтборНоменклатурныеГруппы = Неопределено;
	
	Если Не БухгалтерскийУчетВызовСервераПовтИсп.ИспользоватьОднуНоменклатурнуюГруппу() Тогда
		
		ОписаниеНастройки = ДанныеАлгоритма.ОписаниеНастроек[ИдентификаторПоказателя]; // см. НовыйОписаниеНастройкиПродажи
		
		ОтборНоменклатурныеГруппы = ДанныеАлгоритма.НоменклатурныеГруппы[ИдентификаторПоказателя];
		
		Если ЭтоОсновнойПоказатель Тогда
			
			Для Каждого Субсчет Из Субсчета Цикл
				ДетализироватьНоменклатурныеГруппыОтчета = (ДанныеАлгоритма.СчетаДетально.Найти(Субсчет) <> Неопределено);
				Если ДетализироватьНоменклатурныеГруппыОтчета Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ДетализироватьНоменклатурныеГруппыРасшифровки = ДетализироватьНоменклатурныеГруппыОтчета;
			
		Иначе
			
			ДетализироватьНоменклатурныеГруппыОтчета = ОтборНоменклатурныеГруппы <> Неопределено;
			ДетализироватьНоменклатурныеГруппыРасшифровки = ДетализироватьНоменклатурныеГруппыОтчета И ОтборНоменклатурныеГруппы.Количество() > 1;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДетализироватьНоменклатурныеГруппыРасшифровки Тогда
		
		// Не используем фиксированные значения, так как порядок объектов переменный (они упорядочены по сумме)
		Описание.ШагиРасчета.Добавить(Неопределено, "НоменклатурнаяГруппа");
		
	КонецЕсли;
	
	СловаОписания = Новый Структура;
	ТекстСчета = "";
	Если ДанныеАлгоритма.ПредставлениеСчетов.Количество = 1 Тогда
		ТекстСчета = СтрШаблон("счету %1", ДанныеАлгоритма.ПредставлениеСчетов.Текст);
	Иначе
		ТекстСчета = СтрШаблон("счетам %1", ДанныеАлгоритма.ПредставлениеСчетов.Текст);
	КонецЕсли;
	СловаОписания.Вставить("Счету", ТекстСчета);
	
	ШаблонОписания = НСтр("ru = 'Оборот по [Счету]'", КодЯзыка);
	Если ОписаниеНастройки = Неопределено Тогда
		Если ЭтоОсновнойПоказатель И ДанныеАлгоритма.НоменклатурныеГруппы.Количество() > 1 Тогда
			ШаблонОписания = СтрШаблон(НСтр("ru = '%1 по номенклатурным группам, не входящим в состав других показателей'", КодЯзыка), ШаблонОписания);
		КонецЕсли;
	Иначе
		
		СпискиНоменклатурныхГрупп = Новый СписокЗначений; // из Строка - имя списка в ОписаниеНастройки, Представление - представление списка, Пометка - Истина для списка из нескольких элементов
		ШаблонОдинЭлемент  = НСтр("ru = '%1 по номенклатурной группе %2'", КодЯзыка);
		ШаблонНесколькоЭлементов = НСтр("ru = '%1 по номенклатурным группам, %2'", КодЯзыка);
		ШаблонНесколькоСписковЭлементов = НСтр("ru = '%1 по номенклатурным группам:
		                                       |%2'", КодЯзыка);
		
		Если ОписаниеНастройки.Элементы.Количество() = 1 Тогда
			СпискиНоменклатурныхГрупп.Добавить("Элементы");
		ИначеЕсли ЗначениеЗаполнено(ОписаниеНастройки.Элементы) Тогда
			СпискиНоменклатурныхГрупп.Добавить("Элементы", НСтр("ru = 'входящим в список'", КодЯзыка), Истина);
		КонецЕсли;
		Если ОписаниеНастройки.Группы.Количество() = 1 Тогда
			СпискиНоменклатурныхГрупп.Добавить("Группы", НСтр("ru = 'включенным в иерархию'", КодЯзыка));
		ИначеЕсли ЗначениеЗаполнено(ОписаниеНастройки.Группы) Тогда
			СпискиНоменклатурныхГрупп.Добавить("Группы", НСтр("ru = 'включенным по иерархии в список'", КодЯзыка), Истина);
		КонецЕсли;
		Если ОписаниеНастройки.Исключения.Количество() = 1 Тогда
			СпискиНоменклатурныхГрупп.Добавить("Исключения", НСтр("ru = 'за исключением входящего в состав другого показателя'", КодЯзыка));
		ИначеЕсли ЗначениеЗаполнено(ОписаниеНастройки.Исключения) Тогда
			СпискиНоменклатурныхГрупп.Добавить("Исключения", НСтр("ru = 'за исключением входящих в состав других показателей'", КодЯзыка), Истина);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СпискиНоменклатурныхГрупп) Тогда
		
			ОписаниеСпискаНоменклатурныхГрупп = СпискиНоменклатурныхГрупп[0];
			СписокНоменклатурныхГрупп = ОписаниеНастройки[ОписаниеСпискаНоменклатурныхГрупп.Значение];
			Если СпискиНоменклатурныхГрупп.Количество() = 1 И ПустаяСтрока(ОписаниеСпискаНоменклатурныхГрупп.Представление) Тогда
				ШаблонОписания = СтрШаблон(ШаблонОдинЭлемент, ШаблонОписания, ПредставлениеСпискаЗначений(СписокНоменклатурныхГрупп, Ложь, КодЯзыка));
			ИначеЕсли СпискиНоменклатурныхГрупп.Количество() = 1 Тогда
				ШаблонСписка = НСтр("ru = '%1 %2'", КодЯзыка);
				Если ОписаниеСпискаНоменклатурныхГрупп.Пометка Тогда
					ШаблонСписка = НСтр("ru = '%1:
										|%2'", КодЯзыка);
				КонецЕсли;
				ПредставлениеСписка = СтрШаблон(
					ШаблонСписка,
					ОписаниеСпискаНоменклатурныхГрупп.Представление,
					ПредставлениеСпискаЗначений(СписокНоменклатурныхГрупп, ОписаниеСпискаНоменклатурныхГрупп.Пометка, КодЯзыка));
				ШаблонОписания = СтрШаблон(ШаблонНесколькоЭлементов, ШаблонОписания, ПредставлениеСписка);
			Иначе
				ПредставлениеСписковНоменклатурныхГрупп = Новый Массив;
				Для Каждого ОписаниеСпискаНоменклатурныхГрупп Из СпискиНоменклатурныхГрупп Цикл
					
					ШаблонСписка = НСтр("ru = '%1) %2 %3'", КодЯзыка);
					Если ОписаниеСпискаНоменклатурныхГрупп.Пометка Тогда
						ШаблонСписка = НСтр("ru = '%1) %2
										|%3'", КодЯзыка);
					КонецЕсли;
					
					СписокНоменклатурныхГрупп = ОписаниеНастройки[ОписаниеСпискаНоменклатурныхГрупп.Значение];
					ПредставлениеСписка = ПредставлениеСпискаЗначений(СписокНоменклатурныхГрупп, ОписаниеСпискаНоменклатурныхГрупп.Пометка, КодЯзыка);
					НомерСписка = ПредставлениеСписковНоменклатурныхГрупп.Количество() + 1;
					ПолноеПредставлениеСписка = СтрШаблон(
						ШаблонСписка,
						НомерСписка,
						ОписаниеСпискаНоменклатурныхГрупп.Представление,
						ПредставлениеСписка);
					ПредставлениеСписковНоменклатурныхГрупп.Добавить(ПолноеПредставлениеСписка);
				КонецЦикла;
				ШаблонОписания = СтрШаблон(
					ШаблонНесколькоСписковЭлементов,
					ШаблонОписания,
					СтрСоединить(ПредставлениеСписковНоменклатурныхГрупп, Символы.ПС));
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Описание.Текст = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонОписания, СловаОписания);
	
	// Отчет
	Описание.Отчет.ВидОтчета  = "ОборотыСчета";
	Описание.Отчет.СчетГруппа = ПланыСчетов.Хозрасчетный.Продажи;
	Описание.Отчет.Субсчета   = Субсчета;
	
	Если ДетализироватьНоменклатурныеГруппыОтчета Тогда
		
		Описание.Отчет.Субконто.Вставить("НоменклатурнаяГруппа", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
		
		Если ОтборНоменклатурныеГруппы <> Неопределено Тогда
			Описание.Отчет.ОтборыПоказателя.Вставить("НоменклатурнаяГруппа", ОтборНоменклатурныеГруппы.ВыгрузитьЗначения());
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПрочиеДоходыРасходы

// В описаниях показателей с этим алгоритмом свойство Заполнение.Отбор может содержать следующие ключи:
//   * ВидСтатьи - ПеречислениеСсылка.ВидыПрочихДоходовИРасходов
//   * Статья - Массив Из СправочникСсылка.ПрочиеДоходыИРасходы
// Предполагается, что указан или ВидСтатьи или Статья.
// Если указаны оба, то приоритет имеет ВидСтатьи.

#Область ОписаниеПоказателей

Процедура ИнициализироватьЗаполнениеПоказателяПрочиеДоходыРасходы(НастройкиАлгоритма)
	
	НастройкиАлгоритма.Вставить("ЗачетПоказателей", ""); // Нет, СтатьиОбъекты, Показатель
	// Пустую строку следует указывать для показателей, которые включаются в одну группу.
	// Она соответствует поведению по умолчанию - "Показатель", т.е. полный зачет.
	
КонецПроцедуры

Процедура УстановитьЗачетПоказателейПрочиеДоходыРасходы(Процессор, ВариантЗачета)
	
	Если Процессор.КонтекстЗаполнения.Алгоритм <> ИдентификаторАлгоритмаПрочиеДоходыРасходы() Тогда
		Возврат;
	КонецЕсли;
	
	Процессор.КонтекстЗаполнения.Показатель.Заполнение.НастройкиАлгоритма.ЗачетПоказателей = ВариантЗачета;
	
КонецПроцедуры

Процедура ДобавитьОтборПрочиеДоходыРасходы(Заполнение, ЗначениеОтбора)
	
	ИмяСвойства = "ВидСтатьи";
	ТипЗначенияОтбора = ТипЗнч(ЗначениеОтбора);
	
	Если ТипЗначенияОтбора = Тип("СправочникСсылка.ПрочиеДоходыИРасходы") Тогда
		ИмяСвойства = "Статья";
	ИначеЕсли ТипЗначенияОтбора <> Тип("ПеречислениеСсылка.ВидыПрочихДоходовИРасходов") Тогда
		Возврат;
	КонецЕсли;
	
	Если Заполнение.Отбор.Свойство(ИмяСвойства) Тогда
		ЗначенияОтбора = Заполнение.Отбор[ИмяСвойства];
	Иначе
		ЗначенияОтбора = Новый Массив;
		Заполнение.Отбор.Вставить(ИмяСвойства, ЗначенияОтбора);
	КонецЕсли;
	
	ЗначенияОтбора.Добавить(ЗначениеОтбора);
	
	Если Заполнение.Отбор.Свойство("Статья") И Заполнение.Отбор.Свойство("ВидСтатьи") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ВидыСтатей", Заполнение.Отбор.ВидСтатьи);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрочиеДоходыИРасходы.Ссылка КАК Статья
		|ИЗ
		|	Справочник.ПрочиеДоходыИРасходы КАК ПрочиеДоходыИРасходы
		|ГДЕ
		|	ПрочиеДоходыИРасходы.ВидПрочихДоходовИРасходов В (&ВидыСтатей)";
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Заполнение.Отбор.Статья, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Статья"));
		Заполнение.Отбор.Удалить("ВидСтатьи");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ТипЗначенияКлассифицируемыхОбъектовПрочиеДоходыРасходы()
	
	Возврат Новый ОписаниеТипов("СправочникСсылка.ПрочиеДоходыИРасходы");
	
КонецФункции

Процедура ЗаполнитьОтборКлассифицируемымиОбъектамиПрочиеДоходыРасходы(Отбор, КлассифицируемыеОбъекты)
	
	Отбор.Удалить("ВидСтатьи");
	Отбор.Вставить("Статья", КлассифицируемыеОбъекты.ВыгрузитьЗначения());
	
КонецПроцедуры

Процедура СоздатьКлассифицируемыеОбъектыПрочиеДоходыРасходы(МенеджерВременныхТаблиц, Показатели)
	
	// Создаваемые таблицы - полные, то есть, содержат все классифицируемые объекты, в том числе, не участвующие в настройках получения данных.
	
	ВидыСтатей = Новый ТаблицаЗначений;
	ВидыСтатей.Колонки.Добавить("ВидСтатьи",  Новый ОписаниеТипов("ПеречислениеСсылка.ВидыПрочихДоходовИРасходов"));
	ВидыСтатей.Колонки.Добавить("Показатель", Новый ОписаниеТипов("Число"));
	
	Статьи = Новый ТаблицаЗначений;
	Статьи.Колонки.Добавить("Статья",     Новый ОписаниеТипов("СправочникСсылка.ПрочиеДоходыИРасходы"));
	Статьи.Колонки.Добавить("Показатель", Новый ОписаниеТипов("Число"));
	
	Для Каждого ОписаниеПоказателя Из Показатели Цикл
		
		ИндексПоказателя = ОписаниеПоказателя.Владелец().Индекс(ОписаниеПоказателя);
		Если ОписаниеПоказателя.Заполнение.Отбор.Свойство("ВидСтатьи") Тогда
			Для Каждого ВидСтатьи Из ОписаниеПоказателя.Заполнение.Отбор.ВидСтатьи Цикл
				НовыйЭлемент = ВидыСтатей.Добавить();
				НовыйЭлемент.ВидСтатьи  = ВидСтатьи;
				НовыйЭлемент.Показатель = ИндексПоказателя;
			КонецЦикла;
		ИначеЕсли ОписаниеПоказателя.Заполнение.Отбор.Свойство("Статья") Тогда
			Для Каждого Статья Из ОписаниеПоказателя.Заполнение.Отбор.Статья Цикл
				НовыйЭлемент = Статьи.Добавить();
				НовыйЭлемент.Статья     = Статья;
				НовыйЭлемент.Показатель = ИндексПоказателя;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ВидыСтатей", ВидыСтатей);
	Запрос.УстановитьПараметр("Статьи",     Статьи);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыСтатей.ВидСтатьи КАК ВидСтатьи,
	|	ВидыСтатей.Показатель КАК Показатель
	|ПОМЕСТИТЬ ВТ_ВидыСтатейНастройки
	|ИЗ
	|	&ВидыСтатей КАК ВидыСтатей
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидСтатьи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Статьи.Статья КАК Статья,
	|	Статьи.Показатель КАК Показатель
	|ПОМЕСТИТЬ ВТ_СтатьиНастройки
	|ИЗ
	|	&Статьи КАК Статьи
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Статья
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыПрочихДоходовИРасходов.Ссылка КАК ВидСтатьи,
	|	МАКСИМУМ(ВидыСтатей.Показатель) КАК Показатель
	|ПОМЕСТИТЬ ВидыСтатей
	|ИЗ
	|	Перечисление.ВидыПрочихДоходовИРасходов КАК ВидыПрочихДоходовИРасходов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВидыСтатейНастройки КАК ВидыСтатей
	|		ПО ВидыПрочихДоходовИРасходов.Ссылка = ВидыСтатей.ВидСтатьи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВидыПрочихДоходовИРасходов.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидСтатьи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрочиеДоходыИРасходы.Ссылка КАК Статья,
	|	ПрочиеДоходыИРасходы.ВидПрочихДоходовИРасходов КАК ВидСтатьи,
	|	МАКСИМУМ(СтатьиНастройки.Показатель) КАК Показатель
	|ПОМЕСТИТЬ СтатьиЯвнаяНастройка
	|ИЗ
	|	Справочник.ПрочиеДоходыИРасходы КАК ПрочиеДоходыИРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатьиНастройки КАК СтатьиНастройки
	|		ПО ПрочиеДоходыИРасходы.Ссылка = СтатьиНастройки.Статья
	|ГДЕ
	|	НЕ ПрочиеДоходыИРасходы.ЭтоГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеДоходыИРасходы.Ссылка,
	|	ПрочиеДоходыИРасходы.ВидПрочихДоходовИРасходов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидСтатьи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Статьи.ВидСтатьи КАК ВидСтатьи,
	|	Статьи.Статья КАК Статья,
	|	Статьи.Показатель КАК СтатьяПоказатель
	|ПОМЕСТИТЬ Исключения
	|ИЗ
	|	СтатьиЯвнаяНастройка КАК Статьи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВидыСтатей КАК ВидыСтатей
	|		ПО Статьи.ВидСтатьи = ВидыСтатей.ВидСтатьи
	|ГДЕ
	|	Статьи.Показатель ЕСТЬ НЕ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидСтатьи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Статьи.Статья КАК Статья,
	|	Статьи.ВидСтатьи КАК ВидСтатьи,
	|	ЕСТЬNULL(Статьи.Показатель, ВидыСтатей.Показатель) КАК Показатель
	|ПОМЕСТИТЬ Статьи
	|ИЗ
	|	СтатьиЯвнаяНастройка КАК Статьи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыСтатей КАК ВидыСтатей
	|		ПО Статьи.ВидСтатьи = ВидыСтатей.ВидСтатьи
	|			И (ВидыСтатей.Показатель ЕСТЬ НЕ NULL )
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВидыСтатейНастройки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СтатьиНастройки";
	
	Запрос.Выполнить();

КонецПроцедуры

Функция КлассифицируемыеОбъектыПрочиеДоходыРасходы(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Статьи.Показатель КАК Показатель,
	|	Статьи.Статья КАК Объект,
	|	ПРЕДСТАВЛЕНИЕ(Статьи.Статья) КАК Представление,
	|	Статьи.Статья.РеквизитДопУпорядочивания КАК ЗаданныйПорядокСтатей,
	|	Статьи.Статья.Наименование КАК АвтоматическийПорядокСтатей,
	|	НЕ Статьи.Статья.ПометкаУдаления КАК Активный
	|ИЗ
	|	Статьи КАК Статьи
	|
	|УПОРЯДОЧИТЬ ПО
	|	Показатель,
	|	ЗаданныйПорядокСтатей,
	|	АвтоматическийПорядокСтатей,
	|	Объект
	|ИТОГИ
	|ПО
	|	Показатель";
	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции

Процедура СоздатьОборотыПрочихДоходовРасходов(Процессор, СчетаДоходыРасходы, СчетаРасходы)
	
	ВидыСубконтоДоходовРасходов = Новый Массив;
	ВидыСубконтоДоходовРасходов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы);
	ВидыСубконтоДоходовРасходов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РеализуемыеАктивы);
	
	Запрос = НачатьЗапрос(Процессор);
	
	Запрос.УстановитьПараметр("СчетаДоходовРасходов",         СчетаДоходыРасходы);
	Запрос.УстановитьПараметр("СчетаРасходы",                 СчетаРасходы);
	Запрос.УстановитьПараметр("ВидыСубконтоДоходовРасходов",  ВидыСубконтоДоходовРасходов);
	
	Запрос.УстановитьПараметр(
		"СчетаЧрезвычайныхРасходов",
		БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ПрибылиИУбыткиБезНалогаНаПрибыль));
	
	// Поскольку речь о доходах и расходах, суммы кредитового оборота представляются положительными (доход), дебетового - отрицательными (расход)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Данные.Организация КАК Организация,
	|	Данные.Счет КАК Счет,
	|	Данные.Статья КАК Статья,
	|	Данные.РеализуемыйАктив КАК РеализуемыйАктив,
	|	СУММА(Данные.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ОборотыПрочихДоходовРасходов
	|ИЗ
	|	(ВЫБРАТЬ
	|		Счет91.Организация КАК Организация,
	|		Счет91.Счет КАК Счет,
	|		ЕСТЬNULL(ВЫРАЗИТЬ(Счет91.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы), ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)) КАК Статья,
	|		Счет91.Субконто2 КАК РеализуемыйАктив,
	|		ВЫБОР
	|			КОГДА Счет91.Счет В (&СчетаРасходы)
	|				ТОГДА -Счет91.СуммаОборотДт
	|			ИНАЧЕ Счет91.СуммаОборотКт
	|		КОНЕЦ КАК Сумма
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В (&СчетаДоходовРасходов), &ВидыСубконтоДоходовРасходов, Организация В (&Организации), , ) КАК Счет91
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Счет99.Организация,
	|		Счет99.Счет,
	|		ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка),
	|		НЕОПРЕДЕЛЕНО,
	|		-Счет99.СуммаОборот
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				,
	|				Счет В (&СчетаЧрезвычайныхРасходов),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрибылиИУбытки),
	|				Организация В (&Организации)
	|					И Субконто1 = ЗНАЧЕНИЕ(Перечисление.ПрибылиИУбытки.ЧрезвычайныеДоходыРасходы),
	|				,
	|				) КАК Счет99) КАК Данные
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.Организация,
	|	Данные.Счет,
	|	Данные.Статья,
	|	Данные.РеализуемыйАктив
	|
	|ИМЕЮЩИЕ
	|	СУММА(Данные.Сумма) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Статья";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПолучитьДанныеУчетаПрочиеДоходыРасходы(Процессор)
	
	// Счета учета
	Процессор.ДанныеАлгоритма.Вставить("Счета", Новый Структура);
	Процессор.ДанныеАлгоритма.Счета.Вставить("Группа",     ПланыСчетов.Хозрасчетный.ПрочиеДоходыИРасходы);
	Процессор.ДанныеАлгоритма.Счета.Вставить("Субсчета",   Новый Массив);
	Процессор.ДанныеАлгоритма.Счета.Вставить("Доходы",     Новый Массив);
	Процессор.ДанныеАлгоритма.Счета.Вставить("Расходы",    Новый Массив);
	Процессор.ДанныеАлгоритма.Счета.Вставить("Назначение", Новый Соответствие); // Ключ - счет, Значение - "Доходы", "Расходы"
	
	ВсяГруппаСчетов = БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ПрочиеДоходыИРасходы);
	ВидыСчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ВсяГруппаСчетов, "Вид");
	Для Каждого Субсчет Из ВсяГруппаСчетов Цикл
		
		Если Субсчет = ПланыСчетов.Хозрасчетный.СальдоПрочихДоходовИРасходов Тогда
			// Закрывающий
			Продолжить;
		КонецЕсли;
		
		ВидСубсчета = ВидыСчетов[Субсчет];
		Если ВидСубсчета = ВидСчета.Пассивный Тогда
			Процессор.ДанныеАлгоритма.Счета.Доходы.Добавить(Субсчет);
			Процессор.ДанныеАлгоритма.Счета.Назначение.Вставить(Субсчет, "Доходы");
		ИначеЕсли ВидСубсчета = ВидСчета.Активный Тогда
			Процессор.ДанныеАлгоритма.Счета.Расходы.Добавить(Субсчет);
			Процессор.ДанныеАлгоритма.Счета.Назначение.Вставить(Субсчет, "Расходы");
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Процессор.ДанныеАлгоритма.Счета.Субсчета, Процессор.ДанныеАлгоритма.Счета.Доходы);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Процессор.ДанныеАлгоритма.Счета.Субсчета, Процессор.ДанныеАлгоритма.Счета.Расходы);
	
	ОписаниеСчетовДоходы  = ОписаниеСчетовУчета(Процессор.ДанныеАлгоритма.Счета.Доходы);
	ОписаниеСчетовРасходы = ОписаниеСчетовУчета(Процессор.ДанныеАлгоритма.Счета.Расходы);
	
	Процессор.ДанныеАлгоритма.Вставить("ПредставлениеСубсчетовДоходы",  ПредставлениеСпискаСчетов(ОписаниеСчетовДоходы));
	Процессор.ДанныеАлгоритма.Вставить("ПредставлениеСубсчетовРасходы", ПредставлениеСпискаСчетов(ОписаниеСчетовРасходы));
	
	Процессор.ДанныеАлгоритма.Вставить(
		"ПредставлениеСубсчетовДоходыДательныйПадеж",
		ПредставлениеСубсчетовДательныйПадеж(Процессор.ДанныеАлгоритма.ПредставлениеСубсчетовДоходы, Процессор.КодЯзыка));
	
	Процессор.ДанныеАлгоритма.Вставить(
		"ПредставлениеСубсчетовРасходыДательныйПадеж",
		ПредставлениеСубсчетовДательныйПадеж(Процессор.ДанныеАлгоритма.ПредставлениеСубсчетовРасходы, Процессор.КодЯзыка));
		
	ОсновноеРазъяснениеПланСчетов = НСтр(
		"ru = 'Доходы отражаются на пассивных субсчетах (по кредиту), расходы - на активных субсчетах (по дебету).'",
		Процессор.КодЯзыка);
		
	ШаблонРазъясненияЗачетПоказателей = НСтр(
		"ru = 'Поэтому для расчета показателя определяется кредитовый оборот по %1 за вычетом дебетового оборота по %2.'",
		Процессор.КодЯзыка);
	РазъяснениеЗачетПоказателей = СтрШаблон(
		ШаблонРазъясненияЗачетПоказателей,
		Процессор.ДанныеАлгоритма.ПредставлениеСубсчетовДоходыДательныйПадеж,
		Процессор.ДанныеАлгоритма.ПредставлениеСубсчетовРасходыДательныйПадеж);
	
	Процессор.ДанныеАлгоритма.Вставить("РазъяснениеПланСчетовБезЗачета", ОсновноеРазъяснениеПланСчетов);
	РазъяснениеПланСчетовЗачетПоказателей = Новый Массив;
	РазъяснениеПланСчетовЗачетПоказателей.Добавить(ОсновноеРазъяснениеПланСчетов);
	РазъяснениеПланСчетовЗачетПоказателей.Добавить(РазъяснениеЗачетПоказателей);
	Процессор.ДанныеАлгоритма.Вставить(
		"РазъяснениеПланСчетовЗачетПоказателей",
		СтрСоединить(РазъяснениеПланСчетовЗачетПоказателей, Символы.ПС));
	
	// Аналитика
	КлассифицируемыеОбъекты = ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.КлассифицируемыеОбъектыДляВывода(
		Процессор.МенеджерВременныхТаблиц,
		Процессор.Алгоритм,
		Процессор.ОсновнойПоказатель);
	Процессор.ДанныеАлгоритма.Вставить("Статьи", КлассифицируемыеОбъекты.ОбъектыПоказателей);
		
	Процессор.ДанныеАлгоритма.Вставить("ВидыСтатей", ПрименяемыеВидыСтатейПрочиеДоходыРасходы(Процессор.МенеджерВременныхТаблиц));
	
	// Обороты
	СоздатьОборотыПрочихДоходовРасходов(Процессор, Процессор.ДанныеАлгоритма.Счета.Субсчета, Процессор.ДанныеАлгоритма.Счета.Расходы);
	
	ПоказателиРеализуемыйАктив = Новый Массив;
	Для Каждого Правило Из Процессор.ПравилаПолученияДанных Цикл
		Если Правило.Заполнение.НастройкиАлгоритма.ЗачетПоказателей = "СтатьиОбъекты" Тогда
			ПоказателиРеализуемыйАктив.Добавить(БухгалтерскаяОтчетностьБРО.ИдентификаторПоказателя(Правило));
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Процессор.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("БезПоказателя",              Процессор.ОсновнойПоказатель);
	Запрос.УстановитьПараметр("ПоказателиРеализуемыйАктив", ПоказателиРеализуемыйАктив);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Статьи.Показатель КАК Показатель,
	|	Обороты.Статья КАК Статья,
	|	ПРЕДСТАВЛЕНИЕ(Обороты.Статья) КАК СтатьяПредставление,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Статьи.Показатель, &БезПоказателя) В (&ПоказателиРеализуемыйАктив)
	|			ТОГДА Обороты.РеализуемыйАктив
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК РеализуемыйАктив,
	|	ПРЕДСТАВЛЕНИЕ(Обороты.РеализуемыйАктив) КАК РеализуемыйАктивПредставление,
	|	Обороты.Счет КАК Счет,
	|	Обороты.Счет.Порядок КАК ПорядокСчета,
	|	Обороты.Счет.Код КАК СчетПредставление,
	|	Обороты.Счет.Вид КАК ВидСчета,
	|	Обороты.Сумма КАК Значение,
	|	0 КАК ЗначениеМодуль,
	|	Обороты.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(Обороты.Организация) КАК ОрганизацияПредставление
	|ИЗ
	|	ОборотыПрочихДоходовРасходов КАК Обороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Статьи КАК Статьи
	|		ПО Обороты.Статья = Статьи.Статья
	|
	|УПОРЯДОЧИТЬ ПО
	|	Показатель,
	|	ПорядокСчета,
	|	Счет,
	|	ЗначениеМодуль УБЫВ,
	|	Значение УБЫВ,
	|	Статья
	|ИТОГИ
	|	МАКСИМУМ(РеализуемыйАктивПредставление),
	|	СУММА(Значение),
	|	ВЫБОР
	|		КОГДА СУММА(Значение) < 0
	|			ТОГДА -СУММА(Значение)
	|		ИНАЧЕ СУММА(Значение)
	|	КОНЕЦ КАК ЗначениеМодуль
	|ПО
	|	Показатель,
	|	Организация,
	|	Статья,
	|	РеализуемыйАктив,
	|	Счет";
	
	Процессор.ДанныеУчета = Запрос.Выполнить();
	
КонецПроцедуры

Функция ПрименяемыеВидыСтатейПрочиеДоходыРасходы(МенеджерВременныхТаблиц)
	
	ВидыСтатей = Новый ТаблицаЗначений;
	ВидыСтатей.Колонки.Добавить("Показатель", Новый ОписаниеТипов("Число"));
	ВидыСтатей.Колонки.Добавить("ВидыСтатей", Новый ОписаниеТипов("СписокЗначений")); // из ПеречислениеСсылка.ВидыПрочихДоходовИРасходов и его представлений
	ВидыСтатей.Колонки.Добавить("Исключения", Новый ОписаниеТипов("Соответствие")); // Ключ - идентификатор показателя, Значение - список значений из статей и их представлений
	// После заполнения индексируется по Показатель
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыСтатей.Показатель КАК Показатель,
	|	ВидыСтатей.ВидСтатьи КАК ВидСтатьи,
	|	ПРЕДСТАВЛЕНИЕ(ВидыСтатей.ВидСтатьи) КАК ВидСтатьиПредставление,
	|	Исключения.СтатьяПоказатель КАК ПоказательИсключений,
	|	Исключения.Статья КАК Статья,
	|	ПРЕДСТАВЛЕНИЕ(Исключения.Статья) КАК СтатьяПредставление
	|ИЗ
	|	ВидыСтатей КАК ВидыСтатей
	|		ЛЕВОЕ СОЕДИНЕНИЕ Исключения КАК Исключения
	|		ПО ВидыСтатей.ВидСтатьи = Исключения.ВидСтатьи
	|ГДЕ
	|	ВидыСтатей.Показатель ЕСТЬ НЕ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыСтатей.ВидСтатьи.Порядок,
	|	Исключения.Статья.РеквизитДопУпорядочивания,
	|	Исключения.Статья
	|ИТОГИ ПО
	|	Показатель,
	|	ВидСтатьи,
	|	ПоказательИсключений";
	
	ВыборкаПоказатель = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоказатель.Следующий() Цикл
		
		ОписаниеПоказателя = ВидыСтатей.Добавить();
		ЗаполнитьЗначенияСвойств(ОписаниеПоказателя, ВыборкаПоказатель);
		
		ВыборкаВидСтатьи = ВыборкаПоказатель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВидСтатьи.Следующий() Цикл
			
			ОписаниеПоказателя.ВидыСтатей.Добавить(ВыборкаВидСтатьи.ВидСтатьи, ВыборкаВидСтатьи.ВидСтатьиПредставление);
			
			ВыборкаПоказательИсключений = ВыборкаВидСтатьи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоказательИсключений.Следующий() Цикл
				
				Если ВыборкаПоказательИсключений.ПоказательИсключений = Null Тогда
					Продолжить;
				КонецЕсли;
				
				СтатьиИсключения = ОписаниеПоказателя.Исключения[ВыборкаПоказательИсключений.ПоказательИсключений];
				Если СтатьиИсключения = Неопределено Тогда
					СтатьиИсключения = Новый СписокЗначений;
					ОписаниеПоказателя.Исключения.Вставить(ВыборкаПоказательИсключений.ПоказательИсключений, СтатьиИсключения);
				КонецЕсли;
				
				ВыборкаСтатья = ВыборкаПоказательИсключений.Выбрать();
				Пока ВыборкаСтатья.Следующий() Цикл
					СтатьиИсключения.Добавить(ВыборкаСтатья.Статья, ВыборкаСтатья.СтатьяПредставление);
				КонецЦикла;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ВидыСтатей.Индексы.Добавить("Показатель");
	Возврат ВидыСтатей;
	
КонецФункции

Процедура ОписатьПорядокЗаполненияПоказателяПрочиеДоходыРасходы(Описание, Показатель, ЭтоОсновнойПоказатель, Процессор)
	
	ИдентификаторПоказателя = БухгалтерскаяОтчетностьБРО.ИдентификаторПоказателя(Показатель);
	
	СодержимоеПоказателя  = Процессор.ДанныеАлгоритма.Статьи[ИдентификаторПоказателя];
	СодержимоеШагаРасчета = Неопределено;
	Если Не ЭтоОсновнойПоказатель Тогда
		СодержимоеШагаРасчета = СодержимоеПоказателя;
	КонецЕсли;
	
	Описание.ШагиРасчета.Добавить(СодержимоеШагаРасчета, "Статья");
	
	ЗачетПоказателей = Показатель.Заполнение.НастройкиАлгоритма.ЗачетПоказателей;
	
	Если ЗачетПоказателей = "Нет" Тогда
		Описание.Разъяснение = Процессор.ДанныеАлгоритма.РазъяснениеПланСчетовБезЗачета;
	Иначе
		Описание.Разъяснение = Процессор.ДанныеАлгоритма.РазъяснениеПланСчетовЗачетПоказателей;
	КонецЕсли;
	
	ОписаниеЗачетПоказателей = "";
	Если ЗачетПоказателей = "СтатьиОбъекты" Тогда
		
		Описание.ШагиРасчета.Добавить(, "РеализуемыйАктив");
		ОписаниеЗачетПоказателей = НСтр(
			"ru = 'По каждой статье и реализованному объекту раздельно определяются доходы (сумма положительных значений) и расходы (сумма отрицательных значений)'",
			Процессор.КодЯзыка);
		Описание.Отчет.ВидОтчета = "АнализСубконто"; // Нельзя использовать ОборотыСчета: данные выбираются с разных субсчетов счета 91 в разрезе РеализуемыйАктив, но на самом счете 91 такое субконто не определено
		
	Иначе
		
		Описание.ШагиРасчета.Добавить(, "Счет");
		Описание.Отчет.ВидОтчета = "ОборотыСчета";
		
		Если ЗачетПоказателей = "Показатель" Тогда
			ОписаниеЗачетПоказателей = НСтр("ru = 'Положительная итоговая сумма включается в доходы, отрицательная - в расходы'", Процессор.КодЯзыка);
		ИначеЕсли ЗачетПоказателей = "Нет" Тогда
			ОписаниеЗачетПоказателей = НСтр("ru = 'Суммы, учтенные по кредиту, включаются в доходы; по дебету - в расходы'", Процессор.КодЯзыка);
		КонецЕсли;
		
	КонецЕсли;
	
	
	// Отчет
	Описание.Отчет.СчетГруппа = Процессор.ДанныеАлгоритма.Счета.Группа;

	Описание.Отчет.Субконто.Вставить("Статья", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы);
	Описание.Отчет.Субконто.Вставить("РеализуемыйАктив", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РеализуемыеАктивы);
	
	// Текст и отбор отчета.
	// Недостаточно полагаться на заданные правила заполнения, так как могут быть исключения
	// (для одного показателя указаны виды, для другого - статьи того же вида)
	ЕдинственныйПоказатель = (Процессор.ПравилаПолученияДанных.Количество() = 1);
	
	ОписаниеВидаСтатей = Процессор.ДанныеАлгоритма.ВидыСтатей.Найти(ИдентификаторПоказателя, "Показатель");
	
	СловаТекста = Новый Структура;
	
	ШаблонТекста = "";
	Если ЭтоОсновнойПоказатель И ЕдинственныйПоказатель Тогда
		ШаблонТекста = СтрШаблон(НСтр("ru = 'Оборот по счету %1.'", Процессор.КодЯзыка), Процессор.ДанныеАлгоритма.Счета.Группа);
	ИначеЕсли ОписаниеВидаСтатей <> Неопределено Тогда
		
		ШаблонТекста = СтрШаблон(
			НСтр("ru = 'Оборот по счету %1 по статьям [ВидСтатьи].'", Процессор.КодЯзыка),
			Процессор.ДанныеАлгоритма.Счета.Группа);
		ВидСтатьи = "";
		Если ОписаниеВидаСтатей.ВидыСтатей.Количество() > 1 Тогда
			ВидСтатьи = СтрШаблон(
				НСтр("ru = 'видов
                      |%1'", Процессор.КодЯзыка),
				ПредставлениеСпискаЗначений(ОписаниеВидаСтатей.ВидыСтатей, Истина, Процессор.КодЯзыка));
		Иначе
			ВидСтатьи = СтрШаблон(
				НСтр("ru = 'вида %1'", Процессор.КодЯзыка),
				ПредставлениеСпискаЗначений(ОписаниеВидаСтатей.ВидыСтатей, Ложь, Процессор.КодЯзыка));
		КонецЕсли;
		СловаТекста.Вставить("ВидСтатьи", ВидСтатьи);
		
		Если Не ЗначениеЗаполнено(ОписаниеВидаСтатей.Исключения) Или Не ЗначениеЗаполнено(СодержимоеПоказателя) Тогда
			
			ОтборЧерезТочку = Новый Соответствие;
			ОтборЧерезТочку.Вставить("ВидПрочихДоходовИРасходов", ОписаниеВидаСтатей.ВидыСтатей.ВыгрузитьЗначения());
			Описание.Отчет.ОтборыПоказателя.Вставить("Статья", ОтборЧерезТочку);
			
		Иначе
			
			Описание.Отчет.ОтборыПоказателя.Вставить("Статья", СодержимоеПоказателя.ВыгрузитьЗначения());
			
			ШаблонТекста = СтрШаблон(
				НСтр("ru = 'Оборот по счету %1 по статьям [ВидСтатьи].
                      |Исключения - статьи, входящие в состав других показателей:
                      |[Исключения]'", Процессор.КодЯзыка),
				Процессор.ДанныеАлгоритма.Счета.Группа);
			ШаблонИсключения = " * %1 - %2"; // Наименование показателя, Наименования статей
			
			ПорядокИсключений = Новый ТаблицаЗначений;
			ПорядокИсключений.Колонки.Добавить("Показатель", Новый ОписаниеТипов("Число"));
			Для Каждого ОписаниеИсключения Из ОписаниеВидаСтатей.Исключения Цикл
				ПорядокИсключений.Добавить().Показатель = ОписаниеИсключения.Ключ;
			КонецЦикла;
			ПорядокИсключений.Сортировать("Показатель");
			
			ПредложенияИсключений = Новый Массив;
			Для Каждого ИдентификаторПоказателяИсключений Из ПорядокИсключений.ВыгрузитьКолонку("Показатель") Цикл
				
				ПредставленияСтатейИсключений = ПредставлениеСпискаЗначений(
					ОписаниеВидаСтатей.Исключения[ИдентификаторПоказателяИсключений],
					Ложь,
					Процессор.КодЯзыка);
				
				ПоказательИсключений = БухгалтерскаяОтчетностьБРО.Показатель(ИдентификаторПоказателяИсключений, Процессор.ЗаполняемыеПоказатели);
				ПредложенияИсключений.Добавить(СтрШаблон(
					ШаблонИсключения,
					ПоказательИсключений.Наименование,
					ПредставленияСтатейИсключений));
					
			КонецЦикла;
				
			СловаТекста.Вставить("Исключения", СтрСоединить(ПредложенияИсключений, Символы.ПС));
		
		КонецЕсли;
		
	ИначеЕсли Не ЗначениеЗаполнено(СодержимоеПоказателя) Тогда
		// Предполагается, что таких быть не должно
		ШаблонТекста = НСтр("ru = 'Порядок заполнения не определен'", Процессор.КодЯзыка);
	Иначе
		
		Описание.Отчет.ОтборыПоказателя.Вставить("Статья", СодержимоеПоказателя.ВыгрузитьЗначения());
		ШаблонТекста = СтрШаблон(
			НСтр("ru = 'Оборот по счету %1 по статьям из списка:
                  |[Статьи]'", Процессор.КодЯзыка),
			Процессор.ДанныеАлгоритма.Счета.Группа);
		
		СловаТекста.Вставить("Статьи", ПредставлениеСпискаЗначений(СодержимоеПоказателя, Истина, Процессор.КодЯзыка));
		
	КонецЕсли;
	
	Текст = Новый Массив;
	Текст.Добавить(СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонТекста, СловаТекста));
	Если ЭтоОсновнойПоказатель Тогда
		Текст.Добавить(НСтр("ru = 'Дополнительно включается оборот по счету 99.01 с видом убытка ""Чрезвычайные доходы (расходы)"".'", Процессор.КодЯзыка));
	КонецЕсли;
	Если Не ПустаяСтрока(ОписаниеЗачетПоказателей) Тогда
		Текст.Добавить(ОписаниеЗачетПоказателей);
	КонецЕсли;
	
	Описание.Текст = СтрСоединить(Текст, Символы.ПС);
	
КонецПроцедуры

Функция ЗачестьПрочиеДоходыРасходы(КомпонентыЗачета, ВариантЗачета, ЗначенияПоказателя, ДанныеАлгоритма, КодЯзыка)
	
	Если ВариантЗачета = "Показатель" Тогда
		// Стандартное поведение
		Возврат Ложь;
	КонецЕсли;
	
	ПоложительноеЗначение = ЗначенияПоказателя.Значение;
	ОтрицательноеЗначение = 0;
	
	КомпонентыЗачета.Положительный.Пояснение = НСтр("ru = 'положительные значения (доход)'",  КодЯзыка);
	КомпонентыЗачета.Отрицательный.Пояснение = НСтр("ru = 'отрицательные значения (расход)'", КодЯзыка);
	
	Если ВариантЗачета = "СтатьиОбъекты" Тогда
		ДополнитьРазвернутоеЗначениеСтатьиОбъекты(ПоложительноеЗначение, ОтрицательноеЗначение, ЗначенияПоказателя);
	Иначе
		
		ДополнитьРазвернутоеЗначениеВидСчета(
			ПоложительноеЗначение,
			ОтрицательноеЗначение,
			ЗначенияПоказателя,
			ДанныеАлгоритма.Счета.Назначение);
			
		КомпонентыЗачета.Положительный.Пояснение = СтрШаблон(
			НСтр("ru = 'обороты по %1 (доход)'", КодЯзыка),
			ДанныеАлгоритма.ПредставлениеСубсчетовДоходыДательныйПадеж);
		КомпонентыЗачета.Отрицательный.Пояснение = СтрШаблон(
			НСтр("ru = 'обороты по %1 (расход)'", КодЯзыка),
			ДанныеАлгоритма.ПредставлениеСубсчетовРасходыДательныйПадеж);
		
	КонецЕсли;
	
	Если ПоложительноеЗначение <> 0 Тогда
		КомпонентыЗачета.Положительный.Значение  = ПоложительноеЗначение;
	КонецЕсли;

	Если ОтрицательноеЗначение <> 0 Тогда
		КомпонентыЗачета.Отрицательный.Значение  = ОтрицательноеЗначение;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ДополнитьРазвернутоеЗначениеСтатьиОбъекты(ПоложительноеЗначение, ОтрицательноеЗначение, ЗначенияПоказателя)
	Если ЗначениеЗаполнено(ЗначенияПоказателя.Строки) Тогда
		Для Каждого РазвернутоеЗначение Из ЗначенияПоказателя.Строки Цикл
			ДополнитьРазвернутоеЗначениеСтатьиОбъекты(ПоложительноеЗначение, ОтрицательноеЗначение, РазвернутоеЗначение);
		КонецЦикла;
	ИначеЕсли ЗначенияПоказателя.Значение >= 0 Тогда
		Возврат;
	Иначе
		ОтрицательноеЗначение = ОтрицательноеЗначение + ЗначенияПоказателя.Значение;
		ПоложительноеЗначение = ПоложительноеЗначение - ЗначенияПоказателя.Значение;
	КонецЕсли;
КонецПроцедуры

Процедура ДополнитьРазвернутоеЗначениеВидСчета(ПоложительноеЗначение, ОтрицательноеЗначение, ЗначенияПоказателя, НазначениеСчетов)
	
	Если ЗначенияПоказателя.ТипЗаписи <> "Счет" Тогда
		Для Каждого РазвернутоеЗначение Из ЗначенияПоказателя.Строки Цикл
			ДополнитьРазвернутоеЗначениеВидСчета(ПоложительноеЗначение, ОтрицательноеЗначение, РазвернутоеЗначение, НазначениеСчетов);
		КонецЦикла;
	ИначеЕсли НазначениеСчетов[ЗначенияПоказателя.ПредметЗаписи] = "Доходы" Тогда
		Возврат;
	Иначе
		ОтрицательноеЗначение = ОтрицательноеЗначение + ЗначенияПоказателя.Значение;
		ПоложительноеЗначение = ПоложительноеЗначение - ЗначенияПоказателя.Значение;
	КонецЕсли;
	
КонецПроцедуры

Функция ИспользуетсяУстаревшийВариантУчетаПроцентныхДоходовРасходов()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПрочиеДоходыИРасходы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПрочиеДоходыИРасходы КАК ПрочиеДоходыИРасходы
	|ГДЕ
	|	ПрочиеДоходыИРасходы.ВидПрочихДоходовИРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПроцентыКПолучениюУплате)";
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область Налоги

// Данные на счете 99 обрабатываются как этим алгоритмом, так и (в незначительной части) определяемом ИдентификаторАлгоритмаПрочиеДоходыРасходы

// В описаниях показателей с этим алгоритмом свойство Заполнение.Отбор может содержать следующие ключи:
//   * КорСчетНалога - ПланСчетовСсылка.Хозрасчетный - для показателей текущего налога
//   * ОтложенныйНалог - Булево, Истина, если речь идет о показателе отложенного налога
//   * ИтогНалогНаПрибыль - Булево, Истина, если речь идет об итоговом показателе расхода по налогу
// Предполагается, что указано одно из свойств.

Функция ИдентификаторАлгоритмаНалоги()
	Возврат ПланыСчетов.Хозрасчетный.ПрибылиИУбытки_НалогНаПрибыль;
КонецФункции

Процедура ДобавитьОтборНалогНаПрибыль(Заполнение, ЗначениеОтбора)
	
	Если ЗначениеОтбора = ПланыСчетов.Хозрасчетный.ОтложенныйНалогНаПрибыль Тогда
		Заполнение.Отбор.Вставить("ОтложенныйНалог", Истина);
	ИначеЕсли БухгалтерскийУчетПовтИсп.СчетВИерархии(ЗначениеОтбора, ПланыСчетов.Хозрасчетный.РасчетыПоНалогам) Тогда
		Заполнение.Отбор.Вставить("КорСчетНалога", ЗначениеОтбора);
	ИначеЕсли ЗначениеОтбора = ПланыСчетов.Хозрасчетный.ПрибылиИУбытки_НалогНаПрибыль Тогда
		Заполнение.Отбор.Вставить("ИтогНалогНаПрибыль", Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура НастроитьПоказателиНалоги(Показатели, Контекст)
	
	НачалоПериодаОтчета = Контекст.ОтчетныйПериод.Начало;
	Если Контекст.СравнительныйПериод.Заполнен Тогда
		НачалоПериодаОтчета = Контекст.СравнительныйПериод.Начало;
	КонецЕсли;
	
	Для Каждого Показатель Из Показатели Цикл
		
		КорСчетНалога = "";
		Если Не Показатель.Заполнение.Отбор.Свойство("КорСчетНалога", КорСчетНалога) Тогда
			Продолжить;
		КонецЕсли;
		
		Если КорСчетНалога = ПланыСчетов.Хозрасчетный.ЕНприУСН Тогда
			Показатель.Вывод = УчетнаяПолитика.ПрименяетсяУСНЗаПериод(Контекст.Организация, НачалоПериодаОтчета, Контекст.ОтчетныйПериод.КонецДата);
		ИначеЕсли КорСчетНалога = ПланыСчетов.Хозрасчетный.НалогПриАУСН Тогда
			Показатель.Вывод = УчетнаяПолитика.ПрименяетсяАУСНЗаПериод(Контекст.Организация, НачалоПериодаОтчета, Контекст.ОтчетныйПериод.КонецДата);
		ИначеЕсли КорСчетНалога = ПланыСчетов.Хозрасчетный.НалогНаПрофессиональныйДоход Тогда
			Показатель.Вывод = УчетнаяПолитика.ПлательщикНПДЗаПериод(Контекст.Организация, НачалоПериодаОтчета, Контекст.ОтчетныйПериод.КонецДата);
		ИначеЕсли КорСчетНалога = ПланыСчетов.Хозрасчетный.НДФЛ_ИП Тогда
			Показатель.Вывод = УчетнаяПолитика.ПлательщикНДФЛЗаПериод(Контекст.Организация, НачалоПериодаОтчета, Контекст.ОтчетныйПериод.КонецДата);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьДанныеУчетаНалоги(Процессор)
	
	// Сложность этого алгоритма связана с тем, что в программе есть три разных схемы учета расхода в виде налога на прибыль -
	// сокращенная (только расход по налогу) и два варианта полной (расход по налогу раскладывается на текущий и отложенный;
	// одна схема устаревшая, со счетом 68.04.2, вторая - разработанная БМЦ с буквенными субсчетами на 99).
	
	// 1. Показатели
	Процессор.ДанныеАлгоритма.Вставить("Показатели", Новый Структура);
	Процессор.ДанныеАлгоритма.Показатели.Вставить("ИтогНалогНаПрибыль", Неопределено);
	Процессор.ДанныеАлгоритма.Показатели.Вставить("ТекущийНалог",       Процессор.ОсновнойПоказатель);
	Процессор.ДанныеАлгоритма.Показатели.Вставить("ОтложенныйНалог",    Null); // Тип Null, так как если не будет уточнен ниже, должен быть неотличим в запросе от основного показателя
	Процессор.ДанныеАлгоритма.Показатели.Вставить("ПрочиеНалоги",       Новый Соответствие); // Ключ - идентификатор, значение - счет учета обязательств по налогу
	
	ПрочиеНалоги = Новый ТаблицаЗначений;
	ПрочиеНалоги.Колонки.Добавить("Показатель",    Новый ОписаниеТипов("Число"));
	ПрочиеНалоги.Колонки.Добавить("КорСчетНалога", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	
	Для Каждого Показатель Из Процессор.ПравилаПолученияДанных Цикл
		Если Не Показатель.Вывод Тогда
			Продолжить;
		КонецЕсли;
		ИдентификаторПоказателя = Показатель.Владелец().Индекс(Показатель);
		Если Показатель.Заполнение.Отбор.Свойство("КорСчетНалога") Тогда
			ОписаниеНалога = ПрочиеНалоги.Добавить();
			ОписаниеНалога.Показатель    = ИдентификаторПоказателя;
			ОписаниеНалога.КорСчетНалога = Показатель.Заполнение.Отбор.КорСчетНалога;
			Процессор.ДанныеАлгоритма.Показатели.ПрочиеНалоги.Вставить(ИдентификаторПоказателя, ОписаниеНалога.КорСчетНалога);
		ИначеЕсли Показатель.Заполнение.Отбор.Свойство("ОтложенныйНалог") И Показатель.Заполнение.Отбор.ОтложенныйНалог Тогда
			Процессор.ДанныеАлгоритма.Показатели.ОтложенныйНалог = ИдентификаторПоказателя;
		ИначеЕсли Показатель.Заполнение.Отбор.Свойство("ИтогНалогНаПрибыль") И Показатель.Заполнение.Отбор.ИтогНалогНаПрибыль Тогда
			Процессор.ДанныеАлгоритма.Показатели.ИтогНалогНаПрибыль = ИдентификаторПоказателя;
		КонецЕсли;
	КонецЦикла;
	
	
	// 2. Счета учета
	СчетаУчета = Новый Структура;
	СчетаУчета.Вставить("ПолнаяСхемаУчета",       Новый Массив);
	СчетаУчета.Вставить("ОтложенныйНалог",        БалансовыеСчетаОтложенногоНалога());
	СчетаУчета.Вставить("Закрывающие",            Новый Массив);
	СчетаУчета.Вставить("СокращеннаяСхемаУчета",  Новый Массив);
	СчетаУчета.Вставить("ОбязательстваПоНалогам", Новый Массив);
	
	// Полная схема подразумевает, что выделяется текущий и отложенный налог
	СчетаУчета.ПолнаяСхемаУчета.Добавить(ПланыСчетов.Хозрасчетный.ПрибылиИУбытки_НалогНаПрибыль);
	СчетаУчета.ПолнаяСхемаУчета.Добавить(ПланыСчетов.Хозрасчетный.РасчетНалогаНаПрибыль);
	
	// Сокращенная схема подразумевает, что текущий и отложенный налог не выделяется
	// Поскольку используемые в этом случае счета имеют и другие назначения, обороты по ним выбираем только в корреспонденции со счетами обязательств
	СчетаУчета.СокращеннаяСхемаУчета.Добавить(ПланыСчетов.Хозрасчетный.ПрибылиИУбыткиБезНалогаНаПрибыль);
	СчетаУчета.СокращеннаяСхемаУчета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеПрибылиИУбытки);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаУчета.Закрывающие, СчетаУчета.ПолнаяСхемаУчета);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаУчета.Закрывающие, СчетаУчета.СокращеннаяСхемаУчета);
	
	СчетаУчета.ОбязательстваПоНалогам.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоНалогам);
	
	
	Субсчета = Новый Структура;
	Для Каждого ОписаниеСчетов Из СчетаУчета Цикл
		Субсчета.Вставить(ОписаниеСчетов.Ключ, ВсеСубсчета(ОписаниеСчетов.Значение));
	КонецЦикла;
	// Устраним пересечение счетов обязательств (68.04) и счетов расходов (68.04.2)
	Субсчета.ОбязательстваПоНалогам = ОбщегоНазначенияКлиентСервер.РазностьМассивов(Субсчета.ОбязательстваПоНалогам, Субсчета.ПолнаяСхемаУчета);
	
	ПредставленияСчетов = Новый Структура;
	
	ВсеСчета = Новый Массив;
	Для Каждого ОписаниеСчетов Из СчетаУчета Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСчета, ОписаниеСчетов.Значение);
	КонецЦикла;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСчета, Субсчета.ОбязательстваПоНалогам);

	КодыСчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ВсеСчета, "Код");
	Для Каждого ОписаниеСчетов Из СчетаУчета Цикл
		КодыСчетовЭтогоВида = Новый Массив;
		Для Каждого Счет Из ОписаниеСчетов.Значение Цикл
			КодыСчетовЭтогоВида.Добавить(КодыСчетов[Счет]);
		КонецЦикла;
		ПредставленияСчетов.Вставить(ОписаниеСчетов.Ключ, ОбщегоНазначенияБПКлиентСервер.ПредставлениеСписка(КодыСчетовЭтогоВида));
	КонецЦикла;
	
	ПредставленияСчетов.Вставить("Все", КодыСчетов);
	
	Процессор.ДанныеАлгоритма.Вставить("ПредставленияСчетов", ПредставленияСчетов);
	Процессор.ДанныеАлгоритма.Вставить("ОсновнойСчетОтчета",  СчетаУчета.ПолнаяСхемаУчета[0]);
	
	// 3. Обороты
	
	Запрос = НачатьЗапрос(Процессор);
	Запрос.УстановитьПараметр("ПоказательТекущийНалог",    Процессор.ДанныеАлгоритма.Показатели.ТекущийНалог);
	Запрос.УстановитьПараметр("ПоказательОтложенныйНалог", Процессор.ДанныеАлгоритма.Показатели.ОтложенныйНалог);
	Запрос.УстановитьПараметр("ПрочиеНалоги",              ПрочиеНалоги);
	Для Каждого ОписаниеСубсчетов Из Субсчета Цикл
		Запрос.УстановитьПараметр(СтрШаблон("Счета%1", ОписаниеСубсчетов.Ключ),  ОписаниеСубсчетов.Значение);
	КонецЦикла;
	
	РазъяснениеПланСчетов = НСтр(
		"ru = 'Расходы отражаются по дебету счетов учета, поэтому для расчета показателя определяется кредитовый оборот по счету за вычетом дебетового оборота.'",
		Процессор.КодЯзыка);
	Процессор.ДанныеАлгоритма.Вставить("РазъяснениеПланСчетов", РазъяснениеПланСчетов);
	
	// Расходы (дебетовый оборот) представляются в ОФР отрицательным числом
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сокращенная.Организация КАК Организация,
	|	""Сокращенная"" КАК СхемаУчета,
	|	Сокращенная.Счет КАК Счет,
	|	Сокращенная.КорСчет КАК КорСчет,
	|	ЛОЖЬ КАК ОтложенныйНалог,
	|	-Сокращенная.СуммаОборот КАК Сумма
	|ПОМЕСТИТЬ ОборотыНалоги
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В (&СчетаСокращеннаяСхемаУчета), , Организация В (&Организации), КорСчет В (&СчетаОбязательстваПоНалогам), ) КАК Сокращенная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Полная.Организация,
	|	""Полная"",
	|	Полная.Счет,
	|	Полная.КорСчет,
	|	Полная.КорСчет В (&СчетаОтложенныйНалог),
	|	-Полная.СуммаОборот
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В (&СчетаПолнаяСхемаУчета), , Организация В (&Организации), НЕ КорСчет В (&СчетаЗакрывающие), ) КАК Полная
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КорСчет,
	|	СхемаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрочиеНалоги.Показатель КАК Показатель,
	|	ПрочиеНалоги.КорСчетНалога КАК КорСчетНалога
	|ПОМЕСТИТЬ ПрочиеНалоги
	|ИЗ
	|	&ПрочиеНалоги КАК ПрочиеНалоги
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КорСчетНалога
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ОборотыНалоги.СхемаУчета = ""Сокращенная""
	|			ТОГДА ЕСТЬNULL(ПрочиеНалоги.Показатель, &ПоказательТекущийНалог)
	|		КОГДА ОборотыНалоги.ОтложенныйНалог
	|			ТОГДА &ПоказательОтложенныйНалог
	|		ИНАЧЕ &ПоказательТекущийНалог
	|	КОНЕЦ КАК Показатель,
	|	ОборотыНалоги.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(ОборотыНалоги.Организация) КАК ОрганизацияПредставление,
	|	ОборотыНалоги.Организация.Наименование КАК ОрганизацияПорядок,
	|	ОборотыНалоги.Счет КАК Счет,
	|	ОборотыНалоги.КорСчет КАК КорСчет,
	|	ОборотыНалоги.Сумма КАК Значение,
	|	ОборотыНалоги.Счет.Порядок КАК СчетПорядок,
	|	ОборотыНалоги.КорСчет.Порядок КАК КорСчетПорядок,
	|	ОборотыНалоги.Счет.Код КАК СчетПредставление,
	|	ОборотыНалоги.КорСчет.Код КАК КорСчетПредставление
	|ИЗ
	|	ОборотыНалоги КАК ОборотыНалоги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПрочиеНалоги КАК ПрочиеНалоги
	|		ПО ОборотыНалоги.КорСчет = ПрочиеНалоги.КорСчетНалога
	|			И (ОборотыНалоги.СхемаУчета = ""Сокращенная"")
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОрганизацияПорядок,
	|	СчетПорядок,
	|	Счет,
	|	КорСчетПорядок,
	|	КорСчет
	|ИТОГИ
	|	СУММА(Значение)
	|ПО
	|	Показатель,
	|	Организация,
	|	Счет,
	|	КорСчет";
	
	Процессор.ДанныеУчета = Запрос.Выполнить();
	
КонецПроцедуры

Процедура ОписатьПорядокЗаполненияПоказателяНалоги(Описание, Показатель, ДанныеАлгоритма, КодЯзыка)
	
	Если Не Показатель.Вывод Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторПоказателя = Показатель.Владелец().Индекс(Показатель);
	Если ИдентификаторПоказателя = ДанныеАлгоритма.Показатели.ИтогНалогНаПрибыль Тогда
		// См. СуммироватьЗначенияПоказателейНалоги
		Возврат;
	КонецЕсли;
	
	Описание.ШагиРасчета.Добавить(, "Счет");
	Описание.ШагиРасчета.Добавить(, "КорСчет");
	
	СчетОтчета = ДанныеАлгоритма.ОсновнойСчетОтчета;
	
	Если ИдентификаторПоказателя = ДанныеАлгоритма.Показатели.ОтложенныйНалог Тогда
		Описание.Текст = СтрШаблон(
			НСтр("ru = 'Оборот по счетам %1 в корреспонденции со счетами %2'", КодЯзыка),
			ДанныеАлгоритма.ПредставленияСчетов.ПолнаяСхемаУчета,
			ДанныеАлгоритма.ПредставленияСчетов.ОтложенныйНалог);
	Иначе
		СчетНалога = ДанныеАлгоритма.Показатели.ПрочиеНалоги[ИдентификаторПоказателя];
		Если СчетНалога <> Неопределено Тогда
			Описание.Текст = СтрШаблон(
				НСтр("ru = 'Оборот по счетам %1 в корреспонденции со счетом %2'", КодЯзыка),
				ДанныеАлгоритма.ПредставленияСчетов.СокращеннаяСхемаУчета,
				ДанныеАлгоритма.ПредставленияСчетов.Все[СчетНалога]);
			СчетОтчета = СчетНалога;
		Иначе
			ШаблонТекста = НСтр("ru = 'Оборот по счетам
                                |- %1 - в корреспонденции со счетом %2, кроме включенных в другие строки
                                |- %3, кроме
                                |  -- закрывающих оборотов
                                |  -- оборотов в корреспонденции со счетами отложенного налога (%4)'",
								КодЯзыка);
			Описание.Текст = СтрШаблон(
				ШаблонТекста,
				ДанныеАлгоритма.ПредставленияСчетов.СокращеннаяСхемаУчета,
				ДанныеАлгоритма.ПредставленияСчетов.ОбязательстваПоНалогам,
				ДанныеАлгоритма.ПредставленияСчетов.ПолнаяСхемаУчета,
				ДанныеАлгоритма.ПредставленияСчетов.ОтложенныйНалог);
		КонецЕсли;
	КонецЕсли;
	
	Описание.Разъяснение = ДанныеАлгоритма.РазъяснениеПланСчетов;
	
	// Отчет
	Описание.Отчет.ВидОтчета  = "АнализСчета";
	Описание.Отчет.СчетГруппа = СчетОтчета;
	
КонецПроцедуры

Процедура ОписатьЗаполняемоеЗначениеНалоги(ЗаписьРасчет, КешПредставлений, КодЯзыка)
	
	ОписатьЗаполняемоеЗначениеОборотыМеждуСчетами(ЗаписьРасчет, КешПредставлений, КодЯзыка);
	
КонецПроцедуры

Процедура ОписатьСуммирующиеПоказателиНалоги(СуммирующиеПоказатели, ДанныеАлгоритма)
	
	СуммирующиеПоказатели = Новый Соответствие;
	
	Если ДанныеАлгоритма.Показатели.ИтогНалогНаПрибыль = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СлагаемыеИтогНалогНаПрибыль = Новый Массив;
	СлагаемыеИтогНалогНаПрибыль.Добавить(ДанныеАлгоритма.Показатели.ТекущийНалог);
	Если ТипЗнч(ДанныеАлгоритма.Показатели.ОтложенныйНалог) = Тип("Число") Тогда
		СлагаемыеИтогНалогНаПрибыль.Добавить(ДанныеАлгоритма.Показатели.ОтложенныйНалог);
	КонецЕсли;
	
	СуммирующиеПоказатели.Вставить(ДанныеАлгоритма.Показатели.ИтогНалогНаПрибыль, СлагаемыеИтогНалогНаПрибыль);
	
КонецПроцедуры

#КонецОбласти

#Область РезультатПереоценкиВнеоборотныхАктивов

// В описаниях показателей с этим алгоритмом свойство Заполнение.Отбор может содержать следующие ключи:
//   * Счет - ПланСчетовСсылка.Хозрасчетный - субсчет счета 83, соответствующий виду переоцениваемых объектов
//   * ОтложенныйНалог - Булево, Истина, если речь идет о показателе отложенного налога
// Предполагается, что указано одно из свойств.

Функция ИдентификаторАлгоритмаРезультатПереоценкиВнеоборотныхАктивов()
	
	// В качестве идентификатора нельзя использовать код счета,
	// так как план счетов Минфина не предусматривает динамического счета для соответствующих показателей ОФР
	Возврат "РезультатПереоценкиВнеоборотныхАктивов";
	
КонецФункции

Процедура ДобавитьОтборРезультатПереоценкиВнеоборотныхАктивов(Заполнение, ЗначениеОтбора)
	Если ЗначениеОтбора = "ОтложенныйНалог" Тогда
		Заполнение.Отбор.Вставить("ОтложенныйНалог", Истина);
	Иначе
		Заполнение.Отбор.Вставить("Счет", ЗначениеОтбора);
	КонецЕсли;
КонецПроцедуры

Функция СчетаВнеоборотныхАктивов()
	
	Перем СчетаАктивов;
	
	СчетаАктивов = Новый Массив;
	СчетаАктивов.Добавить(ПланыСчетов.Хозрасчетный.ОсновныеСредства);
	СчетаАктивов.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияОсновныхСредств);
	СчетаАктивов.Добавить(ПланыСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ);
	СчетаАктивов.Добавить(ПланыСчетов.Хозрасчетный.НематериальныеАктивы);
	СчетаАктивов.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов_);
	СчетаАктивов.Добавить(ПланыСчетов.Хозрасчетный.ОборудованиеКУстановке);
	СчетаАктивов.Добавить(ПланыСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы);
	Возврат СчетаАктивов;

КонецФункции

Процедура ПолучитьДанныеУчетаРезультатПереоценкиВнеоборотныхАктивов(Процессор)

	// 1. Счет учета
	Процессор.ДанныеАлгоритма.Вставить("Счет",     ПланыСчетов.Хозрасчетный.ПриростСтоимостиПоПереоценке);
	Процессор.ДанныеАлгоритма.Вставить("Субсчета", БухгалтерскийУчетПовтИсп.СчетаВИерархии(Процессор.ДанныеАлгоритма.Счет));
	
	Процессор.ДанныеАлгоритма.Вставить("ОписаниеСчетов", ОписаниеСчетовУчета(Процессор.ДанныеАлгоритма.Субсчета));
	
	// 2. Показатели
	Процессор.ДанныеАлгоритма.Вставить("Показатели", Новый Структура);
	Процессор.ДанныеАлгоритма.Показатели.Вставить("ОтложенныйНалог", Null);
	Процессор.ДанныеАлгоритма.Показатели.Вставить("ВидыАктивов",     Новый Соответствие); // Ключ - идентификатор, значение - субсчет счета капитала
	
	ВидыАктивов = Новый ТаблицаЗначений;
	ВидыАктивов.Колонки.Добавить("Показатель", Новый ОписаниеТипов("Число"));
	ВидыАктивов.Колонки.Добавить("Субсчет",    Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	
	Счет = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	ОтложенныйНалог = Ложь;
	Для Каждого Показатель Из Процессор.ПравилаПолученияДанных Цикл
		ИдентификаторПоказателя = Показатель.Владелец().Индекс(Показатель);
		Если Показатель.Заполнение.Отбор.Свойство("Счет", Счет) Тогда
			Если Процессор.ДанныеАлгоритма.Субсчета.Найти(Счет) <> Неопределено Тогда
				ОписаниеВидаАктивов = ВидыАктивов.Добавить();
				ОписаниеВидаАктивов.Показатель = ИдентификаторПоказателя;
				ОписаниеВидаАктивов.Субсчет    = Счет;
				Процессор.ДанныеАлгоритма.Показатели.ВидыАктивов.Вставить(ИдентификаторПоказателя, Счет);
			КонецЕсли;
		ИначеЕсли Показатель.Заполнение.Отбор.Свойство("ОтложенныйНалог", ОтложенныйНалог) И ОтложенныйНалог Тогда
			Процессор.ДанныеАлгоритма.Показатели.ОтложенныйНалог = ИдентификаторПоказателя;
		КонецЕсли;
	КонецЦикла;
	
	// 3. Счета прочих видов активов
	ОписаниеСчетовПрочие = ОбщегоНазначенияКлиентСервер.СкопироватьСписокЗначений(Процессор.ДанныеАлгоритма.ОписаниеСчетов);
	СчетаГруппы = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ОписаниеСчетовПрочие.ВыгрузитьЗначения(), "ЗапретитьИспользоватьВПроводках");
	Для Каждого СчетГруппа Из СчетаГруппы Цикл
		Если СчетГруппа.Значение = Истина Тогда
			УдалитьЗначенияИзСписка(ОписаниеСчетовПрочие, СчетГруппа.Ключ);
		КонецЕсли;
	КонецЦикла;

	Для Каждого ОписаниеВидаАктивов Из ВидыАктивов Цикл
		УдалитьЗначенияИзСписка(ОписаниеСчетовПрочие, ОписаниеВидаАктивов.Субсчет);
	КонецЦикла;
	
	ПредставлениеСубсчетовПрочие = ПредставлениеСпискаСчетов(ОписаниеСчетовПрочие);
	Если ПредставлениеСубсчетовПрочие.Количество = 1 Тогда
		ШаблонСчетовПрочие = НСтр("ru = 'субсчету %1'", Процессор.КодЯзыка);
	Иначе
		ШаблонСчетовПрочие = НСтр("ru = 'субсчетам %1'", Процессор.КодЯзыка);
	КонецЕсли;
		
	Процессор.ДанныеАлгоритма.Вставить("СубсчетаПрочие", ОписаниеСчетовПрочие.ВыгрузитьЗначения());
	Процессор.ДанныеАлгоритма.Вставить("ПредставлениеСубсчетовПрочие", СтрШаблон(ШаблонСчетовПрочие, ПредставлениеСубсчетовПрочие.Текст));
	
	// 4. Кор.счета

	Процессор.ДанныеАлгоритма.Вставить("СчетаАктивов", СчетаВнеоборотныхАктивов());
	Процессор.ДанныеАлгоритма.Вставить("ПредставлениеСчетовАктивов", ПредставлениеСчетовГрупп(Процессор.ДанныеАлгоритма.СчетаАктивов));
	
	СчетаОтложенногоНалога = БалансовыеСчетаОтложенногоНалога();
	Процессор.ДанныеАлгоритма.Вставить("СчетаОтложенногоНалога",               ВсеСубсчета(СчетаОтложенногоНалога));
	Процессор.ДанныеАлгоритма.Вставить("ПредставлениеСчетовОтложенногоНалога", ПредставлениеСчетовГрупп(СчетаОтложенногоНалога));
		
	// 5. Обороты
	КорСчета = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КорСчета, Процессор.ДанныеАлгоритма.СчетаАктивов);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КорСчета, Процессор.ДанныеАлгоритма.СчетаОтложенногоНалога);
	
	Запрос = НачатьЗапрос(Процессор);
	Запрос.УстановитьПараметр("Субсчета",                  Процессор.ДанныеАлгоритма.Субсчета);
	Запрос.УстановитьПараметр("ПоказательОтложенныйНалог", Процессор.ДанныеАлгоритма.Показатели.ОтложенныйНалог);
	Запрос.УстановитьПараметр("СчетаОтложенногоНалога",    Процессор.ДанныеАлгоритма.СчетаОтложенногоНалога);
	Запрос.УстановитьПараметр("ВидыАктивов",               ВидыАктивов);
	Запрос.УстановитьПараметр("КорСчета",                  ВсеСубсчета(КорСчета));
	
	РазъяснениеПланСчетов = НСтр(
		"ru = 'Увеличение капитала отражается по кредиту счетов капитала, поэтому определяется кредитовый оборот по счету за вычетом дебетового оборота.'",
		Процессор.КодЯзыка);
	Процессор.ДанныеАлгоритма.Вставить("РазъяснениеПланСчетов", РазъяснениеПланСчетов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Обороты.Организация КАК Организация,
	|	Обороты.Счет КАК Счет,
	|	Обороты.КорСчет КАК КорСчет,
	|	-Обороты.СуммаОборот КАК Сумма
	|ПОМЕСТИТЬ ОборотыПереоценкаВнеоборотныхАктивов
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В (&Субсчета), , Организация В (&Организации), КорСчет В (&КорСчета), ) КАК Обороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыАктивов.Показатель КАК Показатель,
	|	ВидыАктивов.Субсчет КАК Субсчет
	|ПОМЕСТИТЬ ВидыАктивов
	|ИЗ
	|	&ВидыАктивов КАК ВидыАктивов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Обороты.КорСчет В (&СчетаОтложенногоНалога)
	|			ТОГДА &ПоказательОтложенныйНалог
	|		ИНАЧЕ ВидыАктивов.Показатель
	|	КОНЕЦ КАК Показатель,
	|	Обороты.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(Обороты.Организация) КАК ОрганизацияПредставление,
	|	Обороты.Организация.Наименование КАК ОрганизацияПорядок,
	|	Обороты.Счет КАК Счет,
	|	Обороты.КорСчет КАК КорСчет,
	|	Обороты.Сумма КАК Значение,
	|	Обороты.Счет.Порядок КАК СчетПорядок,
	|	Обороты.КорСчет.Порядок КАК КорСчетПорядок,
	|	Обороты.Счет.Код КАК СчетПредставление,
	|	Обороты.КорСчет.Код КАК КорСчетПредставление
	|ИЗ
	|	ОборотыПереоценкаВнеоборотныхАктивов КАК Обороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыАктивов КАК ВидыАктивов
	|		ПО Обороты.Счет = ВидыАктивов.Субсчет
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОрганизацияПорядок,
	|	СчетПорядок,
	|	Счет,
	|	КорСчетПорядок,
	|	КорСчет
	|ИТОГИ
	|	СУММА(Значение)
	|ПО
	|	Показатель,
	|	Организация,
	|	Счет,
	|	КорСчет";
	
	Процессор.ДанныеУчета = Запрос.Выполнить();
	
КонецПроцедуры

Процедура ОписатьПорядокЗаполненияПоказателяРезультатПереоценкиВнеоборотныхАктивов(Описание, Показатель, ДанныеАлгоритма, КодЯзыка)
	
	Описание.ШагиРасчета.Добавить(, "Счет");
	Описание.ШагиРасчета.Добавить(, "КорСчет");
	
	СчетОтчета = ДанныеАлгоритма.Счет;
	ОтборСчетов = Неопределено;
	
	ИдентификаторПоказателя = Показатель.Владелец().Индекс(Показатель);
	Если ИдентификаторПоказателя = ДанныеАлгоритма.Показатели.ОтложенныйНалог Тогда
		Описание.Текст = СтрШаблон(
			НСтр("ru = 'Оборот по счету %1 в корреспонденции со счетами отложенного налога (%2)'", КодЯзыка),
			ДанныеАлгоритма.Счет,
			ДанныеАлгоритма.ПредставлениеСчетовОтложенногоНалога);
	Иначе
		Субсчет = ДанныеАлгоритма.Показатели.ВидыАктивов[ИдентификаторПоказателя];
		Если Субсчет <> Неопределено Тогда
			Описание.Текст = СтрШаблон(
				НСтр("ru = 'Оборот по счету %1 в корреспонденции со счетами внеоборотных активов (%2)'", КодЯзыка),
				Субсчет,
				ДанныеАлгоритма.ПредставлениеСчетовАктивов);
			СчетОтчета = Субсчет;
		Иначе
			Описание.Текст = СтрШаблон(
				НСтр("ru = 'Оборот по %1 в корреспонденции со счетами внеоборотных активов (%2)'", КодЯзыка),
				ДанныеАлгоритма.ПредставлениеСубсчетовПрочие,
				ДанныеАлгоритма.ПредставлениеСчетовАктивов);
			Если ДанныеАлгоритма.СубсчетаПрочие.Количество() = 1 Тогда
				СчетОтчета = ДанныеАлгоритма.СубсчетаПрочие[0];
			Иначе
				ОтборСчетов = ДанныеАлгоритма.СубсчетаПрочие;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Описание.Разъяснение = ДанныеАлгоритма.РазъяснениеПланСчетов;
	
	// Отчет
	Описание.Отчет.ВидОтчета  = "АнализСчета";
	Описание.Отчет.СчетГруппа = СчетОтчета;
	Если ОтборСчетов <> Неопределено Тогда
		Описание.Отчет.Субсчета = ОтборСчетов;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОписатьЗаполняемоеЗначениеРезультатПереоценкиВнеоборотныхАктивов(ЗаписьРасчет, КешПредставлений, КодЯзыка)
	
	ОписатьЗаполняемоеЗначениеОборотыМеждуСчетами(ЗаписьРасчет, КешПредставлений, КодЯзыка);
	
КонецПроцедуры

#КонецОбласти

#Область ДенежныеСредства

// При реализации баланса этот код предполагается унифицировать

Функция ИдентификаторАлгоритмаДенежныеСредства()
	Возврат "ДенежныеСредства";
КонецФункции

Функция ПредопределенныеСчетаДенег()
	
	СчетаДенег = Новый Массив;
	
	СчетаДенег.Добавить(ПланыСчетов.Хозрасчетный.Касса);
	СчетаДенег.Добавить(ПланыСчетов.Хозрасчетный.РасчетныеСчета);
	СчетаДенег.Добавить(ПланыСчетов.Хозрасчетный.ВалютныеСчета);
	СчетаДенег.Добавить(ПланыСчетов.Хозрасчетный.ЦифровойРубль);
	СчетаДенег.Добавить(ПланыСчетов.Хозрасчетный.СпециальныеСчета);
	СчетаДенег.Добавить(ПланыСчетов.Хозрасчетный.ПереводыВПути_);
	
	Возврат СчетаДенег;
	
КонецФункции

Функция ПредопределенныеСчетаДенежныхИнструментов()
	
	// Активы, учитываемые на счетах денег, но не относящиеся к денежным эквивалентам
	// (недостаточно высоколиквидные, имеющие законодательные ограничения и т.п.)
	
	СчетаДенег = Новый Массив;
	
	СчетаДенег.Добавить(ПланыСчетов.Хозрасчетный.ДенежныеДокументы);
	СчетаДенег.Добавить(ПланыСчетов.Хозрасчетный.ДенежныеДокументыВал);
	СчетаДенег.Добавить(ПланыСчетов.Хозрасчетный.КассаПлатежногоАгента);
	СчетаДенег.Добавить(ПланыСчетов.Хозрасчетный.ДепозитныеСчета);
	СчетаДенег.Добавить(ПланыСчетов.Хозрасчетный.ДепозитныеСчетаВал);
	
	Возврат СчетаДенег;
	
КонецФункции

Функция ПредопределенныеСчетаОбменВалют()
	
	СчетаДенег = Новый Массив;
	
	СчетаДенег.Добавить(ПланыСчетов.Хозрасчетный.ПриобретениеИностраннойВалюты);
	СчетаДенег.Добавить(ПланыСчетов.Хозрасчетный.РеализацияИностраннойВалюты);
	
	Возврат СчетаДенег;
	
КонецФункции

Процедура ПолучитьДанныеУчетаДенежныеСредства(Процессор)
	
	УстановитьСчетаДенежныеСредства(Процессор.ДанныеАлгоритма);
	
	Запрос = НачатьЗапрос(Процессор);
	Запрос.УстановитьПараметр("СчетаДенег",  Процессор.ДанныеАлгоритма.Счета.Деньги);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачальноеСальдо.Счет КАК Счет,
	|	НачальноеСальдо.Организация КАК Организация,
	|	НачальноеСальдо.СуммаОстаток КАК Сумма
	|ПОМЕСТИТЬ ВТ_Деньги
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&НачалоПериода, Счет В (&СчетаДенег), , Организация В (&Организации)) КАК НачальноеСальдо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	NULL КАК Показатель,
	|	Деньги.Счет КАК Счет,
	|	Деньги.Счет.Порядок КАК ПорядокСчета,
	|	Деньги.Счет.Код КАК СчетПредставление,
	|	Деньги.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(Деньги.Организация) КАК ОрганизацияПредставление,
	|	Деньги.Сумма КАК Значение
	|ИЗ
	|	ВТ_Деньги КАК Деньги
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокСчета,
	|	Счет,
	|	Организация
	|ИТОГИ
	|	СУММА(Значение)
	|ПО
	|	Показатель,
	|	Организация,
	|	Счет";
	
	Процессор.ДанныеУчета = Запрос.Выполнить();
	
КонецПроцедуры

Процедура ОписатьПорядокЗаполненияПоказателяДенежныеСредства(Описание, Показатель, ДанныеАлгоритма, КодЯзыка)
	
	Описание.ШагиРасчета.Добавить(ДанныеАлгоритма.Счета.Описание, "Счет");
	
	Описание.Текст = НСтр("ru = 'Сальдо по счетам денежных средств и денежных эквивалентов, перечисленных ниже.'", КодЯзыка);
	Описание.Отчет.ВидОтчета = "ОборотноСальдоваяВедомостьПоСчету";
	
КонецПроцедуры

#КонецОбласти

#Область ДенежныеПотоки // См. ПБУ 23, IAS 7

// В описаниях показателей с этим алгоритмом свойство Заполнение.Отбор может содержать следующие ключи:
//   * ВидСтатьи - Массив Из ПеречислениеСсылка.СтатьиДвиженияДенежныхСредств
//   * Свернутый - Строка, имя свернутого потока; см. УстановитьСворачиваемыйДенежныйПоток и ДобавитьПоказательСвернутогоДенежногоПотока;
//                 Перечень сворачиваемых потоков определяется в СоздатьКорректировкиДенежныхПотоков и ПредставленияСворачиваемыхДенежныхПотоков
//   * РаспределениеИсточник - строка, имя распределенного потока; см. РаспределитьДенежныйПоток
//   * РаспределениеПриемник - КлючИЗначение, где Ключ - имя распределенного потока, Значение - Массив значений отбора
//                             (для потока "ЕдиныйНалоговыйПлатеж" - из СправочникСсылка.ВидыНалоговИПлатежейВБюджет или ПеречислениеСсылка.ВидыНалогов);
//                             см. ДобавитьПоказательРаспределенногоДенежногоПотока
// Предполагается, что указан один ключ.

Функция ИдентификаторАлгоритмаДенежныеПотоки()
	Возврат "ДенежныеПотоки";
КонецФункции

Функция ТипЗначенияКлассифицируемыхОбъектовДенежныеПотоки()
	
	Возврат Новый ОписаниеТипов("СправочникСсылка.СтатьиДвиженияДенежныхСредств");
	
КонецФункции

#Область ОписаниеПоказателей

// Здесь Процессор - это ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.НовыйПроцессорОписанияЗаполняемыеПоказатели

Процедура ИнициализироватьЗаполнениеПоказателяДенежныеПотоки(НастройкиАлгоритма)
	
	// Определяет суммы, представляемые на нетто-основе (IAS 7.22, п. 16 ПБУ 23).
	// Например, организация получает НДС от покупателей в составе их платежей,
	// и уплачивает НДС поставщикам (в составе платежей им) и в бюджет (для простоты - разницу).
	// В отчете мы показываем поступления от покупателей и платежи поставщикам без НДС.
	// Сооответственно, корректируем и платежи в бюджет (размещаем сальдированное значение поступления НДС от покупателей и платежей НДС поставщикам).
	// В результате отражаемая на нетто-основе сумма платежа в бюджет будет околонулевой
	// (в частном случае за счет некоторых налоговых правил может оказаться ненулевой).
	//
	// Ключ - имя сворачиваемого потока (см. ПредставленияСворачиваемыхДенежныхПотоков); Значение - Неопределено
	НастройкиАлгоритма.Вставить("Сворачиваемые", Новый Структура);
	
КонецПроцедуры

Процедура ДобавитьСворачиваемыйДенежныйПоток(Процессор, ИмяСворачиваемогоПотока)
	
	Если Процессор.КонтекстЗаполнения.Группа = Неопределено И Процессор.КонтекстЗаполнения.Алгоритм <> Неопределено Тогда
		
		Если Процессор.КонтекстЗаполнения.ОбщиеСвойстваАлгоритма.Свойство("СворачиваемыеПотоки") Тогда
			СворачиваемыеПотоки = Процессор.КонтекстЗаполнения.ОбщиеСвойстваАлгоритма.СворачиваемыеПотоки;
		Иначе
			СворачиваемыеПотоки = Новый Структура;
			Процессор.КонтекстЗаполнения.ОбщиеСвойстваАлгоритма.Вставить("СворачиваемыеПотоки", СворачиваемыеПотоки);
		КонецЕсли;
		
		СворачиваемыеПотоки.Вставить(ИмяСворачиваемогоПотока); // См. УстановитьОбщийСворачиваемыйДенежныйПоток
		
	ИначеЕсли Процессор.КонтекстЗаполнения.Показатель <> Неопределено Тогда
		
		УстановитьСворачиваемыйДенежныйПоток(
			Процессор.КонтекстЗаполнения.Показатель.Заполнение.НастройкиАлгоритма,
			ИмяСворачиваемогоПотока);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОбщийСворачиваемыйДенежныйПоток(Заполнение, Алгоритм, ОбщиеСвойстваАлгоритма)
	
	Если Алгоритм <> ИдентификаторАлгоритмаДенежныеПотоки() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщиеСвойстваАлгоритма.Свойство("СворачиваемыеПотоки") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ОписаниеСворачиваемогоПотока Из ОбщиеСвойстваАлгоритма.СворачиваемыеПотоки Цикл
		УстановитьСворачиваемыйДенежныйПоток(Заполнение.НастройкиАлгоритма, ОписаниеСворачиваемогоПотока.Ключ);
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьСворачиваемыйДенежныйПоток(НастройкиАлгоритма, ИмяСворачиваемогоПотока)
	
	НастройкиАлгоритма.Сворачиваемые.Вставить(ИмяСворачиваемогоПотока);
	
КонецПроцедуры

Процедура ОграничитьСворачиваемыйДенежныйПоток(Процессор, ИмяСворачиваемогоПотока)
	
	Процессор.КонтекстЗаполнения.Показатель.Заполнение.НастройкиАлгоритма.Сворачиваемые.Удалить(ИмяСворачиваемогоПотока);
	
КонецПроцедуры

Процедура ДобавитьПоказательСвернутогоДенежногоПотока(Процессор, ИмяСворачиваемогоПотока, НаименованиеПоказателя)
	
	ДобавитьПоказатель(Процессор, НаименованиеПоказателя);
	ДобавитьЗначениеСвернутогоДенежногоПотока(Процессор, ИмяСворачиваемогоПотока, НаименованиеПоказателя);
	
КонецПроцедуры

Процедура ДобавитьЗначениеСвернутогоДенежногоПотока(Процессор, ИмяСворачиваемогоПотока, НаименованиеПоказателя)
	
	ДобавитьОтборДенежныеПотоки(
		Процессор.КонтекстЗаполнения.Показатель.Заполнение,
		Новый Структура("Свернутый", ИмяСворачиваемогоПотока));
	
	ОграничитьСворачиваемыйДенежныйПоток(Процессор, ИмяСворачиваемогоПотока); // Исключаем сворачивание "сам-на-себя"
	
КонецПроцедуры

Процедура ДобавитьПоказательРаспределенногоДенежногоПотока(Процессор, ВидСтатьи, Отбор, НаименованиеПоказателя)
	
	Показатель = ДобавитьПоказатель(Процессор, НаименованиеПоказателя);
	
	ИмяВидаСтатьи = ИмяРаспределенногоДенежногоПотока(ВидСтатьи);
	ОписаниеРаспределения = НовыйКлючИЗначение(ИмяВидаСтатьи, Отбор);
	
	ДобавитьОтборДенежныеПотоки(Показатель.Заполнение, Новый Структура("РаспределениеПриемник", ОписаниеРаспределения));
	
КонецПроцедуры

Процедура РаспределитьДенежныйПоток(Процессор, ВидСтатьи)
	
	Показатель = ДобавитьПоказатель(Процессор, ВидСтатьи);
	ИмяВидаСтатьи = ИмяРаспределенногоДенежногоПотока(ВидСтатьи);
	ДобавитьОтборДенежныеПотоки(Показатель.Заполнение, Новый Структура("РаспределениеИсточник", ИмяВидаСтатьи));
	
КонецПроцедуры

Функция ИмяРаспределенногоДенежногоПотока(ВидСтатьи)
	Возврат ОбщегоНазначения.ИмяЗначенияПеречисления(ВидСтатьи);
КонецФункции

Процедура ДобавитьПоказательДенежногоПотокаПоСчету(Процессор, НаименованиеПоказателя, Счет)
	
	// показатели по счету используются для счетов без статей движения денежных средств
	ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДвиженияДенежныхСредств;
	
	СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
	Если СвойстваСчета.ИдентификаторыСубконто[ВидСубконто] <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьПоказатель(Процессор, НаименованиеПоказателя);
	ДополнитьОтбор(Процессор, Счет);
	
КонецПроцедуры

Функция НовыйКлючИЗначение(Ключ, Значение)
	
	Фабрика = Новый Соответствие;
	Фабрика.Вставить(Ключ, Значение);
	Для Каждого КлючИЗначение Из Фабрика Цикл
		Возврат КлючИЗначение;
	КонецЦикла;
	
КонецФункции

Процедура ДобавитьОтборДенежныеПотоки(Заполнение, ЗначениеОтбора)
	
	Если ТипЗнч(ЗначениеОтбора) = Тип("Структура") Тогда
		
		ДопустимыеСвойства = СтрРазделить("Свернутый,РаспределениеПриемник,РаспределениеИсточник", ",");
		Для Каждого ИмяСвойства Из ДопустимыеСвойства Цикл
			Если ЗначениеОтбора.Свойство(ИмяСвойства) Тогда
				Заполнение.Отбор.Вставить(ИмяСвойства, ЗначениеОтбора[ИмяСвойства]);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ЗначениеОтбора) = Тип("ПеречислениеСсылка.ВидыДвиженийДенежныхСредств") Тогда
	
		ДобавитьЗначениеОтбора(Заполнение.Отбор, "ВидСтатьи", ЗначениеОтбора);
		
	ИначеЕсли ТипЗнч(ЗначениеОтбора) = Тип("ПланСчетовСсылка.Хозрасчетный") Тогда
		
		// Применяется для счетов без субконто СтатьиДвиженияДенежныхСредств,
		// позволяет ассоциировать транзитный счет с определенным денежным потоком
		
		ДобавитьЗначениеОтбора(Заполнение.Отбор, "Счет", ЗначениеОтбора);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьЗначениеОтбора(Отбор, ИмяСвойства, ЗначениеОтбора)
	
	Если Отбор.Свойство(ИмяСвойства) Тогда
		ЗначенияОтбора = Отбор[ИмяСвойства];
	Иначе
		ЗначенияОтбора = Новый Массив;
		Отбор.Вставить(ИмяСвойства, ЗначенияОтбора);
	КонецЕсли;
	
	ЗначенияОтбора.Добавить(ЗначениеОтбора);
	
КонецПроцедуры

#КонецОбласти

Процедура СоздатьКлассифицируемыеОбъектыДенежныхПотоков(МенеджерВременныхТаблиц, Показатели)
	
	// Создаваемая таблица Статьи - полная, то есть, содержит все классифицируемые объекты,
	// в том числе, не участвующие в настройках получения данных.
	// Создаваемая таблица СчетаБезСтатей не полная, содержит только те счета, для которых выполнены настройки.
	
	ВидыСтатей = Новый ТаблицаЗначений;
	ВидыСтатей.Колонки.Добавить("ВидСтатьи",  Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДвиженийДенежныхСредств"));
	ВидыСтатей.Колонки.Добавить("Показатель", Новый ОписаниеТипов("Число"));
	
	СчетаБезСтатей = Новый ТаблицаЗначений;
	СчетаБезСтатей.Колонки.Добавить("Счет",       Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	СчетаБезСтатей.Колонки.Добавить("Показатель", Новый ОписаниеТипов("Число"));
	
	Для Каждого ОписаниеПоказателя Из Показатели Цикл
		
		ИдентификаторПоказателя = БухгалтерскаяОтчетностьБРО.ИдентификаторПоказателя(ОписаниеПоказателя);
		Если ОписаниеПоказателя.Заполнение.Отбор.Свойство("ВидСтатьи") Тогда
			Для Каждого ВидСтатьи Из ОписаниеПоказателя.Заполнение.Отбор.ВидСтатьи Цикл
				НовыйЭлемент = ВидыСтатей.Добавить();
				НовыйЭлемент.ВидСтатьи  = ВидСтатьи;
				НовыйЭлемент.Показатель = ИдентификаторПоказателя;
			КонецЦикла;
		ИначеЕсли ОписаниеПоказателя.Заполнение.Отбор.Свойство("Счет") Тогда
			Для Каждого Счет Из ОписаниеПоказателя.Заполнение.Отбор.Счет Цикл
				НовыйЭлемент = СчетаБезСтатей.Добавить();
				НовыйЭлемент.Счет       = Счет;
				НовыйЭлемент.Показатель = ИдентификаторПоказателя;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ВидыСтатей",     ВидыСтатей);
	Запрос.УстановитьПараметр("СчетаБезСтатей", СчетаБезСтатей);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыСтатей.ВидСтатьи КАК ВидСтатьи,
	|	ВидыСтатей.Показатель КАК Показатель
	|ПОМЕСТИТЬ ВТ_ВидыСтатейНастройки
	|ИЗ
	|	&ВидыСтатей КАК ВидыСтатей
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидСтатьи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Счета.Счет КАК Счет,
	|	Счета.Показатель КАК Показатель
	|ПОМЕСТИТЬ ВТ_СчетаНастройки
	|ИЗ
	|	&СчетаБезСтатей КАК Счета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеСтатьи.Ссылка КАК Статья,
	|	ВсеСтатьи.ВидДвиженияДенежныхСредств КАК ВидСтатьи,
	|	МАКСИМУМ(ВидыСтатейНастройки.Показатель) КАК Показатель
	|ПОМЕСТИТЬ Статьи
	|ИЗ
	|	Справочник.СтатьиДвиженияДенежныхСредств КАК ВсеСтатьи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВидыСтатейНастройки КАК ВидыСтатейНастройки
	|		ПО ВсеСтатьи.ВидДвиженияДенежныхСредств = ВидыСтатейНастройки.ВидСтатьи
	|ГДЕ
	|	НЕ ВсеСтатьи.ЭтоГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеСтатьи.Ссылка,
	|	ВсеСтатьи.ВидДвиженияДенежныхСредств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаНастройки.Счет КАК Счет,
	|	МАКСИМУМ(СчетаНастройки.Показатель) КАК Показатель
	|ПОМЕСТИТЬ СчетаБезСтатей
	|ИЗ
	|	ВТ_СчетаНастройки КАК СчетаНастройки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный КАК СчетаУчета
	|		ПО СчетаНастройки.Счет = СчетаУчета.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК СубконтоСчетов
	|		ПО СчетаНастройки.Счет = СубконтоСчетов.Ссылка
	|			И (СубконтоСчетов.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДвиженияДенежныхСредств))
	|ГДЕ
	|	СубконтоСчетов.Ссылка ЕСТЬ NULL
	|	И НЕ СчетаУчета.ЗапретитьИспользоватьВПроводках
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетаНастройки.Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВидыСтатейНастройки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СчетаНастройки";
	
	Запрос.Выполнить();

КонецПроцедуры

#Область ДанныеУчета

Процедура ПолучитьДанныеУчетаДенежныеПотоки(Процессор)
	
	Процессор.ДанныеАлгоритма.Вставить(
		"ПредставленияСворачиваемыхДенежныхПотоков",
		ПредставленияСворачиваемыхДенежныхПотоков(Процессор.КодЯзыка));
	Процессор.ДанныеАлгоритма.Вставить("ВременныйУчетЕдиногоНалоговогоПлатежа", Неопределено); // См. НовыйДанныеВременногоУчетаЕдиногоНалоговогоПлатежа
	Процессор.ДанныеАлгоритма.Вставить("ОперацииНалогов", ОперацииНалогов());
	
	УстановитьСчетаДенежныеСредства(Процессор.ДанныеАлгоритма);
	УстановитьСчетаДенежныеПотокиПоНастройкам(Процессор);
	СоздатьДенежныеПотоки(Процессор);
	
	// Полученные данные корректируются:
	// - некоторые потоки показываются свернуто
	// - поток платежей в составе единого налогового платежа - развернуто
	СоздатьКорректировкиДенежныхПотоков(Процессор);
	
	Запрос = НачатьЗапрос(Процессор);
	Запрос.УстановитьПараметр("ОсновнойПоказатель", Процессор.ОсновнойПоказатель);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СчетаБезСтатей.Показатель, Статьи.Показатель) КАК Показатель,
	|	Потоки.Статья КАК Статья,
	|	ВЫРАЗИТЬ(Потоки.Счет КАК ПланСчетов.Хозрасчетный) КАК Счет,
	|	Потоки.Организация КАК Организация,
	|	"""" КАК ВидКорректировки,
	|	NULL КАК ИсточникКорректировки,
	|	NULL КАК ПриемникКорректировки,
	|	ЗНАЧЕНИЕ(Справочник.ВидыНалоговИПлатежейВБюджет.ПустаяСсылка) КАК Налог,
	|	"""" КАК ОперацияНалога,
	|	Потоки.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_ДенежныеПотокиСкорректированные
	|ИЗ
	|	ДенежныеПотоки КАК Потоки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Статьи КАК Статьи
	|		ПО Потоки.Статья = Статьи.Статья
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаБезСтатей КАК СчетаБезСтатей
	|		ПО Потоки.Счет = СчетаБезСтатей.Счет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Корректировки.ПоказательИсточник,
	|	Корректировки.Статья,
	|	Корректировки.Счет,
	|	Корректировки.Организация,
	|	Корректировки.Вид,
	|	NULL,
	|	Корректировки.ПоказательПриемник,
	|	Корректировки.Налог,
	|	Корректировки.ОперацияНалога,
	|	-Корректировки.Сумма
	|ИЗ
	|	КорректировкиДенежныхПотоков КАК Корректировки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Корректировки.ПоказательПриемник,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка),
	|	Корректировки.Организация,
	|	Корректировки.Вид,
	|	ЕСТЬNULL(Корректировки.ПоказательИсточник, &ОсновнойПоказатель),
	|	NULL,
	|	Корректировки.Налог,
	|	Корректировки.ОперацияНалога,
	|	Корректировки.Сумма
	|ИЗ
	|	КорректировкиДенежныхПотоков КАК Корректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Потоки.Показатель КАК Показатель,
	|	Потоки.Статья КАК Статья,
	|	ПРЕДСТАВЛЕНИЕ(Потоки.Статья) КАК СтатьяПредставление,
	|	Потоки.Счет ЕСТЬ НЕ NULL 
	|		И Потоки.Счет <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК ЭтоДвижениеДенежныхСредств,
	|	Потоки.Счет КАК Счет,
	|	Потоки.Счет.Порядок КАК ПорядокСчета,
	|	Потоки.Счет.Код КАК СчетПредставление,
	|	Потоки.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(Потоки.Организация) КАК ОрганизацияПредставление,
	|	Потоки.ВидКорректировки КАК ВидКорректировки,
	|	Потоки.ВидКорректировки КАК ВидКорректировкиДляОписанияСсылки,
	|	Потоки.ИсточникКорректировки КАК ИсточникКорректировки,
	|	ЕСТЬNULL(Потоки.ИсточникКорректировки, Потоки.ПриемникКорректировки) КАК СсылкаКорректировки,
	|	Потоки.Налог КАК Налог,
	|	ПРЕДСТАВЛЕНИЕ(Потоки.Налог) КАК НалогПредставление,
	|	Потоки.Налог.ВидНалога.Порядок КАК ВидНалогаПорядок,
	|	Потоки.Налог.Наименование КАК НалогПорядок,
	|	Потоки.ОперацияНалога КАК ОперацияНалога,
	|	Потоки.Сумма КАК Значение
	|ИЗ
	|	ВТ_ДенежныеПотокиСкорректированные КАК Потоки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Показатель,
	|	ЭтоДвижениеДенежныхСредств УБЫВ,
	|	ИсточникКорректировки,
	|	ПорядокСчета,
	|	Счет,
	|	Статья,
	|	ВидКорректировки,
	|	СсылкаКорректировки,
	|	Налог,
	|	ОперацияНалога
	|ИТОГИ
	|	СУММА(Значение)
	|ПО
	|	Показатель,
	|	Организация,
	|	ЭтоДвижениеДенежныхСредств,
	|	ИсточникКорректировки,
	|	Счет,
	|	Статья,
	|	ВидКорректировки,
	|	СсылкаКорректировки,
	|	ВидКорректировкиДляОписанияСсылки,
	|	ВидНалогаПорядок,
	|	НалогПорядок,
	|	Налог,
	|	ОперацияНалога
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ДенежныеПотокиСкорректированные";
	
	Процессор.ДанныеУчета = Запрос.Выполнить();
	
КонецПроцедуры

Процедура УстановитьСчетаДенежныеПотокиПоНастройкам(Процессор)
	
	Процессор.ДанныеАлгоритма.Счета.Вставить("ОписаниеСтатьи", Процессор.ДанныеАлгоритма.Счета.Описание.Скопировать());
	
	Запрос = НачатьЗапрос(Процессор);
	Запрос.УстановитьПараметр("ВсеСчета", Процессор.ДанныеАлгоритма.Счета.ОписаниеСтатьи.ВыгрузитьЗначения());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетаУчета.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК СчетаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоСтатьи
	|		ПО СчетаУчета.Ссылка = ВидыСубконтоСтатьи.Ссылка
	|			И (ВидыСубконтоСтатьи.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДвиженияДенежныхСредств))
	|ГДЕ
	|	СчетаУчета.Ссылка В(&ВсеСчета)
	|	И ВидыСубконтоСтатьи.Ссылка ЕСТЬ NULL";
	УдалитьСчетаПоРезультатуЗапроса(Процессор.ДанныеАлгоритма.Счета.ОписаниеСтатьи, Запрос);
	
	Процессор.ДанныеАлгоритма.Счета.Вставить("ОписаниеОсновной", Процессор.ДанныеАлгоритма.Счета.Описание.Скопировать());

	Запрос = НачатьЗапрос(Процессор);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетаУчета.Счет КАК Счет
	|ИЗ
	|	СчетаБезСтатей КАК СчетаУчета";
	УдалитьСчетаПоРезультатуЗапроса(Процессор.ДанныеАлгоритма.Счета.ОписаниеОсновной, Запрос);
	
КонецПроцедуры

Процедура УдалитьСчетаПоРезультатуЗапроса(ОписаниеСчетов, Запрос)
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		УдаляемаяЗапись = ОписаниеСчетов.НайтиПоЗначению(Выборка.Счет);
		Если УдаляемаяЗапись <> Неопределено Тогда
			ОписаниеСчетов.Удалить(УдаляемаяЗапись);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьДенежныеПотоки(Процессор)
	
	Запрос = НачатьЗапрос(Процессор);
	Запрос.УстановитьПараметр("СчетаДенег",         Процессор.ДанныеАлгоритма.Счета.Деньги);
	Запрос.УстановитьПараметр("СчетаДенегДетально", Процессор.ДанныеАлгоритма.Счета.ДеньгиДетально);
	Запрос.УстановитьПараметр("СчетаДенегСводно",   Процессор.ДанныеАлгоритма.Счета.ДеньгиСводно);
	// Аналогичный запрос повторяется в методах получения корректирующих потоков (СоздатьДенежныеПотокиОбменВалют, СоздатьДенежныеПотокиКурсовыеРазницы)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетПоСтатьям.Организация КАК Организация,
	|	УчетПоСтатьям.Счет КАК Счет,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(УчетПоСтатьям.Субконто1 КАК Справочник.СтатьиДвиженияДенежныхСредств), ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) КАК Статья,
	|	УчетПоСтатьям.СуммаОборот КАК Сумма
	|ПОМЕСТИТЬ ДенежныеПотоки
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В (&СчетаДенегДетально), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДвиженияДенежныхСредств), Организация В (&Организации), НЕ КорСчет В (&СчетаДенег), ) КАК УчетПоСтатьям
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УчетБезСтатей.Организация,
	|	УчетБезСтатей.Счет,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка),
	|	УчетБезСтатей.СуммаОборот
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В (&СчетаДенегСводно), , Организация В (&Организации), НЕ КорСчет В (&СчетаДенег), ) КАК УчетБезСтатей
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Статья";
	Запрос.Выполнить();

КонецПроцедуры

Процедура СоздатьДенежныеПотокиКонтрагентов(Процессор)
	
	// Особенность - что берем данные из табличных частей.
	
	Запрос = НачатьЗапрос(Процессор);
	Запрос.УстановитьПараметр("СчетаДенег",    Процессор.ДанныеАлгоритма.Счета.Деньги);
	Запрос.УстановитьПараметр("ВалютаУчета",   Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ПлательщикНДС", ПлательщикНДС(Процессор.Контекст.Период.КонецДата, Процессор.Контекст.Организации[0]));
	Запрос.УстановитьПараметр("ВычетНДС",      ВозможенВычетНДС(Процессор.Контекст.Период.КонецДата, Процессор.Контекст.Организации[0]));
	
	СпособОценкиТоваровВРознице = ЗаполнениеБухгалтерскойОтчетности.СпособОценкиТоваровВРознице(
		Процессор.Контекст.Организации[0],
		Процессор.Контекст.Период.КонецДата);
	Запрос.УстановитьПараметр(
		"ИспользуетсяСводныйУчетРозницы",
		СпособОценкиТоваровВРознице = Перечисления.СпособыОценкиТоваровВРознице.ПоПродажнойСтоимости);
	
	СчетаВознагражденияАгентаПокупателя = СчетаВознагражденияАгентаПокупателя();
	Запрос.УстановитьПараметр("СчетаВознагражденияАгентаПокупателя", БухгалтерскийУчет.СформироватьМассивСубсчетовПоОтбору(СчетаВознагражденияАгентаПокупателя));
	
	// В потоках НДС не учитываем агентский НДС, чтобы избежать двойного счета.
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Ссылка КАК Ссылка,
	|	ПриходныйКассовыйОрдер.Организация КАК Организация,
	|	ПриходныйКассовыйОрдер.СчетКасса КАК Счет,
	|	ПриходныйКассовыйОрдер.ВалютаДокумента КАК ВалютаДокумента,
	|	ПриходныйКассовыйОрдер.ВидОперации КАК ВидОперации,
	|	ПриходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.РозничнаяВыручка) КАК ЭтоРозница,
	|	&ИспользуетсяСводныйУчетРозницы
	|		И ПриходныйКассовыйОрдер.ВыручкаСНТТ КАК СводныйУчетРозницы
	|ПОМЕСТИТЬ ВТ_ДокументыПКО
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Дата МЕЖДУ &НачалоПериода И &КонецПериодаДата
	|	И ПриходныйКассовыйОрдер.Организация В(&Организации)
	|	И ПриходныйКассовыйОрдер.Проведен
	|	И ПриходныйКассовыйОрдер.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ОплатаПокупателя), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ВозвратОтПоставщика), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.РозничнаяВыручка))
	|	И ПриходныйКассовыйОрдер.СчетКасса В(&СчетаДенег)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	ЭтоРозница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетОРозничныхПродажах.Ссылка КАК Ссылка,
	|	ОтчетОРозничныхПродажах.Организация КАК Организация,
	|	ОтчетОРозничныхПродажах.СчетКасса КАК Счет,
	|	ОтчетОРозничныхПродажах.СтатьяДвиженияДенежныхСредств КАК Статья,
	|	&ИспользуетсяСводныйУчетРозницы
	|		И ОтчетОРозничныхПродажах.Склад.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.НеавтоматизированнаяТорговаяТочка) КАК СводныйУчетРозницы
	|ПОМЕСТИТЬ ВТ_ДокументыОРП
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	|ГДЕ
	|	&ПлательщикНДС
	|	И ОтчетОРозничныхПродажах.Дата МЕЖДУ &НачалоПериода И &КонецПериодаДата
	|	И ОтчетОРозничныхПродажах.Организация В(&Организации)
	|	И ОтчетОРозничныхПродажах.Проведен
	|	И ОтчетОРозничныхПродажах.СчетКасса В(&СчетаДенег)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотокиКонтрагентов.Организация КАК Организация,
	|	ПотокиКонтрагентов.Счет КАК Счет,
	|	ПотокиКонтрагентов.Статья КАК Статья,
	|	СУММА(ВЫБОР
	|			КОГДА ПотокиКонтрагентов.АгентПокупателя <> 0
	|				ТОГДА ПотокиКонтрагентов.АгентПокупателя - ПотокиКонтрагентов.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ * ПотокиКонтрагентов.ПересчетВалюты) КАК АгентПокупателя,
	|	СУММА(ВЫБОР
	|			КОГДА ПотокиКонтрагентов.АгентПродавца <> 0
	|				ТОГДА ПотокиКонтрагентов.АгентПродавца - ПотокиКонтрагентов.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ * ПотокиКонтрагентов.ПересчетВалюты) КАК АгентПродавца,
	|	СУММА(ПотокиКонтрагентов.НДС * ПотокиКонтрагентов.ПересчетВалюты) КАК НДС
	|ПОМЕСТИТЬ ВТ_ДенежныеПотокиКонтрагентовДенормализованная
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПоступленияБезналичные.Ссылка.Организация КАК Организация,
	|		ПоступленияБезналичные.Ссылка.СчетБанк КАК Счет,
	|		ПоступленияБезналичные.СтатьяДвиженияДенежныхСредств КАК Статья,
	|		ВЫБОР
	|			КОГДА ПоступленияБезналичные.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку)
	|					И ПоступленияБезналичные.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя)
	|					И НЕ ПоступленияБезналичные.СчетУчетаРасчетовСКонтрагентом В (&СчетаВознагражденияАгентаПокупателя)
	|				ТОГДА ПоступленияБезналичные.СуммаПлатежа
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК АгентПокупателя,
	|		0 КАК АгентПродавца,
	|		ВЫБОР
	|			КОГДА &ПлательщикНДС
	|				ТОГДА ПоступленияБезналичные.СуммаНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК НДС,
	|		ВЫБОР
	|			КОГДА ПоступленияБезналичные.Ссылка.ВалютаДокумента = &ВалютаУчета
	|					ИЛИ ПоступленияБезналичные.КратностьВзаиморасчетов = 0
	|				ТОГДА 1
	|			ИНАЧЕ ПоступленияБезналичные.КурсВзаиморасчетов / ПоступленияБезналичные.КратностьВзаиморасчетов
	|		КОНЕЦ КАК ПересчетВалюты
	|	ИЗ
	|		Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступленияБезналичные
	|	ГДЕ
	|		ПоступленияБезналичные.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериодаДата
	|		И ПоступленияБезналичные.Ссылка.Организация В(&Организации)
	|		И ПоступленияБезналичные.Ссылка.Проведен
	|		И ПоступленияБезналичные.Ссылка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ВозвратОтПоставщика))
	|		И ПоступленияБезналичные.Ссылка.СчетБанк В(&СчетаДенег)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Отбор.Организация,
	|		Отбор.Счет,
	|		ПоступленияНаличные.СтатьяДвиженияДенежныхСредств,
	|		ВЫБОР
	|			КОГДА ПоступленияНаличные.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку)
	|					И Отбор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ОплатаПокупателя)
	|					И НЕ ПоступленияНаличные.СчетУчетаРасчетовСКонтрагентом В (&СчетаВознагражденияАгентаПокупателя)
	|				ТОГДА ПоступленияНаличные.СуммаПлатежа
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0,
	|		ВЫБОР
	|			КОГДА &ПлательщикНДС
	|				ТОГДА ПоступленияНаличные.СуммаНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА Отбор.ВалютаДокумента = &ВалютаУчета
	|					ИЛИ ПоступленияНаличные.КратностьВзаиморасчетов = 0
	|				ТОГДА 1
	|			ИНАЧЕ ПоступленияНаличные.КурсВзаиморасчетов / ПоступленияНаличные.КратностьВзаиморасчетов
	|		КОНЕЦ
	|	ИЗ
	|		Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПоступленияНаличные
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДокументыПКО КАК Отбор
	|			ПО ПоступленияНаличные.Ссылка = Отбор.Ссылка
	|				И (НЕ Отбор.ЭтоРозница)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Отбор.Организация,
	|		Отбор.Счет,
	|		ПоступленияРозницаСводно.СтатьяДвиженияДенежныхСредств,
	|		0,
	|		0,
	|		ПоступленияРозницаСводно.СуммаНДС,
	|		ВЫБОР
	|			КОГДА Отбор.ВалютаДокумента = &ВалютаУчета
	|					ИЛИ ПоступленияРозницаСводно.КратностьВзаиморасчетов = 0
	|				ТОГДА 1
	|			ИНАЧЕ ПоступленияРозницаСводно.КурсВзаиморасчетов / ПоступленияРозницаСводно.КратностьВзаиморасчетов
	|		КОНЕЦ
	|	ИЗ
	|		Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПоступленияРозницаСводно
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДокументыПКО КАК Отбор
	|			ПО ПоступленияРозницаСводно.Ссылка = Отбор.Ссылка
	|				И (Отбор.СводныйУчетРозницы)
	|				И (Отбор.ЭтоРозница)
	|	ГДЕ
	|		&ПлательщикНДС
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоступленияРозницаПлатежныеКарты.Ссылка.Организация,
	|		ПоступленияРозницаПлатежныеКарты.Ссылка.СчетКасса,
	|		ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка),
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА ПоступленияРозницаПлатежныеКарты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаПлатежнойКартой.ВозвратПокупателю)
	|				ТОГДА -ПоступленияРозницаПлатежныеКарты.СуммаНДС
	|			ИНАЧЕ ПоступленияРозницаПлатежныеКарты.СуммаНДС
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ПоступленияРозницаПлатежныеКарты.Ссылка.ВалютаДокумента = &ВалютаУчета
	|					ИЛИ ПоступленияРозницаПлатежныеКарты.КратностьВзаиморасчетов = 0
	|				ТОГДА 1
	|			ИНАЧЕ ПоступленияРозницаПлатежныеКарты.КурсВзаиморасчетов / ПоступленияРозницаПлатежныеКарты.КратностьВзаиморасчетов
	|		КОНЕЦ
	|	ИЗ
	|		Документ.ОплатаПлатежнойКартой.РасшифровкаПлатежа КАК ПоступленияРозницаПлатежныеКарты
	|	ГДЕ
	|		ПоступленияРозницаПлатежныеКарты.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериодаДата
	|		И ПоступленияРозницаПлатежныеКарты.Ссылка.Организация В(&Организации)
	|		И ПоступленияРозницаПлатежныеКарты.Ссылка.Проведен
	|		И ПоступленияРозницаПлатежныеКарты.Ссылка.СчетКасса В(&СчетаДенег)
	|		И &ПлательщикНДС
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Отбор.Организация,
	|		Отбор.Счет,
	|		Отбор.Статья,
	|		0,
	|		0,
	|		ПоступленияРозницаТовары.СуммаНДС,
	|		1
	|	ИЗ
	|		Документ.ОтчетОРозничныхПродажах.Товары КАК ПоступленияРозницаТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДокументыОРП КАК Отбор
	|			ПО ПоступленияРозницаТовары.Ссылка = Отбор.Ссылка
	|				И (НЕ Отбор.СводныйУчетРозницы)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Отбор.Организация,
	|		Отбор.Счет,
	|		Отбор.Статья,
	|		0,
	|		0,
	|		ПоступленияРозницаАгент.СуммаНДС,
	|		1
	|	ИЗ
	|		Документ.ОтчетОРозничныхПродажах.АгентскиеУслуги КАК ПоступленияРозницаАгент
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДокументыОРП КАК Отбор
	|			ПО ПоступленияРозницаАгент.Ссылка = Отбор.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПлатежиБезналичные.Ссылка.Организация,
	|		ПлатежиБезналичные.Ссылка.СчетБанк,
	|		ПлатежиБезналичные.СтатьяДвиженияДенежныхСредств,
	|		0,
	|		ВЫБОР
	|			КОГДА ПлатежиБезналичные.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику)
	|					И ПлатежиБезналичные.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомитентом)
	|				ТОГДА -ПлатежиБезналичные.СуммаПлатежа
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &ВычетНДС
	|				ТОГДА -ПлатежиБезналичные.СуммаНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ПлатежиБезналичные.Ссылка.ВалютаДокумента = &ВалютаУчета
	|					ИЛИ ПлатежиБезналичные.КратностьВзаиморасчетов = 0
	|				ТОГДА 1
	|			ИНАЧЕ ПлатежиБезналичные.КурсВзаиморасчетов / ПлатежиБезналичные.КратностьВзаиморасчетов
	|		КОНЕЦ
	|	ИЗ
	|		Документ.СписаниеСРасчетногоСчета.РасшифровкаПлатежа КАК ПлатежиБезналичные
	|	ГДЕ
	|		ПлатежиБезналичные.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериодаДата
	|		И ПлатежиБезналичные.Ссылка.Организация В(&Организации)
	|		И ПлатежиБезналичные.Ссылка.Проведен
	|		И ПлатежиБезналичные.Ссылка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю))
	|		И ПлатежиБезналичные.Ссылка.СчетБанк В(&СчетаДенег)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПлатежиНаличные.Ссылка.Организация,
	|		ПлатежиНаличные.Ссылка.СчетКасса,
	|		ПлатежиНаличные.СтатьяДвиженияДенежныхСредств,
	|		0,
	|		ВЫБОР
	|			КОГДА ПлатежиНаличные.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомитентом)
	|					И ПлатежиНаличные.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ОплатаПоставщику)
	|				ТОГДА -ПлатежиНаличные.СуммаПлатежа
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &ВычетНДС
	|				ТОГДА -ПлатежиНаличные.СуммаНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ПлатежиНаличные.Ссылка.ВалютаДокумента = &ВалютаУчета
	|					ИЛИ ПлатежиНаличные.КратностьВзаиморасчетов = 0
	|				ТОГДА 1
	|			ИНАЧЕ ПлатежиНаличные.КурсВзаиморасчетов / ПлатежиНаличные.КратностьВзаиморасчетов
	|		КОНЕЦ
	|	ИЗ
	|		Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПлатежиНаличные
	|	ГДЕ
	|		ПлатежиНаличные.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериодаДата
	|		И ПлатежиНаличные.Ссылка.Организация В(&Организации)
	|		И ПлатежиНаличные.Ссылка.Проведен
	|		И ПлатежиНаличные.Ссылка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ОплатаПоставщику), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ВозвратПокупателю))
	|		И ПлатежиНаличные.Ссылка.СчетКасса В(&СчетаДенег)) КАК ПотокиКонтрагентов
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотокиКонтрагентов.Организация,
	|	ПотокиКонтрагентов.Счет,
	|	ПотокиКонтрагентов.Статья
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""НДС"" КАК Вид,
	|	Потоки.Организация КАК Организация,
	|	Потоки.Счет КАК Счет,
	|	Потоки.Статья КАК Статья,
	|	Потоки.НДС КАК Сумма
	|ПОМЕСТИТЬ ДенежныеПотокиКонтрагентов
	|ИЗ
	|	ВТ_ДенежныеПотокиКонтрагентовДенормализованная КАК Потоки
	|ГДЕ
	|	Потоки.НДС <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""АгентПокупателя"",
	|	Потоки.Организация,
	|	Потоки.Счет,
	|	Потоки.Статья,
	|	Потоки.АгентПокупателя
	|ИЗ
	|	ВТ_ДенежныеПотокиКонтрагентовДенормализованная КАК Потоки
	|ГДЕ
	|	Потоки.АгентПокупателя <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""АгентПродавца"",
	|	Потоки.Организация,
	|	Потоки.Счет,
	|	Потоки.Статья,
	|	Потоки.АгентПродавца
	|ИЗ
	|	ВТ_ДенежныеПотокиКонтрагентовДенормализованная КАК Потоки
	|ГДЕ
	|	Потоки.АгентПродавца <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Статья
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ДокументыПКО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ДокументыОРП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ДенежныеПотокиКонтрагентовДенормализованная";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ПлательщикНДС(Период, Организация)
	Возврат УчетнаяПолитика.ПлательщикНДС(Организация, Период) Или УчетнаяПолитика.ПлательщикНДСПрименяющийУСН(Организация, Период);
КонецФункции

Функция ВозможенВычетНДС(Период, Организация)
	Возврат УчетнаяПолитика.ПлательщикНДС(Организация, Период) Или УчетнаяПолитика.ПлательщикНДСнаУСНСВычетами(Организация, Период);
КонецФункции

Функция СчетаВознагражденияАгентаПокупателя()
	
	СчетаРасчетовСПокупателями = Новый Массив;
	СчетаРасчетовСПокупателями.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками); // 62
	СчетаРасчетовСПокупателями.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчиками); // 76.06
	СчетаРасчетовСПокупателями.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчикамиВал); // 76.26
	СчетаРасчетовСПокупателями.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчикамиУЕ); // 76.36
	Возврат СчетаРасчетовСПокупателями;

КонецФункции

Процедура СоздатьДенежныеПотокиОбменВалют(Процессор)
	
	// Потери и выгоды в результате обмена валют ПБУ 23 предписывает отражать свернуто:
	// 17. Денежные потоки отражаются в отчете о движении денежных средств свернуто в случаях,
	// когда они отличаются быстрым оборотом, большими суммами и короткими сроками возврата
	//
	// Часть таких потоков можно идентифицировать по использованию специальных субсчетов счета 57.
	// Другую часть - только по аналитике счета расходов (так называемую "продажу валюты",
	// в этом случае на счете доходов отражается полученная от обмена сумма рублей).
	//
	// Также п. 6 стандарта отмечает, что 
	// "Денежными потоками организации не являются:
	// в) валютно-обменные операции (за исключением потерь или выгод от операции)".
	// Это требование выполняется "автоматически", за счет того, что исключаются внутренние обороты между счетами денег.
	
	Процессор.ДанныеАлгоритма.Вставить(
		"СтатьяДоходовОбменВалют",
		ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПрочиеДоходыИРасходы.ДоходыРасходыПриПродажеПокупкеВалюты"));
	Процессор.ДанныеАлгоритма.Счета.Вставить(
		"ДоходыОбменВалют",
		БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ПрочиеДоходы));
	
	ДеньгиДетальноБезОбменВалют = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		Процессор.ДанныеАлгоритма.Счета.ДеньгиДетально,
		Процессор.ДанныеАлгоритма.Счета.ДеньгиОбменВалют);
	
	ДеньгиСводноБезОбменВалют = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		Процессор.ДанныеАлгоритма.Счета.ДеньгиСводно,
		Процессор.ДанныеАлгоритма.Счета.ДеньгиОбменВалют);
		
	Запрос = НачатьЗапрос(Процессор);
	Запрос.УстановитьПараметр("СчетаУчетаОбменВалют", Процессор.ДанныеАлгоритма.Счета.ДеньгиОбменВалют);
	Запрос.УстановитьПараметр("СчетаДенегДетально",   ДеньгиДетальноБезОбменВалют);
	Запрос.УстановитьПараметр("СчетаДенегСводно",     ДеньгиСводноБезОбменВалют);
	Запрос.УстановитьПараметр("СчетаДоходов",         Процессор.ДанныеАлгоритма.Счета.ДоходыОбменВалют);
	Запрос.УстановитьПараметр("СтатьяДоходов",        Процессор.ДанныеАлгоритма.СтатьяДоходовОбменВалют);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Потоки.Организация КАК Организация,
	|	Потоки.Счет КАК Счет,
	|	Потоки.Статья КАК Статья,
	|	Потоки.Сумма КАК Сумма
	|ПОМЕСТИТЬ ДенежныеПотокиОбменВалют
	|ИЗ
	|	ДенежныеПотоки КАК Потоки
	|ГДЕ
	|	Потоки.Счет В(&СчетаУчетаОбменВалют)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УчетПоСтатьям.Организация,
	|	УчетПоСтатьям.Счет,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(УчетПоСтатьям.Субконто1 КАК Справочник.СтатьиДвиженияДенежныхСредств), ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)),
	|	УчетПоСтатьям.СуммаОборот
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В (&СчетаДенегДетально),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДвиженияДенежныхСредств),
	|			Организация В (&Организации)
	|				И КорСубконто1 = &СтатьяДоходов,
	|			КорСчет В (&СчетаДоходов),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы)) КАК УчетПоСтатьям
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УчетБезСтатей.Организация,
	|	УчетБезСтатей.Счет,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка),
	|	УчетБезСтатей.СуммаОборот
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В (&СчетаДенегСводно),
	|			,
	|			Организация В (&Организации)
	|				И КорСубконто1 = &СтатьяДоходов,
	|			КорСчет В (&СчетаДоходов),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы)) КАК УчетБезСтатей
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Статья";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьДенежныеПотокиКурсовыеРазницы(Процессор)
	
	// П. 19 ПБУ 23: Разница, возникающая в связи с пересчетом денежных потоков организации и остатков
	// денежных средств и денежных эквивалентов в иностранной валюте по курсам на разные даты,
	// отражается в отчете о движении денежных средств отдельно от текущих, инвестиционных и финансовых денежных потоков организации
	// как влияние изменений курса иностранной валюты по отношению к рублю.
	
	Процессор.ДанныеАлгоритма.Вставить("ВидДоходовРасходовКурсовыеРазницы", Перечисления.ВидыПрочихДоходовИРасходов.КурсовыеРазницы);
	СчетаДоходыРасходы = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		СчетаДоходыРасходы,
		БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ПрочиеДоходы));
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		СчетаДоходыРасходы,
		БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ПрочиеРасходы));
	
	Запрос = НачатьЗапрос(Процессор);
	Запрос.УстановитьПараметр("СчетаУчетаОбменВалют", Процессор.ДанныеАлгоритма.Счета.ДеньгиОбменВалют);
	Запрос.УстановитьПараметр("СчетаДенегДетально",   Процессор.ДанныеАлгоритма.Счета.ДеньгиДетально);
	Запрос.УстановитьПараметр("СчетаДенегСводно",     Процессор.ДанныеАлгоритма.Счета.ДеньгиСводно);
	Запрос.УстановитьПараметр("СчетаДоходыРасходы",   СчетаДоходыРасходы);
	Запрос.УстановитьПараметр("ВидКурсовыеРазницы",   Процессор.ДанныеАлгоритма.ВидДоходовРасходовКурсовыеРазницы);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрочиеДоходыИРасходы.Ссылка КАК Статья
	|ПОМЕСТИТЬ ВТ_СтатьиКурсовыеРазницы
	|ИЗ
	|	Справочник.ПрочиеДоходыИРасходы КАК ПрочиеДоходыИРасходы
	|ГДЕ
	|	ПрочиеДоходыИРасходы.ВидПрочихДоходовИРасходов = &ВидКурсовыеРазницы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Статья
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетПоСтатьям.Организация КАК Организация,
	|	УчетПоСтатьям.Счет КАК Счет,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(УчетПоСтатьям.Субконто1 КАК Справочник.СтатьиДвиженияДенежныхСредств), ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) КАК Статья,
	|	УчетПоСтатьям.СуммаОборот КАК Сумма
	|ПОМЕСТИТЬ ДенежныеПотокиКурсовыеРазницы
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В (&СчетаДенегДетально),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДвиженияДенежныхСредств),
	|			Организация В (&Организации)
	|				И КорСубконто1 В
	|					(ВЫБРАТЬ
	|						Статьи.Статья
	|					ИЗ
	|						ВТ_СтатьиКурсовыеРазницы КАК Статьи),
	|			КорСчет В (&СчетаДоходыРасходы),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы)) КАК УчетПоСтатьям
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УчетБезСтатей.Организация,
	|	УчетБезСтатей.Счет,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка),
	|	УчетБезСтатей.СуммаОборот
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В (&СчетаДенегСводно),
	|			,
	|			Организация В (&Организации)
	|				И КорСубконто1 В
	|					(ВЫБРАТЬ
	|						Статьи.Статья
	|					ИЗ
	|						ВТ_СтатьиКурсовыеРазницы КАК Статьи),
	|			КорСчет В (&СчетаДоходыРасходы),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы)) КАК УчетБезСтатей
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Статья
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СтатьиКурсовыеРазницы";

	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьКорректировкиДенежныхПотоков(Процессор)
	
	СоздатьДенежныеПотокиКонтрагентов(Процессор);
	СоздатьДенежныеПотокиОбменВалют(Процессор);
	СоздатьДенежныеПотокиКурсовыеРазницы(Процессор);
	
	КорректировочныеПоказатели = КорректировочныеПоказателиДенежныхПотоков(Процессор.ЗаполняемыеПоказатели);
	
	Процессор.ДанныеАлгоритма.Вставить("ПоказательЕдиныйНалоговыйПлатежБезРаспределения", -1);
	РаспределятьЕдиныйНалоговыйПлатеж = Ложь;
	
	ПоказательЕдиныйНалоговыйПлатеж = НайтиКорректировочныйПоказательДенежныхПотоков(
		КорректировочныеПоказатели,
		"ЕдиныйНалоговыйПлатеж",
		"РаспределениеИсточник");
	
	Если ПоказательЕдиныйНалоговыйПлатеж <> Неопределено Тогда
		РаспределятьЕдиныйНалоговыйПлатеж = Истина;
	Иначе
		ПоказательЕдиныйНалоговыйПлатеж = НайтиПоказательЕдиныйНалоговыйПлатеж(Процессор.ЗаполняемыеПоказатели);
		Процессор.ДанныеАлгоритма.ПоказательЕдиныйНалоговыйПлатежБезРаспределения = ПоказательЕдиныйНалоговыйПлатеж;
	КонецЕсли;
	
	ПоказательНДС = НайтиКорректировочныйПоказательДенежныхПотоков(
		КорректировочныеПоказатели,
		"НДС",
		"Сворачивание");
	
	СоздатьДенежныеПотокиЕдиныйНалоговыйПлатеж(Процессор, РаспределятьЕдиныйНалоговыйПлатеж, ПоказательНДС);
	
	Процессор.ДанныеАлгоритма.Вставить(
		"ПредставленияСсылокПоказателей",
		ПредставленияСсылокПоказателей(КорректировочныеПоказатели, Процессор.ЗаполняемыеПоказатели, Процессор.КодЯзыка));
	
	СворачиваемыеПоказатели = СворачиваемыеПоказатели(Процессор.ЗаполняемыеПоказатели);
	
	// Кроме корректировок денежных потоков внутри одного вида корректировки,
	// выполняется межвидовая корректировка - перенос НДС из ЕдиныйНалоговыйПлатеж в НДС.
	// Знак суммы должен быть со стороны корректируемого показателя - и для переноса НДС знак меняется,
	// так как выбираются данные из ЕдиныйНалоговыйПлатеж, а корректируется НДС.
	
	Запрос = НачатьЗапрос(Процессор);
	Запрос.УстановитьПараметр("КорректировочныеПоказатели", КорректировочныеПоказатели);
	Запрос.УстановитьПараметр("КорректировочныйПоказательЕдиныйНалоговыйПлатеж", ПоказательЕдиныйНалоговыйПлатеж);
	Запрос.УстановитьПараметр("КорректировочныйПоказательНДС", ПоказательНДС);
	Запрос.УстановитьПараметр("СворачиваемыеПоказатели", СворачиваемыеПоказатели);
	// По общему правилу основной показатель может идентифицироваться в запросе ДанныеУчета как Null,
	// но в условиях соединений с временными таблицами может быть удобнее избавиться от Null
	Запрос.УстановитьПараметр("ОсновнойПоказатель", Процессор.ОсновнойПоказатель);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КорректировочныеПоказатели.Вид КАК Вид,
	|	КорректировочныеПоказатели.Направление КАК Направление,
	|	КорректировочныеПоказатели.Показатель КАК Показатель
	|ПОМЕСТИТЬ ВТ_КорректировочныеПоказатели
	|ИЗ
	|	&КорректировочныеПоказатели КАК КорректировочныеПоказатели
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Вид,
	|	Направление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СворачиваемыеПоказатели.Вид КАК Вид,
	|	СворачиваемыеПоказатели.Показатель КАК Показатель
	|ПОМЕСТИТЬ ВТ_СворачиваемыеПоказатели
	|ИЗ
	|	&СворачиваемыеПоказатели КАК СворачиваемыеПоказатели
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Вид,
	|	Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СчетаБезСтатей.Показатель, Статьи.Показатель) КАК ПоказательИсточник,
	|	ЕСТЬNULL(ЕСТЬNULL(СчетаБезСтатей.Показатель, Статьи.Показатель), &ОсновнойПоказатель) КАК ПоказательИсточникСворачиваемыеПоказатели,
	|	КорректировочныеПоказатели.Показатель КАК ПоказательПриемник,
	|	Корректировки.Вид КАК Вид,
	|	Корректировки.Организация КАК Организация,
	|	Корректировки.Счет КАК Счет,
	|	Корректировки.Статья КАК Статья,
	|	Корректировки.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_КорректировкиДенежныхПотоковКонтрагентов
	|ИЗ
	|	ДенежныеПотокиКонтрагентов КАК Корректировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Статьи КАК Статьи
	|		ПО Корректировки.Статья = Статьи.Статья
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаБезСтатей КАК СчетаБезСтатей
	|		ПО Корректировки.Счет = СчетаБезСтатей.Счет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КорректировочныеПоказатели КАК КорректировочныеПоказатели
	|		ПО Корректировки.Вид = КорректировочныеПоказатели.Вид
	|			И (КорректировочныеПоказатели.Направление = ""Сворачивание"")
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Вид,
	|	ПоказательИсточникСворачиваемыеПоказатели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Корректировки.ПоказательИсточник КАК ПоказательИсточник,
	|	Корректировки.ПоказательПриемник КАК ПоказательПриемник,
	|	Корректировки.Вид КАК Вид,
	|	Корректировки.Организация КАК Организация,
	|	Корректировки.Счет КАК Счет,
	|	Корректировки.Статья КАК Статья,
	|	ЗНАЧЕНИЕ(Справочник.ВидыНалоговИПлатежейВБюджет.ПустаяСсылка) КАК Налог,
	|	"""" КАК ОперацияНалога,
	|	Корректировки.Сумма КАК Сумма
	|ПОМЕСТИТЬ КорректировкиДенежныхПотоков
	|ИЗ
	|	ВТ_КорректировкиДенежныхПотоковКонтрагентов КАК Корректировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СворачиваемыеПоказатели КАК СворачиваемыеПоказатели
	|		ПО Корректировки.Вид = СворачиваемыеПоказатели.Вид
	|			И Корректировки.ПоказательИсточникСворачиваемыеПоказатели = СворачиваемыеПоказатели.Показатель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&КорректировочныйПоказательЕдиныйНалоговыйПлатеж,
	|	&КорректировочныйПоказательНДС,
	|	""НДС"",
	|	ПлатежНДС.Организация,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка),
	|	ПлатежНДС.Налог,
	|	ПлатежНДС.ОперацияНалога,
	|	ПлатежНДС.Сумма
	|ИЗ
	|	ДенежныеПотокиЕдиныйНалоговыйПлатеж КАК ПлатежНДС
	|ГДЕ
	|	НЕ ПлатежНДС.ВременныйУчет
	|	И ПлатежНДС.ВидНалога = ЗНАЧЕНИЕ(Перечисление.ВидыНалогов.НДС)
	|	И &КорректировочныйПоказательНДС <> НЕОПРЕДЕЛЕНО
	|	И &КорректировочныйПоказательЕдиныйНалоговыйПлатеж <> НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&КорректировочныйПоказательЕдиныйНалоговыйПлатеж,
	|	Корректировки.Показатель,
	|	КорректировочныеПоказатели.Вид,
	|	Корректировки.Организация,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка),
	|	Корректировки.Налог,
	|	Корректировки.ОперацияНалога,
	|	Корректировки.Сумма
	|ИЗ
	|	ДенежныеПотокиЕдиныйНалоговыйПлатеж КАК Корректировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КорректировочныеПоказатели КАК КорректировочныеПоказатели
	|		ПО (КорректировочныеПоказатели.Показатель = &КорректировочныйПоказательЕдиныйНалоговыйПлатеж)
	|ГДЕ
	|	НЕ Корректировки.ВременныйУчет
	|	И Корректировки.ВидНалога <> ЗНАЧЕНИЕ(Перечисление.ВидыНалогов.НДС)
	|	И &КорректировочныйПоказательЕдиныйНалоговыйПлатеж <> НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременныйУчетЕдиногоНалоговогоПлатежа.Показатель,
	|	&КорректировочныйПоказательЕдиныйНалоговыйПлатеж,
	|	""ВременныйУчетЕдиногоНалоговогоПлатежа"",
	|	ВременныйУчетЕдиногоНалоговогоПлатежа.Организация,
	|	ВременныйУчетЕдиногоНалоговогоПлатежа.Счет,
	|	ВременныйУчетЕдиногоНалоговогоПлатежа.Статья,
	|	ЗНАЧЕНИЕ(Справочник.ВидыНалоговИПлатежейВБюджет.ПустаяСсылка),
	|	"""",
	|	ВременныйУчетЕдиногоНалоговогоПлатежа.Сумма
	|ИЗ
	|	ДенежныеПотокиЕдиныйНалоговыйПлатеж КАК ВременныйУчетЕдиногоНалоговогоПлатежа
	|ГДЕ
	|	ВременныйУчетЕдиногоНалоговогоПлатежа.ВременныйУчет
	|	И &КорректировочныйПоказательЕдиныйНалоговыйПлатеж <> НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СчетаБезСтатей.Показатель, Статьи.Показатель),
	|	КорректировочныеПоказатели.Показатель,
	|	КорректировочныеПоказатели.Вид,
	|	Корректировки.Организация,
	|	Корректировки.Счет,
	|	Корректировки.Статья,
	|	ЗНАЧЕНИЕ(Справочник.ВидыНалоговИПлатежейВБюджет.ПустаяСсылка),
	|	"""",
	|	Корректировки.Сумма
	|ИЗ
	|	ДенежныеПотокиОбменВалют КАК Корректировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Статьи КАК Статьи
	|		ПО Корректировки.Статья = Статьи.Статья
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаБезСтатей КАК СчетаБезСтатей
	|		ПО Корректировки.Счет = СчетаБезСтатей.Счет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КорректировочныеПоказатели КАК КорректировочныеПоказатели
	|		ПО (КорректировочныеПоказатели.Вид = ""ОбменВалют"")
	|			И (КорректировочныеПоказатели.Направление = ""Сворачивание"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СчетаБезСтатей.Показатель, Статьи.Показатель),
	|	КорректировочныеПоказатели.Показатель,
	|	КорректировочныеПоказатели.Вид,
	|	Корректировки.Организация,
	|	Корректировки.Счет,
	|	Корректировки.Статья,
	|	ЗНАЧЕНИЕ(Справочник.ВидыНалоговИПлатежейВБюджет.ПустаяСсылка),
	|	"""",
	|	Корректировки.Сумма
	|ИЗ
	|	ДенежныеПотокиКурсовыеРазницы КАК Корректировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Статьи КАК Статьи
	|		ПО Корректировки.Статья = Статьи.Статья
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаБезСтатей КАК СчетаБезСтатей
	|		ПО Корректировки.Счет = СчетаБезСтатей.Счет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КорректировочныеПоказатели КАК КорректировочныеПоказатели
	|		ПО (КорректировочныеПоказатели.Вид = ""КурсовыеРазницы"")
	|			И (КорректировочныеПоказатели.Направление = ""Сворачивание"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_КорректировочныеПоказатели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СворачиваемыеПоказатели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_КорректировкиДенежныхПотоковКонтрагентов";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ТипИмя()
	СтандартнаяДлинаИмени = 255;
	Возврат ОбщегоНазначения.ОписаниеТипаСтрока(СтандартнаяДлинаИмени);
КонецФункции

Функция НовыйКорректировочныеПоказатели()
	
	ТипИмя = ТипИмя();
	
	КорректировочныеПоказатели = Новый ТаблицаЗначений;
	КорректировочныеПоказатели.Колонки.Добавить("Вид", ТипИмя);
	КорректировочныеПоказатели.Колонки.Добавить("Направление", ТипИмя); // Сворачивание, РаспределениеПриемник, РаспределениеИсточник
	КорректировочныеПоказатели.Колонки.Добавить("Показатель", Новый ОписаниеТипов("Число"));
	
	Возврат КорректировочныеПоказатели;
	
КонецФункции

Функция КорректировочныеПоказателиДенежныхПотоков(ЗаполняемыеПоказатели)
	
	КорректировочныеПоказатели = НовыйКорректировочныеПоказатели();
	
	Для Каждого ОписаниеПоказателя Из ЗаполняемыеПоказатели.Показатели Цикл
		
		Если ОписаниеПоказателя.Заполнение.Идентификатор <> ИдентификаторАлгоритмаДенежныеПотоки() Тогда
			Продолжить;
		КонецЕсли;
		
		Вид         = Неопределено;
		Направление = Неопределено;
		
		Если ОписаниеПоказателя.Заполнение.Отбор.Свойство("Свернутый") Тогда
			
			Вид         = ОписаниеПоказателя.Заполнение.Отбор.Свернутый;
			Направление = "Сворачивание";
			
		ИначеЕсли ОписаниеПоказателя.Заполнение.Отбор.Свойство("РаспределениеПриемник") Тогда
			Вид         = ОписаниеПоказателя.Заполнение.Отбор.РаспределениеПриемник.Ключ;
			Направление = "РаспределениеПриемник";
		ИначеЕсли ОписаниеПоказателя.Заполнение.Отбор.Свойство("РаспределениеИсточник") Тогда
			Вид         = ОписаниеПоказателя.Заполнение.Отбор.РаспределениеИсточник;
			Направление = "РаспределениеИсточник";
		КонецЕсли;
		
		Если Вид <> Неопределено Тогда
			
			Корректировка = КорректировочныеПоказатели.Добавить();
			Корректировка.Вид         = Вид;
			Корректировка.Направление = Направление;
			Корректировка.Показатель  = БухгалтерскаяОтчетностьБРО.ИдентификаторПоказателя(ОписаниеПоказателя);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КорректировочныеПоказатели;
	
КонецФункции

Функция НовыйСворачиваемыеПоказатели()
	
	СворачиваемыеПоказатели = Новый ТаблицаЗначений;
	СворачиваемыеПоказатели.Колонки.Добавить("Вид", ТипИмя());
	СворачиваемыеПоказатели.Колонки.Добавить("Показатель", Новый ОписаниеТипов("Число"));
	
	Возврат СворачиваемыеПоказатели;
	
КонецФункции

Функция СворачиваемыеПоказатели(ЗаполняемыеПоказатели)
	
	СворачиваемыеПоказатели = НовыйСворачиваемыеПоказатели();
	
	Для Каждого ОписаниеПоказателя Из ЗаполняемыеПоказатели.Показатели Цикл
		
		Если ОписаниеПоказателя.Заполнение.Идентификатор <> ИдентификаторАлгоритмаДенежныеПотоки() Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СворачиваемыйПоток Из ОписаниеПоказателя.Заполнение.НастройкиАлгоритма.Сворачиваемые Цикл
			
			ИмяСворачиваемогоПотока = СворачиваемыйПоток.Ключ;
			
			ОписаниеСворачиваемогоПоказателя = СворачиваемыеПоказатели.Добавить();
			ОписаниеСворачиваемогоПоказателя.Показатель = БухгалтерскаяОтчетностьБРО.ИдентификаторПоказателя(ОписаниеПоказателя);;
			ОписаниеСворачиваемогоПоказателя.Вид = ИмяСворачиваемогоПотока;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат СворачиваемыеПоказатели;
	
КонецФункции

Функция НайтиКорректировочныйПоказательДенежныхПотоков(КорректировочныеПоказатели, ВидКорректировки, НаправлениеКорректировки)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Вид", ВидКорректировки);
	Отбор.Вставить("Направление", НаправлениеКорректировки);
	
	Поиск = КорректировочныеПоказатели.НайтиСтроки(Отбор);
	Если Не ЗначениеЗаполнено(Поиск) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Поиск[0].Показатель;
	
КонецФункции

Функция НайтиПоказательДенежныхПотоковПоВидуСтатьи(ВидСтатьи, ЗаполняемыеПоказатели)
	
	Для Каждого Показатель Из ЗаполняемыеПоказатели.Показатели Цикл
		
		Если Показатель.Заполнение.Идентификатор <> ИдентификаторАлгоритмаДенежныеПотоки() Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не Показатель.Заполнение.Отбор.Свойство("ВидСтатьи") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Показатель.Заполнение.Отбор.ВидСтатьи.Найти(ВидСтатьи) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Возврат БухгалтерскаяОтчетностьБРО.ИдентификаторПоказателя(Показатель);
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#Область ПотокиЕдиногоНалоговогоСчета

// Реализует Рекомендацию БМЦ Р-175.
// Поток в виде единого налогового платежа может отражаться
// - общей суммой (п. 2 Рекомендации)
// - раздельно по видам налогов - распределяться между показателями на основе данных из ФНС (п. 3 Рекомендации).

Функция РаспределятьЕдиныйНалоговыйПлатеж(Контекст)
	
	Если Не ЗначениеЗаполнено(Контекст.Организация) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат УчетнаяПолитика.РаспределятьЕдиныйНалоговыйПлатеж(Контекст.Период, Контекст.Организация);
	
КонецФункции

Процедура ДобавитьГруппуОтрицательныхЗначенийЕдиныйНалоговыйПлатеж(Процессор, КодСтроки, НаименованиеГруппы, ПоказательЕдиныйНалоговыйПлатеж)
	
	// В соответствии с п. 2 Рекомендации БМЦ Р-175 в ОДДС отражается общая сумма единого налогового платежа отдельным показателем.
	// В частном случае чистое значение такого потока может оказаться положительным - и тогда его следует отразить как поступление.
	// Как правило, показатели, отражаемые в ОДДС в поступлениях или в платежах в зависимости от знака,
	// входят в группы Прочие поступления/Прочие платежи.
	// Показатель ЕНП - исключение, он должен входить в обособленную группу, поэтому группу отрицательных значений определяем отдельно от других.
	
	ДобавитьГруппу(Процессор, КодСтроки, НаименованиеГруппы);
	ДобавитьПоказательОтрицательногоЗначения(Процессор, ПоказательЕдиныйНалоговыйПлатеж);
	
КонецПроцедуры

Процедура ДобавитьПоказательРаспределенныйЕдиныйНалоговыйПлатеж(Процессор, ОтборНалогов, Наименование)
	
	ДобавитьПоказательРаспределенногоДенежногоПотока(
		Процессор,
		Перечисления.ВидыДвиженийДенежныхСредств.ЕдиныйНалоговыйПлатеж,
		ОтборНалогов,
		Наименование);
	
КонецПроцедуры

Функция НайтиПоказательЕдиныйНалоговыйПлатеж(ЗаполняемыеПоказатели)
	
	Возврат НайтиПоказательДенежныхПотоковПоВидуСтатьи(
		Перечисления.ВидыДвиженийДенежныхСредств.ЕдиныйНалоговыйПлатеж,
		ЗаполняемыеПоказатели);
	
КонецФункции

Функция НалоговыеПлатежиНДФЛ(КодыВидовДохода)
	
	Налоги = Новый Массив;
	Для Каждого Код Из КодыВидовДохода Цикл
		
		Налог = Справочники.ВидыНалоговИПлатежейВБюджет.НалогПоВиду(Перечисления.ВидыНалогов.НДФЛ, Ложь, , Код, Ложь);
		Если ЗначениеЗаполнено(Налог) Тогда
			Налоги.Добавить(Налог);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОбщегоНазначенияКлиентСервер.СвернутьМассив(Налоги);
	
КонецФункции

Функция НалоговыеПлатежиНДФЛОплатыТруда()
	
	// Одинаковый элемент Перечисления.ВидыНалогов.НДФЛ для удобства используется для всего агентского НДФЛ -
	// как связанного с выплатами сотрудникам, так и нет (см. дивиденды).
	// Поэтому здесь не получится опираться на него, нужно опираться на коды бюджетной классификации.
	
	Возврат НалоговыеПлатежиНДФЛ(Справочники.ВидыНалоговИПлатежейВБюджет.КодыВидовДоходаНДФЛ_ОплатаТруда());
	
КонецФункции

Функция НалоговыеПлатежиНДФЛДивидендов()

	// Одинаковый элемент Перечисления.ВидыНалогов.НДФЛ для удобства используется для всего агентского НДФЛ -
	// как связанного дивидендами, так и с выплатами сотрудникам.
	// Поэтому здесь не получится опираться на него, нужно опираться на коды бюджетной классификации.
	
	Возврат НалоговыеПлатежиНДФЛ(Справочники.ВидыНалоговИПлатежейВБюджет.КодыВидовДоходаНДФЛ_Дивиденды());
	
КонецФункции

Функция ОперацииНалогов()
	
	ОперацииНалогов = Новый СписокЗначений; // Представление - строка на разных языках
	
	ОперацииНалогов.Добавить("Списано", "ru = 'Списано в счет уплаты налога'");
	ОперацииНалогов.Добавить("ЗачетПереплаты", "ru = 'Зачет переплаты и возмещение налога'");
	
	Возврат ОперацииНалогов;
	
КонецФункции

Функция ИдентификаторыОперацийНалогов()
	
	Идентификаторы = Новый Структура;
	
	Для Каждого ОписаниеОперации Из ОперацииНалогов() Цикл
		Идентификаторы.Вставить(ОписаниеОперации.Значение, Идентификаторы.Количество());
	КонецЦикла;
	
	Возврат Идентификаторы;
	
КонецФункции

Процедура СоздатьДенежныеПотокиЕдиныйНалоговыйПлатеж(Процессор, РаспределятьЕдиныйНалоговыйПлатеж, КорректировочныйПоказательНДС)

	Процессор.ДанныеАлгоритма.ВременныйУчетЕдиногоНалоговогоПлатежа = ДанныеВременногоУчетаЕдиногоНалоговогоПлатежа(Процессор);
	
	ЕдиныйНалоговыйПлатеж = Новый ТаблицаЗначений;
	ЕдиныйНалоговыйПлатеж.Колонки.Добавить("Показатель", Новый ОписаниеТипов("Число"));
	ЕдиныйНалоговыйПлатеж.Колонки.Добавить("Налог", Новый ОписаниеТипов("СправочникСсылка.ВидыНалоговИПлатежейВБюджет"));
	ЕдиныйНалоговыйПлатеж.Колонки.Добавить("ВидНалога", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалогов"));
	ЕдиныйНалоговыйПлатеж.Колонки.Добавить("ОперацияНалога", Новый ОписаниеТипов("Число")); // индекс в ОперацииНалогов, см. ИдентификаторыОперацийНалогов
	ЕдиныйНалоговыйПлатеж.Колонки.Добавить("Сумма", БухгалтерскийУчетКлиентСервер.ТипСумма());
	ЕдиныйНалоговыйПлатеж.Колонки.Добавить("ВременныйУчет", Новый ОписаниеТипов("Булево"));
	ДополнитьКолонкамиАналитикиПотоковВременногоУчетаЕдиногоНалоговогоПлатежа(ЕдиныйНалоговыйПлатеж);
	
	ПеренестиЕдиныйНалоговыйПлатежИзВременныхСтатей(ЕдиныйНалоговыйПлатеж, Процессор.ДанныеАлгоритма.ВременныйУчетЕдиногоНалоговогоПлатежа);
	
	Если РаспределятьЕдиныйНалоговыйПлатеж Тогда
		РаспределитьЕдиныйНалоговыйПлатеж(ЕдиныйНалоговыйПлатеж, КорректировочныйПоказательНДС, Процессор);
	КонецЕсли;
	
	Запрос = НачатьЗапрос(Процессор);
	Запрос.УстановитьПараметр("ДенежныеПотокиЕдиныйНалоговыйПлатеж", ЕдиныйНалоговыйПлатеж);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Данные.Показатель КАК Показатель,
	|	Данные.Налог КАК Налог,
	|	Данные.ВидНалога КАК ВидНалога,
	|	Данные.ОперацияНалога КАК ОперацияНалога,
	|	Данные.Сумма КАК Сумма,
	|	Данные.ВременныйУчет КАК ВременныйУчет,
	|	Данные.Организация КАК Организация,
	|	Данные.Статья КАК Статья,
	|	Данные.Счет КАК Счет
	|ПОМЕСТИТЬ ДенежныеПотокиЕдиныйНалоговыйПлатеж
	|ИЗ
	|	&ДенежныеПотокиЕдиныйНалоговыйПлатеж КАК Данные
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВременныйУчет,
	|	ВидНалога";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура РаспределитьЕдиныйНалоговыйПлатеж(ЕдиныйНалоговыйПлатеж, КорректировочныйПоказательНДС, Процессор)
	
	// Потоки единого налогового платежа определяются по данным о принадлежности сумм ЕНС, общим для организации в целом.
	// Поэтому их нельзя определить для отчетности с показателями отдельного филиала.
	ОсновнаяОрганизация = Процессор.Контекст.Организации[0];
	Если ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоОбособленноеПодразделение(ОсновнаяОрганизация) Тогда
		Возврат;
	КонецЕсли;
	
	ОперацииНалогов = ИдентификаторыОперацийНалогов();
	
	СуммаЕНП = 0;
	Если Процессор.ДанныеАлгоритма.ВременныйУчетЕдиногоНалоговогоПлатежа <> Неопределено Тогда
		СуммаЕНП = Процессор.ДанныеАлгоритма.ВременныйУчетЕдиногоНалоговогоПлатежа.Сумма;
	Иначе
		СуммаЕНП = СуммаЕдиногоНалоговогоПлатежа(Процессор);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СуммаЕНП) Тогда
		Возврат;
	КонецЕсли;
	
	ПоказателиНалогов = ПоказателиНалоговЕдиныйНалоговыйПлатеж(Процессор.ЗаполняемыеПоказатели, КорректировочныйПоказательНДС);
	Если Не ЗначениеЗаполнено(ПоказателиНалогов) Тогда
		Возврат;
	КонецЕсли;
	
	Если СуммаЕНП > 0 Тогда
		// Возврат с ЕНС
		Возврат;
	КонецЕсли;
	
	// Интересны данные по видам налогов, включаемым в обособленные показатели, а также НДС, сворачиваемый с НДС в расчетах с контрагентами.
	// См. СоздатьКорректировкиДенежныхПотоков
	
	ПорядокЗачета = Новый ТаблицаЗначений;
	ПорядокЗачета.Колонки.Добавить("ВидНалога", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалогов"));
	Для Каждого ВидНалога Из ПорядокЗачетаПереплатыЕдиногоНалоговогоПлатежа() Цикл
		ПорядокЗачета.Добавить().ВидНалога = ВидНалога;
	КонецЦикла;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ЕдиныйНалоговыйСчет.СоздатьУплатаНалогов(
		МенеджерВременныхТаблиц,
		Процессор.Контекст.Период.Начало,
		Процессор.Контекст.Период.КонецДата,
		Процессор.Контекст.Организации[0]);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПоказателиНалогов", ПоказателиНалогов);
	Запрос.УстановитьПараметр("ПорядокВидовНалогов", ПорядокЗачета);
	Запрос.УстановитьПараметр("ПорядокВидаНалоговПоУмолчанию", ПорядокЗачета.Количество() + 1);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК Порядок,
	|	ПоказателиНалогов.Налог КАК Налог,
	|	ПоказателиНалогов.Показатель КАК Показатель
	|ПОМЕСТИТЬ ВТ_ПоказателиНалогов
	|ИЗ
	|	&ПоказателиНалогов КАК ПоказателиНалогов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Налог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК Порядок,
	|	ПорядокВидовНалогов.ВидНалога КАК ВидНалога
	|ПОМЕСТИТЬ ВТ_ПорядокВидовНалогов
	|ИЗ
	|	&ПорядокВидовНалогов КАК ПорядокВидовНалогов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидНалога
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыНалогов.Ссылка КАК ВидНалога,
	|	МАКСИМУМ(ПоказателиНалогов.Порядок) КАК Порядок,
	|	МАКСИМУМ(ПоказателиНалогов.Показатель) КАК Показатель
	|ПОМЕСТИТЬ ВТ_ПоказателиВидовНалогов
	|ИЗ
	|	ВТ_ПоказателиНалогов КАК ПоказателиНалогов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Перечисление.ВидыНалогов КАК ВидыНалогов
	|		ПО ПоказателиНалогов.Налог = ВидыНалогов.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВидыНалогов.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидНалога
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиНалогов.Налог КАК Налог,
	|	МАКСИМУМ(Налоги.ВидНалога) КАК ВидНалога,
	|	МАКСИМУМ(ПоказателиНалогов.Порядок) КАК Порядок,
	|	МАКСИМУМ(ПоказателиНалогов.Показатель) КАК Показатель
	|ПОМЕСТИТЬ ВТ_ПоказателиНалоговУпорядоченные
	|ИЗ
	|	ВТ_ПоказателиНалогов КАК ПоказателиНалогов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНалоговИПлатежейВБюджет КАК Налоги
	|		ПО ПоказателиНалогов.Налог = Налоги.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоказателиНалогов.Налог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПоказателиНалогов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УплатаНалогов.Налог КАК Налог,
	|	УплатаНалогов.Сумма КАК Сумма,
	|	ЕСТЬNULL(ПоказателиНалогов.ВидНалога, Налоги.ВидНалога) КАК ВидНалога,
	|	ЕСТЬNULL(ПоказателиНалогов.Показатель, ПоказателиВидовНалогов.Показатель) КАК Показатель,
	|	ЕСТЬNULL(ПоказателиНалогов.Порядок, ПоказателиВидовНалогов.Порядок) КАК Порядок
	|ПОМЕСТИТЬ ВТ_ПоказателиУплатыНалогов
	|ИЗ
	|	УплатаНалогов КАК УплатаНалогов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоказателиНалоговУпорядоченные КАК ПоказателиНалогов
	|		ПО УплатаНалогов.Налог = ПоказателиНалогов.Налог
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоказателиВидовНалогов КАК ПоказателиВидовНалогов
	|		ПО УплатаНалогов.Налог.ВидНалога = ПоказателиВидовНалогов.ВидНалога
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНалоговИПлатежейВБюджет КАК Налоги
	|		ПО УплатаНалогов.Налог = Налоги.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПоказателиНалоговУпорядоченные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПоказателиВидовНалогов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УплатаНалогов.Налог КАК Налог,
	|	УплатаНалогов.Сумма КАК Сумма,
	|	УплатаНалогов.ВидНалога КАК ВидНалога,
	|	УплатаНалогов.Показатель КАК Показатель,
	|	ВЫБОР
	|		КОГДА УплатаНалогов.Показатель ЕСТЬ NULL
	|			ТОГДА -1
	|		ИНАЧЕ ЕСТЬNULL(ПорядокВидовНалогов.Порядок, &ПорядокВидаНалоговПоУмолчанию)
	|	КОНЕЦ КАК ПорядокЗачетаВидовНалогов,
	|	УплатаНалогов.Порядок КАК ПорядокПоказателей,
	|	УплатаНалогов.ВидНалога.Порядок КАК ПорядокВидовНалогов,
	|	ВЫРАЗИТЬ(УплатаНалогов.Налог КАК Справочник.ВидыНалоговИПлатежейВБюджет).Наименование КАК ПорядокНалогов
	|ИЗ
	|	ВТ_ПоказателиУплатыНалогов КАК УплатаНалогов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокВидовНалогов КАК ПорядокВидовНалогов
	|		ПО УплатаНалогов.ВидНалога = ПорядокВидовНалогов.ВидНалога
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокЗачетаВидовНалогов,
	|	ПорядокПоказателей,
	|	ПорядокВидовНалогов,
	|	ПорядокНалогов
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПорядокВидовНалогов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПоказателиУплатыНалогов";
	
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если Не ВыборкаИтоги.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыборкаИтоги.Сумма <= 0 Тогда
		// Нет сведений о списании с ЕНС, вся сумма - переплата
		Возврат;
	КонецЕсли;
	
	ПереплатаПрошлыхЛет = Макс(0, СуммаЕНП + ВыборкаИтоги.Сумма); // ФНС списало больше, чем фактические платежи за год
	
	Выборка = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		Списано = - Выборка.Сумма; // Уплата налогов - это отрицательный денежный поток
		
		// Зачитываем переплату по всем списанным ФНС налогам - как выделяемым в отдельные показатели отчета, так и нет
		// (в первую очередь - по не выделяемым).
		ЗачетПереплаты = 0;
		Если ПереплатаПрошлыхЛет > 0 И Списано < 0 Тогда
			ЗачетПереплаты = Мин(ПереплатаПрошлыхЛет, - Списано);
			ПереплатаПрошлыхЛет = ПереплатаПрошлыхЛет - ЗачетПереплаты;
		КонецЕсли;
		
		Если Выборка.Показатель = Null Тогда
			Продолжить;
		КонецЕсли;
		
		Слагаемое = ЕдиныйНалоговыйПлатеж.Добавить();
		ЗаполнитьЗначенияСвойств(Слагаемое, Выборка);
		Слагаемое.Организация = ОсновнаяОрганизация;
		
		Слагаемое.Сумма = Списано;
		Слагаемое.ОперацияНалога = ОперацииНалогов.Списано;
		
		Если ЗачетПереплаты > 0 Тогда
			
			Слагаемое = ЕдиныйНалоговыйПлатеж.Добавить();
			ЗаполнитьЗначенияСвойств(Слагаемое, Выборка);
			Слагаемое.Организация = ОсновнаяОрганизация;
			
			Слагаемое.Сумма = ЗачетПереплаты;
			Слагаемое.ОперацияНалога = ОперацииНалогов.ЗачетПереплаты;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СуммаЕдиногоНалоговогоПлатежа(Процессор)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Процессор.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(Потоки.Сумма) КАК Сумма
	|ИЗ
	|	ДенежныеПотоки КАК Потоки
	|ГДЕ
	|	Потоки.Статья.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ЕдиныйНалоговыйПлатеж)";
	
	Возврат Запрос.Выполнить().Выгрузить().Итог("Сумма");
	
КонецФункции

Функция ПоказателиНалоговЕдиныйНалоговыйПлатеж(ЗаполняемыеПоказатели, КорректировочныйПоказательНДС)
	
	ПоказателиНалогов = Новый ТаблицаЗначений;
	ПоказателиНалогов.Колонки.Добавить("Налог", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалогов,СправочникСсылка.ВидыНалоговИПлатежейВБюджет"));
	ПоказателиНалогов.Колонки.Добавить("Показатель", Новый ОписаниеТипов("Число"));
	
	ИмяПотока = ИмяРаспределенногоДенежногоПотока(Перечисления.ВидыДвиженийДенежныхСредств.ЕдиныйНалоговыйПлатеж);
	
	Для Каждого ОписаниеПоказателя Из ЗаполняемыеПоказатели.Показатели Цикл
		
		Если ОписаниеПоказателя.Заполнение.Идентификатор <> ИдентификаторАлгоритмаДенежныеПотоки() Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ОписаниеПоказателя.Заполнение.Отбор.Свойство("РаспределениеПриемник")
			Или ОписаниеПоказателя.Заполнение.Отбор.РаспределениеПриемник.Ключ <> ИмяПотока Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Налог Из ОписаниеПоказателя.Заполнение.Отбор.РаспределениеПриемник.Значение Цикл
			
			ОписаниеНалога = ПоказателиНалогов.Добавить();
			ОписаниеНалога.Налог = Налог;
			Если Налог = Перечисления.ВидыНалогов.НДС И КорректировочныйПоказательНДС <> Неопределено Тогда
				ОписаниеНалога.Показатель = КорректировочныйПоказательНДС;
			Иначе
				ОписаниеНалога.Показатель = БухгалтерскаяОтчетностьБРО.ИдентификаторПоказателя(ОписаниеПоказателя);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Если ПоказателиНалогов.Найти(Перечисления.ВидыНалогов.НДС, "Налог") = Неопределено
		И КорректировочныйПоказательНДС <> Неопределено Тогда
		ОписаниеНалога = ПоказателиНалогов.Добавить();
		ОписаниеНалога.Налог = Перечисления.ВидыНалогов.НДС;
		ОписаниеНалога.Показатель = КорректировочныйПоказательНДС;
	КонецЕсли;
	
	Возврат ПоказателиНалогов;
	
КонецФункции

Функция ПорядокЗачетаПереплатыЕдиногоНалоговогоПлатежа()
	
	// Переплатами здесь считаем только то, что не удалось зачесть без привлечения показателей, в которых части ЕНП отражаются обособленно.
	// См. также вызовы ДобавитьПоказательРаспределенныйЕдиныйНалоговыйПлатеж, в частности - НалоговыеПлатежиНДФЛ
	
	ПорядокВидовНалогов = Новый Массив;
	
	ПорядокВидовНалогов.Добавить(Перечисления.ВидыНалогов.НДФЛ);
	
	ПорядокПоказателей = Новый Массив; // Из Массив Из ПеречислениеСсылка.ВидыНалогов
	ПорядокПоказателей.Добавить(Перечисления.ВидыНалогов.НалоговыеПлатежиСтраховыеВзносыОплатыТруда());
	ПорядокПоказателей.Добавить(Перечисления.ВидыНалогов.НалоговыеПлатежиНалогНаПрибыль());
	ПорядокПоказателей.Добавить(Перечисления.ВидыНалогов.НалоговыеПлатежиНалогНаПрибыльДивидендов());
	
	Для Каждого НаборВидовНалоговПоказателя Из ПорядокПоказателей Цикл
		Для Каждого ВидНалога Из НаборВидовНалоговПоказателя Цикл
			ПорядокВидовНалогов.Добавить(ВидНалога);
		КонецЦикла;
	КонецЦикла;
	
	ПорядокВидовНалогов.Добавить(Перечисления.ВидыНалогов.НДС); // Последний, так как сальдируется с суммами в составе расчетов
	
	Возврат ПорядокВидовНалогов;
	
КонецФункции

#Область ВременныйУчетЕдиногоНалоговогоПлатежа

Функция НачалоОбязательногоПримененияСтатьиЕдиныйНалоговыйПлатеж()
	// Временный учет применяется до применения статьи
	Возврат '2026-01-01';
КонецФункции

Функция ДанныеВременногоУчетаЕдиногоНалоговогоПлатежа(Процессор)
	
	Если Процессор.Контекст.Период.КонецДата >= НачалоОбязательногоПримененияСтатьиЕдиныйНалоговыйПлатеж() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеВременногоУчета = НовыйДанныеВременногоУчетаЕдиногоНалоговогоПлатежа();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Процессор.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ВидСтатьиЕдиныйНалоговыйПлатеж", ДанныеВременногоУчета.ВидСтатьиЕдиныйНалоговыйПлатеж);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Потоки.Статья
	|ИЗ
	|	ДенежныеПотоки КАК Потоки
	|ГДЕ
	|	Потоки.Статья.ВидДвиженияДенежныхСредств = &ВидСтатьиЕдиныйНалоговыйПлатеж";
	ОпределитьСтатьиЕдиныйНалоговыйПлатежПоКорреспонденции = Запрос.Выполнить().Пустой();
	
	Если Не ОпределитьСтатьиЕдиныйНалоговыйПлатежПоКорреспонденции Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтатьиЕдиныйНалоговыйПлатеж = СтатьиЕдиныйНалоговыйПлатежПоКорреспонденции(Процессор, ДанныеВременногоУчета.СчетУчетаЕдиныйНалоговыйСчет);
	Если Не ЗначениеЗаполнено(СтатьиЕдиныйНалоговыйПлатеж) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СтатьиЕдиныйНалоговыйПлатеж", СтатьиЕдиныйНалоговыйПлатеж);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Статьи.Показатель КАК Показатель,
	|	Потоки.Статья КАК Статья,
	|	Потоки.Статья.Наименование КАК СтатьяПорядок,
	|	Потоки.Счет КАК Счет,
	|	Потоки.Счет.Порядок КАК СчетПорядок,
	|	Потоки.Организация КАК Организация,
	|	Потоки.Организация.Наименование КАК ОрганизацияПорядок,
	|	Потоки.Сумма КАК Сумма
	|ИЗ
	|	ДенежныеПотоки КАК Потоки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Статьи КАК Статьи
	|		ПО Потоки.Статья = Статьи.Статья
	|			И (Потоки.Статья В (&СтатьиЕдиныйНалоговыйПлатеж))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Показатель,
	|	ОрганизацияПорядок,
	|	Организация,
	|	СтатьяПорядок,
	|	Статья,
	|	СчетПорядок,
	|	Счет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеВременногоУчета.Потоки.Добавить(), Выборка);
	КонецЦикла;
	
	ДанныеВременногоУчета.Сумма = ДанныеВременногоУчета.Потоки.Итог("Сумма");
	ДанныеВременногоУчета.Период = Процессор.Контекст.Период.КонецДата;
	
	Возврат ДанныеВременногоУчета;
	
КонецФункции

Функция НовыйДанныеВременногоУчетаЕдиногоНалоговогоПлатежа()
	
	ДанныеВременногоУчета = Новый Структура;
	
	ДанныеВременногоУчета.Вставить("Сумма", 0);
	ДанныеВременногоУчета.Вставить("СчетУчетаЕдиныйНалоговыйСчет", ПланыСчетов.Хозрасчетный.ЕдиныйНалоговыйСчет);
	ДанныеВременногоУчета.Вставить("ВидСтатьиЕдиныйНалоговыйПлатеж", Перечисления.ВидыДвиженийДенежныхСредств.ЕдиныйНалоговыйПлатеж);
	ДанныеВременногоУчета.Вставить("Период", '0001-01-01');
	ДанныеВременногоУчета.Вставить("Потоки", Новый ТаблицаЗначений);
	ДанныеВременногоУчета.Потоки.Колонки.Добавить("Показатель", Новый ОписаниеТипов("Число"));
	ДанныеВременногоУчета.Потоки.Колонки.Добавить("Сумма", БухгалтерскаяОтчетностьБРО.ТипСумма());
	ДополнитьКолонкамиАналитикиПотоковВременногоУчетаЕдиногоНалоговогоПлатежа(ДанныеВременногоУчета.Потоки);
	
	Возврат ДанныеВременногоУчета;
	
КонецФункции

Процедура ДополнитьКолонкамиАналитикиПотоковВременногоУчетаЕдиногоНалоговогоПлатежа(ТаблицаЗначений)
	ТаблицаЗначений.Колонки.Добавить("Статья", Новый ОписаниеТипов("СправочникСсылка.СтатьиДвиженияДенежныхСредств"));
	ТаблицаЗначений.Колонки.Добавить("Счет", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ТаблицаЗначений.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
КонецПроцедуры

Функция СтатьиЕдиныйНалоговыйПлатежПоКорреспонденции(Процессор, СчетУчетаЕдиныйНалоговыйСчет)
	
	Запрос = НачатьЗапрос(Процессор);
	Запрос.УстановитьПараметр("СчетаДенегДетально",  Процессор.ДанныеАлгоритма.Счета.ДеньгиДетально);
	Запрос.УстановитьПараметр("ЕдиныйНалоговыйСчет", БухгалтерскийУчетПовтИсп.СчетаВИерархии(СчетУчетаЕдиныйНалоговыйСчет));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Статьи.Ссылка КАК Статья,
	|	Статьи.Наименование КАК Порядок
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В (&СчетаДенегДетально), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДвиженияДенежныхСредств), Организация В (&Организации), КорСчет В (&ЕдиныйНалоговыйСчет), ) КАК ДенежныеПотоки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтатьиДвиженияДенежныхСредств КАК Статьи
	|		ПО ДенежныеПотоки.Субконто1 = Статьи.Ссылка
	|ГДЕ
	|	Статьи.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ПрочиеРасходыПоТекущейДеятельности)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	Статья";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Статья");
	
КонецФункции

Процедура ПеренестиЕдиныйНалоговыйПлатежИзВременныхСтатей(ЕдиныйНалоговыйПлатеж, ДанныеВременногоУчета)
	
	Если ДанныеВременногоУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Источник Из ДанныеВременногоУчета.Потоки Цикл
		
		Приемник = ЕдиныйНалоговыйПлатеж.Добавить();
		ЗаполнитьЗначенияСвойств(Приемник, Источник);
		Приемник.ВременныйУчет = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьОписаниеПорядкаВременногоУчетаЕдиногоНалоговогоПлатежа(Предложения, ДанныеАлгоритма, КодЯзыка)
	
	Если ДанныеАлгоритма.ВременныйУчетЕдиногоНалоговогоПлатежа = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонТекста = НСтр(
		"ru = 'Дополнительно в %1 году учитывается оборот по счетам учета денежных средств с указанием статей, по которым в этом периоде были корреспонденции со счетом %2.
         |Такие обороты переносятся из других показателей отчета. Перечень статей и показателей приведен ниже.
         |Это дополнение применяется в переходном периоде до %3 года, если не используются статьи вида %4.'",
		КодЯзыка);
	
	Описание = СтрШаблон(
		ШаблонТекста,
		Формат(ДанныеАлгоритма.ВременныйУчетЕдиногоНалоговогоПлатежа.Период, "ДФ=yyyy"),
		ДанныеАлгоритма.ВременныйУчетЕдиногоНалоговогоПлатежа.СчетУчетаЕдиныйНалоговыйСчет,
		Формат(НачалоОбязательногоПримененияСтатьиЕдиныйНалоговыйПлатеж(), "ДФ=yyyy"),
		ДанныеАлгоритма.ВременныйУчетЕдиногоНалоговогоПлатежа.ВидСтатьиЕдиныйНалоговыйПлатеж);
	
	Предложения.Добавить(Описание);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

Процедура ОписатьПорядокЗаполненияПоказателяДенежныеПотоки(Описание, Показатель, ДанныеАлгоритма, КодЯзыка)
	
	ТекстОписания = Новый Массив;
	ТекстРазъяснения = Новый Массив;
	
	СодержитДвижениеДенежныхСредств = Не ЗначениеЗаполнено(Показатель.Заполнение.Отбор)
		Или Показатель.Заполнение.Отбор.Свойство("ВидСтатьи")
		Или Показатель.Заполнение.Отбор.Свойство("Счет");
		
	КомбинированныйПоказатель = СодержитДвижениеДенежныхСредств
		И (Показатель.Заполнение.Отбор.Свойство("Свернутый")
			Или Показатель.Заполнение.Отбор.Свойство("РаспределениеИсточник"));
			
	Если КомбинированныйПоказатель Тогда
		Описание.ШагиРасчета.Добавить(, "ЭтоДвижениеДенежныхСредств");
	КонецЕсли;
	
	Если СодержитДвижениеДенежныхСредств Тогда
		
		Сворачиваемые = Новый Массив;
		Для Каждого ОписаниеПотока Из ДанныеАлгоритма.ПредставленияСворачиваемыхДенежныхПотоков Цикл
			Если Не Показатель.Заполнение.НастройкиАлгоритма.Сворачиваемые.Свойство(ОписаниеПотока.Значение) Тогда
				Продолжить;
			КонецЕсли;
			Сворачиваемые.Добавить(ОписаниеПотока.Представление);
		КонецЦикла;
		
		Если Показатель.Заполнение.Отбор.Свойство("Счет") Тогда
			
			ОписаниеСчетовОтбора = Новый СписокЗначений;
			Для Каждого ОписаниеСчета Из ДанныеАлгоритма.Счета.Описание Цикл
				Если Показатель.Заполнение.Отбор.Счет.Найти(ОписаниеСчета.Значение) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ОписаниеСчетовОтбора.Добавить(ОписаниеСчета.Значение, ОписаниеСчета.Представление, Истина);
			КонецЦикла;
			
			Если КомбинированныйПоказатель Тогда
				Описание.ШагиРасчета.Добавить(, "Счет?");
			Иначе
				Описание.ШагиРасчета.Добавить(ОписаниеСчетовОтбора, "Счет");
			КонецЕсли;
			
			ПредставлениеСчетовОтбора = ПредставлениеСпискаСчетов(ОписаниеСчетовОтбора);
			Если ПредставлениеСчетовОтбора.Количество = 1 Тогда
				ШаблонТекста = НСтр("ru = 'Оборот по счету %1'", КодЯзыка);
			Иначе
				ШаблонТекста = НСтр("ru = 'Оборот по счетам %1'", КодЯзыка);
			КонецЕсли;
			
			ТекстОписания.Добавить(СтрШаблон(ШаблонТекста, ПредставлениеСчетовОтбора.Текст));
			ТекстРазъяснения.Добавить(НСтр(
				"ru = 'Учет по статьям денежных средств на этом счете не ведется, весь его оборот относится к одному показателю отчета'",
				КодЯзыка));
			
		Иначе
			
			ОписаниеСчетовОтбора = ДанныеАлгоритма.Счета.Описание;
			Если Показатель.Заполнение.Отбор.Свойство("ВидСтатьи") Тогда
				ОписаниеСчетовОтбора = ДанныеАлгоритма.Счета.ОписаниеСтатьи;
			Иначе
				ОписаниеСчетовОтбора = ДанныеАлгоритма.Счета.ОписаниеОсновной;
			КонецЕсли;
			
			ШаблонТекста = НСтр("ru = 'Оборот по счетам денежных средств и денежных эквивалентов %1.'", КодЯзыка);
			ОписаниеСтатей = "";
			ДопускаетсяПустаяСтатья = Ложь;
			Если Не Показатель.Заполнение.Отбор.Свойство("ВидСтатьи") Тогда
				ОписаниеСтатей = НСтр("ru = 'по статьям и счетам, не включенным в другие показатели'", КодЯзыка);
				ДопускаетсяПустаяСтатья = Истина;
			ИначеЕсли Показатель.Заполнение.Отбор.ВидСтатьи.Количество() = 1 Тогда
				ОписаниеСтатей = СтрШаблон(
					НСтр("ru = 'по статьям вида ""%1""'", КодЯзыка),
					Показатель.Заполнение.Отбор.ВидСтатьи[0]);
			Иначе
				ОписаниеСтатей = СтрШаблон(
					НСтр("ru = 'по статьям видов %1'", КодЯзыка),
					ОбщегоНазначенияБПКлиентСервер.ПредставлениеСписка(Показатель.Заполнение.Отбор.ВидСтатьи, "И", "; "));
			КонецЕсли;
			Если Не ДопускаетсяПустаяСтатья
				И Показатель.Заполнение.Отбор.ВидСтатьи.Найти(Перечисления.ВидыДвиженийДенежныхСредств.ПустаяСсылка()) <> Неопределено Тогда
				ДопускаетсяПустаяСтатья = Истина;
			КонецЕсли;
			ТекстОписания.Добавить(СтрШаблон(ШаблонТекста, ОписаниеСтатей));
			
			Если Не КомбинированныйПоказатель Тогда
				ТекстОписания.Добавить(НСтр("ru = 'Список счетов приведен ниже.'", КодЯзыка));
			КонецЕсли;
			
			Если КомбинированныйПоказатель Тогда
				Описание.ШагиРасчета.Добавить(, "Счет?");
				Описание.ШагиРасчета.Добавить(, "Статья?");
			Иначе
				Описание.ШагиРасчета.Добавить(ОписаниеСчетовОтбора, "Счет");
				Если ДопускаетсяПустаяСтатья И ЗначениеЗаполнено(Сворачиваемые) Тогда
					Описание.ШагиРасчета.Добавить(, "Статья?");
				Иначе
					Описание.ШагиРасчета.Добавить(, "Статья");
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Сворачиваемые) Тогда
			ТекстОписания.Добавить(НСтр("ru = 'Исключаются обороты между счетами денежных средств и денежных эквивалентов.'", КодЯзыка));
		Иначе
			
			Описание.ШагиРасчета.Добавить(, "ВидКорректировки");
			
			ТекстОписания.Добавить(НСтр("ru = 'Исключаются:
                                       |- обороты между счетами денежных средств и денежных эквивалентов
                                       |- денежные потоки, отображаемые в отчете свернуто.'", КодЯзыка));
			ШаблонТекста = НСтр("ru = 'Свернуто отражаются %1.'", КодЯзыка);
			Если Сворачиваемые.Количество() = 1 Тогда
				НСтр("ru = 'Свернуто отражается %1.'", КодЯзыка);
			КонецЕсли;
			Союз = НСтр("ru = ', а также '", КодЯзыка); // используем нестандартный союз, так как описания сворачиваемых потоков уже содержат союз "и"
			ТекстОписания.Добавить(СтрШаблон(ШаблонТекста, ОбщегоНазначенияБПКлиентСервер.ПредставлениеСписка(Сворачиваемые, Союз, "; ")));
		КонецЕсли;
		
		// Отчет
		Описание.Отчет.ВидОтчета  = "ОборотыСчета";
		
		Если Показатель.Заполнение.Отбор.Свойство("ВидСтатьи") Тогда
			Описание.Отчет.Субконто.Вставить("Статья", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДвиженияДенежныхСредств);
			ОтборЧерезТочку = Новый Соответствие;
			ОтборЧерезТочку.Вставить("ВидДвиженияДенежныхСредств", Показатель.Заполнение.Отбор.ВидСтатьи);
			Описание.Отчет.ОтборыПоказателя.Вставить("Статья", ОтборЧерезТочку);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Показатель.Заполнение.Отбор.Свойство("Свернутый") Тогда
		Если Показатель.Заполнение.Отбор.Свернутый = "АгентПродавца" Тогда
			ТекстРазъяснения.Добавить(НСтр(
				"ru = 'Условно считаем, что суммы, выплаченные комитентам, агент в полном объеме получил от покупателей'",
				КодЯзыка));
		ИначеЕсли Показатель.Заполнение.Отбор.Свернутый = "АгентПокупателя" Тогда
			ТекстРазъяснения.Добавить(НСтр(
				"ru = 'Условно считаем, что сумму, полученную от комитента для приобретения чего-либо, агент в полном объеме заплатил поставщикам.
                 |При этом предполагается, что суммы, полученные для платежей поставщикам отражаются на счетах прочих расчетов, а комиссионного вознаграждения - на счетах расчетов с покупателями.'",
				КодЯзыка));
		ИначеЕсли Показатель.Заполнение.Отбор.Свернутый = "НДС" Тогда
			Описание.ШагиРасчета.Добавить(, "СсылкаКорректировки");
			Описание.ШагиРасчета.Добавить(, "ВидКорректировкиДляОписанияСсылки");
			Если Не СодержитДвижениеДенежныхСредств Тогда
				ТекстОписания.Добавить(НСтр(
					"ru = 'Сальдирует денежные потоки по налогу на добавленную стоимость
                     |- исключенные из расчетов с контрагентами
                     |- перенесенные из состава единого налогового платежа.'", 
					КодЯзыка));
			Иначе
				ТекстОписания.Добавить(НСтр(
					"ru = 'Также сальдирует денежные потоки по налогу на добавленную стоимость, исключенные из расчетов с контрагентами.'",
					КодЯзыка));
			КонецЕсли;
		Иначе
			// Пока ограничиваемся наименованием
		КонецЕсли;
	ИначеЕсли Показатель.Заполнение.Отбор.Свойство("РаспределениеПриемник") Тогда
		Если Показатель.Заполнение.Отбор.РаспределениеПриемник.Ключ = "ЕдиныйНалоговыйПлатеж" Тогда
			Описание.ШагиРасчета.Добавить(, "СсылкаКорректировки?");
			Описание.ШагиРасчета.Добавить(, "Налог");
			ШаблонТекста = НСтр(
				"ru = 'Сведения о суммах, зачисленных на единый налоговый счет, и отнесенных налоговым органом к следующим видам обязательств: %1'",
				КодЯзыка);
			Если Показатель.Заполнение.Отбор.РаспределениеПриемник.Значение.Количество() = 1 Тогда
				ШаблонТекста = НСтр(
					"ru = 'Сведения о суммах, зачисленных на единый налоговый счет, и отнесенных налоговым органом к обязательству вида ""%1""'",
					КодЯзыка);
			КонецЕсли;
			ТекстОписания.Добавить(СтрШаблон(
				ШаблонТекста,
				ОбщегоНазначенияБПКлиентСервер.ПредставлениеСписка(Показатель.Заполнение.Отбор.РаспределениеПриемник.Значение, "И", "; ")));
			ТекстРазъяснения.Добавить(СтрШаблон(
					НСтр("ru = 'См. документы %1.'", КодЯзыка),
					Метаданные.Документы.СведенияОбУплатеНалогов.Представление()));
		КонецЕсли;
	ИначеЕсли Показатель.Заполнение.Отбор.Свойство("РаспределениеИсточник") Тогда
		Если Показатель.Заполнение.Отбор.РаспределениеИсточник = "ЕдиныйНалоговыйПлатеж" Тогда
			
			Описание.ШагиРасчета.Добавить(, "СсылкаКорректировки?");
			Описание.ШагиРасчета.Добавить(, "Налог");
			Описание.ШагиРасчета.Добавить(, "ОперацияНалога");
			
			ТекстОписания.Добавить(НСтр(
				"ru = 'Значение показателя корректируется с учетом сведений о суммах, отнесенных налоговым органом к видам обязательств, данные о выполнении которых отражаются в других показателях отчета.
                 |Для такой корректировки учитываются суммы:
                 |- списаний налоговым органом с единого налогового счета в счет уплаты налогов и иных обязательств
                 |- зачета переплаты прошлого отчетного периода
                 |- возмещений на единый налоговый счет, в частности, налога на добавленную стоимость.
                 |Суммы зачета переплаты и возмещений определяется расчетным путем, как превышение списаний с ЕНС над поступлениями, распределенное по видам обязательств.'",
				КодЯзыка));
			
			ТекстРазъяснения.Добавить(СтрШаблон(
					НСтр("ru = 'Сведения о суммах, отнесенных налоговым органом к отдельным видам обязательств, см. в документах %1.'", КодЯзыка),
					Метаданные.Документы.СведенияОбУплатеНалогов.Представление()));
					
			ДобавитьОписаниеПорядкаВременногоУчетаЕдиногоНалоговогоПлатежа(ТекстРазъяснения, ДанныеАлгоритма, КодЯзыка);
			
		КонецЕсли;
	КонецЕсли;
	
	Если БухгалтерскаяОтчетностьБРО.ИдентификаторПоказателя(Показатель) = ДанныеАлгоритма.ПоказательЕдиныйНалоговыйПлатежБезРаспределения Тогда
		ТекстРазъяснения.Добавить(НСтр(
			"ru = 'В учетной политике выбран вариант представления в отчете общей суммы единого налогового платежа
             |(п. 2 Рекомендации БМЦ Р-175/2025-КпР ""Единый налоговый счет"")'",
			КодЯзыка));
	КонецЕсли;
	
	Описание.Текст = СтрСоединить(ТекстОписания, Символы.ПС);
	Описание.Разъяснение = СтрСоединить(ТекстРазъяснения, Символы.ПС);
	
КонецПроцедуры

Процедура ОписатьЗаполняемоеЗначениеДенежныеПотоки(ЗаписьРасчет, СоставШагаРасчета, ДанныеАлгоритма, КодЯзыка)
	
	Если ЗаписьРасчет.ТипЗаписи = "ЭтоДвижениеДенежныхСредств" Тогда
		Если СоставШагаРасчета.ЭтоДвижениеДенежныхСредств Тогда
			ЗаписьРасчет.Описание = НСтр("ru = 'Оборот по счетам учета денежных средств'", КодЯзыка);
		Иначе
			ЗаписьРасчет.Описание = НСтр("ru = 'Корректировки других показателей отчета'", КодЯзыка);
		КонецЕсли;
	ИначеЕсли ЗаписьРасчет.ТипЗаписи = "ВидКорректировки" Тогда
		Если Не ЗначениеЗаполнено(СоставШагаРасчета.ВидКорректировки) Тогда
			ЗаписьРасчет.Описание = НСтр("ru = 'Всего'", КодЯзыка);
		Иначе
			ОписаниеКорректировки = ДанныеАлгоритма.ПредставленияСворачиваемыхДенежныхПотоков.НайтиПоЗначению(СоставШагаРасчета.ВидКорректировки);
			Если ОписаниеКорректировки <> Неопределено Тогда
				Если СоставШагаРасчета.Свойство("ЭтоДвижениеДенежныхСредств") Тогда
					// Слова про корректировку уже прозвучали
					ЗаписьРасчет.Описание = ОбщегоНазначенияБПКлиентСервер.КапитализироватьСтроку(ОписаниеКорректировки.Представление);
				Иначе
					ЗаписьРасчет.Описание = СтрШаблон(НСтр("ru = 'Исключены %1'", КодЯзыка), ОписаниеКорректировки.Представление);
				КонецЕсли;
			ИначеЕсли СоставШагаРасчета.ВидКорректировки = "ВременныйУчетЕдиногоНалоговогоПлатежа" Тогда
				ЗаписьРасчет.Описание = НСтр("ru = 'Суммы единого налогового платежа перенесены в одноименный показатель'", КодЯзыка);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ЗаписьРасчет.ТипЗаписи = "СсылкаКорректировки" Тогда
		ЗаписьРасчет.Описание = ПредставлениеСсылкиПоказателя(СоставШагаРасчета.СсылкаКорректировки, ЗаписьРасчет, ДанныеАлгоритма);
	ИначеЕсли ЗаписьРасчет.ТипЗаписи = "ВидКорректировкиДляОписанияСсылки" Тогда
		ПредставлениеПредметаКорректировки = ПредставлениеПредметаКорректировки(
			СоставШагаРасчета.ВидКорректировкиДляОписанияСсылки,
			ДанныеАлгоритма.ПредставленияСворачиваемыхДенежныхПотоков,
			КодЯзыка);
		ЗаписьРасчет.Описание = ОбщегоНазначенияБПКлиентСервер.КапитализироватьСтроку(ПредставлениеПредметаКорректировки);
	ИначеЕсли ЗаписьРасчет.ТипЗаписи = "ОперацияНалога" Тогда
		Если ТипЗнч(СоставШагаРасчета.ОперацияНалога) = Тип("Число") Тогда
			ЗаписьРасчет.Описание = НСтр(ДанныеАлгоритма.ОперацииНалогов[СоставШагаРасчета.ОперацияНалога].Представление, КодЯзыка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПредставленияСворачиваемыхДенежныхПотоков(КодЯзыка)
	
	Представления = Новый СписокЗначений;
	
	Представления.Добавить("НДС", НСтр("ru = 'суммы НДС'", КодЯзыка));
	
	Если ПолучитьФункциональнуюОпцию("ОсуществляетсяЗакупкаТоваровУслугДляКомитентов") Тогда
		Представления.Добавить("АгентПокупателя", НСтр("ru = 'поступления и платежи, относящиеся к деятельности агента при покупках в интересах комитента'", КодЯзыка));
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ОсуществляетсяРеализацияТоваровУслугКомитентов") Тогда
		Представления.Добавить("АгентПродавца", НСтр("ru = 'поступления и платежи, относящиеся к деятельности агента при продажах в интересах комитента'", КодЯзыка));
	КонецЕсли;
	
	Если БухгалтерскийУчетПереопределяемый.ИспользоватьВалютныйУчет() Тогда
		Представления.Добавить("ОбменВалют",      НСтр("ru = 'выгоды и потери от валютно-обменных операций'", КодЯзыка));
		Представления.Добавить("КурсовыеРазницы", НСтр("ru = 'последствия изменений курсов валют'", КодЯзыка));
	КонецЕсли;
	
	Возврат Представления;
	
КонецФункции

Функция ПредставлениеПредметаКорректировки(ВидКорректировки, ПредставленияСворачиваемыхДенежныхПотоков, КодЯзыка)
	
	Если ВидКорректировки = "ВременныйУчетЕдиногоНалоговогоПлатежа" Тогда
		Возврат НСтр("ru = 'единый налоговый платеж'", КодЯзыка);
	Иначе
		// См. ПредставленияСворачиваемыхДенежныхПотоков()
		ОписаниеКорректировки = ПредставленияСворачиваемыхДенежныхПотоков.НайтиПоЗначению(ВидКорректировки);
		Если ОписаниеКорректировки <> Неопределено Тогда
			Возврат ОписаниеКорректировки.Представление;
		КонецЕсли;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

#Область ПредставленияСсылокПоказателей

Функция ПредставленияСсылокПоказателей(КорректировочныеПоказатели, ЗаполняемыеПоказатели, КодЯзыка)
	
	ПредставленияПоказателей = Новый Структура;
	ПредставленияПоказателей.Вставить("ГруппыПоказателей", Новый Соответствие); // Ключ - идентификатор показателя; Значение - идентификатор группы
	ПредставленияПоказателей.Вставить("ПредставленияОдинаковойГруппы", Новый Соответствие); // Ключ - идентификатор показателя; Значение - представление
	ПредставленияПоказателей.Вставить("ПредставленияРазныхГрупп", Новый Соответствие); // Ключ - идентификатор показателя; Значение - представление
	
	КодыПоказателей = Новый Соответствие; // Ключ - идентификатор показателя, Значение - коды групп
	Для Каждого ГруппаПоказателей Из ЗаполняемыеПоказатели.ГруппыПоказателей Цикл
		ИдентификаторГруппы = БухгалтерскаяОтчетностьБРО.ИдентификаторПоказателя(ГруппаПоказателей);
		Если ГруппаПоказателей.Показатель <> Неопределено Тогда
			ОбщегоНазначенияБПКлиентСервер.ДополнитьРазделенныйМассив(КодыПоказателей, ГруппаПоказателей.Показатель, ГруппаПоказателей.КодСтроки);
			ПредставленияПоказателей.ГруппыПоказателей.Вставить(ГруппаПоказателей.Показатель, ИдентификаторГруппы);
		Иначе
			Для Каждого Показатель Из ГруппаПоказателей.Состав Цикл
				ОбщегоНазначенияБПКлиентСервер.ДополнитьРазделенныйМассив(КодыПоказателей, Показатель, ГруппаПоказателей.КодСтроки);
				ПредставленияПоказателей.ГруппыПоказателей.Вставить(Показатель, ИдентификаторГруппы);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Показатель Из ЗаполняемыеПоказатели.Показатели Цикл
		
		ИдентификаторПоказателя = БухгалтерскаяОтчетностьБРО.ИдентификаторПоказателя(Показатель);
		ПредставленияПоказателей.ПредставленияОдинаковойГруппы.Вставить(ИдентификаторПоказателя, Показатель.Наименование);
		ПредставленияПоказателей.ПредставленияРазныхГрупп.Вставить(
			ИдентификаторПоказателя,
			ПредставлениеПоказателяКодыСтрок(Показатель, КодыПоказателей[ИдентификаторПоказателя], КодЯзыка));
		
	КонецЦикла;
	
	Возврат ПредставленияПоказателей;
	
КонецФункции

Функция ПредставлениеПоказателяКодыСтрок(Показатель, КодыСтрок, КодЯзыка)
	
	ПредставлениеКодовСтрок = СтрСоединить(КодыСтрок, НСтр("ru = ', '", КодЯзыка));
	Возврат СтрШаблон(НСтр("ru = '%1 (см. %2)'", КодЯзыка), Показатель.Наименование, ПредставлениеКодовСтрок);
	
КонецФункции

Функция ПредставлениеСсылкиПоказателя(СсылкаПоказателя, ЗаписьРасчет, ДанныеАлгоритма)
	
	// Показатель в ЗаписьРасчет (ЭтотПоказатель) ссылается на какой-то другой показатель (СсылкаПоказателя).
	// Они могут входить в одну группу или в разные.
	// От этого зависит представление.
	ЭтотПоказатель = ИдентификаторПоказателяПоЗаписьРасчет(ЗаписьРасчет);
	ГруппаЭтогоПоказателя = ДанныеАлгоритма.ПредставленияСсылокПоказателей.ГруппыПоказателей[ЭтотПоказатель];
	ГруппаСсылкиПоказателя = ДанныеАлгоритма.ПредставленияСсылокПоказателей.ГруппыПоказателей[СсылкаПоказателя];
	НаборПредставлений = ДанныеАлгоритма.ПредставленияСсылокПоказателей.ПредставленияРазныхГрупп;
	Если ГруппаЭтогоПоказателя = ГруппаСсылкиПоказателя Тогда
		НаборПредставлений = ДанныеАлгоритма.ПредставленияСсылокПоказателей.ПредставленияОдинаковойГруппы;
	КонецЕсли;
	
	Возврат НаборПредставлений[СсылкаПоказателя];
	
КонецФункции

Функция ИдентификаторПоказателяПоЗаписьРасчет(ЗаписьРасчет)
	
	ЗаписьРасчетПоказателя = ЗаписьРасчет;
	Пока Истина Цикл
		Родитель = ЗаписьРасчетПоказателя.Родитель;
		Если Родитель = Неопределено Тогда
			Возврат ЗаписьРасчетПоказателя.Показатель;
		КонецЕсли;
		ЗаписьРасчетПоказателя = Родитель;
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбщиеПрикладныеДанные

Функция БалансовыеСчетаОтложенногоНалога()
	
	СчетаОтложенногоНалога = Новый Массив;
	СчетаОтложенногоНалога.Добавить(ПланыСчетов.Хозрасчетный.ОтложенныеНалоговыеАктивы);
	СчетаОтложенногоНалога.Добавить(ПланыСчетов.Хозрасчетный.ОтложенныеНалоговыеОбязательства);
	Возврат СчетаОтложенногоНалога;

КонецФункции

Функция СчетаПрименяетсяАналитика(Счета, Аналитика)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счета",     Счета);
	Запрос.УстановитьПараметр("Аналитика", Аналитика);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХозрасчетныйВидыСубконто.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|ГДЕ
	|	ХозрасчетныйВидыСубконто.Ссылка В(&Счета)
	|	И ХозрасчетныйВидыСубконто.ВидСубконто = &Аналитика И ХозрасчетныйВидыСубконто.Суммовой";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеМетоды

Функция ОписаниеСчетовУчета(Счета, ОбязательныеСчета = Неопределено)
	
	ОписаниеСчетов = Новый СписокЗначений;
	
	КодыСчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Счета, "Код");
	Для Каждого Счет Из Счета Цикл
		ОписаниеСчетов.Добавить(Счет, КодыСчетов[Счет], ОбязательныеСчета = Неопределено Или ОбязательныеСчета[Счет] <> Неопределено);
	КонецЦикла;
	
	Возврат ОписаниеСчетов;
	
КонецФункции

Функция ПредставлениеСпискаСчетов(ОписаниеСчетовУчета)
	
	Представление = Новый Структура;
	Представление.Вставить("Количество", 0);
	Представление.Вставить("Текст",      "");
	
	СчетаГруппы = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ОписаниеСчетовУчета.ВыгрузитьЗначения(), "ЗапретитьИспользоватьВПроводках");
	
	ПредставленияОсновных = Новый Массив;
	Для Каждого ОписаниеСчета Из ОписаниеСчетовУчета Цикл
		Если СчетаГруппы[ОписаниеСчета.Значение] = Ложь Тогда
			ПредставленияОсновных.Добавить(ОписаниеСчета.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Представление.Количество = ПредставленияОсновных.Количество();
	Представление.Текст      = ОбщегоНазначенияБПКлиентСервер.ПредставлениеСписка(ПредставленияОсновных);
	Возврат Представление;
	
КонецФункции

Функция ПредставлениеСубсчетовДательныйПадеж(ПредставлениеСубсчетов, КодЯзыка)
	
	Шаблон = НСтр("ru = 'субсчету %1'", КодЯзыка);
	Если ПредставлениеСубсчетов.Количество > 1 Тогда
		Шаблон = НСтр("ru = 'субсчетам %1'", КодЯзыка);
	КонецЕсли;
	
	Возврат СтрШаблон(Шаблон, ПредставлениеСубсчетов.Текст);
	
КонецФункции

Функция ВсеСубсчета(ПредопределенныеСчета)
	Субсчета = Новый Массив;
	Для Каждого Счет Из ПредопределенныеСчета Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Субсчета, БухгалтерскийУчетПовтИсп.СчетаВИерархии(Счет));
	КонецЦикла;
	Возврат Субсчета;
КонецФункции

Функция ПредставлениеСчетовГрупп(СчетаГруппы)

	КодыСчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(СчетаГруппы, "Код");
	Представления = Новый Массив;
	Для Каждого Счет Из СчетаГруппы Цикл
		Представления.Добавить(КодыСчетов[Счет]);
	КонецЦикла;
	Возврат СтрСоединить(Представления, ",");

КонецФункции

Функция ПредставлениеСпискаЗначений(СписокЗначений, Маркированный, КодЯзыка, Лимит = 20)
	
	// Стандартное значение лимита установлено исходя из количества строк на экране,
	// так как интерактивная работа в табличном документе с текстом, не помещающимся по высоте экрана, затруднена
	
	Представления = Новый Массив;
	ОстатокЛимита = Лимит;
	Для Каждого ОписаниеЗначения Из СписокЗначений Цикл
		
		ПредставлениеЭлементаСписка = ОписаниеЗначения.Представление;
		
		ОстатокЛимита = ОстатокЛимита - 1;
		Если ОстатокЛимита = 0 Тогда
			СверхЛимита = СписокЗначений.Количество() - Лимит + 1; // последняя строка в пределах лимита - описание итога
			Если СверхЛимита > 1 Тогда
				ШаблонСверхЛимита = НСтр("ru = 'еще %1'", КодЯзыка);
				Если Маркированный Тогда
					ШаблонСверхЛимита = НСтр("ru = 'и др. (еще %1)'", КодЯзыка);
				КонецЕсли;
				ПредставлениеЭлементаСписка = СтрШаблон(ШаблонСверхЛимита, СверхЛимита);
			КонецЕсли;
		ИначеЕсли ОстатокЛимита < 0 Тогда
			Прервать;
		КонецЕсли;
		
		Если Маркированный Тогда
			ПредставлениеЗначения = СтрШаблон(" - %1", ПредставлениеЭлементаСписка);
		Иначе
			ПредставлениеЗначения = СтрШаблон("""%1""", ПредставлениеЭлементаСписка);
		КонецЕсли;
		Представления.Добавить(ПредставлениеЗначения);
		
	КонецЦикла;
	
	Если Маркированный Тогда
		Возврат СтрСоединить(Представления, Символы.ПС);
	Иначе
		Возврат ОбщегоНазначенияБПКлиентСервер.ПредставлениеСписка(Представления);
	КонецЕсли;
КонецФункции

Процедура УдалитьЗначенияИзСписка(СписокЗначений, Значение)
	
	Пока Истина Цикл
		ЭлементСписка = СписокЗначений.НайтиПоЗначению(Значение);
		Если ЭлементСписка = Неопределено Тогда
			Прервать;
		КонецЕсли;
		СписокЗначений.Удалить(ЭлементСписка);
	КонецЦикла;

КонецПроцедуры

Функция СоответствиеИзМассива(Массив)
	
	Соответствие = Новый Соответствие;
	Для Каждого Элемент Из Массив Цикл
		Соответствие.Вставить(Элемент, Истина);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция НачатьЗапрос(Процессор)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Процессор.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НачалоПериода",    Процессор.Контекст.Период.Начало);
	Запрос.УстановитьПараметр("КонецПериода",     Процессор.Контекст.Период.Конец);
	Запрос.УстановитьПараметр("КонецПериодаДата", Процессор.Контекст.Период.КонецДата);
	Запрос.УстановитьПараметр("Организации",      Процессор.Контекст.Организации);
	
	Возврат Запрос;
	
КонецФункции

Процедура ОписатьЗаполняемоеЗначениеОборотыМеждуСчетами(ЗаписьРасчет, КешПредставлений, КодЯзыка)
	
	Если ЗаписьРасчет.ТипЗаписи = "Счет" Тогда
		ЗаписьРасчет.Описание = СтрШаблон(
			НСтр("ru = 'Оборот по счету %1'", КодЯзыка),
			КешПредставлений.Счет);
	ИначеЕсли ЗаписьРасчет.ТипЗаписи = "КорСчет" Тогда
		ЗаписьРасчет.Описание = СтрШаблон(
			НСтр("ru = 'Оборот по счету %1 в корреспонденции со счетом %2'", КодЯзыка),
			КешПредставлений.Счет,
			КешПредставлений.КорСчет);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ЗаполнениеСтруктурыОтчета

// Методы для лаконичного описания структуры отчета - коллекции НовыйЗаполняемыеПоказателиРаздела

Функция НовыйКонтекстЗаполнения()
	
	Контекст = Новый Структура;
	Контекст.Вставить("Раздел", ""); // Из БухгалтерскаяОтчетностьБРО.РазделыОтчета
	Контекст.Вставить("Группа"); // Ссылка на строку ГруппыПоказателей (положительных значений при наличии ГруппаОтрицательных)
	// Есть два способа описать заполнение группы положительных значений:
	// - параллельное: объявляем группу положительных и сразу группу отрицательных; далее добавляем показатели сразу в две группы.
	//                 Позволяет описать последовательные группы, в которых вперемешку идут как включаемые в обе группы, так и в одну из них (как в ОФР)
	//                 При использовании этого способа в ГруппаОтрицательных помещается ссылка на строку ГруппыПоказателей (отрицательных значений)
	// - последовательный: отмечаем показатели, которые должны войти в группу отрицательных; 
	//                 потом в группе отрицательных отмечаем место, где нужно разместить включаемые в обе группы.
	//                 Позволяет описать группы, которые не размещены последовательно (как в ОДДС).
	//                 В этом случае в ГруппаОтрицательных помещается Соответствие (Ключ - индекс группы положительных; Значение - массив идентификаторов показателей).
	// В тех случаях, когда нет "активных" показателей, включаемых в две группы, содержит значение Неопределено.
	Контекст.Вставить("ГруппаОтрицательных");
	Контекст.Вставить("Показатель"); // Ссылка на строку Показатели
	Контекст.Вставить("Алгоритм");
	Контекст.Вставить("ОбщиеСвойстваАлгоритма", Новый Структура);
	Возврат Контекст;
	
КонецФункции

Процедура ИнициализироватьКонтекстЗаполнения(Процессор)
	Процессор.КонтекстЗаполнения = НовыйКонтекстЗаполнения();
	Процессор.КонтекстЗаполнения.Раздел = Процессор.Раздел;
КонецПроцедуры

Процедура ДобавитьГруппу(Процессор, КодСтроки, Знач Наименование = "")
	
	Если Не ЗначениеЗаполнено(Процессор.КонтекстЗаполнения) Тогда
		ИнициализироватьКонтекстЗаполнения(Процессор);
	Иначе
		
		Если Процессор.КонтекстЗаполнения.Группа <> Неопределено Тогда
			// Для завершения инициализации группы без показателей
			РедактируемыйПоказатель(Процессор);
		КонецЕсли;
		
		Если ТипЗнч(Процессор.КонтекстЗаполнения.ГруппаОтрицательных) <> Тип("Соответствие") Тогда
			Процессор.КонтекстЗаполнения.ГруппаОтрицательных = Неопределено;
		КонецЕсли;
		Процессор.КонтекстЗаполнения.Показатель = Неопределено;
		
	КонецЕсли;
	
	УстановитьНаименованиеГруппыПоКодуСтроки(Наименование, КодСтроки, Процессор);
	
	Процессор.КонтекстЗаполнения.Группа = Процессор.ЗаполняемыеПоказатели.ГруппыПоказателей.Добавить();
	Процессор.КонтекстЗаполнения.Группа.Наименование = Наименование;
	Процессор.КонтекстЗаполнения.Группа.КодСтроки    = КодСтроки;
	
КонецПроцедуры

Процедура УстановитьНаименованиеГруппыПоКодуСтроки(Наименование, КодСтроки, Процессор)
	
	Если Не ПустаяСтрока(Наименование) Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеПоКоду = Процессор.НаименованияКодовСтрок[КодСтроки];
	Если НаименованиеПоКоду = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Наименование = НаименованиеПоКоду;
	
КонецПроцедуры

Процедура УстановитьНаименованиеГруппыИзОбразца(НаименованиеОбразца, Процессор)
	
	Процессор.КонтекстЗаполнения.Группа.НаименованиеОбразца = НаименованиеОбразца;
	
КонецПроцедуры

Процедура НачатьАлгоритм(Процессор, Алгоритм)
	
	Если Не ЗначениеЗаполнено(Процессор.КонтекстЗаполнения) Тогда
		ИнициализироватьКонтекстЗаполнения(Процессор);
	КонецЕсли;
	
	Процессор.КонтекстЗаполнения.Группа     = Неопределено;
	Процессор.КонтекстЗаполнения.Показатель = Неопределено;
	Процессор.КонтекстЗаполнения.ОбщиеСвойстваАлгоритма.Очистить();
	
	Процессор.КонтекстЗаполнения.Алгоритм = Алгоритм;
	
КонецПроцедуры

Процедура УстановитьАлгоритм(Процессор, Алгоритм)
	Показатель = РедактируемыйПоказатель(Процессор);
	Показатель.Заполнение = ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.НовыйАлгоритмЗаполнения(Алгоритм);
КонецПроцедуры

Процедура ДобавитьГруппуОтрицательныхЗначений(Процессор, КодСтроки, Знач Наименование = "")
	
	ГруппаПоложительных = Процессор.КонтекстЗаполнения.Группа;
	Если Не ЗначениеЗаполнено(ГруппаПоложительных) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьНаименованиеГруппыПоКодуСтроки(Наименование, КодСтроки, Процессор);

	Если ПустаяСтрока(Наименование) Тогда
		Наименование = ГруппаПоложительных.Наименование;
	КонецЕсли;
	
	ГруппаОтрицательных = Процессор.ЗаполняемыеПоказатели.ГруппыПоказателей.Добавить();
	ГруппаОтрицательных.Наименование = Наименование;
	ГруппаОтрицательных.КодСтроки    = КодСтроки;
	
	Процессор.КонтекстЗаполнения.ГруппаОтрицательных = ГруппаОтрицательных;
	
КонецПроцедуры

Процедура ДобавитьПоказательОтрицательногоЗначения(Процессор, Показатель)
	
	Процессор.КонтекстЗаполнения.Показатель = БухгалтерскаяОтчетностьБРО.ИдентификаторПоказателя(Показатель);
	Процессор.КонтекстЗаполнения.Группа.Состав.Добавить(Процессор.КонтекстЗаполнения.Показатель);
	
КонецПроцедуры

Функция НачатьДобавлениеПоказателя(Процессор, Наименование)
	
	Процессор.КонтекстЗаполнения.Показатель = ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.ДобавитьПоказатель(
		Процессор.ЗаполняемыеПоказатели,
		Наименование,
		Процессор.КонтекстЗаполнения.Алгоритм);
		
	УстановитьОбщийСворачиваемыйДенежныйПоток(
		Процессор.КонтекстЗаполнения.Показатель.Заполнение,
		Процессор.КонтекстЗаполнения.Алгоритм,
		Процессор.КонтекстЗаполнения.ОбщиеСвойстваАлгоритма);
		
	Возврат Процессор.КонтекстЗаполнения.Показатель;
	
КонецФункции

Функция ДобавитьПоказатель(Процессор, Содержимое)
	
	Показатель = НачатьДобавлениеПоказателя(Процессор, Строка(Содержимое));
	
	Если ТипЗнч(Содержимое) <> Тип("Строка") Тогда
		ДополнитьОтбор(Процессор, Содержимое);
	КонецЕсли;
	
	ИдентификаторПоказателя = БухгалтерскаяОтчетностьБРО.ИдентификаторПоказателя(Показатель);
	
	Если Процессор.КонтекстЗаполнения.Группа <> Неопределено Тогда
		
		Процессор.КонтекстЗаполнения.Группа.Состав.Добавить(ИдентификаторПоказателя);
	
		Если Процессор.КонтекстЗаполнения.ГруппаОтрицательных <> Неопределено Тогда
			
			ТипГруппаОтрицательных = ТипЗнч(Процессор.КонтекстЗаполнения.ГруппаОтрицательных);
			Если ТипГруппаОтрицательных = Тип("Соответствие") Тогда
				ОбъявитьПоказательГруппыПоложительных(Процессор, ИдентификаторПоказателя, Ложь);
			Иначе
				Процессор.КонтекстЗаполнения.ГруппаОтрицательных.Состав.Добавить(ИдентификаторПоказателя);
				УстановитьЗачетПоказателейПрочиеДоходыРасходы(Процессор, "Показатель");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Показатель;
	
КонецФункции

Процедура ДобавитьПоказательРасходы(Процессор, Содержимое)
	
	ГруппаРасходы = Процессор.КонтекстЗаполнения.ГруппаОтрицательных;
	Процессор.КонтекстЗаполнения.ГруппаОтрицательных = Неопределено;
	
	ГруппаДоходы = Процессор.КонтекстЗаполнения.Группа;
	Процессор.КонтекстЗаполнения.Группа = ГруппаРасходы;
	
	ДобавитьПоказатель(Процессор, Содержимое);
	
	Процессор.КонтекстЗаполнения.Группа              = ГруппаДоходы;
	Процессор.КонтекстЗаполнения.ГруппаОтрицательных = ГруппаРасходы;
	
КонецПроцедуры

Процедура ДополнитьОтбор(Процессор, ЗначениеОтбора)
	
	Показатель = РедактируемыйПоказатель(Процессор);
	ДополнитьОтборАлгоритма(Показатель.Заполнение, ЗначениеОтбора);
	
КонецПроцедуры

Процедура ДополнитьОтборАлгоритма(Заполнение, ЗначениеОтбора)
	
	Если Заполнение.Идентификатор = ИдентификаторАлгоритмаПрочиеДоходыРасходы() Тогда
		ДобавитьОтборПрочиеДоходыРасходы(Заполнение, ЗначениеОтбора);
	ИначеЕсли Заполнение.Идентификатор = ИдентификаторАлгоритмаНалоги() Тогда
		ДобавитьОтборНалогНаПрибыль(Заполнение, ЗначениеОтбора);
	ИначеЕсли Заполнение.Идентификатор = ИдентификаторАлгоритмаРезультатПереоценкиВнеоборотныхАктивов() Тогда
		ДобавитьОтборРезультатПереоценкиВнеоборотныхАктивов(Заполнение, ЗначениеОтбора);
	ИначеЕсли Заполнение.Идентификатор = ИдентификаторАлгоритмаДенежныеПотоки() Тогда
		ДобавитьОтборДенежныеПотоки(Заполнение, ЗначениеОтбора);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОсновнойПоказатель(Процессор, НаименованиеПоказателя)
	
	Показатель = ДобавитьПоказатель(Процессор, НаименованиеПоказателя);
	
	Показатель.Заполнение.Отбор.Очистить();
	Показатель.Вывод = Ложь;
	
КонецПроцедуры

Функция РедактируемыйПоказатель(Процессор)
	
	Показатель = Процессор.КонтекстЗаполнения.Показатель;
	
	Если Не ЗначениеЗаполнено(Показатель) Тогда
		
		Показатель = НачатьДобавлениеПоказателя(Процессор, Процессор.КонтекстЗаполнения.Группа.Наименование);
		
		Процессор.КонтекстЗаполнения.Группа.Наименование = ""; // Наименование хранится в показателе
		Процессор.КонтекстЗаполнения.Группа.Показатель = БухгалтерскаяОтчетностьБРО.ИдентификаторПоказателя(Показатель);
		Процессор.КонтекстЗаполнения.Группа.Состав.Очистить();
		
	КонецЕсли;
	
	Возврат Показатель;
	
КонецФункции

Функция ГруппаПоложительных(Процессор, РазрешеноНачинатьГруппуПоложительных = Ложь)
	
	ИдентификаторГруппы = Процессор.ЗаполняемыеПоказатели.ГруппыПоказателей.Индекс(Процессор.КонтекстЗаполнения.Группа);
	ГруппаПоложительных = Процессор.КонтекстЗаполнения.ГруппаОтрицательных[ИдентификаторГруппы];
	Если ГруппаПоложительных <> Неопределено Тогда
		Возврат ГруппаПоложительных;
	КонецЕсли;
		
	Если Не РазрешеноНачинатьГруппуПоложительных Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ГруппаПоложительных = Новый Массив;
	Процессор.КонтекстЗаполнения.ГруппаОтрицательных.Вставить(ИдентификаторГруппы, ГруппаПоложительных);
	
	Возврат ГруппаПоложительных;
	
КонецФункции

Процедура ОбъявитьПоказательГруппыПоложительных(Процессор, ИдентификаторПоказателя, РазрешеноНачинатьГруппуПоложительных)
	
	ГруппаПоложительных = ГруппаПоложительных(Процессор);
	Если ГруппаПоложительных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаПоложительных.Добавить(ИдентификаторПоказателя);
	
КонецПроцедуры

Процедура НачатьДобавлениеПоказателейПоложительныхЗначений(Процессор)
	
	Если Процессор.КонтекстЗаполнения.ГруппаОтрицательных = Неопределено Тогда
		Процессор.КонтекстЗаполнения.ГруппаОтрицательных = Новый Соответствие;
	ИначеЕсли ТипЗнч(Процессор.КонтекстЗаполнения.ГруппаОтрицательных) <> Тип("Соответствие") Тогда
		// Не допускаем сочетание параллельного и последовательного порядка заполнения
		Возврат;
	КонецЕсли;
	
	ГруппаПоложительных(Процессор, Истина);
	
КонецПроцедуры

Процедура ДополнитьГруппуОтрицательныхЗначений(Процессор)
	
	Если ТипЗнч(Процессор.КонтекстЗаполнения.ГруппаОтрицательных) <> Тип("Соответствие") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ГруппаПоложительных Из Процессор.КонтекстЗаполнения.ГруппаОтрицательных Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Процессор.КонтекстЗаполнения.Группа.Состав, ГруппаПоложительных.Значение);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
