#Область ПрограммныйИнтерфейс

Функция ЗаголовокПодсказкиСамозанятыйНеВключеныДоговоры() Экспорт
	
	Заголовок = Новый ФорматированнаяСтрока(
		Новый ФорматированнаяСтрока(
			НСтр("ru = 'Чтобы загружать чеки НПД в документах поступления и автоматически проверять статус самозанятого, включите'")),
		Символы.ПС,
		Новый ФорматированнаяСтрока(НСтр("ru = 'Учет по договорам'"), , , , ПерейтиКОпцииУчетПоДоговорам()));
	
	Возврат Заголовок;
	
КонецФункции

Функция ПерейтиКОпцииУчетПоДоговорам() Экспорт
	
	Возврат "ОпцияУчетПоДоговорам";
	
КонецФункции

// Возвращает наименование договора по умолчанию, присваемое при программном создании без заполнения реквизитов
//
// Возвращаемое значение:
//  Строка - наименование договора "Без договора"
//
Функция НаименованиеБезДоговора() Экспорт
	
	Возврат НСтр("ru = 'Без договора'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	
КонецФункции

#КонецОбласти