#Область СлужебныйПрограммныйИнтерфейс

Функция СтатусыОригиналовДокументов(Знач Ссылка, Знач СчетФактура) Экспорт
	
	ДокументыДляПолученияСтатуса = Новый Массив;
	ДокументыДляПолученияСтатуса.Добавить(Ссылка);
	ДокументыДляПолученияСтатуса.Добавить(СчетФактура);
	
	КоллекцияСтатусов = РегистрыСведений.СтатусыДокументов.ПолучитьСтатусыДокументов(ДокументыДляПолученияСтатуса);
	
	СтатусыОригиналовДокументов = Новый Соответствие;
	СтатусПоступления  = КоллекцияСтатусов[Ссылка].Статус = Перечисления.СтатусыДокументовПоступления.ОригиналПолучен;
	СтатусСчетаФактуры = КоллекцияСтатусов[СчетФактура].Статус = Перечисления.СтатусыДокументовПоступления.ОригиналПолучен;
	СтатусЧекаНПД = КоллекцияСтатусов[Ссылка].СтатусЧекаНПД = Перечисления.СтатусыЧековНПД.Получен;
	СтатусыОригиналовДокументов.Вставить(Ссылка, СтатусПоступления);
	СтатусыОригиналовДокументов.Вставить(СчетФактура, СтатусСчетаФактуры);
	СтатусыОригиналовДокументов.Вставить(ЧекиНПДКлиентСервер.ИмяСтатусаЧекаНПД() , СтатусЧекаНПД);
	
	Возврат СтатусыОригиналовДокументов;
	
КонецФункции

Процедура ЗаписатьСтатусДокументаНаСервере(ДокументСсылка, ОригиналПолучен) Экспорт
	
	СтатусыДокумента = РегистрыСведений.СтатусыДокументов.НовыеСтатусыДокумента();
	СтатусыДокумента.Статус = Документы.ПоступлениеТоваровУслуг.СтатусДокументаПеречислением(ОригиналПолучен);
	РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокумента(ДокументСсылка, СтатусыДокумента);
	
КонецПроцедуры

Функция СкладыНТТ() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Склад
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.НеавтоматизированнаяТорговаяТочка)");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад");
	
КонецФункции

Функция ОписаниеТипаРеквизитаДокументАванса() Экспорт
	
	Возврат Метаданные.Документы.ПоступлениеТоваровУслуг.ТабличныеЧасти.ЗачетАвансов.Реквизиты.ДокументАванса.Тип;
	
КонецФункции

#КонецОбласти