
#Область ПрограммныйИнтерфейс

// Позволяет модифицировать параметры блокировки сеансов.
//
// Параметры:
//  Менеджер - Строка - представление менеджера объекта, например ДокументМенеджер
//  ИмяОбъекта - Строка - имя объекта, как задан в конфигураторе, например "ВозвратТоваровОтПокупателя"
//  ВидФормы - Строка - имя стандартной формы, например, ФормаСписка, ФормаЭлемента
//  ДоступноВМобильномКлиенте - Булево - установить Ложь, если форма доступна только в версии для компьютера
//
Процедура ПриОпределенииДоступностиФормы(Менеджер, ИмяОбъекта, ВидФормы, ДоступноВМобильномКлиенте) Экспорт
	
КонецПроцедуры

#КонецОбласти


