#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	БУ = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
	ВестиСводныйУчетРасчетовСРаботниками = БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций, "ВидСубконто") = Неопределено;
	Если ЭтотОбъект.Значение = ВестиСводныйУчетРасчетовСРаботниками Тогда
		Отказ = Истина;
	ИначеЕсли ЭтотОбъект.Значение = Константы.ВедетсяУчетРасчетовПоЗарплатеСводно.Получить() Тогда
		Константы.ВедетсяУчетРасчетовПоЗарплатеСводно.Установить(НЕ ЭтотОбъект.Значение);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли