
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Обработки.ПанелиПростойИнтерфейс.ЗадатьВидимостьЭлементовФормы(ЭтотОбъект);
	
	МобильныйКлиентАдаптацияФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УчетнаяПолитика(Команда)
	
	ОткрытьФорму("РегистрСведений.УчетнаяПолитика.ФормаЗаписи", ПараметрыФормыУчетнаяПолитика(), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УставныйКапитал(Команда)
	
	ОткрытьФорму("Документ.ФормированиеУставногоКапитала.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подразделения(Команда)
	
	ОткрытьФорму("Справочник.ПодразделенияОрганизаций.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацииВНалоговыхОрганах(Команда)
	
	ОткрытьФорму("Справочник.РегистрацииВНалоговомОргане.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Валюты(Команда)
	
	ОткрытьФорму("Справочник.Валюты.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыОплат(Команда)
	
	ОткрытьФорму("Справочник.ВидыОплатОрганизаций.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскиеСчета(Команда)
	
	ПараметрыФормы = Новый Структура("БанковскиеСчетаОрганизаций", Истина);
	ОткрытьФорму("Справочник.БанковскиеСчета.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛимитОстаткаКассы(Команда)
	
	ОткрытьФорму("РегистрСведений.ЛимитОстаткаКассыОрганизаций.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Склады(Команда)
	
	ОткрытьФорму("Справочник.Склады.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыЦенНоменклатуры(Команда)
	
	ОткрытьФорму("Справочник.ТипыЦенНоменклатуры.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыНоменклатуры(Команда)
	
	ОткрытьФорму("Справочник.ВидыНоменклатуры.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЗарплаты(Команда)
	
	ОткрытьФорму("ОбщаяФорма.НастройкиЗарплаты", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛица(Команда)
	
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатныеПроекты(Команда)
	
	ОткрытьФорму("Справочник.ЗарплатныеПроекты.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Должности(Команда)
	
	ОткрытьФорму("Справочник.Должности.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикиРаботы(Команда)

	ОткрытьФорму("Справочник.Календари.Форма.ФормаСпискаПростая", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Сотрудники(Команда)
	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПланСчетов(Команда)
	
	ОткрытьФорму("ПланСчетов.Хозрасчетный.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатурныеГруппы(Команда)
	
	ОткрытьФорму("Справочник.НоменклатурныеГруппы.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьиЗатрат(Команда)
	
	ОткрытьФорму("Справочник.СтатьиЗатрат.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочиеДоходыИРасходы(Команда)
	
	ОткрытьФорму("Справочник.ПрочиеДоходыИРасходы.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБудущихПериодов(Команда)
	
	ОткрытьФорму("Справочник.ДоходыБудущихПериодов.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыБудущихПериодов(Команда)
	
	ОткрытьФорму("Справочник.РасходыБудущихПериодов.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыСтроительства(Команда)
	
	ОткрытьФорму("Справочник.ОбъектыСтроительства.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтовОС(Команда)
	
	ОткрытьФорму("Справочник.ВидыРемонтовОС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщероссийскийКлассификаторОсновныхФондов(Команда)
	
	ОткрытьФорму("Справочник.ОбщероссийскийКлассификаторОсновныхФондов.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеСредства(Команда)
	
	ОткрытьФорму("Справочник.ТранспортныеСредства.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Банки(Команда)
	
	ОткрытьФорму("Справочник.Банки.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьиДвиженияДенежныхСредств(Команда)
	
	ОткрытьФорму("Справочник.СтатьиДвиженияДенежныхСредств.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДенежныеДокументы(Команда)
	
	ОткрытьФорму("Справочник.ДенежныеДокументы.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ГосударственныеКонтракты(Команда)
	
	ОткрытьФорму("Справочник.ГосКонтракты.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПараметрыФормыУчетнаяПолитика()
	
	Возврат РегистрыСведений.УчетнаяПолитика.ПараметрыОткрытияФормыДляКомандыУчетнаяПолитика();
	
КонецФункции

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаОрганизация,
		"УчетнаяПолитика,УставныйКапитал,Подразделения,РегистрацииВНалоговыхОрганах");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаДеньги,
		"Валюты,ВидыОплат,БанковскиеСчета,ЛимитОстаткаКассы");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаТовары,
		"Склады,ВидыНоменклатуры");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаСотрудники);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаБухгалтерия,
		"ПланСчетов,НастройкаПланаСчетов,НоменклатурныеГруппы,СтатьиЗатрат,ПрочиеДоходыИРасходы,
		|ДоходыБудущихПериодов,РасходыБудущихПериодов");
	
КонецПроцедуры

#КонецОбласти
