#Область СлужебныеПроцедурыИФункции

Функция ФормыСоздаваемогоДокумента(ТипДокумента) Экспорт
	
	Если ТипДокумента = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		Возврат Документы.СчетФактураВыданный.ПолучитьСоответствиеВидовСчетаФактурыФормам();
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
		Возврат Документы.СчетФактураПолученный.ПолучитьСоответствиеВидовСчетаФактурыФормам();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ОписаниеАналитикиУчета(Знач ДанныеСтроки, ПараметрыОбъекта, Знач ЗаполнятьНДС, Знач ЗаполнятьНДФЛ, Знач ПрименяетсяМалоценка) Экспорт 
	
	Если ПараметрыОбъекта.Направление = Перечисления.НаправленияРаспознанногоДокумента.Исходящий Тогда
		// Реализация товаров услуг
	
		Если ДанныеСтроки.Услуга Тогда
			
			Результат = Новый Структура;
			Результат.Вставить("АналитикаУчета",          "");
			Результат.Вставить("АналитикаУчетаЗаполнена", Истина);

			ВидСубконтоНГ = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы;
			
			// Счет доходов - всегда
		    Если Не ЗначениеЗаполнено(ДанныеСтроки.СчетДоходов) Тогда
		    	Результат.АналитикаУчета 	      = ОбщегоНазначенияБПКлиентСервер.ПредставлениеНезаполненногоЗначения();
				Результат.АналитикаУчетаЗаполнена = Ложь;
		    Иначе
				СвойстваСчета			 = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ДанныеСтроки.СчетДоходов);
				Результат.АналитикаУчета = "" + СвойстваСчета.Код;
				
				Если СвойстваСчета.КоличествоСубконто >= 1 Тогда
					
					Если ЗначениеЗаполнено(ДанныеСтроки.Субконто) Тогда
						ТипСубконто = ТипЗнч(ДанныеСтроки.Субконто);
						ПредставлениеСубконто = "";
						
						Если Справочники.ТипВсеСсылки().СодержитТип(ТипСубконто) Тогда
							ПредставлениеСубконто = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСтроки.Субконто, "Представление");
						ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипСубконто) Тогда
							ПредставлениеСубконто = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСтроки.Субконто, "Представление");
						Иначе
							ПредставлениеСубконто = Строка(ДанныеСтроки.Субконто);
						КонецЕсли;
						Если НЕ (СвойстваСчета.ВидСубконто1 = ВидСубконтоНГ И БухгалтерскийУчетВызовСервераПовтИсп.ИспользоватьОднуНоменклатурнуюГруппу()) Тогда
							Результат.АналитикаУчета = Результат.АналитикаУчета + ", " + ПредставлениеСубконто;
						КонецЕсли;
					Иначе
						Результат.АналитикаУчета = Результат.АналитикаУчета + ", <...>";
						
						// Заполнение субконто обязательно для ИП, когда на счете есть субконто "Номенклатурные группы".
						Если ПараметрыОбъекта.ПлательщикНДФЛ
							И (СвойстваСчета.ВидСубконто1 = ВидСубконтоНГ
								ИЛИ СвойстваСчета.ВидСубконто2 = ВидСубконтоНГ
								ИЛИ СвойстваСчета.ВидСубконто3 = ВидСубконтоНГ) Тогда
							Результат.АналитикаУчетаЗаполнена = Ложь;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
		    КонецЕсли;
			
		    // Счет расходов
		    Если ЗначениеЗаполнено(ДанныеСтроки.СчетРасходов) Тогда
				СвойстваСчета			 = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ДанныеСтроки.СчетРасходов);
				Результат.АналитикаУчета = Результат.АналитикаУчета + ", " + СвойстваСчета.Код;
		    Иначе
		    	Если ПараметрыОбъекта.ТребуетсяСчетРасходовПоОказаниюУслуг Тогда
					Результат.АналитикаУчетаЗаполнена = Ложь;
				КонецЕсли;
		    КонецЕсли;

			Если Не ПараметрыОбъекта.ДокументБезНДС Тогда
				Если ЗначениеЗаполнено(ДанныеСтроки.СчетУчетаНДСПоРеализации) Тогда
					СвойстваСчета			 = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ДанныеСтроки.СчетУчетаНДСПоРеализации);
					Результат.АналитикаУчета = Результат.АналитикаУчета + ", " + СвойстваСчета.Код;
				Иначе
					Если ДанныеСтроки.СуммаНДС <> 0 Тогда
						Результат.АналитикаУчета          = Результат.АналитикаУчета + ", <...>";
						Результат.АналитикаУчетаЗаполнена = Ложь;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

			Возврат Результат;
			
		Иначе
			
			Результат = Новый Структура;
			Результат.Вставить("АналитикаУчета",          "");
			Результат.Вставить("СчетУчетаЗабалансовый", Ложь);
			Результат.Вставить("СчетУчетаПартионный", Ложь);
			Результат.Вставить("АналитикаУчетаЗаполнена", Истина);
			
			ВидСубконтоНГ = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы;
			
			// СчетУчета
			Если ЗначениеЗаполнено(ДанныеСтроки.СчетУчета) Тогда
				СвойстваСчета 			 = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ДанныеСтроки.СчетУчета);
				Результат.СчетУчетаЗабалансовый = СвойстваСчета.Забалансовый;
				Результат.СчетУчетаПартионный = СвойстваСчета.ВидСубконто1 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии
					ИЛИ СвойстваСчета.ВидСубконто2 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии
					ИЛИ СвойстваСчета.ВидСубконто3 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии;
				Результат.АналитикаУчета = СвойстваСчета.Код;
			Иначе
				Результат.АналитикаУчета           = ОбщегоНазначенияБПКлиентСервер.ПредставлениеНезаполненногоЗначения();
				Результат.АналитикаУчетаЗаполнена  = Ложь;
			КонецЕсли;
			
			// Счета дохода, расхода и НДС учитываются, если счет учета товара незабалансовый
			Если НЕ Результат.СчетУчетаЗабалансовый Тогда
				Если ЗначениеЗаполнено(ДанныеСтроки.СчетДоходов) Тогда
					
					СвойстваСчета 		     = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ДанныеСтроки.СчетДоходов);
					Результат.АналитикаУчета = Результат.АналитикаУчета + ", " + СвойстваСчета.Код;
					
					Если СвойстваСчета.КоличествоСубконто >= 1 Тогда
						Если ЗначениеЗаполнено(ДанныеСтроки.Субконто) Тогда
							ТипСубконто = ТипЗнч(ДанныеСтроки.Субконто);
							ПредставлениеСубконто = "";
							
							Если Справочники.ТипВсеСсылки().СодержитТип(ТипСубконто) Тогда
								ПредставлениеСубконто = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСтроки.Субконто, "Представление");
							ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипСубконто) Тогда
								ПредставлениеСубконто = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСтроки.Субконто, "Представление");
							Иначе
								ПредставлениеСубконто = Строка(ДанныеСтроки.Субконто);
							КонецЕсли;
							Если НЕ (СвойстваСчета.ВидСубконто1 = ВидСубконтоНГ И БухгалтерскийУчетВызовСервераПовтИсп.ИспользоватьОднуНоменклатурнуюГруппу()) Тогда
								Результат.АналитикаУчета = Результат.АналитикаУчета + ", " + ПредставлениеСубконто;
							КонецЕсли;
						Иначе
							Результат.АналитикаУчета = Результат.АналитикаУчета + ", <...>";
							
							// Заполнение субконто обязательно для ИП, когда на счете есть субконто "Номенклатурные группы".
							Если ЗаполнятьНДФЛ
								И (СвойстваСчета.ВидСубконто1 = ВидСубконтоНГ
									ИЛИ СвойстваСчета.ВидСубконто2 = ВидСубконтоНГ
									ИЛИ СвойстваСчета.ВидСубконто3 = ВидСубконтоНГ) Тогда
								Результат.АналитикаУчетаЗаполнена = Ложь;
							КонецЕсли;
							
						КонецЕсли;
					КонецЕсли;
			    	
			    Иначе
			    	Результат.АналитикаУчета          = Результат.АналитикаУчета + ", <...>";
					Результат.АналитикаУчетаЗаполнена = Ложь;
			    КонецЕсли;
				
			    Если ЗначениеЗаполнено(ДанныеСтроки.СчетРасходов) Тогда
			    	СвойстваСчета 		= БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ДанныеСтроки.СчетРасходов);
			    	Результат.АналитикаУчета = Результат.АналитикаУчета + ", " + СвойстваСчета.Код;
			    Иначе
			    	Результат.АналитикаУчета          = Результат.АналитикаУчета + ", <...>";
					Результат.АналитикаУчетаЗаполнена = Ложь;
			    КонецЕсли;
				
				Если ЗаполнятьНДС Тогда
					Если ЗначениеЗаполнено(ДанныеСтроки.СчетУчетаНДСПоРеализации) Тогда
						СвойстваСчета 		     = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ДанныеСтроки.СчетУчетаНДСПоРеализации);
						Результат.АналитикаУчета = Результат.АналитикаУчета + ", " + СвойстваСчета.Код;
					Иначе
						Если ДанныеСтроки.СуммаНДС <> 0 Тогда
							Результат.АналитикаУчета          = Результат.АналитикаУчета + ", <...>";
							Результат.АналитикаУчетаЗаполнена = Ложь;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;

			Возврат Результат;
			
		КонецЕсли;
		
	Иначе
		// Поступление товаров услуг
		
		Малоценка = ПрименяетсяМалоценка И (ДанныеСтроки.СчетУчета = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПриобретениеМалоценногоОборудованияИЗапасов"));
		
		Если ДанныеСтроки.Услуга Или Малоценка Тогда
			
			АналитикаУчетаТекст 	= "";
			АналитикаУчетаЗаполнена = Истина;

			ИспользоватьОднуНоменклатурнуюГруппу = БухгалтерскийУчетВызовСервераПовтИсп.ИспользоватьОднуНоменклатурнуюГруппу();
			СтроковыеПредставленияСубконто = Новый Структура();
			
			Если ДанныеСтроки.Свойство("СчетЗатрат") Тогда
				Если ЗначениеЗаполнено(ДанныеСтроки.СчетЗатрат) Тогда
					СвойстваСчета 		= БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ДанныеСтроки.СчетЗатрат);
					
					АналитикаУчетаТекст = СвойстваСчета.Код;
					
					Если СвойстваСчета.УчетПоПодразделениям Тогда
						Если ЗначениеЗаполнено(ДанныеСтроки.ПодразделениеЗатрат) Тогда
							ТекстСтроки 			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСтроки.ПодразделениеЗатрат, "Наименование");
							АналитикаУчетаТекст 	= АналитикаУчетаТекст + ", " + ТекстСтроки;
						Иначе
							АналитикаУчетаТекст 	= АналитикаУчетаТекст + ", <...>";
						КонецЕсли;
					КонецЕсли;
					
					Для Н = 1 По СвойстваСчета.КоличествоСубконто Цикл
						ЗначениеСубконто = ДанныеСтроки["Субконто" + Н];
						Если ЗначениеЗаполнено(ЗначениеСубконто) Тогда
							ПредставлениеСубконто = "";
							ТипСубконто = ТипЗнч(ЗначениеСубконто);
							Если ИспользоватьОднуНоменклатурнуюГруппу И ТипСубконто = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
								Продолжить;
							ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипСубконто) Тогда
								ПредставлениеСубконто = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеСубконто, "Представление");
							ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипСубконто) Тогда
								ПредставлениеСубконто = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеСубконто, "Представление");
							Иначе
								ПредставлениеСубконто = Строка(ЗначениеСубконто);
							КонецЕсли;
							
							СтроковыеПредставленияСубконто.Вставить("ЗначениеСубконто" + Н, ЗначениеСубконто);
							СтроковыеПредставленияСубконто.Вставить("ПредставлениеСубконто" + Н, ПредставлениеСубконто);
							
							АналитикаУчетаТекст = АналитикаУчетаТекст + ", " + ПредставлениеСубконто;
						Иначе
							АналитикаУчетаТекст = АналитикаУчетаТекст + ", <...>";
						КонецЕсли;
					КонецЦикла;
					
				Иначе
					АналитикаУчетаТекст 	= АналитикаУчетаТекст + ", <...>";
					АналитикаУчетаЗаполнена = Ложь;
				КонецЕсли;
			КонецЕсли;

			// СчетУчетаНДС - до затрат НУ, т.к. аналитика НУ чаще всего совпадает с БУ
			Если ДанныеСтроки.Свойство("СчетУчетаНДС") Тогда
				Если ПараметрыОбъекта.НДСВключенВСтоимость
					И НЕ ПараметрыОбъекта.УчетАгентскогоНДС
					И НЕ ПараметрыОбъекта.РаздельныйУчетНДСНаСчете19 Тогда
					// в этих случаях счет учета НДС не показывается
				Иначе
					Если ЗначениеЗаполнено(ДанныеСтроки.СчетУчетаНДС) Тогда
						СвойстваСчета 		= БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ДанныеСтроки.СчетУчетаНДС);
						АналитикаУчетаТекст = АналитикаУчетаТекст + ", " + СвойстваСчета.Код;
					Иначе
						Если ДанныеСтроки.СуммаНДС <> 0 Тогда
							АналитикаУчетаТекст 	= АналитикаУчетаТекст + ", <...>";
							АналитикаУчетаЗаполнена = Ложь;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ДанныеСтроки.Свойство("СпособУчетаНДС") Тогда
				Если ПараметрыОбъекта.РаздельныйУчетНДСНаСчете19 Тогда
					Если ЗначениеЗаполнено(ДанныеСтроки.СпособУчетаНДС) Тогда
						АналитикаУчетаТекст = АналитикаУчетаТекст + ", " + Строка(ДанныеСтроки.СпособУчетаНДС);
					Иначе
						Если ДанныеСтроки.СуммаНДС <> 0 Тогда
							АналитикаУчетаТекст 	= АналитикаУчетаТекст + ", <...>";
							АналитикаУчетаЗаполнена = Ложь;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			// СчетУчетаЗатратНУ
			Если ДанныеСтроки.Свойство("СчетЗатратНУ") Тогда
				Если ПараметрыОбъекта.ПлательщикНалогаНаПрибыль Тогда
					Если ЗначениеЗаполнено(ДанныеСтроки.СчетЗатратНУ) Тогда
						СвойстваСчетаНУ 	= БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ДанныеСтроки.СчетЗатратНУ);
						
						АналитикаУчетаТекст = АналитикаУчетаТекст + ", " + СвойстваСчетаНУ.Код;
						
						Для Н = 1 По СвойстваСчетаНУ.КоличествоСубконто Цикл
							
							ЗначениеСубконтоНУ 	= ДанныеСтроки["СубконтоНУ" + Н];
							
							Если ЗначениеЗаполнено(ЗначениеСубконтоНУ) Тогда

								ПредставлениеСубконтоНУ = "";
								
								// Если совпадает с субконто БУ, то представление выводим как для БУ.
								ЗначениеСубконтоБУ = Неопределено;
								Если СтроковыеПредставленияСубконто.Свойство("ЗначениеСубконто" + Н, ЗначениеСубконтоБУ) Тогда
									Если ЗначениеСубконтоБУ = ЗначениеСубконтоНУ Тогда
										ПредставлениеСубконтоНУ = СтроковыеПредставленияСубконто["ПредставлениеСубконто" + Н];
									КонецЕсли;
								КонецЕсли;
								
								Если ПустаяСтрока(ПредставлениеСубконтоНУ) Тогда
									ТипСубконто = ТипЗнч(ЗначениеСубконтоНУ);
									Если ИспользоватьОднуНоменклатурнуюГруппу И ТипСубконто = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
										Продолжить;
									ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипСубконто) Тогда
										ПредставлениеСубконтоНУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеСубконтоНУ, "Представление");
									ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипСубконто) Тогда
										ПредставлениеСубконтоНУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеСубконтоНУ, "Представление");
									Иначе
										ПредставлениеСубконтоНУ = Строка(ЗначениеСубконтоНУ);
									КонецЕсли;
								КонецЕсли;
							
								АналитикаУчетаТекст = АналитикаУчетаТекст + ", " + ПредставлениеСубконтоНУ;
							
							Иначе
								АналитикаУчетаТекст = АналитикаУчетаТекст + ", <...>";
							КонецЕсли;
							
						КонецЦикла;

					Иначе
						АналитикаУчетаТекст 	= АналитикаУчетаТекст + ", <...>";
						АналитикаУчетаЗаполнена = Ложь;
					КонецЕсли;

				КонецЕсли;
			КонецЕсли;

			// ОтражениеВУСН
			Если НЕ ПараметрыОбъекта.ПрименениеУСН
				ИЛИ ПараметрыОбъекта.ПрименениеУСНДоходы Тогда	
				// в этих случаях ОтражениеВУСН не требуется
			Иначе
				Если ЗначениеЗаполнено(ДанныеСтроки.ОтражениеВУСН) Тогда
				    АналитикаУчетаТекст 	= АналитикаУчетаТекст + ", " + Строка(ДанныеСтроки.ОтражениеВУСН);
				Иначе
					АналитикаУчетаТекст 	= АналитикаУчетаТекст + ", <...>";
					АналитикаУчетаЗаполнена = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			Результат = Новый Структура;
			Результат.Вставить("АналитикаУчета", АналитикаУчетаТекст);
			Результат.Вставить("АналитикаУчетаЗаполнена", АналитикаУчетаЗаполнена);
			
			Возврат Результат;
		
		Иначе
			
			Результат = Новый Структура;
			Результат.Вставить("АналитикаУчета",          "");
			Результат.Вставить("АналитикаУчетаЗаполнена", Истина);
			
			// СчетУчета
			Если ЗначениеЗаполнено(ДанныеСтроки.СчетУчета) Тогда
				СвойстваСчета 			 = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ДанныеСтроки.СчетУчета);
				Результат.АналитикаУчета = СвойстваСчета.Код;
			Иначе
				Результат.АналитикаУчета           = ОбщегоНазначенияБПКлиентСервер.ПредставлениеНезаполненногоЗначения();
				Результат.АналитикаУчетаЗаполнена  = Ложь;
			КонецЕсли;
			
			// СчетУчетаНДС
			Если ЗначениеЗаполнено(ДанныеСтроки.СчетУчетаНДС) Тогда
				СвойстваСчета 			 = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ДанныеСтроки.СчетУчетаНДС);
				Результат.АналитикаУчета = Результат.АналитикаУчета + ", " + СвойстваСчета.Код;
			Иначе
				Результат.АналитикаУчета           = Результат.АналитикаУчета + ", <...>";
				Результат.АналитикаУчетаЗаполнена  = Ложь;
			КонецЕсли;
			
			Возврат Результат;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти