#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ПолучитьФункциональнуюОпцию("ВедетсяУчетНФО") Тогда
	
		НепроверяемыеРеквизиты = Новый Массив;
		НепроверяемыеРеквизиты.Добавить("КодВидаОперацииНФО");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);

	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	
	// ВидСтатьиДДС в значениях заполнения может иметь тип ФиксированныйМассив, если в форме выбора установлен отбор "ВСписке".
	// Например, Доход и ДоходРасход. В таком случае создавать новый элемент нужно с типом Доход.
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ВидСтатьиДДС") 
			И ТипЗнч(ДанныеЗаполнения.ВидСтатьиДДС) = Тип("ФиксированныйМассив") Тогда
			
			ВидыСтатей = ДанныеЗаполнения.ВидСтатьиДДС;
			
			Если ВидыСтатей.Найти(Перечисления.ВидСтатьиДвиженияДенег.Доход) <> Неопределено Тогда
				ВидСтатьиДДС = Перечисления.ВидСтатьиДвиженияДенег.Доход;
				
			ИначеЕсли ВидыСтатей.Найти(Перечисления.ВидСтатьиДвиженияДенег.Расход) <> Неопределено Тогда
				ВидСтатьиДДС = Перечисления.ВидСтатьиДвиженияДенег.Расход;
				
			Иначе
				ВидСтатьиДДС = Перечисления.ВидСтатьиДвиженияДенег.ДоходРасход;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

