#Область ПеременныеФормы

&НаКлиенте
Перем УИДЗамера;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнтеграцияВИнформационнойБазеВключена = ИнтеграцияСБанкамиПовтИсп.ИнтеграцияВИнформационнойБазеВключена();
	ИнтеграцияСБанкамиПодключена = ИнтеграцияВИнформационнойБазеВключена
		И ОбщегоНазначенияБП.ЭтоИнтерфейсИнтеграцииСБанком();
	УстановитьОтборыПриСозданииНаСервере(Параметры);
	
	МожноРедактироватьБанк = ПравоДоступа("Редактирование", Метаданные.Документы.СписаниеСРасчетногоСчета)
		И ПравоДоступа("Редактирование", Метаданные.Документы.ПоступлениеНаРасчетныйСчет);
	МожноРедактироватьКассу = ПравоДоступа("Редактирование", Метаданные.Документы.РасходныйКассовыйОрдер)
		И ПравоДоступа("Редактирование", Метаданные.Документы.ПриходныйКассовыйОрдер);
	
	ИспользуетсяНПД = ИнтеграцияСПлатформойСамозанятыеПовтИсп.ДоступнаИнтеграцияСПлатформойСамозанятые();
	
	ЕстьРасчетныеСчетаБезИнтеграции = НЕ ИнтеграцияСБанкамиПодключена
		ИЛИ Справочники.НастройкиИнтеграцииСБанками.ЕстьРасчетныеСчетаБезИнтеграции();
	
	УправлениеКассовойСменойДоступно = КассовыеСменыВызовСервераБП.ДоступноУправлениеКассовойСменой();
	
	Элементы.ОтборВсеДеньги.Видимость = Не ИнтеграцияСБанкамиПодключена;
	Элементы.ЗагрузитьИзКлиентБанк.Видимость = МожноРедактироватьБанк;
	Элементы.ФормаОткрытьКлиентБанк.Видимость   = МожноРедактироватьБанк И ЕстьРасчетныеСчетаБезИнтеграции;
	Элементы.СоздатьНаОсновании.Видимость       = МожноРедактироватьБанк И МожноРедактироватьКассу;
	Элементы.ФормаПодобратьНеоплаченныеПлатежныеПоручения.Видимость = МожноРедактироватьБанк;
	
	Элементы.СписокКонтекстноеМенюИзменитьВыделенные.Видимость = МожноРедактироватьКассу И МожноРедактироватьБанк;
	Элементы.Список.ИзменятьСоставСтрок = МожноРедактироватьБанк И МожноРедактироватьКассу;
	
	Элементы.СчетВРежимеИнтеграции.Видимость = ИнтеграцияВИнформационнойБазеВключена;
	Если ИнтеграцияСБанкамиПодключена Тогда
		ОбработатьРежимИнтеграцииСБанком();
	Иначе
		УстановитьВидимостьЭлементовДиректБанк(ЭтотОбъект);
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	// ИнтернетПоддержкаПользователей.Новости.КонтекстныеНовости_ПриСозданииНаСервере
	ИдентификаторыСобытийПриОткрытии = Новый Массив;
	ИдентификаторыСобытийПриОткрытии.Добавить("ПриОткрытии");
	
	ИмеютсяДействующиеПатенты = УчетПСН.ИмеютсяДействующиеПатенты(ТекущаяДатаСеанса());
	Если ИмеютсяДействующиеПатенты Тогда
		ИдентификаторыСобытийПриОткрытии.Добавить("ПриОткрытии_ИспользуетсяПатент");
	КонецЕсли;
	
	ОбработкаНовостейПереопределяемый.КонтекстныеНовости_ПриСозданииНаСервере(
		ЭтотОбъект,
		"БП.ЖурналДокументов.Деньги",
		"ФормаСпискаПростойИнтерфейс",
		НСтр("ru = 'Новости: Деньги'"),
		ИдентификаторыСобытийПриОткрытии
	);
	// Конец ИнтернетПоддержкаПользователей.Новости.КонтекстныеНовости_ПриСозданииНаСервере
	
	УстановитьФункциональныеОпцииФормы();
	
	ОбновитьБаннерИПодменюКомандУправленияКассовойСменой(ЭтотОбъект, Истина, Истина);
	
	УстановитьВидимостьЭлементовВсеДеньги();
	
	ТарификацияБП.РазместитьИнформациюОбОграниченииПоКоличествуОбъектов(ЭтотОбъект);
	
	ПомеченныеНаУдалениеСервер.СкрытьПомеченныеНаУдаление(ЭтотОбъект);
	
	УправлениеПанельюПодсказки.ПриСозданииНаСервере(ЭтотОбъект);
	
	МобильныйКлиентАдаптацияФормы(МожноРедактироватьБанк И МожноРедактироватьКассу);
	МобильныйКлиентБП.ПроверитьИЗарегистроватьСобытиеДляОценки("просмотрдокументов", ПоказыватьФормуОценкиМК);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если ИнтеграцияСБанкамиПодключена Тогда
		ОтборВсеДеньги = 0;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ОтборыПриОткрытии) Тогда
		
		Если ОтборыПриОткрытии.Свойство("Организация") И ЗначениеЗаполнено(ОтборыПриОткрытии.Организация) Тогда
			ОтборОрганизация = ОтборыПриОткрытии.Организация;
			ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
		КонецЕсли;
		
		Если ОтборыПриОткрытии.Свойство("БанковскийСчет") И ЗначениеЗаполнено(ОтборыПриОткрытии.БанковскийСчет) Тогда
			ОтборБанковскийСчет = ОтборыПриОткрытии.БанковскийСчет;
			ОтборБанковскийСчетИспользование = ЗначениеЗаполнено(ОтборБанковскийСчет) 
				И Не ОткрытаДляПроверкиЗагрузкиДокументов
				И ТолькоБанк(ОтборВсеДеньги);
		КонецЕсли;
		
		Если ОтборыПриОткрытии.Свойство("ДатаОтбора") И ЗначениеЗаполнено(ОтборыПриОткрытии.ДатаОтбора) Тогда
			ОтборДатаОтбора = ОтборыПриОткрытии.ДатаОтбора;
			ОтборДатаОтбораИспользование = ЗначениеЗаполнено(ОтборДатаОтбора)
				И НЕ ОткрытаДляПроверкиЗагрузкиДокументов;
		КонецЕсли;
		
	ИначеЕсли ОткрытаДляПроверкиЗагрузкиДокументов Тогда
		ОтборОрганизацияИспользование = Ложь;
		ОтборБанковскийСчетИспользование = Ложь;
		ОтборДатаОтбораИспользование = Ложь;
		
	Иначе
		Если ОтборОрганизация <> ОсновнаяОрганизация Тогда
			ОтборОрганизация = ОсновнаяОрганизация;
			
			// Предварительно сбросим сохраненный банковский счет, т.к. он не принадлежит текущей организации
			// и может быть проблема при RLS.
			ОтборБанковскийСчет = Справочники.БанковскиеСчета.ПустаяСсылка();
			
			УстановитьБанковскийСчетОрганизации();
			ОтборОрганизацияИспользование    = ЗначениеЗаполнено(ОтборОрганизация);
			ОтборБанковскийСчетИспользование = ЗначениеЗаполнено(ОтборБанковскийСчет) И ТолькоБанк(ОтборВсеДеньги);
		ИначеЕсли НЕ ОтборОрганизацияИспользование Тогда
			ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
		КонецЕсли;
	КонецЕсли;
	
	// Из сохраненного отбора может прийти битая ссылка - счет в настройках сохранен, но был удален позже.
	// Проверим отбор и очистим его, если счет битый.
	Если ЗначениеЗаполнено(ОтборБанковскийСчет) Тогда
		Если ЗначениеЗаполнено(ОтборБанковскийСчет) И Не ОбщегоНазначения.СсылкаСуществует(ОтборБанковскийСчет) Тогда
			ОтборБанковскийСчет = Справочники.БанковскиеСчета.ПустаяСсылка();
			ОтборБанковскийСчетИспользование = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВосстановленныеОтборы();
	УстановитьВидимостьБанковскогоСчета();
	УстановитьВидимостьЭлементовВсеДеньги();
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		МобильныйКлиентБПФормаОбъектаКлиентСервер.ОбновитьНадписьФиксированногоОтбора(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ИнтернетПоддержкаПользователей.Новости.ПриОткрытии
	ОбработкаНовостейКлиент.КонтекстныеНовости_ПриОткрытии(ЭтотОбъект);
	// Конец ИнтернетПоддержкаПользователей.Новости.ПриОткрытии
	
	ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
	
	ПодключитьОбработчикОжидания("ПоказатьПредупреждениеПоРаботеСМаркетплейсами", 0.1, Истина);
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 1, Истина);
	
	ПодключитьОбработчикОжидания("Подключаемый_ПоказатьБаннерДиректБанк", 3, Истина);
	
	Если ЧекиНПДВызовСервера.ВключенаИнтеграцияСПлатформойСамозанятые() И ЧекиНПДКлиент.ЕстьПравоОбновленияЧековНПД() Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСтатусОфлайнЧековНПД", 1, Истина);
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСведенияОСформированныхЧекахНПД", 3, Истина);
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьОбновлениеИнформацииИБаннеровАвтозагрузки", 0.1, Истина);
	
	ПодключитьОбработчикОжидания("Подключаемый_АУСН", 0.1, Истина);
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьИтогиОбработчик", 0.2, Истина);
	
	ЗаявкиНаОткрытиеСчетаКлиент.ПослеОткрытияЖурналаДеньги();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		ОсновнаяОрганизация = Параметр;
		Если ОсновнаяОрганизация <> ОтборОрганизация Тогда
			ОтборОрганизация = ОсновнаяОрганизация;
			ОтборОрганизацияПриИзмененииСервер();
			
			ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
			ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 0.1, Истина);
		КонецЕсли;
		
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьИтогиОбработчик", 0.2, Истина);
		
	ИначеЕсли ИмяСобытия = "ИзмененБанковскийСчет" И Параметр.Владелец = ОтборОрганизация Тогда
		
		ИзменениеСоставаБанковскихСчетовОрганизации();
		ПодключитьОбработчикОжидания("Подключаемый_ПоказатьБаннерДиректБанк", 3, Истина);
		ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "ИзменениеВыписки" Тогда
		
		ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
		Оповестить("ПоказатьИнформациюОПравеПримененияСпецрежима",
			?(ОтборОрганизацияИспользование, ОтборОрганизация, Неопределено),
			ЭтотОбъект);
		
		ПодключитьОбработчикОжидания("ПоказатьПредупреждениеПоРаботеСМаркетплейсами", 0.1, Истина);
		
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьИтогиОбработчик", 0.2, Истина);
		
	ИначеЕсли ИмяСобытия = "ПоказатьИнформациюОПравеПримененияСпецрежима" Тогда
		
		Если Источник <> ЭтотОбъект И (Не ОтборОрганизацияИспользование Или Параметр = ОтборОрганизация) Тогда
			ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
		КонецЕсли;
	
	ИначеЕсли ИмяСобытия = "ИзмененоПредупреждениеПриЗагрузкеВыписки" Тогда
		
		ПоказатьБаннерПредупрежденийПриЗагрузкеИУстановитьОтбор();
		Элементы.Список.Обновить();
		
	ИначеЕсли (ИмяСобытия = "ИзмененоСостояниеИнтеграцииСПлатформойСамозанятые"
				Или ИмяСобытия = "ИзменениеУчетнойПолитики") Тогда
		
		Если ОтборОрганизацияИспользование И ОтборОрганизация = Параметр Тогда
			ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 0.1, Истина);
			ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
		КонецЕсли;
		УстановитьФункциональныеОпцииФормы();
		
	ИначеЕсли ИмяСобытия = "ИнтеграцияАУСН_ИзмененоСостояние" Тогда
		
		Если ОтборОрганизацияИспользование
			И ОтборОрганизация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметр, "Организация") Тогда
			
			ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 0.1, Истина);
		КонецЕсли;
		
		УстановитьФункциональныеОпцииФормы();
		
	ИначеЕсли ИмяСобытия = "ИзмененаНастройкаОбмена" Тогда
		
		УстановитьВидимостьЭлементовДиректБанк(ЭтотОбъект);
		ПоказатьБаннерДиректБанк(ЭтотОбъект);
		
	ИначеЕсли ИмяСобытия = ИнтеграцияАУСНКлиент.ИмяСобытияОбменССервисом() Тогда
		
		ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьОбновлениеИнформацииИБаннеровАвтозагрузки", 0.1, Истина);
		Если Источник = ЭтотОбъект Тогда
			ПодключитьОбработчикОжидания("Подключаемый_ПоказатьУведомленияАУСНОтФНС", 0.1, Истина);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = ИнтеграцияАУСНКлиент.ИмяСобытияИзмененияВОшибкахОтправки() Тогда
		
		Элементы.ГруппаСостояниеАвтозагрузкиОшибка.Видимость = Ложь;
		ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьОбновлениеИнформацииИБаннеровАвтозагрузки", 5, Истина);
		
	ИначеЕсли ИмяСобытия = ЧекиНПДКлиент.ИмяСобытияОбновленияСведенийОСформированныхЧеках() Тогда
		
		Элементы.Список.Обновить();
		
	ИначеЕсли ИмяСобытия = "ПростойИнтерфейс_ФункциональностьИзменение"
		Или (ИмяСобытия = "Запись_НаборКонстант" И Источник = "ИспользоватьПродажиЧерезМаркетплейс") Тогда
		
		ПодключитьОбработчикОжидания("ПоказатьПредупреждениеПоРаботеСМаркетплейсами", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = ИнтеграцияСтатусСамозанятогоКлиент.ИменаСобытий().ИспользоватьСтатусСамозанятогоИзменено Тогда
		ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 0.1, Истина);
	ИначеЕсли Не ТолькоБанк(ОтборВсеДеньги) Тогда
		
		Если ИмяСобытия = КассовыеСменыКлиентБП.СобытиеВыполняетсяОперацияКассовойСмены() Тогда
			Доступность = Ложь;
		ИначеЕсли ИмяСобытия = КассовыеСменыКлиентБП.СобытиеЗавершиласьОперацияКассовойСмены() Тогда
			Доступность = Истина;
		ИначеЕсли ИмяСобытия = КассовыеСменыКлиентБП.СобытиеОшибкаОткрытияСмены() Тогда
			КассовыеСменыКлиентБП.ПроверитьНаличиеПодключеннойКассовойТехники();
		ИначеЕсли ИмяСобытия = "ИзменениеСтатусаКассовойСмены" Тогда
			ОбновитьБаннерИПодменюКомандУправленияКассовойСменой(ЭтотОбъект, Ложь, Истина);
		ИначеЕсли ИмяСобытия = "ОбновитьБаннеры_РозничнаяТорговля" Тогда
			ОбновитьБаннерИПодменюКомандУправленияКассовойСменой(ЭтотОбъект, Истина, Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеПанельюПодсказкиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
	// ИнтернетПоддержкаПользователей.Новости.ОбработкаОповещения
	ОбработкаНовостейКлиент.КонтекстныеНовости_ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец ИнтернетПоддержкаПользователей.Новости.ОбработкаОповещения
	
	ПрисоединенныеФайлыБПКлиент.ОбновитьСписокПослеДобавленияФайла(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		ВыборСчетаДляЗагрузкиВыписки(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ПерсонализированныеПредложенияСервисовКлиент.ПерейтиПоСсылкеБаннера(
		НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Баннер, ЭтотОбъект);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы И Элементы.ГруппаСостояниеАвтозагрузки.Видимость Тогда
		РаботаСОповещениямиОСостоянииОбменаССервисамиВызовСервера.ЗаписатьДатуЗакрытияБаннера();
	КонецЕсли;
	
	Если ПоказыватьФормуОценкиМК И НЕ ЗавершениеРаботы Тогда
		ОткрытьФорму("ОбщаяФорма.ОценитьПриложение");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьПоступлениеНаРасчетныйСчет(Команда)
	
	КлючеваяОперация = "СозданиеФормыПоступлениеНаРасчетныйСчет";
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, КлючеваяОперация);
	
	СтруктураОтбора = ОбщегоНазначенияБПВызовСервера.ЗначенияЗаполненияДинамическогоСписка(Список.КомпоновщикНастроек);
	
	ОткрытьФорму("Документ.ПоступлениеНаРасчетныйСчет.ФормаОбъекта",
		Новый Структура("ЗначенияЗаполнения", СтруктураОтбора), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСписаниеСРасчетногоСчета(Команда)
	
	КлючеваяОперация = "СозданиеФормыСписаниеСРасчетногоСчета";
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, КлючеваяОперация);
	
	СтруктураОтбора = ОбщегоНазначенияБПВызовСервера.ЗначенияЗаполненияДинамическогоСписка(Список.КомпоновщикНастроек);
	ОткрытьФорму("Документ.СписаниеСРасчетногоСчета.ФормаОбъекта",
		Новый Структура("ЗначенияЗаполнения", СтруктураОтбора), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПриходныйКассовыйОрдер(Команда)
	
	КлючеваяОперация = "СозданиеФормыПриходныйКассовыйОрдер";
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, КлючеваяОперация);
	
	СтруктураОтбора = ОбщегоНазначенияБПВызовСервера.ЗначенияЗаполненияДинамическогоСписка(Список.КомпоновщикНастроек);
	ОткрытьФорму("Документ.ПриходныйКассовыйОрдер.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", СтруктураОтбора), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРасходныйКассовыйОрдер(Команда)
	
	КлючеваяОперация = "СозданиеФормыРасходныйКассовыйОрдер";
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, КлючеваяОперация);
	
	СтруктураОтбора = ОбщегоНазначенияБПВызовСервера.ЗначенияЗаполненияДинамическогоСписка(Список.КомпоновщикНастроек);
	ОткрытьФорму("Документ.РасходныйКассовыйОрдер.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", СтруктураОтбора), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзКлиентБанк(Команда)
	
	Если ИнтеграцияСБанкамиПодключена И Не ЕстьБанковскиеСчетаБезИнтеграции Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьИзКлиентБанкЗавершение", ЭтотОбъект);
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить("ОткрытьНастройки", НСтр("ru = 'Открыть настройки'"));
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
		ТекстВопроса = НСтр("ru = 'Для загрузки выписки из другого банка укажите банковский счет в разделе Настройки'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, СписокКнопок,, КодВозвратаДиалога.Отмена);
	Иначе
		Организация    = ?(ОтборОрганизацияИспользование, ОтборОрганизация, Неопределено);
		БанковскийСчет = БанковскийСчетОрганизации(ЭтотОбъект, Истина);
		ЗагрузитьВыписку(Организация, БанковскийСчет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьНеоплаченныеПлатежныеПоручения(Команда)
	
	БанковскийСчет = БанковскийСчетОрганизации(ЭтотОбъект);
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("Организация", ОтборОрганизация);
	СтруктураОтбора.Вставить("БанковскийСчет", БанковскийСчет);
	СтруктураОтбора.Вставить("Дата", ОтборДатаОтбора);
	ОткрытьФорму("Документ.ПлатежноеПоручение.Форма.ФормаПодбораНеоплаченных",
		Новый Структура("Отбор", СтруктураОтбора), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКлиентБанк(Команда)
	
	ОткрытьФормуКлиентБанка();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОсновании(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	Если ТекущиеДанные <> Неопределено Тогда
		ПараметрыФормы.Вставить("Основание", ТекущиеДанные.Ссылка);
	КонецЕсли;
	
	ОткрытьФорму("ЖурналДокументов.Деньги.Форма.ВыборТипаДокумента", ПараметрыФормы, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКонтекстныеНовости(Команда)
	
	ОбработкаНовостейКлиент.КонтекстныеНовости_ОбработкаКомандыНовости(
		ЭтотОбъект,
		Команда
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетКассоваяКнига(Команда)
	
	СтруктураПараметров = Новый Структура;
	
	Если ОтборОрганизацияИспользование И ЗначениеЗаполнено(ОтборОрганизация) Тогда
		СтруктураПараметров.Вставить("Организация", ОтборОрганизация);
	КонецЕсли;
	
	ОткрытьФорму("Отчет.КассоваяКнига.Форма", СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетАнализДвиженийДенежныхСредств(Команда)
	
	ОткрытьФормуОтчета("АнализДвиженийДенежныхСредств");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетОстаткиДенежныхСредств(Команда)
	
	ОткрытьФормуОтчета("ОстаткиДенежныхСредств");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоступленияДенежныхСредств(Команда)
	
	ОткрытьФормуОтчета("ПоступленияДенежныхСредств");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетРасходыДенежныхСредств(Команда)
	
	ОткрытьФормуОтчета("РасходыДенежныхСредств");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетАнализПродаж(Команда)
	
	ОткрытьФормуОтчета("ВаловаяПрибыль");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетДоходыИРасходы(Команда)
	
	ОткрытьФормуОтчета("ДоходыРасходы");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетОборотныеСредства(Команда)

	ОткрытьФормуОтчета("ОборотныеСредства");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетСравнениеПродажПоКонтрагентам(Команда)
	
	ПараметрыОтчета = Новый Структура;
	
	ПараметрыОтчета.Вставить("КлючВарианта", "СравнениеПродажПоКонтрагентам");
	Уникальность = "Отчет.СравнениеПродаж/КлючВарианта." + ПараметрыОтчета.КлючВарианта;
	
	ПараметрыОтчета.Вставить("КлючПараметровПечати",        Уникальность);
	ПараметрыОтчета.Вставить("КлючСохраненияПоложенияОкна", Уникальность);
	
	ОткрытьФормуОтчета("СравнениеПродаж", ПараметрыОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетДвижениеДенежныхДокументов(Команда)
	
	СтруктураПараметров = Новый Структура;
	Если ОтборОрганизацияИспользование И ЗначениеЗаполнено(ОтборОрганизация) Тогда
		СтруктураПараметров.Вставить("РежимРасшифровки", Истина);
		СтруктураПараметров.Вставить("Организация", ОтборОрганизация);
	КонецЕсли;
	
	ОткрытьФорму("Отчет.ОтчетПоДвижениюДенежныхДокументов.Форма", СтруктураПараметров);
	
КонецПроцедуры

#Область КомандыУправленияКассовойСменой

&НаКлиенте
Процедура ОткрытьКассовуюСмену(Команда)
	
	Если ДоступнаРаботаСКассовойСменой() Тогда
		ОчиститьСообщения();
		КассовыеСменыКлиентБП.НачатьОткрытиеКассовойСмены(УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетОТекущемСостоянииРасчетов(Команда)
	
	Если ДоступнаРаботаСКассовойСменой() Тогда
		ОчиститьСообщения();
		Доступность = Ложь;
		
		ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыВыполненияОперации();
		КассовыеСменыВызовСервераБП.ЗаполнитьПараметрыОперацииДляОрганизацииПоУмолчанию(ПараметрыОперации);
		
		ОповещениеЗавершения = Новый ОписаниеОповещения("ОперацияЗавершение", ЭтотОбъект);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФормированиеОтчетаОТекущемСостоянииРасчетов(
			ОповещениеЗавершения, УникальныйИдентификатор, ,ПараметрыОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетБезГашения(Команда)
	
	Если ДоступнаРаботаСКассовойСменой() Тогда
		ОчиститьСообщения();
		Доступность = Ложь;
		
		ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыВыполненияОперации();
		КассовыеСменыВызовСервераБП.ЗаполнитьПараметрыОперацииДляОрганизацииПоУмолчанию(ПараметрыОперации);
			
		ОповещениеЗавершения = Новый ОписаниеОповещения("ОперацияЗавершение", ЭтотОбъект);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФормированиеОтчетаБезГашения(
			ОповещениеЗавершения, УникальныйИдентификатор, ,ПараметрыОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьКассовуюСмену(Команда)
	
	Если ДоступнаРаботаСКассовойСменой() Тогда
		ОчиститьСообщения();
		КассовыеСменыКлиентБП.ЗакрытьСмену(УникальныйИдентификатор, Список.КомпоновщикНастроек);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодключаемоеОборудование(Команда)
	
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.ФормаСписка", , , , , ,
		Новый ОписаниеОповещения("ОповещениеОбновленияБаннера", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВидовОплат(Команда)
	
	ОткрытьФорму("Справочник.ВидыОплатОрганизаций.ФормаСписка", , , , , ,
		Новый ОписаниеОповещения("ОповещениеОбновленияБаннера", ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ИзменитьВидимостьПодсказок(Команда)
	
	ИзменитьВидимостьПодсказокНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПанельПодсказок(Команда)
	
	ИзменитьВидимостьПодсказокНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	УИДЗамера = ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Ложь, "ОтборПоОрганизациямВЖурналеВыпискиПоБанку");
	// СтандартныеПодсистемы.ОценкаПроизводительности
	
	ОтборОрганизацияПриИзмененииСервер();
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 0.1, Истина);
	
	ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьИтогиОбработчик", 0.2, Истина);
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 0.3, Истина);
	
	ПодключитьОбработчикОжидания("Подключаемый_ПоказатьБаннерДиректБанк", 3, Истина);
	
	ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьОбновлениеИнформацииИБаннеровАвтозагрузки", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияИспользованиеПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	
	Если ОтборОрганизацияИспользование Тогда
		СкрытьРезультатСозданияДокументов(ЭтотОбъект);
	КонецЕсли;
	
	ПоказатьБаннерПредупрежденийПриЗагрузкеИУстановитьОтбор();
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 0.1, Истина);
	
	ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьИтогиОбработчик", 0.2, Истина);
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 0.3, Истина);
	
	ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьОбновлениеИнформацииИБаннеровАвтозагрузки", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаИспользованиеПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "ДатаОтбора");
	
	ПоказатьБаннерПредупрежденийПриЗагрузкеИУстановитьОтбор();
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьИтогиОбработчик", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаОтбораПриИзменении(Элемент)
	
	ОтборДатаОтбораИспользование = ЗначениеЗаполнено(ОтборДатаОтбора);
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "ДатаОтбора");
	
	ПоказатьБаннерПредупрежденийПриЗагрузкеИУстановитьОтбор();
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьИтогиОбработчик", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборБанковскийСчетИспользованиеПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "БанковскийСчет");
	
	Если ОтборБанковскийСчетИспользование Тогда
		СкрытьРезультатСозданияДокументов(ЭтотОбъект);
	КонецЕсли;
	
	ПоказатьБаннерПредупрежденийПриЗагрузкеИУстановитьОтбор();
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьИтогиОбработчик", 0.2, Истина);
	
	ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьОбновлениеИнформацииИБаннеровАвтозагрузки", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборБанковскийСчетПриИзменении(Элемент)
	
	ОтборБанковскийСчетИспользование = ЗначениеЗаполнено(ОтборБанковскийСчет);
	ОтборБанковскийСчетПриИзмененииСервер();
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьИтогиОбработчик", 0.2, Истина);
	
	ПодключитьОбработчикОжидания("Подключаемый_ПоказатьБаннерДиректБанк", 0.1, Истина);
	
	ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьОбновлениеИнформацииИБаннеровАвтозагрузки", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстИнформацииОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КонтрольПраваПримененияСпецрежимаКлиент.ПодробнееНажатие(ЭтотОбъект, НавигационнаяСсылкаФорматированнойСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура НапомнитьПозжеНажатие(Элемент)
	
	ОтложитьПоказНапоминанияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодробнееНажатие(Элемент)
	
	КонтрольПраваПримененияСпецрежимаКлиент.ПодробнееНажатие(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстДополнительнойИнформацииОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КонтрольПраваПримененияСпецрежимаКлиент.ПодробнееНажатие(ЭтотОбъект, НавигационнаяСсылкаФорматированнойСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительнаяИнформацияНапомнитьПозжеНажатие(Элемент)
	
	ОтложитьПоказДополнительногоНапоминанияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительнаяИнформацияПодробнееНажатие(Элемент)
	
	КонтрольПраваПримененияСпецрежимаКлиент.ПодробнееНажатие(ЭтотОбъект, СсылкаНаДополнительноеПояснение);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТекстРекламыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПодключитьДиректБанк" Тогда
		
		СтандартнаяОбработка = Ложь;
		РеквизитыСчета = БанкИНомерСчета(ОтборБанковскийСчет);
		ОбменСБанкамиКлиент.ОткрытьСоздатьНастройкуОбмена(
			ОтборОрганизация, РеквизитыСчета.Банк, РеквизитыСчета.НомерСчета);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСкрытьРекламуДиректБанкНажатие(Элемент)
	
	РеквизитыСчета = БанкИНомерСчета(ОтборБанковскийСчет);
	ЭлектронноеВзаимодействиеБПВызовСервера.СохранитьНастройкуВидимостиРекламыДиректБанк(РеквизитыСчета.Банк, Ложь);
	ВидимостьЭлементовДиректБанк = "ПоказатьГиперссылку";
	ПоказатьБаннерДиректБанк(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтбораОшибокЗагрузкиПриИзменении(Элемент)
	
	УстановитьОтборПредупрежденийПриЗагрузке(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьБаннерНажатие(Элемент)
	
	ОтключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер");
	
	ПерсонализированныеПредложенияСервисовКлиент.ЗакрытьБаннер(ЭтотОбъект, ОтборОрганизация);
	
КонецПроцедуры
&НаКлиенте
Процедура ДекорацияСкрытьНажатиеТекстКонтекстнаяПодсказкиИнтеграцияСБанком(Элемент)
	
	СкрытьНажатиеТекстКонтекстнаяПодсказкиИнтеграцияСБанком();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущийБаннерНажатие(Элемент)
	
	ОтключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер");
	
	ПерсонализированныеПредложенияСервисовКлиент.УстановитьРежимОжиданияНаБаннере(ЭтотОбъект);
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьПредыдущийБаннер", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СледующийБаннерНажатие(Элемент)
	
	ОтключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер");
	
	ПерсонализированныеПредложенияСервисовКлиент.УстановитьРежимОжиданияНаБаннере(ЭтотОбъект);
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер", 0.1, Истина);
	
КонецПроцедуры

#Область Панель_Подсказки

&НаКлиенте
Процедура НавигацияВПрограммеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	УправлениеПанельюПодсказкиКлиент.НавигацияВПрограммеОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительнаяФункциональностьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	УправлениеПанельюПодсказкиКлиент.ДополнительнаяФункциональностьОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылка,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СоветПоРаботе1ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	УправлениеПанельюПодсказкиКлиент.СоветПоРаботеОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СоветПоРаботе2ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	УправлениеПанельюПодсказкиКлиент.СоветПоРаботеОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СоветПоРаботе3ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	УправлениеПанельюПодсказкиКлиент.СоветПоРаботеОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СоветПоРаботе4ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	УправлениеПанельюПодсказкиКлиент.СоветПоРаботеОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ТекстПредупреждениеПоРаботеСМаркетплейсамиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ГруппаТорговля" Тогда
		
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("ТекущаяСтраница", НавигационнаяСсылкаФорматированнойСтроки);
		ОткрытьФорму("Обработка.ФункциональностьПрограммы.Форма", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСкрытьПредупреждениеПоРаботеСМаркетплейсамиНажатие(Элемент)
	
	СкрытьПредупреждениеПоРаботеСМаркетплейсами();
	Элементы.ГруппаПредупреждениеПоРаботеСМаркетплейсами.Видимость = Ложь;
	
КонецПроцедуры


&НаКлиенте
Процедура ОтборВсеДеньгиПриИзменении(Элемент)
	
	ОтборВсеДеньгиПриИзмененииНаСервере();
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьИтогиОбработчик", 0.2, Истина);
	
	ПодключитьОбработчикОжидания("Подключаемый_ПоказатьБаннерДиректБанк", 0.1, Истина);
	
	ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьОбновлениеИнформацииИБаннеровАвтозагрузки", 0.1, Истина);
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	ДанныеСтроки = ОбщегоНазначенияБПКлиент.ТекущиеДанныеДинамическогоСписка(Элементы.Список);
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеСтроки.Ссылка) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		КлючеваяОперация = "ОткрытиеФормыПоступлениеНаРасчетныйСчет";
	ИначеЕсли ТипЗнч(ДанныеСтроки.Ссылка) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
		КлючеваяОперация = "ОткрытиеФормыСписаниеСРасчетногоСчета";
	ИначеЕсли ТипЗнч(ДанныеСтроки.Ссылка) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		КлючеваяОперация = "ОткрытиеФормыПриходныйКассовыйОрдер";
	ИначеЕсли ТипЗнч(ДанныеСтроки.Ссылка) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		КлючеваяОперация = "ОткрытиеФормыРасходныйКассовыйОрдер";
	КонецЕсли;
	
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, КлючеваяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	Оповестить("ИзменениеВыписки");
	ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
	Оповестить("ПоказатьИнформациюОПравеПримененияСпецрежима",
		?(ОтборОрганизацияИспользование, ОтборОрганизация, Неопределено),
		ЭтотОбъект);
	ПодключитьОбработчикОжидания("ПоказатьПредупреждениеПоРаботеСМаркетплейсами", 0.1, Истина);
	
	ПомеченныеНаУдалениеКлиент.ПриИзмененииСписка(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если Строка <> Неопределено Тогда
		
		Если ПрисоединенныеФайлыБПКлиент.ПараметрыПеретаскиванияСодержатФайлы(ПараметрыПеретаскивания) Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Ссылка"                 , Строка);
			ДополнительныеПараметры.Вставить("ПараметрыПеретаскивания", ПараметрыПеретаскивания);
			ДополнительныеПараметры.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ПеретаскиваниеФайловОтветПолучен",
				ПрисоединенныеФайлыБПКлиент,
				ДополнительныеПараметры);
			ШаблонВопроса = НСтр("ru='Присоединить файлы к документу %1?'");
			ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонВопроса, Строка);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса,РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки, ИспользуютсяСтандартныеНастройки)
	
	ОтборыСписков.СброситьИспользованиеПользовательскихОтборовВНастройке(Настройки);
	
	ПомеченныеНаУдалениеСервер.УдалитьОтборПометкаУдаления(Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Отборы

&НаСервере
Процедура УстановитьОтборыПриСозданииНаСервере(Параметры)
	
	УстановитьВариантОтбораПредупрежденийПриЗагрузкеИзПараметров(Параметры);
	
	ВходящийОтборПоОрганизации = Ложь;
	СтруктураОтбора = Неопределено;
	Если Параметры.Свойство("Отбор", СтруктураОтбора) И ТипЗнч(СтруктураОтбора) = Тип("Структура") Тогда
		ВходящийОтборПоОрганизации = СтруктураОтбора.Свойство("Организация", ОтборОрганизация);
		СтруктураОтбора.Свойство("БанковскийСчет", ОтборБанковскийСчет);
		СтруктураОтбора.Свойство("ДатаОтбора",     ОтборДатаОтбора);
		
		ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
		ОтборБанковскийСчетИспользование = ЗначениеЗаполнено(ОтборБанковскийСчет) И ТолькоБанк(ОтборВсеДеньги);
		ОтборДатаОтбораИспользование     = ЗначениеЗаполнено(ОтборДатаОтбора);
		
		ЗаполнитьОтборПриОткрытииИзПараметров(Параметры.Отбор);
		
	КонецЕсли;
	
	ОсновнаяОрганизация = Справочники.Организации.ОрганизацияПоУмолчанию();
	
	Если Не ВходящийОтборПоОрганизации И ОтборОрганизация <> ОсновнаяОрганизация Тогда
		ОтборОрганизация                 = ОсновнаяОрганизация;
		ОтборОрганизацияИспользование    = ЗначениеЗаполнено(ОтборОрганизация);
		ОтборБанковскийСчетИспользование = ЗначениеЗаполнено(ОтборБанковскийСчет) И ТолькоБанк(ОтборВсеДеньги);
	КонецЕсли;
	
	ОтборОрганизацияПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтборПриОткрытииИзПараметров(Отбор)
	
	// Нужно переложить отборы из параметров в отдельную структуру,
	// которую потом будем использовать в ПриЗагрузкеДанныхИзНастроекНаСервере
	// Так как мы устанавливаем отбор самостоятельно, то нужно очистить те поля
	// структуры "Параметры.Отбор", для которых установлен отбор из кода.
	// Если не очистить поля - то будет вызвана ошибка пересечения отборов.
	
	ОтборыПриОткрытии = Новый Структура;
	
	Если Отбор.Свойство("Организация")
		И ЗначениеЗаполнено(Отбор.Организация) Тогда
		
		ОтборыПриОткрытии.Вставить("Организация", Отбор.Организация);
		Отбор.Удалить("Организация");
		
	КонецЕсли;
	
	Если Отбор.Свойство("БанковскийСчет")
		И ЗначениеЗаполнено(Отбор.БанковскийСчет) Тогда
		
		ОтборыПриОткрытии.Вставить("БанковскийСчет", Отбор.БанковскийСчет);
		Отбор.Удалить("БанковскийСчет");
		
	КонецЕсли;
	
	Если Отбор.Свойство("ДатаОтбора")
		И ЗначениеЗаполнено(Отбор.ДатаОтбора) Тогда
		
		ОтборыПриОткрытии.Вставить("ДатаОтбора", Отбор.ДатаОтбора);
		Отбор.Удалить("ДатаОтбора");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеСоставаБанковскихСчетовОрганизации()
	
	ОтборОрганизацияПриИзмененииСервер();
	
	Если ЕстьБанковскиеСчетаБезИнтеграции Тогда
		ВидимостьКонтекстнаяПодсказкаИнтеграцияСБанком = Ложь;
		БанкИКассаФормы.ПоказатьКонтекстнаяПодсказкаИнтеграцияСБанком(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаВыписки

&НаКлиенте
Процедура ЗагрузитьВыписку(Организация, БанковскийСчет)
	
	СоглашениеЭД = Неопределено;
	НастройкиБанковскогоСчета = ЭлектронноеВзаимодействиеБПВызовСервера.НастройкиКлиентБанкаДляБанковскогоСчета(
		Организация, БанковскийСчет);
	Если ИнтеграцияСБанкамиПодключена И ЕстьБанковскиеСчетаБезИнтеграции Тогда
		НастройкиБанковскогоСчета.Вставить("РежимИнтеграцииОграничиватьПериодВыписки", Истина);
	КонецЕсли;
	
	РежимЗагрузки = "";
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиБанковскогоСчета, "ЭтоЦифровойСчет", Ложь) Тогда
		РежимЗагрузки = "ЦифровойСчет";
	ИначеЕсли ЗначениеЗаполнено(ОтборОрганизация) И Не ЗначениеЗаполнено(ОтборБанковскийСчет) Тогда
		РежимЗагрузки = "Универсальная";
	КонецЕсли;
	Если НастройкиБанковскогоСчета.ПодключенСервисАУСН Или
		НастройкиБанковскогоСчета.ПередЗагрузкойПоказыватьФормуОбменаСБанком Тогда
		Если ЗначениеЗаполнено(БанковскийСчет) Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("БанковскийСчет",  БанковскийСчет);
			ПараметрыФормы.Вставить("РежимЗагрузки",   РежимЗагрузки);
		Иначе
			ПараметрыФормы = Неопределено;
		КонецЕсли;
		ОткрытьФормуКлиентБанка(ПараметрыФормы);
	ИначеЕсли НастройкиБанковскогоСчета.ЕстьПрямойОбменСБанками Тогда
		СоглашениеЭД = НастройкиБанковскогоСчета.СоглашениеПрямогоОбменаСБанками;
		ЗагружатьВыпискуПоВсемСчетамНастройка = Неопределено;
		Если ЗначениеЗаполнено(СоглашениеЭД) Тогда
			ЗагружатьВыпискуПоВсемСчетамНастройка =
				НастройкиБанковскогоСчета.ПользовательскиеНастройки.ЗагружатьВыпискуПоВсемСчетам[СоглашениеЭД];
		КонецЕсли;
		
		// В ЗагружатьВыпискуПоВсемСчетамНастройка может быть Неопределено - это значит,
		// что вариант загрузки, для данной настройки обмена с банком, еще не задан пользователем.
		ЗагружатьВыпискуПоВсемСчетам =
			ЗначениеЗаполнено(ЗагружатьВыпискуПоВсемСчетамНастройка) И ЗагружатьВыпискуПоВсемСчетамНастройка;
		Если ЗначениеЗаполнено(СоглашениеЭД) Тогда
			Если ЗагружатьВыпискуПоВсемСчетам Тогда
				НастройкиБанковскогоСчета.БанковскийСчет = Неопределено;
			ИначеЕсли ЗначениеЗаполнено(СоглашениеЭД) И ЗагружатьВыпискуПоВсемСчетамНастройка = Неопределено
				И ЗначениеЗаполнено(БанковскийСчет)
				И ПолучитьФункциональнуюОпциюФормы("ИспользоватьНесколькоБанковскихСчетовОрганизации") Тогда
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("Настройка", НастройкиБанковскогоСчета.СоглашениеПрямогоОбменаСБанками);
				ПараметрыНастройки = Новый Структура("ПараметрыНастройки", ПараметрыФормы);
				
				ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьПослеНастройкиЗавершение", ЭтотОбъект, НастройкиБанковскогоСчета);
				
				ОткрытьФорму("Обработка.КлиентБанк.Форма.ФормаНастройкиЗагрузки",
					ПараметрыНастройки, ЭтотОбъект,,,, ОписаниеОповещения);
				
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ЗагрузитьВыпискуПоПрямомуОбмену(НастройкиБанковскогоСчета);
	Иначе
		ЗагрузитьВыпискуЧерезФайл(
			НастройкиБанковскогоСчета.ФайлЗагрузки, НастройкиБанковскогоСчета.Кодировка, РежимЗагрузки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборСчетаДляЗагрузкиВыписки(ВыбранныйБанковскийСчет)
	
	Если ВыбранныйБанковскийСчет = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	// Обновим отборы
	Если ТолькоБанк(ОтборВсеДеньги) Тогда
		ОтборБанковскийСчет               = ВыбранныйБанковскийСчет;
		ОтборБанковскийСчетИспользование  = Истина;
		ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "БанковскийСчет");
	КонецЕсли;
	
	Если НЕ ОтборОрганизацияИспользование ИЛИ НЕ ЗначениеЗаполнено(ОтборОрганизация) Тогда
		ОтборОрганизация              = ПолучитьРеквизитСчета(ВыбранныйБанковскийСчет, "Владелец");
		ОтборОрганизацияИспользование = Истина;
		ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	КонецЕсли;
	
	// Загрузим выписку по выбранному счету
	ЗагрузитьВыписку(ОтборОрганизация, ВыбранныйБанковскийСчет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайлВыпискиНаКлиенте(ОписаниеФайла, Кодировка = Неопределено, РежимЗагрузки = "") Экспорт
	
	ДлительнаяОперация = ЗагрузитьБанковскуюВыпискуНаСервере(ОписаниеФайла, Кодировка, РежимЗагрузки);
	
	Если ДлительнаяОперация.Статус = "Ошибка" Тогда
		СообщитьОбОшибкеДлительнойОперации(ДлительнаяОперация);
	ИначеЕсли ДлительнаяОперация.Статус = "ОшибкаЗагрузкиЦР" Тогда
		СообщитьОбОшибкеДлительнойОперации(ДлительнаяОперация, Истина);
	Иначе
		НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		НастройкиОжидания.ТекстСообщения = НСтр("ru = 'Загрузка выписки из банка'");
		
		Обработчик = Новый ОписаниеОповещения("ПослеЗагрузкиБанковскойВыпискиВФоне", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиБанковскойВыпискиВФоне(ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда // задание было отменено
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		РезультатЗагрузки = ПолучитьИзВременногоХранилища(ДлительнаяОперация.АдресРезультата);
		ОбработатьЗагрузкуБанковскойВыписки(РезультатЗагрузки);
	ИначеЕсли ДлительнаяОперация.Статус = "Ошибка" Тогда
		СообщитьОбОшибкеДлительнойОперации(ДлительнаяОперация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьОбОшибкеДлительнойОперации(ДлительнаяОперация, ОшибкаЗагрузкиЦР = Ложь)
	
	ШаблонСообщения = НСтр("ru = 'При выполнении операции произошла ошибка:
							|%1
							|Подробности в журнале регистрации.'");
	Если ОшибкаЗагрузкиЦР Тогда
		СообщениеОбОшибке = ДлительнаяОперация.КраткоеПредставлениеОшибки;
	ИначеЕсли ЗначениеЗаполнено(ДлительнаяОперация.КраткоеПредставлениеОшибки) Тогда
		СообщениеОбОшибке = СтрШаблон(ШаблонСообщения, ДлительнаяОперация.КраткоеПредставлениеОшибки);
	ИначеЕсли ЗначениеЗаполнено(ДлительнаяОперация.ПодробноеПредставлениеОшибки) Тогда
		СообщениеОбОшибке = СтрШаблон(ШаблонСообщения, ДлительнаяОперация.ПодробноеПредставлениеОшибки);
	Иначе
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьБанковскуюВыпискуНаСервере(ОписаниеФайла, Кодировка, РежимЗагрузки = "")
	
	СтруктураПараметров = Новый Структура;
	
	Если РасширениеРаботыСФайламиПодключено
		И ТипЗнч(ОписаниеФайла) = Тип("ОписаниеПереданногоФайла")
		И ЗначениеЗаполнено(ОписаниеФайла.ПолноеИмя) Тогда
		СтруктураПараметров.Вставить("ФайлЗагрузки", ОписаниеФайла.ПолноеИмя);
	Иначе
		СтруктураПараметров.Вставить("ФайлЗагрузки", ОписаниеФайла.Имя);
	КонецЕсли;
	
	СтруктураПараметров.Вставить("АдресХранилищаРаспознанныеДанныеИзБанка",
		ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор));
	СтруктураПараметров.Вставить("Кодировка", ?(РежимЗагрузки = "ЦифровойСчет", "UTF-8", Кодировка));
	СтруктураПараметров.Вставить("РежимЗагрузки", РежимЗагрузки);
	Если Не ПустаяСтрока(ОписаниеФайла.Хранение) Тогда
		СтруктураПараметров.Вставить("ДвоичныеДанные", ПолучитьИзВременногоХранилища(ОписаниеФайла.Хранение));
	КонецЕсли;
	
	Результат = ЗагрузитьБанковскуюВыпискуНаСервереОбщая(СтруктураПараметров);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьЗагрузкуБанковскойВыписки(РезультатЗагрузки)
	
	Для Каждого ТекстСообщения Из РезультатЗагрузки.СообщенияПользователю Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;
	
	Если РезультатЗагрузки.РезультатВыполнения = "ЕстьОшибкиЧтенияФайла" Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Не удалось прочитать файл'"));
		
	ИначеЕсли РезультатЗагрузки.РезультатВыполнения = "ЕстьОшибкиРаспознавания" ИЛИ
		РезультатЗагрузки.РезультатВыполнения = "ЕстьОшибкиСозданияКонтрагентов" ИЛИ
		РезультатЗагрузки.РезультатВыполнения = "ЕстьОшибкиСозданияДокументов" ИЛИ
		РезультатЗагрузки.РезультатВыполнения = "НеобходимоСоздатьКонтрагентов" Тогда
		
		Если РезультатЗагрузки.Свойство("Организация") Тогда
			ОтборОрганизация = РезультатЗагрузки.Организация;
			ОтборОрганизацияИспользование = ЗначениеЗаполнено(РезультатЗагрузки.Организация);
			ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
		КонецЕсли;
		
		Если РезультатЗагрузки.Свойство("БанковскийСчет") И ТолькоБанк(ОтборВсеДеньги) Тогда
			ОтборБанковскийСчет = РезультатЗагрузки.БанковскийСчет;
			ОтборБанковскийСчетИспользование = ЗначениеЗаполнено(РезультатЗагрузки.БанковскийСчет);
			ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "БанковскийСчет");
		КонецЕсли;
		
		ПараметрыФормыКлиентБанка = Новый Структура;
		ПараметрыФормыКлиентБанка.Вставить("АдресХранилищаРаспознанныеДанныеИзБанка", РезультатЗагрузки.АдресХранилищаРаспознанныеДанныеИзБанка);
		ПараметрыФормыКлиентБанка.Вставить("СообщенияПользователюВФормеОбменСБанком", РезультатЗагрузки.СообщенияПользователюВФормеОбменСБанком);
		ПараметрыФормыКлиентБанка.Вставить("НачалоПериода",                           ПериодНачало);
		ПараметрыФормыКлиентБанка.Вставить("КонецПериода",                            ПериодОкончание);
		ПараметрыФормыКлиентБанка.Вставить("СоглашениеЭД",                            СоглашениеЭД);
		ПараметрыФормыКлиентБанка.Вставить("ЭлектроннаяВыпискаБанка",                 ВыпискиБанка);
		
		Если РезультатЗагрузки.Свойство("ИмяФайла") Тогда
			ПараметрыФормыКлиентБанка.Вставить("ФайлЗагрузки", РезультатЗагрузки.ИмяФайла);
		ИначеЕсли РезультатЗагрузки.Свойство("АдресВыписки") Тогда
			ПараметрыФормыКлиентБанка.Вставить("АдресВыписки", РезультатЗагрузки.АдресВыписки);
		КонецЕсли;
		
		ОткрытьФормуКлиентБанка(ПараметрыФормыКлиентБанка);
		
	ИначеЕсли РезультатЗагрузки.РезультатВыполнения = "УспешнаяЗагрузка" Тогда
		
		Если РезультатЗагрузки.Свойство("Организация") Тогда
			ОтборОрганизация = РезультатЗагрузки.Организация;
			ОтборОрганизацияИспользование = ЗначениеЗаполнено(РезультатЗагрузки.Организация);
			ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
		КонецЕсли;
		
		Элементы.Список.Обновить();
		
		Если РезультатЗагрузки.Свойство("РезультатСозданияДокументов") Тогда
			ВалютаСчета = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатЗагрузки, "ВалютаСчета");
			ПоказатьРезультатСозданияДокументов(РезультатЗагрузки.РезультатСозданияДокументов, ВалютаСчета);
			
			ОповеститьОбИзменении(Тип("ДокументСсылка.СчетНаОплатуПокупателю"));
		КонецЕсли;
		
		Оповестить("ИзменениеВыписки");
		
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьИтогиОбработчик", 0.2, Истина);
		ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
		Оповестить("ПоказатьИнформациюОПравеПримененияСпецрежима",
			?(ОтборОрганизацияИспользование, ОтборОрганизация, Неопределено),
			ЭтотОбъект);
		
		ПодключитьОбработчикОжидания("ПоказатьПредупреждениеПоРаботеСМаркетплейсами", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКлиентБанка(ПараметрыФормы = Неопределено) Экспорт
	
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("РежимПоУмолчанию", "ГруппаЗагрузка");
	Если ОтборОрганизацияИспользование И ЗначениеЗаполнено(ОтборОрганизация) Тогда
		ПараметрыФормы.Вставить("Организация", ОтборОрганизация);
	КонецЕсли;
	
	Если Не ПараметрыФормы.Свойство("РежимЗагрузки") Тогда
		ПараметрыФормы.Вставить("РежимЗагрузки", "");
	КонецЕсли;
	
	Если Не ПараметрыФормы.Свойство("БанковскийСчет")
		И ОтборБанковскийСчетИспользование И ЗначениеЗаполнено(ОтборБанковскийСчет) Тогда
		ПараметрыФормы.Вставить("БанковскийСчет", ОтборБанковскийСчет);
	КонецЕсли;
	
	Если ОтборДатаОтбораИспользование И ЗначениеЗаполнено(ОтборДатаОтбора) Тогда
		ПараметрыФормы.Вставить("НачалоПериода", ОтборДатаОтбора);
		ПараметрыФормы.Вставить("КонецПериода",  ОтборДатаОтбора);
	КонецЕсли;
	
	ОткрытьФорму("Обработка.КлиентБанк.Форма.Форма", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#Область ПрямойОбменСБанком

&НаКлиенте
Процедура ЗагрузитьВыпискуПоПрямомуОбмену(НастройкиБанковскогоСчета)
	
	// Счет определен, начинаем получение выписки
	Если ЗначениеЗаполнено(НастройкиБанковскогоСчета.БанковскийСчет)
		Или ЗначениеЗаполнено(НастройкиБанковскогоСчета.БанкДляПрямогоОбмена) Тогда
		ПолучитьВыпискиПоПрямомуОбменуСБанком(НастройкиБанковскогоСчета);
		
	// Счет не определен, спросим у пользователя по какому счету необходимо производить загрузку.
	// Может быть выбран счет по которому не подключен прямой обмен.
	// В этом случае производим загрузку через файл
	Иначе
		ПараметрыФормы = Новый Структура;
		СтруктураОтбора = Новый Структура;
		
		Владелец = НастройкиБанковскогоСчета.Организация;
		Если Владелец = Неопределено Тогда
			// Типизируем отбор по владельцу, если он пустой
			Владелец = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		КонецЕсли;
		
		СтруктураОтбора.Вставить("Владелец", Владелец);
		Если ИнтеграцияСБанкамиПодключена И ЕстьБанковскиеСчетаБезИнтеграции Тогда
			СтруктураОтбора.Вставить("Ссылка", БанковскиеСчетаБезИнтеграции.Счета);
		КонецЕсли;
		
		ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
		ОткрытьФорму("Справочник.БанковскиеСчета.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВыпискиПоПрямомуОбменуСБанком(НастройкиБанковскогоСчета)
	
	Если ОтборДатаОтбораИспользование И ЗначениеЗаполнено(ОтборДатаОтбора) Тогда
		СтруктураПериода = Новый Структура;
		СтруктураПериода.Вставить("ДатаНачала",    ОтборДатаОтбора);
		СтруктураПериода.Вставить("ДатаОкончания", ОтборДатаОтбора);
	Иначе
		// Определим период загрузки по последнему проведенному документу
		СтруктураПериода = ПериодЗагрузкиВыписки(НастройкиБанковскогоСчета,
			НастройкиБанковскогоСчета.РежимИнтеграцииОграничиватьПериодВыписки);
	КонецЕсли;
	
	БанкИКассаФормыКлиент.ПолучитьВыпискуБанка(ЭтотОбъект, НастройкиБанковскогоСчета, СтруктураПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВыпискиПоПрямомуОбменуСБанкомЗавершение(ПараметрыФормы) Экспорт
	
	ОткрытьФормуКлиентБанка(ПараметрыФормы);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПериодЗагрузкиВыписки(Знач НастройкиБанковскогоСчета, Знач РежимИнтеграцииОграничиватьПериодВыписки)
	
	Возврат Обработки.КлиентБанк.ПериодЗагрузкиВыписки(НастройкиБанковскогоСчета, РежимИнтеграцииОграничиватьПериодВыписки);
	
КонецФункции

#КонецОбласти

#Область ОбменЧерезФайл

&НаКлиенте
Процедура ЗагрузитьВыпискуЧерезФайл(ФайлЗагрузки, Кодировка, РежимЗагрузки)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ФайлЗагрузки",    ФайлЗагрузки);
	ДополнительныеПараметры.Вставить("Кодировка",       Кодировка); 
	ДополнительныеПараметры.Вставить("РежимЗагрузки",   РежимЗагрузки); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьВыпискуЧерезФайлЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВыпискуЧерезФайлЗавершение(ПодключеноРасширениеРаботыСФайлами, ДополнительныеПараметры) Экспорт
	
	РасширениеРаботыСФайламиПодключено = ПодключеноРасширениеРаботыСФайлами;
	РежимЗагрузки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "РежимЗагрузки", "");
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры.ФайлЗагрузки) И РасширениеРаботыСФайламиПодключено Тогда
		// Файл определен - можно начинаем чтение
		ОбменСБанкомКлиент.ЗагрузитьВыбранныйФайл(
			ДополнительныеПараметры.ФайлЗагрузки,
			ЭтотОбъект,
			ДополнительныеПараметры.Кодировка,
			РежимЗагрузки);
	Иначе
		// Файл не определен - запросим файл у пользователя
		Если Не ПустаяСтрока(РежимЗагрузки) Тогда
			ОбменСБанкомКлиент.ВыбратьИЗагрузитьФайл(ЭтотОбъект,, РежимЗагрузки);
		Иначе
			ОбменСБанкомКлиент.ВыбратьИЗагрузитьФайл(ЭтотОбъект, ДополнительныеПараметры.Кодировка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедуры

&НаКлиенте
Процедура СкрытьНажатие(Элемент)
	
	СкрытьРезультатСозданияДокументов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СкрытьРезультатСозданияДокументов(Форма)
	
	Элементы = Форма.Элементы;
	Если Элементы.ГруппаСостояниеЗагрузкиИзКлиентБанка.Видимость Тогда
		Элементы.ГруппаСостояниеЗагрузкиИзКлиентБанка.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРезультатСозданияДокументов(РезультатСозданияДокументов, ВалютаСчета)
	
	Элементы.ГруппаСостояниеЗагрузкиИзКлиентБанка.Видимость = Истина;
	Элементы.ГруппаСостояниеАвтозагрузки.Видимость = Ложь;
	Элементы.ГруппаСостояниеАвтозагрузкиОшибка.Видимость = Ложь;
	
	Если НЕ РезультатСозданияДокументов.Свойство("КоличествоЗагружено") Тогда
		Элементы.ТекстСостояниеЗагрузки.Заголовок = НСтр("ru='Новых документов для загрузки не обнаружено'");
	Иначе
		ШаблонТекста = НСтр("ru = 'Загружено: [КоличествоДокументов]. Поступило: [СуммаПоступило] Списано: [СуммаСписано]'");
		
		СтрокаКоличествоДокументов = СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(РезультатСозданияДокументов.КоличествоЗагружено, "документ, документа, документов");
		СтрокаСуммаПоступило       = ОбщегоНазначенияБПВызовСервера.ФорматСумм(РезультатСозданияДокументов.СуммаПоступило, ВалютаСчета, "0,00");
		СтрокаСуммаПоступило       = ?((Прав(СтрокаСуммаПоступило, 1) = "."), СтрокаСуммаПоступило, СтрокаСуммаПоступило + ".");
		СтрокаСуммаСписано         = ОбщегоНазначенияБПВызовСервера.ФорматСумм(РезультатСозданияДокументов.СуммаСписано, ВалютаСчета, "0,00");
		СтрокаСуммаСписано         = ?((Прав(СтрокаСуммаСписано, 1) = "."),   СтрокаСуммаСписано,   СтрокаСуммаСписано + ".");
		
		ВставляемыеЗначения = Новый Структура;
		ВставляемыеЗначения.Вставить("КоличествоДокументов", СтрокаКоличествоДокументов);
		ВставляемыеЗначения.Вставить("СуммаПоступило",       СтрокаСуммаПоступило);
		ВставляемыеЗначения.Вставить("СуммаСписано",         СтрокаСуммаСписано);
		Элементы.ТекстСостояниеЗагрузки.Заголовок = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонТекста, ВставляемыеЗначения);
		
		Если ЗначениеЗаполнено(РезультатСозданияДокументов.ПервыйЗагруженный) Тогда
			Элементы.Список.ТекущаяСтрока = РезультатСозданияДокументов.ПервыйЗагруженный;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитСчета(Знач БанковскийСчет, Знач ИмяРеквизита)
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскийСчет, ИмяРеквизита);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Процедура СкрытьСостояниеАвтозагрузкиНажатие(Элемент)
	
	Элементы.ГруппаСостояниеАвтозагрузки.Видимость = Не Элементы.ГруппаСостояниеАвтозагрузки.Видимость;
	
	РаботаСОповещениямиОСостоянииОбменаССервисамиВызовСервера.ЗаписатьДатуЗакрытияБаннера();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьСостояниеАвтозагрузкиОшибкаНажатие(Элемент)
	
	Элементы.ГруппаСостояниеАвтоЗагрузкиОшибка.Видимость = Не Элементы.ГруппаСостояниеАвтоЗагрузкиОшибка.Видимость;
	
	РаботаСОповещениямиОСостоянииОбменаССервисамиВызовСервера.ЗаписатьДатуЗакрытияБаннера();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстСостояниеАвтозагрузкиОшибкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки =
		РаботаСОповещениямиОСостоянииОбменаССервисамиКлиентСервер.ИмяДействияОткрытьЖурналРегистрации() Тогда
		СтандартнаяОбработка = Ложь;
		Отбор = Новый Структура("Пользователь, СобытиеЖурналаРегистрации, ДатаНачала, ДатаОкончания, Данные, Сеанс, Уровень");
		Отбор.Пользователь	= Строка(ПользователиКлиентСервер.ТекущийПользователь());
		Отбор.ДатаНачала	= НачалоДня(ИнформацияАвтозагрузкиДиректБанк_ДатаОшибки);
		Отбор.ДатаОкончания	= КонецДня(ИнформацияАвтозагрузкиДиректБанк_ДатаОшибки);
		Отбор.Уровень		= "Ошибка";
		СобытиеЖурналаРегистрации =  СтрШаблон(НСтр("ru = '%1.Журнал'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()),
			ОбменСБанкамиКлиентСервер.ИмяСобытияЖурналаРегистрации());
		Отбор.СобытиеЖурналаРегистрации = СобытиеЖурналаРегистрации;
		ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(Отбор, ЭтотОбъект);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки =
		РаботаСОповещениямиОСостоянииОбменаССервисамиКлиентСервер.ИмяДействияОбращениеВТехподдержку1С() Тогда
		СтандартнаяОбработка = Ложь;
		РаботаСОповещениямиОСостоянииОбменаССервисамиКлиент.НаписатьОбращениеВТехподдержку1СОшибкаАУСН(
			АдресДанныхСостоянияОбмена, УникальныйИдентификатор);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки =
		РаботаСОповещениямиОСостоянииОбменаССервисамиКлиентСервер.ИмяДействияИнформацияОбОшибкеАУСН() Тогда
		СтандартнаяОбработка = Ложь;
		РаботаСОповещениямиОСостоянииОбменаССервисамиКлиент.ОткрытьИнформациюОбОшибкеАУСН(
			АдресДанныхСостоянияОбмена, УникальныйИдентификатор);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки =
		РаботаСОповещениямиОСостоянииОбменаССервисамиКлиентСервер.ИмяДействияЛичныйКабинетБанка() Тогда
		СтандартнаяОбработка = Ложь;
		ИнтеграцияАУСНКлиент.ОткрытьЛКБанка(АдресДанныхСостоянияОбмена);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки =
		РаботаСОповещениямиОСостоянииОбменаССервисамиКлиентСервер.ИмяДействияИсправитьОшибкиОтправкиАУСН() Тогда
		СтандартнаяОбработка = Ложь;
		РаботаСОповещениямиОСостоянииОбменаССервисамиКлиент.ОткрытьОшибкиОтправкиАУСН(
			АдресДанныхСостоянияОбмена, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстНеобходимоПовторноеЧтениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВариантОтбора", "СОшибками");
	Если ОтборОрганизацияИспользование И ЗначениеЗаполнено(ОтборОрганизация) Тогда
		ПараметрыФормы.Вставить("Организация", ОтборОрганизация);
	КонецЕсли;
	Если ОтборБанковскийСчетИспользование И ЗначениеЗаполнено(ОтборБанковскийСчет) Тогда
		ПараметрыФормы.Вставить("Банк", КлассификаторБанкаПоОтбору(ОтборБанковскийСчет));
	КонецЕсли;
	ОткрытьФорму("РегистрСведений.ДокументыАУСН.Форма.ЖурналОбмена",
		ПараметрыФормы,
		ЭтотОбъект,
		УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗагрузитьИзКлиентБанкЗавершение(ВыбранныйВариант, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйВариант = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ПерейтиПоНавигационнойСсылке("e1cib/command/Обработка.ПанелиПростойИнтерфейс.Команда.НастройкиБазовый");
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьВыпискуНаКлиенте(АдресВыписки, Кодировка = Неопределено) Экспорт
	
	ДлительнаяОперация = ЗагрузитьБанковскуюВыпискуДБНаСервере(АдресВыписки, Кодировка);
	
	Если ДлительнаяОперация.Статус = "Ошибка" Тогда
		СообщитьОбОшибкеДлительнойОперации(ДлительнаяОперация);
	Иначе
		НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		НастройкиОжидания.ТекстСообщения = НСтр("ru = 'Загрузка выписки из банка'");
		
		Обработчик = Новый ОписаниеОповещения("ПослеЗагрузкиБанковскойВыпискиВФоне", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьБанковскуюВыпискуДБНаСервере(АдресВыписки, Кодировка)
	
	Если ПустаяСтрока(АдресВыписки) Или Не ЭтоАдресВременногоХранилища(АдресВыписки) Тогда
		Результат = Новый Структура;
		Результат.Статус = "Ошибка";
		Результат.Вставить("КраткоеПредставлениеОшибки",   "");
		Результат.Вставить("ПодробноеПредставлениеОшибки", "");
		Возврат Результат;
	КонецЕсли;
	
	ВыпискаБанка = ПолучитьИзВременногоХранилища(АдресВыписки);
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("АдресХранилищаРаспознанныеДанныеИзБанка",
		ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор));
	СтруктураПараметров.Вставить("Кодировка",    Кодировка);
	СтруктураПараметров.Вставить("ВыпискаБанка", ВыпискаБанка);
	
	Результат = ЗагрузитьБанковскуюВыпискуНаСервереОбщая(СтруктураПараметров);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗагрузитьБанковскуюВыпискуНаСервереОбщая(СтруктураПараметров)
	
	Элементы.ГруппаСостояниеЗагрузкиИзКлиентБанка.Видимость = Ложь;
	
	СведенияОВладельцеБанковскогоСчетаИзКонтекста = НовыйСведенияОВладельцеБанковскогоСчетаИзКонтекста();
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		СведенияОВладельцеБанковскогоСчетаИзКонтекста.Организация.Добавить(ОтборОрганизация);
		
		РежимЗагрузки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураПараметров, "РежимЗагрузки", "");
		
		Если ТолькоБанк(ОтборВсеДеньги) И ЗначениеЗаполнено(ОтборБанковскийСчет) Тогда
			СведенияОВладельцеБанковскогоСчетаИзКонтекста.БанковскийСчетОрганизации.Добавить(ОтборБанковскийСчет);
		ИначеЕсли РежимЗагрузки = "ЦифровойСчет" Тогда
			ВалютаРеглУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
			БанковскиеСчетаЦифровые = Справочники.БанковскиеСчета.БанковскиеСчетаОрганизации(
				ОтборОрганизация, ВалютаРеглУчета, , Истина);
			Если БанковскиеСчетаЦифровые.Количество() > 0 Тогда
				СчетЦифровогоРубля = БанковскиеСчетаЦифровые[0].Ссылка;
				СведенияОВладельцеБанковскогоСчетаИзКонтекста.БанковскийСчетОрганизации.Добавить(СчетЦифровогоРубля);
			Иначе
				Результат = Новый Структура("Статус, КраткоеПредставлениеОшибки");
				Результат.Статус = "ОшибкаЗагрузкиЦР";
				Результат.КраткоеПредставлениеОшибки = НСтр("ru = 'У организации нет счета цифрового рубля'");
				Возврат Результат;
			КонецЕсли;
		ИначеЕсли ИнтеграцияСБанкамиПодключена И ЕстьБанковскиеСчетаБезИнтеграции Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
				СведенияОВладельцеБанковскогоСчетаИзКонтекста.БанковскийСчетОрганизации,
				БанковскиеСчетаБезИнтеграции.Счета,
				Истина);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПараметров.Вставить("СведенияОВладельцеБанковскогоСчетаИзКонтекста",
		СведенияОВладельцеБанковскогоСчетаИзКонтекста);
	Если ИнтеграцияСБанкамиПодключена И ЕстьБанковскиеСчетаБезИнтеграции Тогда
		СтруктураПараметров.Вставить("РежимИнтеграцииОграничиватьПериодВыписки", Истина);
	КонецЕсли;
	
	НастройкиЗапуска = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	НастройкиЗапуска.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка выписки из банка'");
	НастройкиЗапуска.ЗапуститьВФоне = Истина;
	НастройкиЗапуска.ОжидатьЗавершение = 0;
	НастройкиЗапуска.КлючФоновогоЗадания = Обработки.КлиентБанк.КлючФоновогоЗаданияЗагрузкаВыписки();
	
	Результат = ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.КлиентБанк.ФоноваяЗагрузкаБанковскойВыпискиИзЖурнала",
		СтруктураПараметров,
		НастройкиЗапуска);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьПослеНастройкиЗавершение(Результат, ДополнительныеНастройки) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат Тогда
		ДополнительныеНастройки.БанковскийСчет = Неопределено;
	КонецЕсли;
	
	ЗагрузитьВыпискуПоПрямомуОбмену(ДополнительныеНастройки);
	
КонецПроцедуры

#КонецОбласти

#Область ФоновоеЗадание

&НаКлиенте
Процедура ЗафиксироватьДлительностьКлючевойОперации()
	
	ОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(УИДЗамера);
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеОбработчики

&НаКлиенте
Процедура Подключаемый_ОбновитьИтогиОбработчик()
	
	ОбновитьИтоги();
	ЗафиксироватьДлительностьКлючевойОперации();
	
КонецПроцедуры

// Процедура показывает новости, требующие прочтения (важные и очень важные)
//
// Параметры:
//  Нет
//
&НаКлиенте
Процедура Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии()
	
	// ИнтернетПоддержкаПользователей.Новости.Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии
	ИдентификаторыСобытийПриОткрытии = Новый Массив;
	ИдентификаторыСобытийПриОткрытии.Добавить("ПриОткрытии");
	
	Если ИмеютсяДействующиеПатенты Тогда
		ИдентификаторыСобытийПриОткрытии.Добавить("ПриОткрытии_ИспользуетсяПатент");
	КонецЕсли;
	// Конец ИнтернетПоддержкаПользователей.Новости.Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии
	
	ОбработкаНовостейКлиент.КонтекстныеНовости_ПоказатьНовостиТребующиеПрочтенияПриОткрытии(ЭтотОбъект, ИдентификаторыСобытийПриОткрытии);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьАвтоматическоеПолучениеВыпискиАктивно()
	
	НастройкиОбмена = НастройкиАвтозагрузкиДиректБанк();
	ЭтотОбъект.АвтоматическоеПолучениеВыпискиАктивно = НастройкиОбмена.Количество() <> 0;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьИнформациюИБаннерыАвтозагрузки()
	
	РезультатОбновленияБаннера = ОбновитьИнформациюИБаннерыАвтозагрузкиНаСервере();
	Если РезультатОбновленияБаннера.Свойство("ОжидатьОкончанияОбмена") Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьОбновлениеИнформацииИБаннеровАвтозагрузки", 10, Истина);
	КонецЕсли;
	Если РезультатОбновленияБаннера.Свойство("ЗакрытьБаннер") Тогда
		ЗакрытьБаннерНажатие("");
	КонецЕсли;
	Если РезультатОбновленияБаннера.Свойство("ОбновитьИтоги") Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьИтогиОбработчик", 0.2, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбновитьИнформациюИБаннерыАвтозагрузкиНаСервере()
	
	РезультатОбновления = Новый Структура;
	ПоказатьБаннерПредупрежденийПриЗагрузкеИУстановитьОтбор();
	
	Если Не ИнтеграцияАУСН.ВозможноПрочитатьДанныеОбмена() Тогда
		РезультатОбновления.Вставить("ОжидатьОкончанияОбмена", Истина);
		Возврат РезультатОбновления;
	КонецЕсли;
	
	ОбновитьИнформациюАвтозагрузки();
	ПараметрыОтображенияБаннеров = РаботаСОповещениямиОСостоянииОбменаССервисами.ПараметрыОтображенияБаннера(
		АдресДанныхСостоянияОбмена);
	
	// Правила отображения баннеров:
	// 1. Если есть ошибка автоматической загрузки, то отображем красный баннер про ошибку
	//    и прячем желтый баннер об успешной синхронизации (если он активен)
	// 2. Если необходимо повторно прочитать документы сервиса АУСН, то появится красный баннер со ссылкой на
	//    журнал обмена с сервисом АУСН, где можно вызвать повторное чтение документов
	//    и прячем желтый баннер об успешной синхронизации (если он активен)
	// 3. Если есть ошибка по учетным документам, то появится красный баннер про ошибки в учетных документах,
	//    и прячем желтый баннер об успешной синхронизации (если он активен)
	// 4. Если нет ошибок, и баннер про успешную синхронизацию не показан,
	//    то проверяем новую дату синхронизации, если она изменилась, то покажем желтый баннер об успешной синхронизации
	//
	// Правило 1
	Если ПараметрыОтображенияБаннеров.ОтображатьБаннерОшибки Тогда
		Элементы.ГруппаСостояниеАвтоЗагрузкиОшибка.Видимость = Истина;
		Элементы.ГруппаСостояниеАвтозагрузки.Видимость = Ложь; 
		Элементы.ГруппаНеобходимоПовторноеЧтение.Видимость = Ложь;
		ЭтотОбъект.ИнформацияАвтозагрузкиДиректБанк_ТекущаяДатаСинхронизации = Неопределено;
		Если Элементы.Баннер.Видимость Тогда
			РезультатОбновления.Вставить("ЗакрытьБаннер", Истина);
		КонецЕсли;
		Возврат РезультатОбновления;
	Иначе
		Элементы.ГруппаСостояниеАвтоЗагрузкиОшибка.Видимость = Ложь;
		ЭтотОбъект.ИнформацияАвтозагрузкиДиректБанк_ДатаОшибки = Неопределено;
	КонецЕсли;
	
	// Правило 2
	Если ПараметрыОтображенияБаннеров.ОтображатьНеобходимостьПовторногоЧтения Тогда
		Элементы.ГруппаНеобходимоПовторноеЧтение.Видимость = Истина;
		Элементы.ГруппаСостояниеАвтозагрузкиОшибка.Видимость = Ложь;
		Элементы.ГруппаСостояниеАвтозагрузки.Видимость = Ложь;
		Если Элементы.Баннер.Видимость Тогда
			РезультатОбновления.Вставить("ЗакрытьБаннер", Истина);
		КонецЕсли;
	Иначе
		Элементы.ГруппаНеобходимоПовторноеЧтение.Видимость = Ложь;
	КонецЕсли;
	
	// Правило 3
	Если ЕстьПредупреждения Тогда
		Элементы.ГруппаСостояниеАвтозагрузки.Видимость = Ложь;
		Если Элементы.Баннер.Видимость Тогда
			РезультатОбновления.Вставить("ЗакрытьБаннер", Истина);
		КонецЕсли;
		Возврат РезультатОбновления;
	КонецЕсли;
	
	//Правило 4
	Если ПараметрыОтображенияБаннеров.ОтображатьБаннерСостоянияЗагрузки
		И Не Элементы.ГруппаСостояниеАвтозагрузки.Видимость
		И (ИнформацияАвтозагрузкиДиректБанк_ТекущаяДатаСинхронизации <> ИнформацияАвтозагрузки_НоваяДатаСинхронизации)
		И Не ЕстьПредупреждения И ЗначениеЗаполнено(Элементы.ТекстСостояниеАвтозагрузки.Заголовок) Тогда
		Элементы.ГруппаСостояниеАвтозагрузки.Видимость = Истина;
		Элементы.ГруппаНеобходимоПовторноеЧтение.Видимость = Ложь;
		ИнформацияАвтозагрузкиДиректБанк_ТекущаяДатаСинхронизации = ИнформацияАвтозагрузки_НоваяДатаСинхронизации;
		Элементы.Список.Обновить();
		РезультатОбновления.Вставить("Подключаемый_ОбновитьИтогиОбработчик", Истина);
	КонецЕсли;
	
	Возврат РезультатОбновления;
	
КонецФункции

#КонецОбласти

#Область УправлениеФормой

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Организация
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Организация");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОтборОрганизацияИспользование", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОтборОрганизация", ВидСравненияКомпоновкиДанных.Заполнено);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// БанковскийСчет
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "БанковскийСчет");
	
	ГруппаОтбораИли = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(
		ЭлементУО.Отбор.Элементы, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		
	ГруппаОтбораИ = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(
		ГруппаОтбораИли.Элементы, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИ,
		"ОтборБанковскийСчетИспользование", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИ,
		"ОтборБанковскийСчет", ВидСравненияКомпоновкиДанных.Заполнено);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИли,
		"ОтборВсеДеньги", ВидСравненияКомпоновкиДанных.НеРавно, 1); // Банк
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	Если ИнтеграцияСБанкамиПодключена Тогда
		
		// Комментарий
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Комментарий");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"ИнтеграцияСБанкамиПодключена", ВидСравненияКомпоновкиДанных.Равно, Истина);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
	КонецЕсли;
	
	// НазначениеПлатежа, НомерВходящегоДокумента, ДатаВходящегоДокумента
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НазначениеПлатежа");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НомерВходящегоДокумента");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДатаВходящегоДокумента");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОтборВсеДеньги", ВидСравненияКомпоновкиДанных.НеРавно, 1); // Банк
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Тип
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Тип");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОтборВсеДеньги", ВидСравненияКомпоновкиДанных.НеРавно, 0); // Все деньги
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Выделение строки с предупреждениями
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Дата");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Доход");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Расход");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СтатусАУСН");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Контрагент");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ВидОперации");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Тип");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Комментарий");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Номер");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Организация");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "БанковскийСчет");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НазначениеПлатежа");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НомерВходящегоДокумента");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДатаВходящегоДокумента");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Ответственный");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Список.ЕстьПредупреждения", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.БанковскиеДокументыСПредупреждениямиПриЗагрузке);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтоги()
	
	Дата = ?(ОтборДатаОтбораИспользование, ОтборДатаОтбора, Неопределено);
	Организация = ?(ОтборОрганизацияИспользование, ОтборОрганизация, Неопределено);
	БанковскийСчет = ?(ОтборБанковскийСчетИспользование, ОтборБанковскийСчет, Неопределено);
	
	СтруктураИтогов = ПолучитьИтоги(Дата, Организация, БанковскийСчет, ОтборВсеДеньги);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураИтогов);
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоМобильныйКлиент() Тогда
		УстановитьЗаголовкиГруппыИтогиМК(Элементы.ГруппаИтоги, ИтогДата, ИтогиНаКонецДня);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИтоги(ДатаОтбора, Организация, БанковскийСчет, ОтборВсеДеньги)
	
	Если Не ЗначениеЗаполнено(ДатаОтбора) Тогда
		ДатаОтбора = ТекущаяДатаСеанса();
	КонецЕсли;
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("ИтогДата", ДатаОтбора);
	СтруктураРезультат.Вставить("ИтогиНаНачалоДня", 0);
	СтруктураРезультат.Вставить("ИтогиПоступило", 0);
	СтруктураРезультат.Вставить("ИтогиСписано", 0);
	СтруктураРезультат.Вставить("ИтогиНаКонецДня", 0);
	
	СписокДоступныхОрганизаций = ОбщегоНазначенияБПВызовСервераПовтИсп.ВсеОрганизацииДанныеКоторыхДоступныПоRLS(Ложь);
	// Если нет доступных организаций, то Итоги не вычисляем
	Если СписокДоступныхОрганизаций.Количество() = 0 Тогда
		Возврат СтруктураРезультат;
	ИначеЕсли ЗначениеЗаполнено(Организация) Тогда
		// Если организация не числится в списке доступных, то Итоги не вычисляем
		Если СписокДоступныхОрганизаций.Найти(Организация) = Неопределено Тогда
			Возврат СтруктураРезультат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		СписокОрганизаций = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация);
	Иначе
		СписокОрганизаций = СписокДоступныхОрганизаций;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаИтоговНачалоДня", НачалоДня(ДатаОтбора));
	Запрос.УстановитьПараметр("ДатаИтоговКонецДня", КонецДня(ДатаОтбора));
	Запрос.УстановитьПараметр("Организации", СписокОрганизаций);
	
	Если Не ТолькоБанк(ОтборВсеДеньги) Тогда
		СчетаУчетаНаличныхДС = Новый Массив;
		СчетаУчетаНаличныхДС.Добавить(ПланыСчетов.Хозрасчетный.Касса);
		СчетаУчетаНаличныхДС.Добавить(ПланыСчетов.Хозрасчетный.КассаОрганизации);
		СчетаУчетаНаличныхДС.Добавить(ПланыСчетов.Хозрасчетный.ОперационнаяКасса);
		СчетаУчетаНаличныхДС.Добавить(ПланыСчетов.Хозрасчетный.КассаПлатежногоАгента);
		СчетаУчетаНаличныхДС.Добавить(ПланыСчетов.Хозрасчетный.КассаОрганизацииВал);
		Запрос.УстановитьПараметр("СчетаУчетаНаличныхДС", СчетаУчетаНаличныхДС);
	КонецЕсли;
	
	Если Не ТолькоКасса(ОтборВсеДеньги) Тогда
		Запрос.УстановитьПараметр("СчетаУчетаБезналичныхДС",
			УчетДенежныхСредствПовтИсп.ПолучитьСчетаССубконтоБанковскиеСчета());
		Запрос.УстановитьПараметр("СубконтоБанковскиеСчета",
			ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.БанковскиеСчета);
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|		КОГДА ОстаткиИОбороты.ЭтоВалютныйСчет
	|			ТОГДА ОстаткиИОбороты.ВалютнаяСуммаНачальныйОстаток
	|		ИНАЧЕ ОстаткиИОбороты.СуммаНачальныйОстаток
	|	КОНЕЦ) КАК ИтогиНаНачалоДня,
	|	СУММА(ВЫБОР
	|		КОГДА ОстаткиИОбороты.ЭтоВалютныйСчет
	|			ТОГДА ОстаткиИОбороты.ВалютнаяСуммаОборотДт
	|		ИНАЧЕ ОстаткиИОбороты.СуммаОборотДт
	|	КОНЕЦ) КАК ИтогиПоступило,
	|	СУММА(ВЫБОР
	|		КОГДА ОстаткиИОбороты.ЭтоВалютныйСчет
	|			ТОГДА ОстаткиИОбороты.ВалютнаяСуммаОборотКт
	|		ИНАЧЕ ОстаткиИОбороты.СуммаОборотКт
	|	КОНЕЦ) КАК ИтогиСписано,
	|	СУММА(ВЫБОР
	|		КОГДА ОстаткиИОбороты.ЭтоВалютныйСчет
	|			ТОГДА ОстаткиИОбороты.ВалютнаяСуммаКонечныйОстаток
	|		ИНАЧЕ ОстаткиИОбороты.СуммаКонечныйОстаток
	|	КОНЕЦ) КАК ИтогиНаКонецДня
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиИОборотыПоБанку.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|		ОстаткиИОборотыПоБанку.ВалютнаяСуммаНачальныйОстаток КАК ВалютнаяСуммаНачальныйОстаток,
	|		ОстаткиИОборотыПоБанку.СуммаОборотДт КАК СуммаОборотДт,
	|		ОстаткиИОборотыПоБанку.ВалютнаяСуммаОборотДт КАК ВалютнаяСуммаОборотДт,
	|		ОстаткиИОборотыПоБанку.СуммаОборотКт КАК СуммаОборотКт,
	|		ОстаткиИОборотыПоБанку.ВалютнаяСуммаОборотКт КАК ВалютнаяСуммаОборотКт,
	|		ОстаткиИОборотыПоБанку.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|		ОстаткиИОборотыПоБанку.ВалютнаяСуммаКонечныйОстаток КАК ВалютнаяСуммаКонечныйОстаток,
	|		ВЫБОР
	|			КОГДА ОстаткиИОборотыПоБанку.ВалютнаяСуммаНачальныйОстаток <> 0
	|			ИЛИ ОстаткиИОборотыПоБанку.ВалютнаяСуммаОборотДт <> 0
	|			ИЛИ ОстаткиИОборотыПоБанку.ВалютнаяСуммаОборотКт <> 0
	|			ИЛИ ОстаткиИОборотыПоБанку.ВалютнаяСуммаКонечныйОстаток <> 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЭтоВалютныйСчет
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаИтоговНачалоДня, &ДатаИтоговКонецДня,, ДвиженияИГраницыПериода,
	|			Счет В (&СчетаУчетаБезналичныхДС), &СубконтоБанковскиеСчета, Организация В (&Организации)) КАК
	|			ОстаткиИОборотыПоБанку
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ОстаткиИОборотыПоКассе.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|		ОстаткиИОборотыПоКассе.ВалютнаяСуммаНачальныйОстаток КАК ВалютнаяСуммаНачальныйОстаток,
	|		ОстаткиИОборотыПоКассе.СуммаОборотДт КАК СуммаОборотДт,
	|		ОстаткиИОборотыПоКассе.ВалютнаяСуммаОборотДт КАК ВалютнаяСуммаОборотДт,
	|		ОстаткиИОборотыПоКассе.СуммаОборотКт КАК СуммаОборотКт,
	|		ОстаткиИОборотыПоКассе.ВалютнаяСуммаОборотКт КАК ВалютнаяСуммаОборотКт,
	|		ОстаткиИОборотыПоКассе.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|		ОстаткиИОборотыПоКассе.ВалютнаяСуммаКонечныйОстаток КАК ВалютнаяСуммаКонечныйОстаток,
	|		ВЫБОР
	|			КОГДА ОстаткиИОборотыПоКассе.ВалютнаяСуммаНачальныйОстаток <> 0
	|			ИЛИ ОстаткиИОборотыПоКассе.ВалютнаяСуммаОборотДт <> 0
	|			ИЛИ ОстаткиИОборотыПоКассе.ВалютнаяСуммаОборотКт <> 0
	|			ИЛИ ОстаткиИОборотыПоКассе.ВалютнаяСуммаКонечныйОстаток <> 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЭтоВалютныйСчет
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаИтоговНачалоДня, &ДатаИтоговКонецДня,, ДвиженияИГраницыПериода,
	|			Счет В (&СчетаУчетаНаличныхДС),, Организация В (&Организации)) КАК ОстаткиИОборотыПоКассе) КАК ОстаткиИОбороты";
	
	Если Не ВсеДеньги(ОтборВсеДеньги) Тогда
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
		ВложенныйЗапрос = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Источники[0].Источник.Запрос;
		Если ТолькоБанк(ОтборВсеДеньги) Тогда
			Если ЗначениеЗаполнено(БанковскийСчет) Тогда
				ВложенныйЗапрос.Операторы[0].Источники[0].Источник.Параметры[6].Выражение = 
					Новый ВыражениеСхемыЗапроса("Организация В (&Организации) И Субконто1 = &БанковскийСчет");
				Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
			КонецЕсли;
			ВложенныйЗапрос.Операторы.Удалить(1);
		ИначеЕсли ТолькоКасса(ОтборВсеДеньги) Тогда
			ВложенныйЗапрос.Операторы.Удалить(0);
		КонецЕсли;
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураРезультат, Выборка);
	КонецЕсли;
	
	Возврат СтруктураРезультат;
	
КонецФункции

&НаСервере
Процедура УстановитьВосстановленныеОтборы(ТолькоОрганизацияИСчет = Ложь)
	
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "БанковскийСчет");
	
	Если Не ТолькоОрганизацияИСчет Тогда
		ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "ДатаОтбора");
		УстановитьОтборВсеДеньги();
		ОбновитьБаннерИПодменюКомандУправленияКассовойСменой(ЭтотОбъект, Ложь, Истина);
	КонецЕсли;
	
	ПоказатьБаннерПредупрежденийПриЗагрузкеИУстановитьОтбор();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРежимИнтеграцииСБанком()
	
	// Интеграция подключена, значит основной банковский счет организации - это счет интеграции.
	БанковскийСчетОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОтборОрганизация, "ОсновнойБанковскийСчет");
	Если Не ЗначениеЗаполнено(БанковскийСчетОрганизации) Тогда
		БанковскиеСчетаИнтеграции = Справочники.НастройкиИнтеграцииСБанками.БанковскиеСчетаОрганизацииВРежимеИнтеграции(
			ОтборОрганизация);
		Если БанковскиеСчетаИнтеграции.Количество() > 0 Тогда
			БанковскийСчетОрганизации = БанковскиеСчетаИнтеграции[0];
		КонецЕсли;
	КонецЕсли;
	
	БанкИнтеграции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскийСчетОрганизации, "Банк");
	Если ЗначениеЗаполнено(БанкИнтеграции) Тогда
		РеквизитыБанкаИнтеграции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(БанкИнтеграции,
			"Наименование, Код");
		НазваниеБанкаИнтеграции  = РеквизитыБанкаИнтеграции.Наименование;
		БИКБанкаИнтеграции       = РеквизитыБанкаИнтеграции.Код;
	КонецЕсли;
	
	Если Не ЕстьБанковскиеСчетаБезИнтеграции Тогда
		ВидимостьИзНастроек = ХранилищеОбщихНастроек.Загрузить(
			"ВидимостьКонтекстнаяПодсказкаИнтеграцияСБанком", БИКБанкаИнтеграции);
		ВидимостьКонтекстнаяПодсказкаИнтеграцияСБанком = ?(ВидимостьИзНастроек = Неопределено, Истина, ВидимостьИзНастроек);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "ПометкаУдаления", Ложь,,, Истина);
	
	УстановитьВидимостьЭлементовДиректБанк(ЭтотОбъект);
	
	БанкИКассаФормы.НастроитьФормуЖурналаДляРежимаИнтеграции(ЭтотОбъект, ИнтеграцияСБанкамиПодключена);
	БанкИКассаФормы.ПоказатьКонтекстнаяПодсказкаИнтеграцияСБанком(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьВидимостьПодсказокНаСервере()
	
	УправлениеПанельюПодсказки.ИзменитьВидимостьПодсказок(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ПравоПримененияСпецрежима

&НаКлиенте
Процедура ПоказатьИнформациюОПравеПримененияСпецрежима()
	
	Если Не ОтборОрганизацияИспользование
		Или Не КонтрольПраваПримененияСпецрежимаКлиент.Контролировать(ОтборОрганизация) Тогда
		Элементы.ИнформацияОПравеПримененияСпецрежима.Видимость = Ложь;
		Элементы.ДополнительнаяИнформацияОПравеПримененияСпецрежима.Видимость = Ложь;
	Иначе
		ПоказатьИнформациюОПравеПримененияСпецрежимаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьИнформациюОПравеПримененияСпецрежимаНаСервере()
	
	ИнформацияОПравеПримененияСпецрежима = КонтрольПраваПримененияСпецрежима.ИнформацияОПравеПримененияСпецрежима(
		ОтборОрганизация,
		КонтрольПраваПримененияСпецрежима.ИмяПоказателяСпецрежимаДоходы());
		
	СледующееЗначениеНапоминания         = ИнформацияОПравеПримененияСпецрежима.СледующееЗначениеНапоминания;
	СсылкаНаПояснение                    = ИнформацияОПравеПримененияСпецрежима.СсылкаНаПояснение;
	
	Элементы.ИнформацияОПравеПримененияСпецрежима.Видимость = ИнформацияОПравеПримененияСпецрежима.Показать;
	Элементы.ИнформацияОПравеПримененияСпецрежима.ЦветФона = ИнформацияОПравеПримененияСпецрежима.ЦветФонаГруппы;
	Элементы.ТекстИнформации.Заголовок = ИнформацияОПравеПримененияСпецрежима.ТекстИнформации;
	Элементы.ТекстИнформацииРасширеннаяПодсказка.Заголовок = ИнформацияОПравеПримененияСпецрежима.ПодсказкаТекстИнформации;
	
	Элементы.Подробнее.Видимость       = ЗначениеЗаполнено(СсылкаНаПояснение);
	Элементы.Подробнее.Заголовок       = ИнформацияОПравеПримененияСпецрежима.ЗаголовокПояснения;
	
	Элементы.НапомнитьПозже.Заголовок  = ИнформацияОПравеПримененияСпецрежима.ТекстНапомнитьПозже;
	Элементы.НапомнитьПозже.Видимость  = ИнформацияОПравеПримененияСпецрежима.ОтображатьНапоминание;
	
	ДополнительнаяИнформацияСпецрежима = ИнформацияОПравеПримененияСпецрежима.ДополнительнаяИнформация;
	
	Если ДополнительнаяИнформацияСпецрежима <> Неопределено Тогда
		ИмяДополнительногоПоказателяСпецрежима      = ДополнительнаяИнформацияСпецрежима.ИмяПоказателя;
		СледующееЗначениеДополнительногоНапоминания = ДополнительнаяИнформацияСпецрежима.СледующееЗначениеНапоминания;
		СсылкаНаДополнительноеПояснение             = ДополнительнаяИнформацияСпецрежима.СсылкаНаПояснение;
		
		Элементы.ДополнительнаяИнформацияОПравеПримененияСпецрежима.Видимость = ДополнительнаяИнформацияСпецрежима.Показать;
		Элементы.ДополнительнаяИнформацияОПравеПримененияСпецрежима.ЦветФона = ДополнительнаяИнформацияСпецрежима.ЦветФонаГруппы;
		Элементы.ТекстДополнительнойИнформации.Заголовок = ДополнительнаяИнформацияСпецрежима.ТекстИнформации;
		Элементы.ТекстДополнительнойИнформацииРасширеннаяПодсказка.Заголовок = ДополнительнаяИнформацияСпецрежима.ПодсказкаТекстИнформации;
		
		Элементы.ДополнительнаяИнформацияПодробнее.Видимость = ЗначениеЗаполнено(СсылкаНаДополнительноеПояснение);
		Элементы.ДополнительнаяИнформацияПодробнее.Заголовок = ДополнительнаяИнформацияСпецрежима.ЗаголовокПояснения;
		
		Элементы.ДополнительнаяИнформацияНапомнитьПозже.Заголовок = ДополнительнаяИнформацияСпецрежима.ТекстНапомнитьПозже;
		Элементы.ДополнительнаяИнформацияНапомнитьПозже.Видимость = ДополнительнаяИнформацияСпецрежима.ОтображатьНапоминание;
	Иначе
		Элементы.ДополнительнаяИнформацияОПравеПримененияСпецрежима.Видимость = Ложь;
	КонецЕсли;
	
	ИмяНастройкиПравоПримененияПатента = КонтрольПраваПримененияСпецрежима.ИмяНастройкиПравоПримененияСпецрежимаПатент();
	ВыводитсяИнформацияОПатенте = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ИнформацияОПравеПримененияСпецрежима,
		ИмяНастройкиПравоПримененияПатента,
		Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ОтложитьПоказНапоминанияНаСервере()
	
	Если ВыводитсяИнформацияОПатенте Тогда
		ИмяПоказателя = КонтрольПраваПримененияСпецрежима.ИмяНастройкиПравоПримененияСпецрежимаПатент();
	Иначе
		ИмяПоказателя = КонтрольПраваПримененияСпецрежима.ИмяПоказателяСпецрежимаДоходы();
	КонецЕсли;
	
	КонтрольПраваПримененияСпецрежима.ОтложитьПоказНапоминания(
		ОтборОрганизация,
		ИмяПоказателя,
		СледующееЗначениеНапоминания);
		
	Элементы.ИнформацияОПравеПримененияСпецрежима.Видимость = Ложь;
	
	Если ВыводитсяИнформацияОПатенте Тогда
		ПоказатьИнформациюОПравеПримененияСпецрежимаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтложитьПоказДополнительногоНапоминанияНаСервере()
	
	КонтрольПраваПримененияСпецрежима.ОтложитьПоказНапоминания(
		ОтборОрганизация,
		ИмяДополнительногоПоказателяСпецрежима,
		СледующееЗначениеДополнительногоНапоминания);
		
	Элементы.ДополнительнаяИнформацияОПравеПримененияСпецрежима.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Подключаемый_ПоказатьБаннерДиректБанк()

	ПоказатьБаннерДиректБанк(ЭтотОбъект);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьБаннерДиректБанк(Форма)
	
	Элементы = Форма.Элементы;
	ВидимостьБаннера = Ложь;
	Если Не Элементы.Баннер.Видимость // если не виден баннер персонализированного предложения
		И ЗначениеЗаполнено(БанковскийСчетОрганизации(Форма))
		И Форма.ВидимостьЭлементовДиректБанк = "ПоказатьБаннер" Тогда 
		
		ВидимостьБаннера = Истина;
		
		Если ЗначениеЗаполнено(Форма.НазваниеБанкаОсновногоБанковскогоСчета) Тогда
			ЧастиБанера = Новый Массив;
			ЧастиБанера.Добавить(Символы.ПС);
			ЧастиБанера.Добавить(Новый ФорматированнаяСтрока(
				НСтр("ru = 'Обменивайтесь с банком'"), Новый Шрифт(Новый Шрифт,, 14)));
			ЧастиБанера.Добавить(" ");
			ЧастиБанера.Добавить(Новый ФорматированнаяСтрока(
				Форма.НазваниеБанкаОсновногоБанковскогоСчета, Новый Шрифт(Новый Шрифт,, 14)));
			ЧастиБанера.Добавить(" ");
			ЧастиБанера.Добавить(Новый ФорматированнаяСтрока(
				НСтр("ru = 'напрямую!'"), Новый Шрифт(Новый Шрифт,, 14)));
			ЧастиБанера.Добавить(Символы.ПС);
			ЧастиБанера.Добавить(Символы.ПС);
			ЧастиБанера.Добавить(Новый ФорматированнаяСтрока(
				НСтр("ru = 'Подключите сервис 1С:ДиректБанк'"),,,, "ПодключитьДиректБанк"));
			ЧастиБанера.Добавить(" ");
			ЧастиБанера.Добавить(Новый ФорматированнаяСтрока(
				НСтр("ru = 'для отправки платежных документов и получения выписок'")));
			ЧастиБанера.Добавить(Символы.ПС);
			ЧастиБанера.Добавить(Новый ФорматированнаяСтрока(
				НСтр("ru = 'напрямую из 1С:Предприятия, без использования клиент-банка.'")));
			ЧастиБанера.Добавить(" ");
			ЧастиБанера.Добавить(Новый ФорматированнаяСтрока(
				НСтр("ru = 'Подробнее'"),,,, "https://portal.1c.ru/applications/44"));
			
			Элементы.ДекорацияТекстРекламы.Заголовок = Новый ФорматированнаяСтрока(ЧастиБанера);
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ГруппаРекламаДиректБанк.Видимость = ВидимостьБаннера;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НаименованиеБанковскогоСчета(БанковскийСчет)
	
	Результат = "";
	Если Не ЗначениеЗаполнено(БанковскийСчет) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскийСчет, "Банк.Наименование");
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция БанкИНомерСчета(БанковскийСчет)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(БанковскийСчет, "Банк, НомерСчета");
	
КонецФункции

&НаСервере
Процедура ОтборОрганизацияПриИзмененииСервер()
	
	УстановитьБанковскийСчетОрганизации();
	
	ОтборОрганизацияИспользование    = ЗначениеЗаполнено(ОтборОрганизация);
	ОтборБанковскийСчетИспользование = ЗначениеЗаполнено(ОтборБанковскийСчет) И ТолькоБанк(ОтборВсеДеньги);
	
	СкрытьРезультатСозданияДокументов(ЭтотОбъект);
	
	УстановитьВосстановленныеОтборы(Истина);
	
	БанкИКассаФормы.ОпределитьСчетаБезИнтеграции(ЭтотОбъект);
	УстановитьВидимостьБанковскогоСчета();
	
	НазваниеБанкаОсновногоБанковскогоСчета = НаименованиеБанковскогоСчета(ОтборБанковскийСчет);
	
	УстановитьВидимостьЭлементовДиректБанк(ЭтотОбъект);
	
	УстановитьФункциональныеОпцииФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОтборБанковскийСчетПриИзмененииСервер()
	
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "БанковскийСчет");
	СкрытьРезультатСозданияДокументов(ЭтотОбъект);
	
	НазваниеБанкаОсновногоБанковскогоСчета = НаименованиеБанковскогоСчета(ОтборБанковскийСчет);
	
	УстановитьВидимостьЭлементовДиректБанк(ЭтотОбъект);
	
	ПоказатьБаннерПредупрежденийПриЗагрузкеИУстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтчета(ИмяОтчета, ПараметрыОтчета = Неопределено)

	ФормаОтчета = ПолучитьФорму(СтрШаблон("Отчет.%1.ФормаОбъекта", ИмяОтчета), ПараметрыОтчета, ЭтотОбъект);
	
	ФормаОтчета.ПодключитьОбработчикОжидания("Подключаемый_СформироватьПриОткрытии",
		БухгалтерскиеОтчетыКлиент.ИнтервалЗапускаФормированияОтчетаПриОткрытии(),
		Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ФормаОтчета.Элементы.Результат,
		"ФормированиеОтчета");
	ФормаОтчета.Открыть();

КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()
	
	ОбщегоНазначенияБПКлиентСервер.УстановитьПараметрОрганизацияФункциональныхОпцийФормы(ЭтотОбъект, ОтборОрганизация);
	
КонецПроцедуры

#Область Баннер

&НаКлиенте
Процедура Подключаемый_УстановитьБаннер()
	
	УстановитьБаннер();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьСледующийБаннер()
	
	// Поскольку обработчик может вызываться не только интерактивно пользователем,
	// но и автоматически по таймеру, меняем баннер при условии, что форма находится в фокусе.
	Если НЕ ВводДоступен() Тогда
		ПодключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер",
			ПерсонализированныеПредложенияСервисовКлиент.ИнтервалПереключенияБаннеров(), Истина);
		Возврат;
	КонецЕсли;
	
	УстановитьБаннер();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьПредыдущийБаннер()
	
	УстановитьБаннер(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьБаннер(ПоказатьПредыдущий = Ложь)
	
	Если (ЕстьПредупреждения ИЛИ ЗначениеЗаполнено(ИнформацияАвтозагрузкиДиректБанк_ДатаОшибки)) Тогда
		Если Элементы.Баннер.Видимость Тогда
			ЗакрытьБаннерНажатие("");
		КонецЕсли;
	Иначе
		ДлительнаяОперация = ПолучитьБаннерНаСервере(ПоказатьПредыдущий);
		
		Если ДлительнаяОперация = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ДлительнаяОперация.Статус <> "Ошибка" Тогда
			
			НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
			
			Обработчик = Новый ОписаниеОповещения("ПослеПолученияБаннераВФоне", ЭтотОбъект);
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияБаннераВФоне(ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		УстановитьБаннерНаФорме(ДлительнаяОперация.АдресРезультата);
		ПодключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер",
			ПерсонализированныеПредложенияСервисовКлиент.ИнтервалПереключенияБаннеров(), Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьБаннерНаСервере(ПоказатьПредыдущий)
	
	НастройкиЗапуска = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	НастройкиЗапуска.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение баннера в фоне'");
	НастройкиЗапуска.ЗапуститьВФоне = Истина;
	НастройкиЗапуска.ОжидатьЗавершение = 0;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Организация", ?(ОтборОрганизацияИспользование, ОтборОрганизация, Неопределено));
	СтруктураПараметров.Вставить("Размещение", ПерсонализированныеПредложенияСервисов.ИмяРазмещенияДеньги());
	СтруктураПараметров.Вставить("ПоказатьПредыдущий", ПоказатьПредыдущий);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"ПерсонализированныеПредложенияСервисов.ПолучитьБаннер",
		СтруктураПараметров,
		НастройкиЗапуска);
	
КонецФункции

&НаСервере
Процедура УстановитьБаннерНаФорме(АдресРезультата)
	
	ПерсонализированныеПредложенияСервисов.УстановитьБаннерНаФорме(ЭтотОбъект, АдресРезультата);
	
	// Скрываем баннер ДиректБанка, если есть персонализированное предложение
	Если Элементы.Баннер.Видимость Тогда
		Элементы.ГруппаРекламаДиректБанк.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИнтеграцияСБанком

&НаСервере
Функция НастройкиАвтозагрузкиДиректБанк()
	
	ОтборОрганизацияАвтозагрукаДиректБанк = Справочники.Организации.ПустаяСсылка();
	Если ОтборОрганизацияИспользование Тогда
		ОтборОрганизацияАвтозагрукаДиректБанк = ОтборОрганизация;
	КонецЕсли;
	ОтборБанкАвтозагрукаДиректБанк = Справочники.Банки.ПустаяСсылка();
	ОтборБанковскийСчетАвтозагрукаДиректБанк = БанковскийСчетОрганизации(ЭтотОбъект, Истина);
	Если ВсеДеньги(ОтборВсеДеньги) И Не ЗначениеЗаполнено(ОтборБанковскийСчетАвтозагрукаДиректБанк) Тогда
		БанковскиеСчетаИнтеграции = Справочники.НастройкиИнтеграцииСБанками.БанковскиеСчетаОрганизацииВРежимеИнтеграции(
			ОтборОрганизация);
		Если БанковскиеСчетаИнтеграции.Количество() > 0 Тогда
			ОтборБанковскийСчетАвтозагрукаДиректБанк = БанковскиеСчетаИнтеграции[0];
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборБанковскийСчетАвтозагрукаДиректБанк) Тогда
		ОтборБанкАвтозагрукаДиректБанк = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ОтборБанковскийСчетАвтозагрукаДиректБанк, "Банк");
	КонецЕсли;
	Возврат ЭлектронноеВзаимодействиеБПВызовСервера.НастройкиОбменаАвтоматическоеПолучениеВыписки(
		ОтборОрганизацияАвтозагрукаДиректБанк,
		ОтборБанкАвтозагрукаДиректБанк);
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ВыполнитьОбновлениеИнформацииИБаннеровАвтозагрузки()
	
	// Сбросим видимость баннеров
	Элементы.ГруппаСостояниеАвтозагрузки.Видимость = Ложь;
	Элементы.ГруппаСостояниеАвтозагрузкиОшибка.Видимость = Ложь;
	Элементы.ГруппаНеобходимоПовторноеЧтение.Видимость = Ложь;
	// Очистим информацию по датам
	ИнформацияАвтозагрузкиДиректБанк_ДатаОшибки = Неопределено;
	ИнформацияАвтозагрузкиДиректБанк_ТекущаяДатаСинхронизации = Неопределено;
	
	Если ТолькоКасса(ОтборВсеДеньги) Тогда
		ОтключитьОбработчикОжидания("Подключаемый_ОбновитьИнформациюИБаннерыАвтозагрузки");
		Возврат;
	КонецЕсли;
	
	ПроверитьАвтоматическоеПолучениеВыпискиАктивно();
	ПодключенСервисАУСН = ИнтеграцияАУСНВызовСервераПовтИсп.СервисПодключен()
		Или ИнтеграцияАУСНВызовСервераПовтИсп.СервисЛКАУСНПодключен();
	Если АвтоматическоеПолучениеВыпискиАктивно Или ПодключенСервисАУСН Тогда
		Подключаемый_ОбновитьИнформациюИБаннерыАвтозагрузки();
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьИнформациюИБаннерыАвтозагрузки", 300);
	Иначе
		ОтключитьОбработчикОжидания("Подключаемый_ОбновитьИнформациюИБаннерыАвтозагрузки");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюАвтозагрузки()
	
	НастройкиОбмена = РаботаСОповещениямиОСостоянииОбменаССервисами.НовыйНастройкиОбмена();
	НастройкиОбмена.НастройкиДиректБанк = НастройкиАвтозагрузкиДиректБанк();
	НастройкиОбмена.НастройкиАУСН = ИнтеграцияАУСНБП.НастройкиИнтеграции(ОтборОрганизацияИспользование, ОтборОрганизация);
	ДанныеСостоянияОбмена = РаботаСОповещениямиОСостоянииОбменаССервисами.ДанныеСостоянияОбмена(
		НастройкиОбмена, УникальныйИдентификатор);
	
	ИнформацияАвтозагрузкиДиректБанк_ДатаОшибки = ДанныеСостоянияОбмена.ДатаОшибкиДиректБанк;
	ИнформацияАвтозагрузки_НоваяДатаСинхронизации = Макс(
		ДанныеСостоянияОбмена.ДатаСинхронизацииДиректБанк, ДанныеСостоянияОбмена.ДатаСинхронизацииАУСН);
	
	ЗаголовкиСостоянияОбмена = РаботаСОповещениямиОСостоянииОбменаССервисами.ЗаголовкиСостоянияОбмена(
		ДанныеСостоянияОбмена);
	
	Элементы.ВариантОтбораПредупрежденийПриЗагрузке.Заголовок =
		ЗаголовкиСостоянияОбмена.ЗаголовокВариантОтбораПредупрежденийПриЗагрузке;
	Элементы.ТекстСостояниеАвтозагрузкиОшибка.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
		ЗаголовкиСостоянияОбмена.ЗаголовокСостояниеАвтозагрузкиОшибка);
	Элементы.ТекстСостояниеАвтозагрузки.Заголовок = ЗаголовкиСостоянияОбмена.ЗаголовокСостояниеАвтозагрузки;
	
	АдресДанныхСостоянияОбмена = ПоместитьВоВременноеХранилище(ДанныеСостоянияОбмена, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ЧекиНПД

&НаКлиенте
Процедура Подключаемый_ОбновитьСтатусОфлайнЧековНПД()
	
	ЧекиНПДКлиент.ОбновитьСтатусыОфлайнЧековНПД();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьСведенияОСформированныхЧекахНПД()
	
	ЧекиНПДКлиент.ОбновитьСведенияОСформированныхЧекахНПД();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииКассовойСмены

&НаКлиенте
Функция ДоступнаРаботаСКассовойСменой()
	Если Не УправлениеКассовойСменойДоступно Тогда
		ПоказатьПредупреждение( , НСтр("ru='Недостаточно прав для выполнения операции'"));
	КонецЕсли;
	
	Возврат УправлениеКассовойСменойДоступно;
КонецФункции

&НаКлиенте
Процедура ОперацияЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Доступность = Истина;
	
	Если РезультатВыполнения <> Неопределено И Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОбновленияБаннера(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Оповестить("ОбновитьБаннеры_РозничнаяТорговля");
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКПодключаемомуОборудованиюЗавершение(Ответ, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОткрытьПодключаемоеОборудование(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьБаннерИПодменюКомандУправленияКассовойСменой(Форма, ОбновитьБаннер, ОбновитьПодменюУправленияКассовойСменой)
	
	Элементы = Форма.Элементы;
	
	ПараметрыРаботыСКассой = ИмяБаннераИПараметрыПодменюУправленияКассовойСменой(ОбновитьБаннер, ОбновитьПодменюУправленияКассовойСменой);
	Баннер = ПараметрыРаботыСКассой.Баннер;
	ПараметрыУправленияКассовойСменой = ПараметрыРаботыСКассой.ПараметрыУправленияКассовойСменой;
	
	Если ОбновитьБаннер Тогда
		Элементы.БаннерЗакрытьСмену_РозничнаяТорговля.Видимость = Баннер;
	КонецЕсли;
	
	Если ОбновитьПодменюУправленияКассовойСменой Тогда
		Если ПараметрыУправленияКассовойСменой = Неопределено Тогда
			Элементы.ПодменюКомандУправленияКассовойСменой.Видимость = Ложь;
		Иначе
			Элементы.ПодменюКомандУправленияКассовойСменой.Видимость = Не ТолькоБанк(Форма.ОтборВсеДеньги);
			ДоступныеКоманды = ПараметрыУправленияКассовойСменой.ДоступныеКоманды;
			Для Каждого Команда Из Элементы.КассоваяСменаПодменю.ПодчиненныеЭлементы Цикл
				Команда.Доступность
					= ДоступныеКоманды.Найти(Команда.Имя) <> Неопределено;
			КонецЦикла;
			Элементы.КассоваяСменаПодменю.Картинка = ПараметрыУправленияКассовойСменой.КартинкаСостоянияСмены;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяБаннераИПараметрыПодменюУправленияКассовойСменой(ОбновитьБаннер, ОбновитьПодменюУправленияКассовойСменой)
	
	Если ПолучитьФункциональнуюОпцию("ИнтерфейсТаксиПростой")
		И ПолучитьФункциональнуюОпцию("ИспользоватьФискальныйРегистратор") Тогда
		РаботаСКассой = Истина;
	Иначе
		РаботаСКассой = Ложь;
	КонецЕсли;
	
	Баннер = Ложь;
	ПараметрыУправленияКассовойСменой = Неопределено;
	
	Если РаботаСКассой И ОбновитьБаннер Тогда
		Баннер = ЖурналыДокументов.РозничныеПродажи.ВидимостьБаннераЗакрытьСмену();
	КонецЕсли;
	
	Если РаботаСКассой И ОбновитьПодменюУправленияКассовойСменой Тогда
		ПараметрыУправленияКассовойСменой = ЖурналыДокументов.РозничныеПродажи.ПараметрыПодменюУправленияКассовойСменой();
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Баннер", Баннер);
	Результат.Вставить("ПараметрыУправленияКассовойСменой", ПараметрыУправленияКассовойСменой);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ПоказатьПредупреждениеПоРаботеСМаркетплейсами()
	
	ПоказатьПредупреждениеПоРаботеСМаркетплейсамиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьПредупреждениеПоРаботеСМаркетплейсамиНаСервере()
	
	ЖурналыДокументов.Деньги.ПоказатьПредупреждениеПоРаботеСМаркетплейсами(Элементы, ОтборОрганизация);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СкрытьПредупреждениеПоРаботеСМаркетплейсами()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		ЖурналыДокументов.Деньги.ИмяНастройкиПредупрежденияПоРаботеСМаркетплейсами(),
		ЖурналыДокументов.Деньги.КлючНастройкиПредупрежденияПоРаботеСМаркетплейсами(),
		Ложь);
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Функция НовыйСведенияОВладельцеБанковскогоСчетаИзКонтекста()
	
	СведенияОВладельцеБанковскогоСчетаИзКонтекста = Новый Структура;
	СведенияОВладельцеБанковскогоСчетаИзКонтекста.Вставить("Организация",               Новый Массив);
	СведенияОВладельцеБанковскогоСчетаИзКонтекста.Вставить("БанковскийСчетОрганизации", Новый Массив);
	
	Возврат СведенияОВладельцеБанковскогоСчетаИзКонтекста;
	
КонецФункции

&НаСервере
Процедура СкрытьНажатиеТекстКонтекстнаяПодсказкиИнтеграцияСБанком()
	
	БанкИКассаФормы.СкрытьНажатиеТекстКонтекстнаяПодсказкиИнтеграцияСБанком(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВсеДеньги(ЗначениеОтбора)

	Возврат ЗначениеОтбора = 0;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТолькоБанк(ЗначениеОтбора)

	Возврат ЗначениеОтбора = 1;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТолькоКасса(ЗначениеОтбора)

	Возврат ЗначениеОтбора = 2;

КонецФункции

&НаСервере
Процедура УстановитьОтборВсеДеньги()
	
	ОтборТипДокумента = Новый СписокЗначений;
	ОтборТипДокументаИспользование = Ложь;
	Если ТолькоБанк(ОтборВсеДеньги) Тогда
		ОтборТипДокумента.Добавить(Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет"));
		ОтборТипДокумента.Добавить(Тип("ДокументСсылка.СписаниеСРасчетногоСчета"));
		ОтборТипДокументаИспользование = Истина;
	ИначеЕсли ТолькоКасса(ОтборВсеДеньги) Тогда
		ОтборТипДокумента.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
		ОтборТипДокумента.Добавить(Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
		ОтборТипДокументаИспользование = Истина;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Тип",
		ОтборТипДокумента,
		ВидСравненияКомпоновкиДанных.ВСписке,,
		ОтборТипДокументаИспользование);
	
КонецПроцедуры

&НаСервере
Процедура ОтборВсеДеньгиПриИзмененииНаСервере()
	
	Если ОтборБанковскийСчетИспользование Тогда
		ОтборБанковскийСчетИспользование = Ложь;
		ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "БанковскийСчет");
	КонецЕсли;
	УстановитьВидимостьБанковскогоСчета();
	
	СкрытьРезультатСозданияДокументов(ЭтотОбъект);
	
	Если ВсеДеньги(ОтборВсеДеньги) Тогда
		УстановитьБанковскийСчетОрганизации();
		ОтборБанковскийСчетПриИзмененииСервер();
	КонецЕсли;
	
	ОбновитьБаннерИПодменюКомандУправленияКассовойСменой(ЭтотОбъект, Ложь, Истина);
	
	ПоказатьБаннерПредупрежденийПриЗагрузкеИУстановитьОтбор();
	
	УстановитьВидимостьЭлементовВсеДеньги();
	
	УстановитьОтборВсеДеньги();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьБанковскогоСчета()
	
	ИспользоватьНесколькоБанковскихСчетовОрганизации    = ТолькоБанк(ОтборВсеДеньги)
		И ИспользуетсяНесколькоБанковскихСчетовОрганизации(ОтборОрганизация);
	
	Элементы.ОтборБанковскийСчет.Видимость              = ИспользоватьНесколькоБанковскихСчетовОрганизации;
	Элементы.ОтборБанковскийСчетИспользование.Видимость = ИспользоватьНесколькоБанковскихСчетовОрганизации;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИспользуетсяНесколькоБанковскихСчетовОрганизации(Организация)
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Возврат Справочники.БанковскиеСчета.ИспользуетсяНесколькоБанковскихСчетовОрганизации(Организация);
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция КлассификаторБанкаПоОтбору(БанковскийСчет)
	
	БИК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскийСчет, "Банк.Код");
	Возврат РаботаСБанкамиБП.СсылкаПоКлассификатору(БИК);
	
КонецФункции

&НаСервере
Процедура УстановитьБанковскийСчетОрганизации()
	
	Если Не ИнтеграцияСБанкамиПодключена Тогда
		УчетДенежныхСредствБП.УстановитьБанковскийСчет(ОтборБанковскийСчет, ОтборОрганизация,
			ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
	КонецЕсли;
	
	Если ВсеДеньги(ОтборВсеДеньги) Тогда
		УОрганизацииТолькоОдинБанковскийСчет = Справочники.БанковскиеСчета.КоличествоБанковскихСчетовОрганизации(
			ОтборОрганизация) = 1;
		Если УОрганизацииТолькоОдинБанковскийСчет И ИнтеграцияСБанкамиПодключена Тогда
			ОтборБанковскийСчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОтборОрганизация, "ОсновнойБанковскийСчет");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция БанковскийСчетОрганизации(Форма, ПроверятьИспользование = Ложь)
	
	Если ВсеДеньги(Форма.ОтборВсеДеньги) Тогда
		Возврат ?(Форма.УОрганизацииТолькоОдинБанковскийСчет, Форма.ОтборБанковскийСчет, Неопределено);
	ИначеЕсли ТолькоБанк(Форма.ОтборВсеДеньги) Тогда
		Возврат ?(Не ПроверятьИспользование Или Форма.ОтборБанковскийСчетИспользование,
			Форма.ОтборБанковскийСчет, Неопределено);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовДиректБанк(Форма)
	
	Если (Форма.ИнтеграцияСБанкамиПодключена И Не ЗначениеЗаполнено(Форма.ОтборБанковскийСчет))
		Или (ВсеДеньги(Форма.ОтборВсеДеньги) И Не Форма.УОрганизацииТолькоОдинБанковскийСчет)
		Или ТолькоКасса(Форма.ОтборВсеДеньги) Тогда
		Форма.ВидимостьЭлементовДиректБанк = "НеПоказывать";
	Иначе
		Форма.ВидимостьЭлементовДиректБанк = ЭлектронноеВзаимодействиеБПВызовСервера.ВидимостьЭлементовДиректБанк(
			Форма.ОтборОрганизация, Форма.ОтборБанковскийСчет);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовВсеДеньги()
	
	Элементы.ГруппаКомандыБанка.Видимость = Не ТолькоКасса(ОтборВсеДеньги);
	Элементы.ГруппаДоход.Видимость = ВсеДеньги(ОтборВсеДеньги);
	Элементы.ГруппаРасход.Видимость = ВсеДеньги(ОтборВсеДеньги);
	Элементы.ГруппаТолькоБанк.Видимость =ТолькоБанк(ОтборВсеДеньги); 
	Элементы.ГруппаТолькоКасса.Видимость = ТолькоКасса(ОтборВсеДеньги);
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаПредупрежденийПриЗагрузке

&НаСервере
Процедура УстановитьВариантОтбораПредупрежденийПриЗагрузкеИзПараметров(Параметры)
	
	Если Параметры.Свойство("ПоказатьПредупреждения")
		И Параметры.ПоказатьПредупреждения Тогда
		
		ВариантОтбораПредупрежденийПриЗагрузке = ВариантОтбораТребующиеПроверки();
		ОткрытаДляПроверкиЗагрузкиДокументов = Истина;
		
	Иначе
		
		ВариантОтбораПредупрежденийПриЗагрузке = ВариантОтбораВсе();
		ОткрытаДляПроверкиЗагрузкиДокументов = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВариантОтбораВсе()
	Возврат "Все";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВариантОтбораТребующиеПроверки()
	Возврат "ТребующиеПроверки";
КонецФункции

&НаСервере
Процедура ПоказатьБаннерПредупрежденийПриЗагрузкеИУстановитьОтбор()
	
	Если Не ТолькоКасса(ОтборВсеДеньги) Тогда
		ОрганизацияПредупреждений = ?(ОтборОрганизацияИспользование, ОтборОрганизация, Неопределено);
		БанковскийСчетПредупреждений = ?(ОтборБанковскийСчетИспользование, ОтборБанковскийСчет, Неопределено);
		ДатаПредупреждений = ?(ОтборДатаОтбораИспользование, ОтборДатаОтбора, Неопределено);
		
		ЕстьПредупреждения = ЕстьДокументыСПредупреждениямиПриЗагрузке(
			ОрганизацияПредупреждений, БанковскийСчетПредупреждений, ДатаПредупреждений);
	Иначе
		ЕстьПредупреждения = Ложь;
	КонецЕсли;
	
	НачальнаяВидимостьБаннера = Элементы.ГруппаПредупрежденияПриЗагрузкеИзКлиентБанка.Видимость;
	Элементы.ГруппаПредупрежденияПриЗагрузкеИзКлиентБанка.Видимость = ЕстьПредупреждения;
	ПараметрыОтбора = Новый Структура("Организация", ОрганизацияПредупреждений);
	Если Не ЕстьПредупреждения Тогда
		ВариантОтбораПредупрежденийПриЗагрузке = ВариантОтбораВсе();
	ИначеЕсли ЕстьПредупреждения И ПолучитьФункциональнуюОпцию("ПрименяетсяАУСН", ПараметрыОтбора)
		И Не НачальнаяВидимостьБаннера Тогда
		ВариантОтбораПредупрежденийПриЗагрузке = ВариантОтбораТребующиеПроверки();
	КонецЕсли;
	
	УстановитьОтборПредупрежденийПриЗагрузке(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьДокументыСПредупреждениямиПриЗагрузке(Организация, СчетОрганизации, Дата)
	
	ПараметрыОтбораПредупреждений = РегистрыСведений.ПредупрежденияПриЗагрузкеВыписки.НовыеПараметрыОтбораПредупреждений();
	ПараметрыОтбораПредупреждений.Организация = Организация;
	ПараметрыОтбораПредупреждений.СчетОрганизации = СчетОрганизации;
	ПараметрыОтбораПредупреждений.НачалоПериода = Дата;
	ПараметрыОтбораПредупреждений.КонецПериода = Дата;
	
	Возврат РегистрыСведений.ПредупрежденияПриЗагрузкеВыписки.ЕстьПредупрежденияВСписке(ПараметрыОтбораПредупреждений);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПредупрежденийПриЗагрузке(Форма)
	
	Настройки = Форма.Список.КомпоновщикНастроек.Настройки;
	
	ИмяПоля = "Ссылка";
	
	Если Форма.ВариантОтбораПредупрежденийПриЗагрузке = ВариантОтбораТребующиеПроверки() Тогда
		
		ОрганизацияПредупреждений = ?(Форма.ОтборОрганизацияИспользование, Форма.ОтборОрганизация, Неопределено);
		ДокументыСПредупреждениямиПриЗагрузке = ДокументыСПредупреждениямиПриЗагрузке(ОрганизацияПредупреждений);
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(
			Настройки.Отбор,
			ИмяПоля);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Настройки.Отбор,
			ИмяПоля,
			ДокументыСПредупреждениямиПриЗагрузке,
			ВидСравненияКомпоновкиДанных.ВСписке,
			,
			Истина);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(
			Настройки.Отбор,
			ИмяПоля);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДокументыСПредупреждениямиПриЗагрузке(Организация)
	
	ПараметрыОтбораПредупреждений = РегистрыСведений.ПредупрежденияПриЗагрузкеВыписки.НовыеПараметрыОтбораПредупреждений();
	ПараметрыОтбораПредупреждений.Организация = Организация;
	
	Возврат РегистрыСведений.ПредупрежденияПриЗагрузкеВыписки.ДокументыСПредупреждениями(ПараметрыОтбораПредупреждений);
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_АУСН()
	
	ИнтеграцияАУСНКлиент.ВыполнитьОбменССервисом(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы(МожноРедактировать)
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	МобильныйКлиентБПФормаСписка.НастроитьФормуОбъекта(ЭтотОбъект);
	
	Если Не ИнтеграцияСБанкамиПодключена Тогда
		ПолеМК_ВидДокумента = Элементы.Добавить("ПолеМК_ВидДокумента", Тип("ПолеФормы"), ЭтотОбъект);
		ПолеМК_ВидДокумента.ПутьКДанным = "ОтборВсеДеньги";
		ПолеМК_ВидДокумента.Вид = ВидПоляФормы.ПолеПереключателя;
		ПолеМК_ВидДокумента.ВидПереключателя = ВидПереключателя.Тумблер;
		ПолеМК_ВидДокумента.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеМК_ВидДокумента.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
		ПолеМК_ВидДокумента.УстановитьДействие("ПриИзменении", "ОтборВсеДеньгиПриИзменении");
		
		ПолеМК_ВидДокумента.СписокВыбора.Очистить();
		Для каждого ЗначенияЭлементов Из Элементы.ОтборВсеДеньги.СписокВыбора Цикл
			ПолеМК_ВидДокумента.СписокВыбора.Добавить(ЗначенияЭлементов.Значение, ЗначенияЭлементов.Представление)
		КонецЦикла;

		МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМКШапка(ЭтотОбъект, ПолеМК_ВидДокумента);
	КонецЕсли;
	
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМКСписок(ЭтотОбъект, Элементы.Список);
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМКСписок(ЭтотОбъект, Элементы.ГруппаИтоги);
	
	АдаптироватьМККоманднаяПанельФормы(МожноРедактировать);
	
	АдаптироватьМКОтборыФормы();
	
	АдаптироватьМКСписокФормы();
	
	АдаптироватьМККонтекстСписокФормы();
	
	АдаптироватьМКИтогиСпискаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМККоманднаяПанельФормы(МожноРедактировать)
	
	КомандыПоля = МобильныйКлиентБПФормаСписка.НовыйОписаниеКомандТабличноеПоле();
	//Управляем вручную
	КомандыПоля.РазрешеноИзменение = Ложь;
	КомандыПоля.ДоступноУправлениеОтбором = Истина;
	
	МобильныйКлиентБПФормаСписка.АдаптироватьМККоманднаяПанельФормы(ЭтотОбъект, КомандыПоля);
	
	МобильныйКлиентБПФормаСписка.ПеренестиЭлементВМККомандыФормы(ЭтотОбъект, Элементы.ФормаОткрытьКлиентБанк);
	МобильныйКлиентБПФормаСписка.ПеренестиКомандыВМККомандыФормы(ЭтотОбъект, Элементы.ПодменюОтчеты.ПодчиненныеЭлементы);
	
	Если МожноРедактировать Тогда
		МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМКСоздать(ЭтотОбъект, Элементы.ГруппаДоход);
		МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМКСоздать(ЭтотОбъект, Элементы.ГруппаРасход);
		МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМКСоздать(ЭтотОбъект, Элементы.ГруппаТолькоБанк);
		МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМКСоздать(ЭтотОбъект, Элементы.ГруппаТолькоКасса);
	
		ЗаголовокГруппы = НСтр("ru = 'Создать'");
		МобильныйКлиентБПФормаСписка.АдаптироватьГруппаМКСоздать(ЭтотОбъект, Истина, ЗаголовокГруппы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаМКПоказатьСкрытьПрочиеКолонки(Команда)
	
	МобильныйКлиентБПФормаОбъектаКлиентСервер.УправлениеФормойСпискаКолонкаПрочее(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКОтборыФормы()
	
	МобильныйКлиентБПФормаСписка.НастроитьФормуОтбораМК(ЭтотОбъект, "Список", "Организация");
	МобильныйКлиентБПФормаСписка.АдаптироватьМКЭлементОтбораОрганизация(ЭтотОбъект,
		Элементы.ОтборОрганизация,
		"",
		"Все организации");
	МобильныйКлиентБПФормаСписка.АдаптироватьМКЭлементОтбораБыстрыеОтборы(ЭтотОбъект,
		Элементы.ОтборДатаОтбора, НСтр("ru = 'Дата'"), "");
	МобильныйКлиентБПФормаСписка.АдаптироватьМКЭлементОтбораБыстрыеОтборы(ЭтотОбъект,
		Элементы.ОтборБанковскийСчет,
		НСтр("ru = 'Банковский счет'"),
		НСтр("ru = 'Все банковские счета'"));
		
	
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМКБыстрыеОтборы(ЭтотОбъект, Элементы.ГруппаДополнительныеОтборы);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаМКПоказатьСкрытьОтбор(Команда)
	
	МобильныйКлиентБПФормаОбъектаКлиентСервер.УправлениеФормойОтбораМК(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМККонтекстСписокФормы()

	МобильныйКлиентБПФормаОбъекта.АдаптироватьКонтекстноеМеню(ЭтотОбъект, "СписокКонтекстноеМенюГруппа");
	
	МобильныйКлиентБПФормаОбъекта.ПереместитьЭлементыФормы(Элементы,
		Элементы.ГруппаГлобальныеКоманды.ПодчиненныеЭлементы,
		Элементы.Список.КонтекстноеМеню);
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКСписокФормы()
	
	МобильныйКлиентБПФормаСписка.ПодготовитьСписокФормы(ЭтотОбъект);
	
	//В реквизитах установить "Использовать всегда" для источника КолонкаСостояниеДокумента
	МобильныйКлиентБПФормаСписка.ДобавитьКолонкаСостояниеДокумента(ЭтотОбъект, "СтандартнаяКартинка", "Список");
	
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМК_СостояниеДокумента(ЭтотОбъект, Элементы.СчетВРежимеИнтеграции);
	
	Элементы.Дата.РастягиватьПоГоризонтали = Истина;
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМК_ДатаНомер(ЭтотОбъект, Элементы.Дата);
	
	Элементы.Доход.ЦветТекста = ЦветаСтиля.ЦветТекстаПоложительногоЗначения;
	Элементы.Расход.ЦветТекста = ЦветаСтиля.ЦветТекстаОтрицательногоЗначения;
	
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМК_СуммаДокумента(ЭтотОбъект, Элементы.Доход);
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМК_СуммаДокумента(ЭтотОбъект, Элементы.Расход);
	
	Элементы.Контрагент.РастягиватьПоГоризонтали = Истина;
	Элементы.Контрагент.АвтоВысотаЯчейки = Истина;
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМК_Важное(ЭтотОбъект, Элементы.Контрагент);
	
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМК_Строка(ЭтотОбъект, Элементы.ВидОперации, 1);
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМК_Строка(ЭтотОбъект, Элементы.Тип, 2);
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМК_Строка(ЭтотОбъект, Элементы.БанковскийСчет, 3);
	
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМК_Прочее(ЭтотОбъект, Элементы.Организация);
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементыВГруппуМК_Прочее(ЭтотОбъект, "Список");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Доход");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Список.Доход", ВидСравненияКомпоновкиДанных.Равно, 0);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Расход");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Список.Расход", ВидСравненияКомпоновкиДанных.Равно, 0);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКИтогиСпискаФормы()
	
	МобильныйКлиентБПФормаСписка.СкрытьЭлементФормыСписка(ЭтотОбъект, Элементы.ИтогДата);
	
	Элементы.ГруппаИтоги.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	Элементы.ГруппаИтоги.ЦветФона = ЦветаСтиля.ЦветФонаФормы;
	Элементы.ГруппаИтоги.ОтображатьЗаголовок = Истина;
	Элементы.ГруппаИтоги.Скрыть();
	
	Элементы.ГруппаОстаткиОбороты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	Элементы.ГруппаОстаткиОбороты.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Авто;
	Элементы.ГруппаОстаткиОбороты.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Авто;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиГруппыИтогиМК(ЭлементГруппы, ДатаИтогов, ИтогиНаКонецДня)
	
	ПредставлениеДатаИтогов = Формат(ДатаИтогов, "ДФ=dd.MM.yyyy");
	ЭлементГруппы.Заголовок = СтрШаблон(НСтр("ru = 'Остаток (%1)'"), ПредставлениеДатаИтогов);
	ЭлементГруппы.ЗаголовокСвернутогоОтображения = СтрШаблон(НСтр("ru = 'Остаток (%1): %2'"),
		ПредставлениеДатаИтогов,
		Формат(ИтогиНаКонецДня, "ЧДЦ=2; ЧН=0,00"));
	
КонецПроцедуры

#КонецОбласти