#Область ОписаниеПеременных

&НаКлиенте
Перем ОткрытыеФормы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МобильныйКлиентАдаптацияФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АктыСверкиВзаиморасчетов(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.АктСверкиВзаиморасчетов.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
		
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаДолга(Команда)
		
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.КорректировкаДолга.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
		
КонецПроцедуры

&НаКлиенте
Процедура НачислениеПеней(Команда)
		
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.НачислениеПеней.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
		
КонецПроцедуры

&НаКлиенте
Процедура ПередачаЗадолженностиНаФакторинг(Команда)
		
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПередачаЗадолженностиНаФакторинг.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанели(ЭтотОбъект,
		"ДокументАктСверкиВзаиморасчетовОткрытьСписок");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
