
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЭтоГруппаНоменклатуры(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Владелец", ПараметрКоманды));
	
	ОткрытьФорму("Справочник.УпаковкиНоменклатуры.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
КонецПроцедуры

&НаСервере
Функция ЭтоГруппаНоменклатуры(Номенклатура)
	
	Возврат Номенклатура.ЭтоГруппа;
	
КонецФункции