#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТаблицаОКАТО.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресТаблицы));
	Строки = ТаблицаОкато.НайтиСтроки(Новый Структура("Код", Параметры.НачальноеЗначение));
	Если Строки.Количество() > 0 Тогда
		Элементы.ТаблицаОКАТО.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыТаблицаОКАТО

&НаКлиенте
Процедура ТаблицаОКАТООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьОКАТО();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	ВыбратьОКАТО();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьОКАТО()
	
	ТекСтрока = Элементы.ТаблицаОКАТО.ТекущиеДанные;
	Структура = Новый Структура("Код, Наименование", ТекСтрока.Код, ТекСтрока.Наименование);
	ОповеститьОВыборе(Структура);
	
КонецПроцедуры

#КонецОбласти
