#Область СлужебныйПрограммныйИнтерфейс

// Добавляет элемент условного оформления в форму списка, красным цветом подсвечиваются документы,
// в случае утраты контрагентом статуса плательщика налога на профессиональный доход. Форма должна
// иметь колонку "СтатусЧекаНПД"
//
// Параметры:
//  ЭлементыУсловногоОформления - КоллекцияЭлементовУсловногоОформленияКомпоновкиДанных
//
Процедура ДобавитьУсловноеОформлениеНепредоставленныхЧековНПД(ЭлементыУсловногоОформления) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользуютсяДоговорыССамозанятыми") Тогда
		ЭлементОформления = ЭлементыУсловногоОформления.Добавить();
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементОформления.Отбор,
			"СтатусЧекаНПД",
			ВидСравненияКомпоновкиДанных.Равно,
			Перечисления.СтатусыЧековНПД.УтраченСтатусПлательщикаНПД);
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти