#Область ПрограммныйИнтерфейс

// Возвращает признак применения расходов на приобретение онлайн-кассы в качестве вычета на налоговый платеж
//
// Параметры:
//  Организация - СправочникСсылка.Организации
//  Период - Дата
//  ВидНалогообложения - ВидыНалоговУменьшаемыхНаРасходыККТ
//
// Возвращаемое значение:
//  Булево
//
Функция ВычетыПрименяются(Организация, Период, ВидНалогообложения) Экспорт
	
	Возврат Ложь;
	
КонецФункции

Функция ДатаНачалаПримененияВычета() Экспорт
	
	Возврат Дата(2018, 1, 1);
	
КонецФункции

Функция ДатаОкончанияПримененияВычета() Экспорт
	
	Возврат Дата(2019, 1, 1);
	
КонецФункции

#КонецОбласти