
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если МобильныйКлиентБПКлиент.ЭтоМобильныйКлиент() Тогда
		ПараметрыОткрытия = МобильныйКлиентБПКлиентСервер.НовыйПараметрыОткрытияФормыСПредупреждением();
		ПараметрыОткрытия.ИмяФормы = "ЖурналДокументов.ЖурналОпераций.Форма.ФормаСпискаМаркетплейсы";
		МобильныйКлиентБПКлиент.ПоказатьФормуНедоступнаяФункциональность(
			"Загрузить отчеты о продажах через маркетплейсы",
			,, ПараметрыОткрытия);
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием(ПараметрыВыполненияКоманды);
	ПараметрыОткрытия.ИмяФормы = "ЖурналДокументов.ЖурналОпераций.Форма.ФормаСпискаМаркетплейсы";
	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия);
	
КонецПроцедуры
