#Область ПрограммныйИнтерфейс

// Возвращает тег начала условия для шаблона письма рассылки.
//
// Параметры:
//  ИмяУсловия - Строка - имя условия.
//
// Возвращаемое значение:
//   Строка - тег начала условия.
//
Функция ТегНачалоУсловия(ИмяУсловия = "") Экспорт

	Если ЗначениеЗаполнено(ИмяУсловия) Тогда
		Возврат "{Условие " + ИмяУсловия +"}";
	Иначе
		Возврат "{Условие}";
	КонецЕсли;
	
КонецФункции

// Возвращает тег окончания условия для шаблона письма рассылки.
//
// Возвращаемое значение:
//   Строка - тег окончания условия.
//
Функция ТегОкончаниеУсловия() Экспорт
	
	Возврат "{/Условие}";
	
КонецФункции

#КонецОбласти