#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Проверяет состояние фонового задания по переданному идентификатору.
//
// Параметры:
//  ИдентификаторЗадания - УникальныйИдентификатор - идентификатор фонового задания. 
//
// Возвращаемое значение:
//  Булево - состояние выполнения задания.
// 
Функция ЗаданиеВыполнено(Знач ИдентификаторЗадания) Экспорт
	
	Если ТипЗнч(ИдентификаторЗадания) = Тип("Строка") Тогда
		ИдентификаторЗадания = Новый УникальныйИдентификатор(ИдентификаторЗадания);
	КонецЕсли;
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	
	Если Задание <> Неопределено
		И Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОперацияНеВыполнена = Истина;
	ПоказатьПолныйТекстОшибки = Ложь;
	Если Задание = Неопределено Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Длительные операции.Фоновое задание не найдено'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Предупреждение, , , Строка(ИдентификаторЗадания));
	Иначе
		Если Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			ОшибкаЗадания = Задание.ИнформацияОбОшибке;
			Если ОшибкаЗадания <> Неопределено Тогда
				ПоказатьПолныйТекстОшибки = Истина;
			КонецЕсли;
		ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Длительные операции.Фоновое задание отменено администратором'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Предупреждение,
				,
				,
				НСтр("ru = 'Выполнение фонового задания прервано администратором.'"));
			Возврат Истина;
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ПоказатьПолныйТекстОшибки Тогда
		ТекстОшибки = КраткоеПредставлениеОшибки(ПолучитьИнформациюОбОшибке(Задание.ИнформацияОбОшибке));
		ВызватьИсключение(ТекстОшибки);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НоваяКонтактнаяИнформация() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КонтактнаяИнформация"); // Строка, 0 - XML 
	Результат.Вставить("Представление");        // Строка, 0
	Результат.Вставить("Комментарий");          // Строка, 0
	Возврат Результат;
	
КонецФункции

Функция ПолучитьXMLПредставлениеАдреса(ЗначенияПолей, ВидКИ, Представление = "") Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЗначенияПолей) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	АдресXML = "";
	ДопустимыеТипы = "Индекс, Страна, Регион, Район, Город, Улица, Дом, Корпус, Квартира";
	
	Если ТипЗнч(ЗначенияПолей) = Тип("Структура") Тогда
		Для Каждого ТекСв Из ЗначенияПолей Цикл
			Если ТекСв.Ключ = "КодРегион" Тогда
				АдресXML = АдресXML + "КодРегиона" + "=" + ТекСв.Значение + Символы.ПС;
			ИначеЕсли ТекСв.Ключ = "Населенный пункт" Тогда
				АдресXML = АдресXML + "НаселенныйПункт" + "=" + ТекСв.Значение + Символы.ПС;
			ИначеЕсли ТекСв.Ключ = "Кварт" Тогда
				АдресXML = АдресXML + "Квартира" + "=" + ТекСв.Значение + Символы.ПС;
			ИначеЕсли Найти(ДопустимыеТипы, ТекСв.Ключ) >0 ТОгда
				АдресXML = АдресXML + ТекСв.Ключ + "=" + ТекСв.Значение + Символы.ПС;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого ТекСв Из ЗначенияПолей Цикл
			Если ТекСв.Тип = "Почтовый индекс" Тогда
				АдресXML = АдресXML + "Индекс" + "=" + ТекСв.Значение + Символы.ПС;
			ИначеЕсли ТекСв.Тип = "Населенный пункт" Тогда
				АдресXML = АдресXML + "НаселенныйПункт" + "=" + ТекСв.Значение + Символы.ПС;
			ИначеЕсли Найти(ДопустимыеТипы, ТекСв.Тип) >0 ТОгда
				АдресXML = АдресXML + ТекСв.Тип + "=" + ТекСв.Значение + Символы.ПС;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	АдресXML = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(АдресXML, Представление , ВидКИ);
	
	Возврат АдресXML;
	
КонецФункции

Процедура ПрочитатьКарточки(НастройкиЧтенияПочты, АдресХранилищаРезультата) Экспорт
	
	Письма = ЗагрузкаПочтовыхСообщений.ПрочитатьПисьма(НастройкиЧтенияПочты);
	
	Если Письма = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресаXMLФайлов = Новый Массив;
	
	Для Каждого Письмо ИЗ Письма Цикл
		Для Каждого Вложение ИЗ Письмо.Вложения Цикл
			Если НЕ ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(Вложение.Ключ) = "xml" Тогда
				Продолжить;
			КонецЕсли;
			АдресВХранилище = ПоместитьВоВременноеХранилище(Вложение.Значение, Новый УникальныйИдентификатор);
			АдресаXMLФайлов.Добавить(АдресВХранилище);
		КонецЦикла;
	КонецЦикла;
	
	ДанныеКарточек = Справочники.Контрагенты.РазобратьКарточкиКонтрагентовXML(АдресаXMLФайлов);
	ПоместитьВоВременноеХранилище(ДанныеКарточек, АдресХранилищаРезультата);
	
КонецПроцедуры

Функция ПолучитьИнформациюОбОшибке(ИнформацияОбОшибке)
	
	Результат = ИнформацияОбОшибке;
	Если ИнформацияОбОшибке <> Неопределено Тогда
		Если ИнформацияОбОшибке.Причина <> Неопределено Тогда
			Результат = ПолучитьИнформациюОбОшибке(ИнформацияОбОшибке.Причина);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли