#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбновитьИдентификатор(НовыйИдентификатор) Экспорт
	
	ПараметрыПолучателя = Новый Структура;
	
	ПараметрыПолучателя.Вставить("Пользователь", Пользователи.ТекущийПользователь());
	ПараметрыПолучателя.Вставить("ИдентификаторПолучателя", НовыйИдентификатор);
	
	ПараметрыПолучателя.Вставить("РассылатьПоСпискуЗадач", ПравоДоступа("Чтение",
		Метаданные.РегистрыСведений.ЗадачиБухгалтера));
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбновитьИдентификаторПолучателя(ПараметрыПолучателя);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПолучателиУведомленийПоСпискуЗадач() Экспорт
	
	УчетПоНесколькимОрганизациям = Справочники.Организации.ИспользуетсяНесколькоОрганизаций();
	
	ТаблицаПолучателей = Новый ТаблицаЗначений;
	
	ТаблицаПолучателей.Колонки.Добавить("Пользователь", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ТаблицаПолучателей.Колонки.Добавить("ИдентификаторПолучателя", Новый ОписаниеТипов("ХранилищеЗначения"));
	ТаблицаПолучателей.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолучателиPushУведомлений.Пользователь КАК Пользователь,
		|	ПолучателиPushУведомлений.ИдентификаторПолучателя КАК ИдентификаторПолучателя
		|ИЗ
		|	РегистрСведений.ПолучателиPushУведомлений КАК ПолучателиPushУведомлений
		|ГДЕ
		|	ПолучателиPushУведомлений.РассылатьПоСпискуЗадач";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если УчетПоНесколькимОрганизациям Тогда
			РазрешенныеОрганизации = УправлениеДоступом.РазрешенныеЗначенияДляДинамическогоСписка("РегистрБухгалтерии.Хозрасчетный",
				Тип("СправочникСсылка.Организации"), Выборка.Пользователь);
			
			Если РазрешенныеОрганизации = Неопределено Тогда
				РазрешенныеОрганизации = Справочники.Организации.ДоступныеОрганизацииПоRLS();
			КонецЕсли;
			
			Для каждого Организация Из РазрешенныеОрганизации Цикл
				НоваяСтрока = ТаблицаПолучателей.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				НоваяСтрока.Организация = Организация;
			КонецЦикла;
		Иначе
			НоваяСтрока = ТаблицаПолучателей.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаПолучателей;
	
КонецФункции

Функция ТекущийИдентификаторПолучателя(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолучателиPushУведомлений.ИдентификаторПолучателя КАК ИдентификаторПолучателя
		|ИЗ
		|	РегистрСведений.ПолучателиPushУведомлений КАК ПолучателиPushУведомлений
		|ГДЕ
		|	ПолучателиPushУведомлений.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ИдентификаторПолучателя.Получить();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьИдентификаторПолучателя(ПараметрыПолучателя)
	
	НастройкаPush = РегистрыСведений.НастройкиОтправкиPushУведомлений.ДанныеАутентификации();
	
	Если НастройкаPush = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь = ПараметрыПолучателя.Пользователь;
	
	МенеджерЗаписи.Прочитать();
	
	Если НЕ МенеджерЗаписи.Выбран() Тогда
		ЗарегистрироватьНовогоПолучателя(ПараметрыПолучателя);
		
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи.ИдентификаторПолучателя = Новый ХранилищеЗначения(ПараметрыПолучателя.ИдентификаторПолучателя);
	
	Попытка
		МенеджерЗаписи.Записать(Истина);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru='Изменение идентификатора получателя push'"),
			УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗарегистрироватьНовогоПолучателя(ПараметрыПолучателя)
	
	Если ПараметрыПолучателя.РассылатьПоСпискуЗадач Тогда
		PushУведомления.ЗапланироватьРассылкуPushУведомлений();
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыПолучателя);
	
	МенеджерЗаписи.ИдентификаторПолучателя = Новый ХранилищеЗначения(ПараметрыПолучателя.ИдентификаторПолучателя);
	
	Попытка
		МенеджерЗаписи.Записать(Истина);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru='Регистрация нового получателя push уведомлений'"),
			УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
