
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	МоиПриложенияКонтрольнаяСумма = Параметры.МоиПриложенияКонтрольнаяСумма;
	
	ЗаполнитьДоступныеПриложения();
	
	СтатистикаПоПоказателямКлиентСервер.ДобавитьСобытие("КалендарьОтчетности.ОткрытыМоиПриложения.ПоКнопке");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ПодключитьНовыеПриложенияОбработчик", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьСписокПриложений();
	Закрыть(Новый Структура("МоиПриложенияКонтрольнаяСумма", МоиПриложенияКонтрольнаяСумма));
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСписокПриложений()
	
	// Метод УстановитьСостояние() требует поднятия привилегированного режима, т.к. регистр сведений
	// ОрганизацииОтчетностиОблачныхПриложений является служебным. Поднимем привилегированный режим
	// сразу на всю процедуру, чтобы не делать это в цикле.
	УстановитьПривилегированныйРежим(Истина);
	ОтключенныеОрганизацииЭтогоПриложения = Новый Массив;
	Для Каждого Строка Из ОблачныеПриложения.ПолучитьЭлементы() Цикл
		
		Подстроки = Строка.ПолучитьЭлементы();
		Если Подстроки.Количество() = 0 Тогда
			// Только "БП".
			ОбработатьСтрокуСпискаПриложений(Строка, ОтключенныеОрганизацииЭтогоПриложения);
			Продолжить;
		КонецЕсли;
		
		// Связка "БП + ЗУП".
		Для Каждого ПодСтрока Из Подстроки Цикл
			ОбработатьСтрокуСпискаПриложений(ПодСтрока, ОтключенныеОрганизацииЭтогоПриложения);
		КонецЦикла;
	КонецЦикла;
		
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
		ТекущийПользователь,
		ОтключенныеОрганизацииЭтогоПриложения,
		КалендарьОтчетностиКлиентСервер.КлючХраненияСпискаОтключенныхОрганизаций());
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	ВидПриложенияЗарплата = ПредопределенноеЗначение("Перечисление.ВидыОблачныхПриложений.Зарплата");
	Для Каждого Строка Из ОблачныеПриложения.ПолучитьЭлементы() Цикл
		Строка.Подключено = Истина;
		Если Строка.ЭтоОшибка Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ПодСтрока Из Строка.ПолучитьЭлементы() Цикл
			
			ПодСтрока.Подключено = Истина;
			Если ПодСтрока.ВидПриложения = ВидПриложенияЗарплата Тогда
				// Зарплатное приложение в списке всегда отображается после бухгалтерского.
				// Отметим галкой только первое зарплатное приложение.
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьОтметки(Команда)
	
	Для Каждого Строка Из ОблачныеПриложения.ПолучитьЭлементы() Цикл
		Строка.Подключено = Ложь;
		Для Каждого ПодСтрока Из Строка.ПолучитьЭлементы() Цикл
			ПодСтрока.Подключено = Ложь;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОблачныеПриложенияПодключеноПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ОблачныеПриложения.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Подключено = ТекущаяСтрока.Подключено;
	
	Если ТекущаяСтрока.ЭтоОшибка Тогда
		ТекущаяСтрока.Подключено = Ложь;
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ТекущаяСтрока.ПолучитьЭлементы() Цикл
		Строка.Подключено = Подключено;
	КонецЦикла;
	
	СтрокаРодитель = ТекущаяСтрока.ПолучитьРодителя();
	Если СтрокаРодитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВидПриложенийЗарплата = ПредопределенноеЗначение("Перечисление.ВидыОблачныхПриложений.Зарплата");
	Если ТекущаяСтрока.ВидПриложения = ВидПриложенийЗарплата Тогда
		
		Если Не Подключено Тогда
			Возврат;
		КонецЕсли;
		
		СтрокаРодитель.Подключено = Истина;
		// В дереве могут быть дубли организаций из разных приложений ЗУП.
		// Разрешим выбирать только одну организацию из всех приложений ЗУП.
		// Так же при отмеченной организации ЗУП должна быть отмечена и организация БП.
		Для Каждого Строка Из СтрокаРодитель.ПолучитьЭлементы() Цикл
			СтрокаПодключена = Истина;
			Если Строка.ВидПриложения = ВидПриложенийЗарплата Тогда
				Если Строка <> ТекущаяСтрока Тогда
					СтрокаПодключена = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			Строка.Подключено = СтрокаПодключена;
		КонецЦикла;
		
		Возврат;
	КонецЕсли;
	
	ВидПриложенийБухгалтерия = ПредопределенноеЗначение("Перечисление.ВидыОблачныхПриложений.Бухгалтерия");
	Если Не Подключено И ТекущаяСтрока.ВидПриложения = ВидПриложенийБухгалтерия Тогда
		// Если есть дубли бухгалтерского приложения, то дадим возможность отключить только этот дубль.
		ПодключеноБухгалтерскихПриложений = 0;
		Для Каждого Строка Из СтрокаРодитель.ПолучитьЭлементы() Цикл
			Если Строка.ВидПриложения = ВидПриложенийБухгалтерия И Строка.Подключено Тогда
				ПодключеноБухгалтерскихПриложений = ПодключеноБухгалтерскихПриложений + 1;
			КонецЕсли;
		КонецЦикла;
		
		Если ПодключеноБухгалтерскихПриложений > 0 Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СтрокаРодитель.Подключено = Подключено;
	
	Если Подключено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из СтрокаРодитель.ПолучитьЭлементы() Цикл
		Строка.Подключено = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПодключитьНовыеПриложения()
	
	ПриложенияПользователя = СообщенияОтчетностиОблачныхПриложений.ДоступныеПриложения();
	
	Если ПриложенияПользователя = Неопределено Тогда
		СообщитьОбОшибкеПолученияПриложенийПользователя();
		Возврат Неопределено;
	КонецЕсли;
	
	НоваяКонтрольнаяСумма = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ПриложенияПользователя, ХешФункция.CRC32);
	Если МоиПриложенияКонтрольнаяСумма = НоваяКонтрольнаяСумма Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыПодключения = СообщенияОтчетностиОблачныхПриложений.НовыйПараметрыПодключенияПриложений();
	ПараметрыПодключения.Пользователь = ТекущийПользователь;
	ПараметрыПодключения.ПриложенияПользователя = ПриложенияПользователя;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"СообщенияОтчетностиОблачныхПриложений.ПодключитьНовыеПриложения",
		ПараметрыПодключения);
	
	Возврат ДлительнаяОперация;
КонецФункции

&НаКлиенте
Процедура ПодключитьНовыеПриложенияОбработчик() Экспорт
	
	ДлительнаяОперация = ПодключитьНовыеПриложения();
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатПодключенияПриложений", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатПодключенияПриложений(РезультатФормирования, ДополнительныеПараметры) Экспорт
	
	Если РезультатФормирования <> Неопределено Тогда
		ОшибкиПодключения = ПолучитьИзВременногоХранилища(РезультатФормирования.АдресРезультата);
		
		Если ОшибкиПодключения.Количество() Тогда
			СообщитьОбОшибкеПодключения(СтрСоединить(ОшибкиПодключения, ", "));
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьДоступныеПриложения();
	
	Для Каждого СтрокаОрганизации Из ОблачныеПриложения.ПолучитьЭлементы() Цикл
		Элементы.ОблачныеПриложения.Развернуть(СтрокаОрганизации.ПолучитьИдентификатор());
	КонецЦикла;
	
	МоиПриложенияКонтрольнаяСумма = НоваяКонтрольнаяСумма;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступныеПриложения()
	
	ОблачныеПриложения.ПолучитьЭлементы().Очистить();
	
	УстановитьПривилегированныйРежим(Истина);
	ОтключенныеОрганизацииЭтогоПриложения = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		ТекущийПользователь,
		КалендарьОтчетностиКлиентСервер.КлючХраненияСпискаОтключенныхОрганизаций());
	УстановитьПривилегированныйРежим(Ложь);
	
	ОрганизацииЭтогоПриложения = Справочники.Организации.ДоступныеОрганизацииПоRLS();
	
	МоиПриложения = МоиПриложения(ОрганизацииЭтогоПриложения, ОтключенныеОрганизацииЭтогоПриложения);
	
	Для Каждого СтрокаОрганизация Из МоиПриложения.Строки Цикл
		
		НоваяСтрока = ОблачныеПриложения.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОрганизация);
		
		Если СтрокаОрганизация.Строки.Количество() > 1
			Или Не ЗначениеЗаполнено(СтрокаОрганизация.ОрганизацияСсылка) Тогда
			Для Каждого СтрокаПриложение Из СтрокаОрганизация.Строки Цикл
				
				НоваяПодстрока = НоваяСтрока.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(НоваяПодстрока, СтрокаПриложение);
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция МоиПриложения(ОрганизацииЭтогоПриложения, ОтключенныеОрганизацииЭтогоПриложения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЭтоПриложение = НСтр("ru = 'Это приложение'");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОрганизацииЭтогоПриложения", ОрганизацииЭтогоПриложения);
	Запрос.УстановитьПараметр("ОтключенныеОрганизацииЭтогоПриложения", ОтключенныеОрганизацииЭтогоПриложения);
	Запрос.УстановитьПараметр("НаименованиеВидаПриложения", НаименованиеВидаЭтогоПриложения());
	Запрос.УстановитьПараметр("ЭтоПриложение", ЭтоПриложение);
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК ОрганизацияСсылка,
	|	ЗНАЧЕНИЕ(Справочник.ОблачныеПриложения.ПустаяСсылка) КАК ПриложениеСсылка,
	|	&ЭтоПриложение КАК ПриложениеНаименование,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОблачныхПриложений.Бухгалтерия) КАК ВидПриложения,
	|	&НаименованиеВидаПриложения КАК ВидПриложенияНаименование,
	|	НЕ Организации.Ссылка В (&ОтключенныеОрганизацииЭтогоПриложения) КАК Подключено,
	|	Организации.Наименование КАК ОрганизацияНаименование,
	|	Организации.ИНН КАК ИНН,
	|	Организации.КПП КАК КПП,
	|	Организации.ИНН + Организации.КПП КАК КлючГруппировки,
	|	0 КАК ИндексКартинки,
	|	ИСТИНА КАК ОрганизацииЭтогоПриложения
	|ПОМЕСТИТЬ ОрганизацииПриложений
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка В(&ОрганизацииЭтогоПриложения)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОрганизацииОтчетностиОблачныхПриложений.Организация.Ссылка,
	|	ОрганизацииОтчетностиОблачныхПриложений.Приложение.Ссылка,
	|	ОрганизацииОтчетностиОблачныхПриложений.Приложение.Наименование,
	|	ОрганизацииОтчетностиОблачныхПриложений.Приложение.Вид,
	|	ОрганизацииОтчетностиОблачныхПриложений.Приложение.НаименованиеВида,
	|	ОрганизацииОтчетностиОблачныхПриложений.ВыводитьВКалендарь,
	|	ОрганизацииОтчетностиОблачныхПриложений.Организация.Наименование,
	|	ОрганизацииОтчетностиОблачныхПриложений.Организация.ИНН,
	|	ОрганизацииОтчетностиОблачныхПриложений.Организация.КПП,
	|	ОрганизацииОтчетностиОблачныхПриложений.Организация.ИНН + ОрганизацииОтчетностиОблачныхПриложений.Организация.КПП,
	|	0,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ОрганизацииОтчетностиОблачныхПриложений КАК ОрганизацииОтчетностиОблачныхПриложений
	|ГДЕ
	|	ОрганизацииОтчетностиОблачныхПриложений.Пользователь = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииПриложений.ОрганизацияСсылка КАК ОрганизацияСсылка,
	|	ОрганизацииПриложений.ОрганизацияНаименование КАК ОрганизацияНаименование,
	|	ОрганизацииПриложений.ИНН КАК ИНН,
	|	ОрганизацииПриложений.КПП КАК КПП,
	|	ОрганизацииПриложений.ПриложениеНаименование КАК ПриложениеНаименование,
	|	ОрганизацииПриложений.ПриложениеСсылка КАК ПриложениеСсылка,
	|	ОрганизацииПриложений.ВидПриложения КАК ВидПриложения,
	|	ОрганизацииПриложений.ВидПриложенияНаименование КАК ВидПриложенияНаименование,
	|	ОрганизацииПриложений.Подключено КАК Подключено,
	|	ОрганизацииПриложений.Подключено КАК УжеПодключено,
	|	ОрганизацииПриложений.ПриложениеНаименование КАК Наименование,
	|	ОрганизацииПриложений.ИндексКартинки КАК ИндексКартинки,
	|	ОрганизацииПриложений.ОрганизацииЭтогоПриложения КАК ОрганизацииЭтогоПриложения,
	|	ОрганизацииПриложений.КлючГруппировки КАК КлючГруппировки
	|ИЗ
	|	ОрганизацииПриложений КАК ОрганизацииПриложений
	|ГДЕ
	|	ОрганизацииПриложений.ИНН = """"
	|	И ОрганизацииПриложений.КПП = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииПриложений.ОрганизацияСсылка КАК ОрганизацияСсылка,
	|	ОрганизацииПриложений.ОрганизацияНаименование КАК ОрганизацияНаименование,
	|	ОрганизацииПриложений.ИНН КАК ИНН,
	|	ОрганизацииПриложений.КПП КАК КПП,
	|	ОрганизацииПриложений.ПриложениеНаименование КАК ПриложениеНаименование,
	|	ОрганизацииПриложений.ПриложениеСсылка КАК ПриложениеСсылка,
	|	ОрганизацииПриложений.ВидПриложения КАК ВидПриложения,
	|	ОрганизацииПриложений.ВидПриложенияНаименование КАК ВидПриложенияНаименование,
	|	ОрганизацииПриложений.Подключено КАК Подключено,
	|	ОрганизацииПриложений.Подключено КАК УжеПодключено,
	|	ОрганизацииПриложений.ПриложениеНаименование КАК Наименование,
	|	ОрганизацииПриложений.ИндексКартинки КАК ИндексКартинки,
	|	ОрганизацииПриложений.ОрганизацииЭтогоПриложения КАК ОрганизацииЭтогоПриложения,
	|	ЛОЖЬ КАК ЭтоОшибка,
	|	ОрганизацииПриложений.КлючГруппировки КАК КлючГруппировки
	|ИЗ
	|	ОрганизацииПриложений КАК ОрганизацииПриложений
	|ГДЕ
	|	(ОрганизацииПриложений.ИНН <> """"
	|			ИЛИ ОрганизацииПриложений.КПП <> """")
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПриложенияНаименование
	|ИТОГИ ПО
	|	КлючГруппировки";
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	МоиПриложения = ПакетЗапросов[2].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для Каждого СтрокаДерева Из МоиПриложения.Строки Цикл
		ОрганизацияОпределена = Ложь;
		ПодключеноЗарплатноеПриложение = Ложь;
		Для Каждого ПодстрокаДерева Из СтрокаДерева.Строки Цикл
			Если ПодстрокаДерева.ВидПриложения = Перечисления.ВидыОблачныхПриложений.Бухгалтерия Тогда
				Если Не ОрганизацияОпределена Тогда
					ЗаполнитьЗначенияСвойств(СтрокаДерева, ПодстрокаДерева);
					ОрганизацияОпределена = Истина;
					Если СтрокаДерева.Строки.Количество() = 1 Тогда
						СтрокаДерева.Наименование = СтрокаДерева.ОрганизацияНаименование + " | " + СтрокаДерева.ПриложениеНаименование;
						СтрокаДерева.ИндексКартинки = 1;
					Иначе
						СтрокаДерева.Наименование = СтрокаДерева.ОрганизацияНаименование;
						СтрокаДерева.ВидПриложенияНаименование = "";
					КонецЕсли;
				КонецЕсли;
				ПодстрокаДерева.ИндексКартинки = 1;
			Иначе
				ПодстрокаДерева.ИндексКартинки = 2;
				
				Если ПодстрокаДерева.Подключено Тогда
					Если ПодключеноЗарплатноеПриложение Тогда
						// Бухгалтерия должна получать данные только из одного зарплатного приложения.
						// Если есть ещё одно приложение, то отключим его.
						ОтключитьОрганизацию(ПодстрокаДерева.ОрганизацияСсылка);
						ПодстрокаДерева.Подключено = Ложь;
						ПодстрокаДерева.УжеПодключено = Ложь;
					КонецЕсли;
					
					ПодключеноЗарплатноеПриложение = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ОрганизацияОпределена Тогда
			СтрокаДерева.ИндексКартинки = 3;
			СтрокаДерева.ЭтоОшибка = Истина;
			ШаблонНаименования = НСтр("ru = 'Не удалось сопоставить по ИНН %1 и КПП %2'");
			Для Каждого ПодстрокаДерева Из СтрокаДерева.Строки Цикл
				ПодстрокаДерева.ЭтоОшибка = Истина;
				ПодстрокаДерева.Наименование = ПодстрокаДерева.ОрганизацияНаименование + " | " + ПодстрокаДерева.ПриложениеНаименование;
				ПодстрокаДерева.Подключено = Ложь;
				ПодстрокаДерева.УжеПодключено = Ложь;
				СтрокаДерева.Наименование = СтрШаблон(ШаблонНаименования, ПодстрокаДерева.ИНН, ПодстрокаДерева.КПП);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	// Организации, по которым нет данных о ИНН или КПП
	Выборка = ПакетЗапросов[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не Выборка.ВидПриложения = Перечисления.ВидыОблачныхПриложений.Бухгалтерия Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = МоиПриложения.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Наименование = Выборка.ОрганизацияНаименование + " | " + Выборка.ПриложениеНаименование;
		НоваяСтрока.ИндексКартинки = 1;
	КонецЦикла;
	
	МоиПриложения.Строки.Сортировать("ЭтоОшибка Убыв, ОрганизацииЭтогоПриложения Убыв, ВидПриложения, ПриложениеНаименование, ОрганизацияНаименование", Истина);
	
	Возврат МоиПриложения;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОтключитьОрганизацию(Организация)
	
	УстановитьПривилегированныйРежим(Истина);
	РегистрыСведений.ОрганизацииОтчетностиОблачныхПриложений.УстановитьСостояние(
		Организация,
		Ложь);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаСервереБезКонтекста
Функция НаименованиеВидаЭтогоПриложения()
	
	КлючХранения = КалендарьОтчетностиКлиентСервер.КлючХраненияНаименованияВидаЭтогоПриложения();
	УстановитьПривилегированныйРежим(Истина);
	НаименованияВида = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(КлючХранения);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НаименованияВида <> Неопределено Тогда
		Возврат НаименованияВида;
	КонецЕсли;
	
	КодЭтогоПриложения = РаботаВМоделиСервиса.ЗначениеРазделителяСеанса();
	ДанныеПриложения = ПрограммныйИнтерфейсСервиса.СвойстваПриложения(КодЭтогоПриложения, Ложь);
	
	Если ДанныеПриложения <> Неопределено Тогда
		Наименование = ДанныеПриложения.НаименованиеВидаПриложения;
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(КлючХранения, Наименование);
		УстановитьПривилегированныйРежим(Ложь);
		Возврат Наименование;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервереБезКонтекста
Функция СообщитьОбОшибкеПодключения(ИмяПриложения)
	
	ШаблонСообщения = НСтр("ru = 'Не удалось подключить приложение ""%1"". Обратитесь в техническую поддержку.'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ШаблонСообщения, ИмяПриложения));
	
КонецФункции

&НаСервереБезКонтекста
Функция СообщитьОбОшибкеПолученияПриложенийПользователя()
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		НСтр("ru = 'Не удалось получить список приложений.'"));
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбработатьСтрокуСпискаПриложений(Строка, ОтключенныеОрганизацииЭтогоПриложения)
	
	Если Не ЗначениеЗаполнено(Строка.ПриложениеСсылка) Тогда
		Если Не Строка.Подключено Тогда
			ОтключенныеОрганизацииЭтогоПриложения.Добавить(Строка.ОрганизацияСсылка);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Строка.Подключено = Строка.УжеПодключено Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.ОрганизацииОтчетностиОблачныхПриложений.УстановитьСостояние(
		Строка.ОрганизацияСсылка,
		Строка.Подключено);
	
	КонецПроцедуры

#КонецОбласти
