#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроверятьСтатусыСамозанятыхАвтоматически = Константы.ИспользоватьСтатусСамозанятого.Получить();
	
	ЕстьПравоНастраиватьСервис = ИнтеграцияСтатусСамозанятого.ЕстьПравоНастраиватьСервис();
	ЕстьПравоПросмотраЖурналаРегистрации = ИнтеграцияСтатусСамозанятого.ЕстьПравоПросмотраЖурналаРегистрации();
	ДоступнаЗагрузкаРеквизитовОрганизации = ИнтеграцияСтатусСамозанятого.ДоступнаЗагрузкаРеквизитовОрганизации();
	
	ЗагружаютсяРеквизитыОбслуживающейОрганизации = ПроверятьСтатусыСамозанятыхАвтоматически;
	ЗагружаетсяСписокОпций = ПроверятьСтатусыСамозанятыхАвтоматически;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДанныеВФоне();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	Если ПроверятьСтатусыСамозанятыхАвтоматически И Не ЗагружаетсяСписокОпций Тогда
		ПолучитьСписокОпций();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ИменаСобытий = ИнтеграцияСтатусСамозанятогоКлиент.ИменаСобытий();
	
	// СписокОпций
	Если ИмяСобытия = ИменаСобытий.СписокОпцийПолучен Тогда
		ПрочитатьСписокОпций(Параметр);
	ИначеЕсли ИмяСобытия = ИменаСобытий.СписокОпцийОшибка Тогда
		ПрочитатьСписокОпций(Новый Структура("Ошибка", Параметр));
	// РеквизитыОбслуживающейОрганизации
	ИначеЕсли ИмяСобытия = ИменаСобытий.ОбслуживающаяОрганизацияПолучена Тогда
		ПрочитатьРеквизитыОбслуживающейОрганизации(Параметр);
	ИначеЕсли ИмяСобытия = ИменаСобытий.ОбслуживающаяОрганизацияОшибка Тогда
		ПрочитатьРеквизитыОбслуживающейОрганизации(Новый Структура("Ошибка", Параметр));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СсылкаНаПодробноеОписаниеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "СсылкаНаПодробноеОписание" Тогда
		СтандартнаяОбработка = Ложь;
		НавигационнаяСсылка = ИнтеграцияСтатусСамозанятогоКлиент.СсылкаСтраницыОписанияСервиса();
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(НавигационнаяСсылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДетальнаяИнформацияОбОшибкеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьЖурналРегистрации" Тогда
		СтандартнаяОбработка = Ложь;
		ИнтеграцияСтатусСамозанятогоКлиент.ОткрытьЖурналРегистрации(ЭтотОбъект, СтрРазделить("Ошибка,Информация", ","));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверятьСтатусыСамозанятыхАвтоматическиПриИзменении(Элемент)
	
	УстановитьИспользоватьСтатусСамозанятого(ПроверятьСтатусыСамозанятыхАвтоматически);
	ОбновитьДанныеВФоне();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодключитьСервисИЗакрыть(Команда)
	
	УстановитьИспользоватьСтатусСамозанятого(Истина);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьДанныеВФоне();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	ВыполняетсяДлительнаяОперация = Форма.ЗагружаютсяРеквизитыОбслуживающейОрганизации Или Форма.ЗагружаетсяСписокОпций;
	ВозниклаОшибка = ЗначениеЗаполнено(Форма.ПредставлениеОшибки);
	
	Элементы.ПроверятьСтатусыСамозанятыхАвтоматически.Доступность = Форма.ЕстьПравоНастраиватьСервис;
	
	Элементы.ГруппаДанныеСервиса.Видимость = Форма.ПроверятьСтатусыСамозанятыхАвтоматически;
	Если Форма.ПроверятьСтатусыСамозанятыхАвтоматически Тогда
		
		Элементы.ГруппаДлительнаяОперация.Видимость = ВыполняетсяДлительнаяОперация;
		Если Элементы.ГруппаДлительнаяОперация.Видимость Тогда
			Форма.ДлительнаяОперацияОписание = ОписаниеДлительнойОперации(Форма);
		КонецЕсли;
		
		Элементы.ГруппаОшибка.Видимость = Не ВыполняетсяДлительнаяОперация И ВозниклаОшибка;
		Если Элементы.ГруппаОшибка.Видимость Тогда
			Элементы.ДетальнаяИнформацияОбОшибке.Видимость = Форма.ЕстьПравоПросмотраЖурналаРегистрации;
		КонецЕсли;
		
		Элементы.ГруппаУсловияИспользования.Видимость = Не ВыполняетсяДлительнаяОперация
			И Не ВозниклаОшибка;
		Если Элементы.ГруппаУсловияИспользования.Видимость Тогда
			ПолученоОписаниеПромоТарифа = ЗначениеЗаполнено(Форма.ОписаниеПромоТарифа);
			Элементы.ГруппаУсловияИспользования.ОтображатьЗаголовок = ПолученоОписаниеПромоТарифа;
			Элементы.ОписаниеПромоТарифа.Видимость = ПолученоОписаниеПромоТарифа;
			// ОбслуживающиеОрганизацииАбонента
			ПолученыРеквизитыОбслуживающейОрганизации = ЗначениеЗаполнено(Форма.ОбслуживающаяОрганизацияНаименование)
				Или ЗначениеЗаполнено(Форма.ОбслуживающаяОрганизацияТелефон)
				Или ЗначениеЗаполнено(Форма.ОбслуживающаяОрганизацияПочта);
			Форма.ОписаниеСпособаПриобретения = ОписаниеСпособаПриобретения(
				ПолученоОписаниеПромоТарифа, ПолученыРеквизитыОбслуживающейОрганизации);
			Элементы.ОписаниеСпособаПриобретения.Видимость = ПолученоОписаниеПромоТарифа
				Или ПолученыРеквизитыОбслуживающейОрганизации;
			Элементы.ОбслуживающаяОрганизацияНаименование.Видимость =
				ЗначениеЗаполнено(Форма.ОбслуживающаяОрганизацияНаименование);
			Элементы.ГруппаОбслуживающаяОрганизацияТелефон.Видимость =
				ЗначениеЗаполнено(Форма.ОбслуживающаяОрганизацияТелефон);
			Элементы.ГруппаОбслуживающаяОрганизацияПочта.Видимость =
				ЗначениеЗаполнено(Форма.ОбслуживающаяОрганизацияПочта);
		КонецЕсли;
		
		Элементы.ОписаниеОстаткаОпций.Видимость = Не ВыполняетсяДлительнаяОперация
			И ЗначениеЗаполнено(Форма.ОписаниеОстаткаОпций);
		Элементы.ГруппаСписокОпций.Видимость = Не ВыполняетсяДлительнаяОперация И Не ВозниклаОшибка;
		
	КонецЕсли;
	
	Элементы.ПодключитьСервисИЗакрыть.Доступность = Форма.ЕстьПравоНастраиватьСервис;
	Элементы.ПодключитьСервисИЗакрыть.Видимость = Не Форма.ПроверятьСтатусыСамозанятыхАвтоматически;
	Элементы.Обновить.Видимость = Форма.ПроверятьСтатусыСамозанятыхАвтоматически И Не ВыполняетсяДлительнаяОперация;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеВФоне()
	
	Если ПроверятьСтатусыСамозанятыхАвтоматически Тогда
		ПолучитьРеквизитыОбслуживающейОрганизации();
		ПолучитьСписокОпций();
	Иначе
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеСпособаПриобретения(ПолученоОписаниеПромоТарифа, ПолученыРеквизитыОбслуживающейОрганизации)
	
	Если ПолученоОписаниеПромоТарифа Тогда
		Если ПолученыРеквизитыОбслуживающейОрганизации Тогда
			Возврат НСтр("ru = 'Для приобретения дополнительного пакета опций обратитесь в обслуживающую организацию:'");
		Иначе
			Возврат НСтр("ru = 'Для приобретения дополнительного пакета опций обратитесь в вашу обслуживающую организацию.'");
		КонецЕсли;
	Иначе
		Если ПолученыРеквизитыОбслуживающейОрганизации Тогда
			Возврат НСтр("ru = 'Ваша обслуживающая организация:'");
		Иначе
			Возврат "";
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеДлительнойОперации(Форма)
	
	Если Форма.ЗагружаютсяРеквизитыОбслуживающейОрганизации Тогда
		Возврат НСтр("ru = 'Получаем реквизиты обслуживающей организации...'");
	ИначеЕсли Форма.ЗагружаетсяСписокОпций Тогда
		Возврат НСтр("ru = 'Загружаем остатки опций...'");
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура УстановитьИспользоватьСтатусСамозанятого(Значение)
	
	Если УстановитьИспользоватьСтатусСамозанятогоНаСервере(Значение) Тогда
		Оповестить(ИнтеграцияСтатусСамозанятогоКлиент.ИменаСобытий().ИспользоватьСтатусСамозанятогоИзменено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьИспользоватьСтатусСамозанятогоНаСервере(Знач Значение)
	
	Константы.ИспользоватьСтатусСамозанятого.Установить(Значение);
	Возврат Истина;
	
КонецФункции

#Область СписокОпций

&НаКлиенте
Процедура ПолучитьСписокОпций()
	
	Если ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки() Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПолучитьСписокОпций", 0.1, Истина);
	Иначе
		ОтобразитьПодключениеКПорталу("Подключаемый_ПолучитьСписокОпцийПослеПодключенияКПорталу");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолучитьСписокОпций()
	
	ЗагружаетсяСписокОпций = ИнтеграцияСтатусСамозанятогоКлиент.ПолучитьСписокОпций(ЭтотОбъект);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолучитьСписокОпцийПослеПодключенияКПорталу(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Действие = "Повторить" Тогда
		ЗагружаетсяСписокОпций = ИнтеграцияСтатусСамозанятогоКлиент.ПолучитьСписокОпций(ЭтотОбъект);
	Иначе
		ЗагружаетсяСписокОпций = Ложь;
		ПредставлениеОшибки = НСтр("ru = 'Подключение к Интернет-поддержке не выполнено'");
	КонецЕсли;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьСписокОпций(Реквизиты)
	
	ЗагружаетсяСписокОпций = Ложь;
	ОписаниеПромоТарифа = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Реквизиты, "ОписаниеПромоТарифа", "");
	ПолученныйСписокОпций = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Реквизиты, "СписокОпций", Неопределено);
	ПредставлениеОшибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Реквизиты, "Ошибка", "");
	ЗаполнитьСписокОпций(ПолученныйСписокОпций);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОпций(ПолученныйСписокОпций)
	
	КоличествоЭлементов = ?(ПолученныйСписокОпций <> Неопределено, ПолученныйСписокОпций.Количество(), 0);
	
	ПрефиксИмени = "ОписаниеОпции";
	КоличествоПредопределенных = КоличествоПредопределенныхЭлементов(ПрефиксИмени);
	
	Для Индекс = КоличествоПредопределенных По КоличествоЭлементов - 1 Цикл
		ДобавитьОписаниеОпции(Индекс, ПрефиксИмени);
	КонецЦикла;
	
	Баланс = 0;
	Для Индекс = 0 По КоличествоЭлементов - 1 Цикл
		ИмяЭлемента = ИмяЭлементаПоИндексу(Индекс, ПрефиксИмени);
		ЭлементФормы = Элементы.Найти(ИмяЭлемента);
		Если ЭлементФормы = Неопределено Тогда
			ДобавитьОписаниеОпции(Индекс, ПрефиксИмени);
		КонецЕсли;
		Опция = ПолученныйСписокОпций[Индекс];
		ОстатокОпции = Макс(Опция.МаксимальныйОбъем - Опция.ИспользованныйОбъем, 0);
		Баланс = Баланс + ОстатокОпции;
		ЭлементФормы.Заголовок = ОписаниеОстаткаОпции(
			ОстатокОпции, Опция.ЭтоПромоТариф, Опция.МаксимальныйОбъем, Опция.ДатаОкончания);
		ЭлементФормы.Видимость = Истина;
	КонецЦикла;
	
	Для Индекс = КоличествоЭлементов По КоличествоПредопределенных - 1 Цикл
		ИмяЭлемента = ИмяЭлементаПоИндексу(Индекс, ПрефиксИмени);
		ЭлементФормы = Элементы.Найти(ИмяЭлемента);
		ЭлементФормы.Заголовок = "";
		ЭлементФормы.Видимость = Ложь;
	КонецЦикла;
	
	Если ПолученныйСписокОпций <> Неопределено Тогда
		ОписаниеОстаткаОпций = ИнтеграцияСтатусСамозанятогоКлиентСервер.ОписаниеОстаткаОпций(Баланс);
	Иначе
		ОписаниеОстаткаОпций = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КоличествоПредопределенныхЭлементов(ПрефиксИмени)

	Количество = 0;
	Пока Истина Цикл
		Если Элементы.Найти(ИмяЭлементаПоИндексу(Количество, ПрефиксИмени)) <> Неопределено Тогда
			Количество = Количество + 1;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Количество;
	
КонецФункции

&НаСервере
Функция ИмяЭлементаПоИндексу(Индекс, ПрефиксИмени)
	
	Возврат СтрШаблон(ПрефиксИмени + "%1", Формат(Индекс, "ЧН=0; ЧГ=0;"));
	
КонецФункции

&НаСервере
Процедура ДобавитьОписаниеОпции(Индекс, ПрефиксИмени)
	
	ЗаголовокУчредителя = Элементы.Добавить(
		ИмяЭлементаПоИндексу(Индекс, ПрефиксИмени),
		Тип("ДекорацияФормы"),
		Элементы.ГруппаСписокОпций);
	ЗаголовокУчредителя.АвтоМаксимальнаяШирина = Ложь;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОписаниеОстаткаОпции(ОстатокОпции, ЭтоПромоТариф, МаксимальныйОбъем, ДатаОкончания)
	
	ПредставлениеОстатка = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru=';%1 проверка;;%1 проверки;%1 проверок;'"),
		ОстатокОпции,
		ВидЧисловогоЗначения.Количественное,
		"ЧН=0; ЧГ=;");
	ПредставлениеДатыОкончания = Формат(ДатаОкончания, "ДЛФ=DD;");
	Если ЭтоПромоТариф Тогда
		НазваниеПромоТарифа = НСтр("ru = 'промо-тариф'");
		Возврат СтрШаблон(
			НСтр("ru = '%1 из %2 до %3 (%4)'"),
			ПредставлениеОстатка, МаксимальныйОбъем, ПредставлениеДатыОкончания, НазваниеПромоТарифа);
	Иначе
		Возврат СтрШаблон(
			НСтр("ru = '%1 из %2 до %3'"),
			ПредставлениеОстатка, МаксимальныйОбъем, ПредставлениеДатыОкончания);
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки()
	
	Возврат ИнтернетПоддержкаПользователей.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();
	
КонецФункции

&НаКлиенте
Процедура ОтобразитьПодключениеКПорталу(ИмяОбработчикаЗавершения)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ФормаВладелец", ЭтотОбъект);
	ОбработчикЗавершения = Новый ОписаниеОповещения(ИмяОбработчикаЗавершения, ЭтотОбъект, ДополнительныеПараметры);
	ИнтеграцияСтатусСамозанятогоКлиент.ОтобразитьПодключениеКПорталу(ОбработчикЗавершения);
	
КонецПроцедуры

#КонецОбласти

#Область РеквизитыОбслуживающейОрганизации

&НаКлиенте
Процедура ПолучитьРеквизитыОбслуживающейОрганизации()
	
	Если ДоступнаЗагрузкаРеквизитовОрганизации Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПолучитьРеквизитыОбслуживающейОрганизации", 0.1, Истина);
	Иначе
		ЗагружаютсяРеквизитыОбслуживающейОрганизации = Ложь;
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолучитьРеквизитыОбслуживающейОрганизации()
	
	ЗагружаютсяРеквизитыОбслуживающейОрганизации =
		ИнтеграцияСтатусСамозанятогоКлиент.ПолучитьРеквизитыОбслуживающейОрганизации(ЭтотОбъект);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьРеквизитыОбслуживающейОрганизации(Реквизиты)
	
	ЗагружаютсяРеквизитыОбслуживающейОрганизации = Ложь;
	ОбслуживающаяОрганизацияНаименование = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Реквизиты, "Наименование", "");
	ОбслуживающаяОрганизацияТелефон = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Реквизиты, "Телефон", "");
	ОбслуживающаяОрганизацияПочта = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Реквизиты, "Почта", "");
	ПредставлениеОшибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Реквизиты, "Ошибка", "");
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
