////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ, ОТРАЖАЮЩИЕ ХОЗЯЙСТВЕННЫЕ ОПЕРАЦИИ В ПОДСИСТЕМЕ НДС

#Область ПрограммныйИнтерфейс

// Запрос для получения следующих данных:
//  1. По документам, которые были определены как партии необходимо получить данные по НДС:
//  - Сумма НДС
//  - Cумма без НДС
//  - Счет учета НДС
//  - Ставка НДС
//  - Способ учета НДС
//  - Вид ценности 
//  - Счет Фактура
//  2 Документы доп расходов: Заявление о ввозе товаров, ГТД по Импорту, Поступление доп расходов.
//  Структура получаемых данных аналогично п.1
//  3. Авансовые отчеты как документы доп расходов
//  Доп расходы в авансовых счетах заполняются в ТЧ Прочее, в качестве счета затрат может быть указан
//  счет учета 
//
// Параметры:
//  СтруктураПараметровДляПолученияНДС - Структура содержащая следующие поля:
//  - Организация
//  - Период - дата, на которую формируются остатки
//  - СчетНДСПоУмолчанию - 19.03, подставляется в случае, если не найден счет в самом документе
//  - ДокументыПартий - таблица значений, содержащая две колонки Партия и Номенклатура
//  По этим документам будут определяться данные по НДС из п.1
//  - ОснованияДляДопРасходов - таблица значений, содержащая две колонки Партия и Номенклатура
//  По этим документам будут определяться данные по НДС из п.2
//  - АвансовыеОтчетыКакРасходы - таблица значений, содержащая три колонки Партия, Номенклатура, Счет
//  По этим документам будут определяться данные по НДС из п.3
// 
// Возвращаемое значение:
//  Результат запроса
//
Функция ДанныеНДСПоДокументам(СтруктураПараметровДляПолученияНДС) Экспорт
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыПартий.Номенклатура КАК Номенклатура,
	|	ДокументыПартий.Партия КАК Партия
	|ПОМЕСТИТЬ ДокументыПартий
	|ИЗ
	|	&ДокументыПартий КАК ДокументыПартий
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвансовыйОтчетКакРасходы.Номенклатура КАК ОбъектУчета,
	|	АвансовыйОтчетКакРасходы.Партия КАК ДокАвансовыйОтчет,
	|	АвансовыйОтчетКакРасходы.Счет КАК СчетУчета
	|ПОМЕСТИТЬ АвансовыеОтчетыКакРасходы
	|ИЗ
	|	&АвансовыйОтчетКакРасходы КАК АвансовыйОтчетКакРасходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОснованияДляДопРасходов.Номенклатура КАК Номенклатура,
	|	ОснованияДляДопРасходов.Партия КАК Партия
	|ПОМЕСТИТЬ ОснованияДляДопРасходов
	|ИЗ
	|	&ОснованияДляДопРасходов КАК ОснованияДляДопРасходов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеДопРасходовТовары.Ссылка КАК ДопРасходы,
	|	ПоступлениеДопРасходовТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ПоступлениеДопРасходовТовары.Количество) КАК Количество,
	|	СУММА(ПоступлениеДопРасходовТовары.СуммаТовара) КАК СуммаТовара,
	|	СУММА(ПоступлениеДопРасходовТовары.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ПоступлениеДопРасходовТовары.Сумма) КАК Сумма,
	|	ПоступлениеДопРасходовТовары.СчетУчетаНДС КАК СчетУчетаНДС,
	|	ПоступлениеДопРасходовТовары.ДокументПартии КАК Поступление,
	|	ПоступлениеДопРасходовТовары.СчетУчета КАК СчетУчета,
	|	ПоступлениеДопРасходовТовары.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ДокументыДопРасходов
	|ИЗ
	|	ОснованияДляДопРасходов КАК ОснованияДляДопРасходов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеДопРасходов.Товары КАК ПоступлениеДопРасходовТовары
	|		ПО ОснованияДляДопРасходов.Номенклатура = ПоступлениеДопРасходовТовары.Номенклатура
	|			И ОснованияДляДопРасходов.Партия = ПоступлениеДопРасходовТовары.ДокументПартии
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеДопРасходовТовары.СчетУчетаНДС,
	|	ПоступлениеДопРасходовТовары.ДокументПартии,
	|	ПоступлениеДопРасходовТовары.Ссылка,
	|	ПоступлениеДопРасходовТовары.Номенклатура,
	|	ПоступлениеДопРасходовТовары.СчетУчета,
	|	ПоступлениеДопРасходовТовары.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеДопРасходов.СтавкаНДС КАК СтавкаНДС,
	|	ПоступлениеДопРасходов.СпособРаспределения КАК СпособРаспределения,
	|	ПоступлениеДопРасходов.Сумма КАК ДопРасходыСумма,
	|	ПоступлениеДопРасходов.СуммаНДС КАК ДопРасходыСуммаНДС,
	|	ПоступлениеДопРасходов.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	ВЫБОР
	|		КОГДА ПоступлениеДопРасходов.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|			ТОГДА 0
	|		КОГДА ПоступлениеДопРасходов.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	|			ТОГДА 5
	|		КОГДА ПоступлениеДопРасходов.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|			ТОГДА 7
	|		КОГДА ПоступлениеДопРасходов.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|			ТОГДА 10
	|		КОГДА ПоступлениеДопРасходов.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|			ТОГДА 18
	|		КОГДА ПоступлениеДопРасходов.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|			ТОГДА 20
	|		КОГДА ПоступлениеДопРасходов.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|			ТОГДА 22
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РасчетнаяСтавкаНДС,
	|	ПоступлениеДопРасходов.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ПоступлениеДопРасходов.КурсВзаиморасчетов = 0
	|			ТОГДА 1
	|		ИНАЧЕ ПоступлениеДопРасходов.КурсВзаиморасчетов
	|	КОНЕЦ КАК Курс,
	|	ВЫБОР
	|		КОГДА ПоступлениеДопРасходов.КратностьВзаиморасчетов = 0
	|			ТОГДА 1
	|		ИНАЧЕ ПоступлениеДопРасходов.КратностьВзаиморасчетов
	|	КОНЕЦ КАК Кратность,
	|	ДокументыДопРасходов.ДопРасходы КАК ДопРасходы,
	|	ВЫБОР
	|		КОГДА НЕ &СокращеннаяАналитика
	|			ТОГДА ПоступлениеДопРасходов.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ПоступлениеДопРасходов.Дата КАК Дата,
	|	ПоступлениеДопРасходов.Номер КАК Номер,
	|	ПоступлениеДопРасходов.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	ПоступлениеДопРасходов.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	ПоступлениеДопРасходов.СуммаДокумента КАК СуммаДокумента,
	|	ПоступлениеДопРасходов.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ПоказателиДляРасчетаНДС
	|ИЗ
	|	ДокументыДопРасходов КАК ДокументыДопРасходов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
	|		ПО ДокументыДопРасходов.ДопРасходы = ПоступлениеДопРасходов.Ссылка
	|ГДЕ
	|	ПоступлениеДопРасходов.Проведен = ИСТИНА
	|	И ПоступлениеДопРасходов.Дата <= &Период
	|	И ПоступлениеДопРасходов.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиДляРасчетаНДС.ДопРасходы КАК ДопРасходы,
	|	СУММА(ПоступлениеДопРасходовТовары.СуммаТовара) КАК СуммаТовара,
	|	СУММА(ПоступлениеДопРасходовТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ИтогиПоРасходам
	|ИЗ
	|	ПоказателиДляРасчетаНДС КАК ПоказателиДляРасчетаНДС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеДопРасходов.Товары КАК ПоступлениеДопРасходовТовары
	|		ПО ПоказателиДляРасчетаНДС.ДопРасходы = ПоступлениеДопРасходовТовары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоказателиДляРасчетаНДС.ДопРасходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыДопРасходов.ДопРасходы КАК ДопРасходы,
	|	ДокументыДопРасходов.Номенклатура КАК Номенклатура,
	|	СУММА(ДокументыДопРасходов.Количество) КАК Количество,
	|	СУММА(ДокументыДопРасходов.СуммаТовара) КАК СуммаТовара,
	|	СУММА(ДокументыДопРасходов.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ДокументыДопРасходов.Сумма) КАК Сумма,
	|	ДокументыДопРасходов.СчетУчетаНДС КАК СчетУчетаНДС,
	|	ДокументыДопРасходов.Поступление КАК Поступление,
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НДС, ВЫБОР
	|				КОГДА ПоказателиДляРасчетаНДС.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|					ТОГДА 0
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПоказателиДляРасчетаНДС.СпособРаспределения = ЗНАЧЕНИЕ(Перечисление.СпособыРаспределенияДопРасходов.ПоКоличеству)
	|							ТОГДА ВЫБОР
	|									КОГДА ПоказателиДляРасчетаНДС.СуммаВключаетНДС
	|										ТОГДА (ПоказателиДляРасчетаНДС.ДопРасходыСумма - ПоказателиДляРасчетаНДС.ДопРасходыСуммаНДС) / ИтогиПоРасходам.Количество * ДокументыДопРасходов.Количество
	|									ИНАЧЕ ПоказателиДляРасчетаНДС.ДопРасходыСумма / ИтогиПоРасходам.Количество * ДокументыДопРасходов.Количество
	|								КОНЕЦ
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПоказателиДляРасчетаНДС.СуммаВключаетНДС
	|									ТОГДА (ПоказателиДляРасчетаНДС.ДопРасходыСумма - ПоказателиДляРасчетаНДС.ДопРасходыСуммаНДС) * ДокументыДопРасходов.СуммаТовара / ИтогиПоРасходам.СуммаТовара
	|								ИНАЧЕ ПоказателиДляРасчетаНДС.ДопРасходыСумма * ДокументыДопРасходов.СуммаТовара / ИтогиПоРасходам.СуммаТовара
	|							КОНЕЦ
	|					КОНЕЦ / 100 * ПоказателиДляРасчетаНДС.РасчетнаяСтавкаНДС
	|			КОНЕЦ + ДокументыДопРасходов.СуммаНДС)) КАК ИтоговаяСуммаНДС,
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, ВЫБОР
	|				КОГДА ПоказателиДляРасчетаНДС.СпособРаспределения = ЗНАЧЕНИЕ(Перечисление.СпособыРаспределенияДопРасходов.ПоКоличеству)
	|					ТОГДА ВЫБОР
	|							КОГДА ПоказателиДляРасчетаНДС.СуммаВключаетНДС
	|								ТОГДА (ПоказателиДляРасчетаНДС.ДопРасходыСумма - ПоказателиДляРасчетаНДС.ДопРасходыСуммаНДС) / ИтогиПоРасходам.Количество * ДокументыДопРасходов.Количество
	|							ИНАЧЕ ПоказателиДляРасчетаНДС.ДопРасходыСумма / ИтогиПоРасходам.Количество * ДокументыДопРасходов.Количество
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПоказателиДляРасчетаНДС.СуммаВключаетНДС
	|							ТОГДА (ПоказателиДляРасчетаНДС.ДопРасходыСумма - ПоказателиДляРасчетаНДС.ДопРасходыСуммаНДС) * ДокументыДопРасходов.СуммаТовара / ИтогиПоРасходам.СуммаТовара
	|						ИНАЧЕ ПоказателиДляРасчетаНДС.ДопРасходыСумма * ДокументыДопРасходов.СуммаТовара / ИтогиПоРасходам.СуммаТовара
	|					КОНЕЦ
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ПоказателиДляРасчетаНДС.СуммаВключаетНДС
	|					ТОГДА ДокументыДопРасходов.Сумма - ДокументыДопРасходов.СуммаНДС
	|				ИНАЧЕ ДокументыДопРасходов.Сумма
	|			КОНЕЦ)) КАК ИтоговаяСуммаБезНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги) КАК ВидыЦенностей,
	|	ПоказателиДляРасчетаНДС.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	ПоказателиДляРасчетаНДС.СтавкаНДС КАК СтавкаНДС,
	|	ДокументыДопРасходов.СчетУчета КАК СчетУчета,
	|	ПоказателиДляРасчетаНДС.Контрагент КАК Контрагент,
	|	ПоказателиДляРасчетаНДС.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ПоказателиДляРасчетаНДС.Дата КАК Дата,
	|	ПоказателиДляРасчетаНДС.Номер КАК Номер,
	|	ПоказателиДляРасчетаНДС.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	ПоказателиДляРасчетаНДС.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	ПоказателиДляРасчетаНДС.СуммаДокумента КАК СуммаДокумента,
	|	ПоказателиДляРасчетаНДС.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ПодготовленныеДопРасходы
	|ИЗ
	|	ПоказателиДляРасчетаНДС КАК ПоказателиДляРасчетаНДС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДопРасходов КАК ДокументыДопРасходов
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммыДокументовВВалюте
	|			ПО ДокументыДопРасходов.ДопРасходы = РублевыеСуммыДокументовВВалюте.Регистратор
	|				И ДокументыДопРасходов.НомерСтроки = РублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|		ПО ПоказателиДляРасчетаНДС.ДопРасходы = ДокументыДопРасходов.ДопРасходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИтогиПоРасходам КАК ИтогиПоРасходам
	|		ПО ПоказателиДляРасчетаНДС.ДопРасходы = ИтогиПоРасходам.ДопРасходы
	|ГДЕ
	|	(РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
	|			ИЛИ РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента ЕСТЬ NULL)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоказателиДляРасчетаНДС.СтавкаНДС,
	|	ПоказателиДляРасчетаНДС.НДСВключенВСтоимость,
	|	ДокументыДопРасходов.СчетУчета,
	|	ДокументыДопРасходов.Поступление,
	|	ДокументыДопРасходов.СчетУчетаНДС,
	|	ДокументыДопРасходов.Номенклатура,
	|	ДокументыДопРасходов.ДопРасходы,
	|	ПоказателиДляРасчетаНДС.Контрагент,
	|	ПоказателиДляРасчетаНДС.ДоговорКонтрагента,
	|	ПоказателиДляРасчетаНДС.НомерВходящегоДокумента,
	|	ПоказателиДляРасчетаНДС.Дата,
	|	ПоказателиДляРасчетаНДС.Номер,
	|	ПоказателиДляРасчетаНДС.СуммаВключаетНДС,
	|	ПоказателиДляРасчетаНДС.ДатаВходящегоДокумента,
	|	ПоказателиДляРасчетаНДС.СуммаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГТДИмпортТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ГТДИмпортТовары.Количество) КАК Количество,
	|	СУММА(ГТДИмпортТовары.СуммаНДС) КАК СуммаНДС,
	|	ГТДИмпортТовары.СчетУчетаНДС КАК СчетУчетаНДС,
	|	СУММА(ГТДИмпортТовары.ФактурнаяСтоимость) КАК СуммаБезНДС,
	|	ГТДИмпортТовары.ДокументПартии КАК ДокументПартии,
	|	ГТДИмпортТовары.Ссылка КАК ГТД,
	|	ГТДИмпортТовары.НомерРаздела КАК НомерРаздела,
	|	СУММА(ГТДИмпортТовары.СуммаПошлины) КАК СуммаПошлины,
	|	ГТДИмпортТовары.СчетУчета КАК СчетУчета
	|ПОМЕСТИТЬ ДокументыГТД
	|ИЗ
	|	ОснованияДляДопРасходов КАК ОснованияДляДопРасходов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ГТДИмпорт.Товары КАК ГТДИмпортТовары
	|		ПО ОснованияДляДопРасходов.Партия = ГТДИмпортТовары.ДокументПартии
	|			И ОснованияДляДопРасходов.Номенклатура = ГТДИмпортТовары.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ГТДИмпортТовары.ДокументПартии,
	|	ГТДИмпортТовары.СчетУчетаНДС,
	|	ГТДИмпортТовары.Ссылка,
	|	ГТДИмпортТовары.Номенклатура,
	|	ГТДИмпортТовары.НомерРаздела,
	|	ГТДИмпортТовары.СчетУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыГТД.ГТД КАК ГТД,
	|	ГТДИмпорт.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	ВЫБОР
	|		КОГДА ГТДИмпорт.КурсВзаиморасчетов = 0
	|			ТОГДА 1
	|		ИНАЧЕ ГТДИмпорт.КурсВзаиморасчетов
	|	КОНЕЦ КАК КурсВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА ГТДИмпорт.КратностьВзаиморасчетов = 0
	|			ТОГДА 1
	|		ИНАЧЕ ГТДИмпорт.КратностьВзаиморасчетов
	|	КОНЕЦ КАК КратностьВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА ГТДИмпорт.КурсДокумента = 0
	|			ТОГДА 1
	|		ИНАЧЕ ГТДИмпорт.КурсДокумента
	|	КОНЕЦ КАК КурсДокумента,
	|	ВЫБОР
	|		КОГДА ГТДИмпорт.КратностьДокумента = 0
	|			ТОГДА 1
	|		ИНАЧЕ ГТДИмпорт.КратностьДокумента
	|	КОНЕЦ КАК КратностьДокумента,
	|	ДокументыГТД.НомерРаздела КАК НомерРаздела,
	|	ГТДИмпортРазделы.ПошлинаВВалюте КАК ПошлинаВВалюте,
	|	ГТДИмпортРазделы.НДСВВалюте КАК НДСВВалюте,
	|	ГТДИмпортРазделы.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА НЕ &СокращеннаяАналитика
	|			ТОГДА ГТДИмпорт.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент
	|ПОМЕСТИТЬ ГТДСтавкиНДС
	|ИЗ
	|	ДокументыГТД КАК ДокументыГТД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ГТДИмпорт КАК ГТДИмпорт
	|		ПО ДокументыГТД.ГТД = ГТДИмпорт.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ГТДИмпорт.Разделы КАК ГТДИмпортРазделы
	|		ПО ДокументыГТД.ГТД = ГТДИмпортРазделы.Ссылка
	|			И ДокументыГТД.НомерРаздела = ГТДИмпортРазделы.НомерСтроки
	|ГДЕ
	|	ГТДИмпорт.Проведен = ИСТИНА
	|	И ГТДИмпорт.Дата <= &Период
	|	И ГТДИмпорт.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыГТД.Номенклатура КАК Номенклатура,
	|	ДокументыГТД.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ГТДСтавкиНДС.НДСВВалюте
	|			ТОГДА ДокументыГТД.СуммаНДС * ГТДСтавкиНДС.КурсВзаиморасчетов / ГТДСтавкиНДС.КратностьВзаиморасчетов
	|		ИНАЧЕ ДокументыГТД.СуммаНДС
	|	КОНЕЦ КАК СуммаНДС,
	|	ДокументыГТД.СчетУчетаНДС КАК СчетУчетаНДС,
	|	ДокументыГТД.ДокументПартии КАК ДокументПартии,
	|	ДокументыГТД.ГТД КАК ГТД,
	|	ДокументыГТД.НомерРаздела КАК НомерРаздела,
	|	ДокументыГТД.СуммаПошлины КАК СуммаПошлины,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ТаможенныеПлатежи) КАК ВидыЦенностей,
	|	ВЫБОР
	|		КОГДА ГТДСтавкиНДС.ПошлинаВВалюте
	|			ТОГДА ДокументыГТД.СуммаПошлины * ГТДСтавкиНДС.КурсВзаиморасчетов / ГТДСтавкиНДС.КратностьВзаиморасчетов
	|		ИНАЧЕ ДокументыГТД.СуммаПошлины
	|	КОНЕЦ + ДокументыГТД.СуммаБезНДС * ГТДСтавкиНДС.КурсДокумента / ГТДСтавкиНДС.КратностьДокумента КАК СуммаБезНДС,
	|	ГТДСтавкиНДС.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	ГТДСтавкиНДС.СтавкаНДС КАК СтавкаНДС,
	|	ДокументыГТД.СчетУчета КАК СчетУчета,
	|	ГТДСтавкиНДС.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ПодгтовленныеГТД
	|ИЗ
	|	ДокументыГТД КАК ДокументыГТД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГТДСтавкиНДС КАК ГТДСтавкиНДС
	|		ПО ДокументыГТД.ГТД = ГТДСтавкиНДС.ГТД
	|			И ДокументыГТД.НомерРаздела = ГТДСтавкиНДС.НомерРаздела
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявлениеОВвозеТоваровТовары.Ссылка КАК СчетФактура,
	|	ЗаявлениеОВвозеТоваровТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаявлениеОВвозеТоваровТовары.Количество) КАК Количество,
	|	СУММА(0) КАК СуммаБезНДС,
	|	СУММА(ЗаявлениеОВвозеТоваровТовары.СуммаНДС) КАК СуммаНДС,
	|	ЗаявлениеОВвозеТоваровТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЗаявлениеОВвозеТоваровТовары.СчетУчетаНДС КАК СчетУчетаНДС,
	|	ЗаявлениеОВвозеТоваровТовары.ДокументПартии КАК ДокументПоступления,
	|	ЗаявлениеОВвозеТоваровТовары.СчетУчета КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА НЕ &СокращеннаяАналитика
	|			ТОГДА ЗаявлениеОВвозеТоваров.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент
	|ПОМЕСТИТЬ ПодготовленныеЗаявленияОВвозеТоваров
	|ИЗ
	|	ОснованияДляДопРасходов КАК ОснованияДляДопРасходов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявлениеОВвозеТоваров.Товары КАК ЗаявлениеОВвозеТоваровТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявлениеОВвозеТоваров КАК ЗаявлениеОВвозеТоваров
	|			ПО ЗаявлениеОВвозеТоваровТовары.Ссылка = ЗаявлениеОВвозеТоваров.Ссылка
	|		ПО ОснованияДляДопРасходов.Партия = ЗаявлениеОВвозеТоваровТовары.ДокументПартии
	|			И ОснованияДляДопРасходов.Номенклатура = ЗаявлениеОВвозеТоваровТовары.Номенклатура
	|ГДЕ
	|	ЗаявлениеОВвозеТоваров.Дата <= &Период
	|	И ЗаявлениеОВвозеТоваров.Проведен = ИСТИНА
	|	И ЗаявлениеОВвозеТоваров.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявлениеОВвозеТоваровТовары.Номенклатура,
	|	ЗаявлениеОВвозеТоваровТовары.ДокументПартии,
	|	ЗаявлениеОВвозеТоваровТовары.Ссылка,
	|	ЗаявлениеОВвозеТоваровТовары.СчетУчетаНДС,
	|	ЗаявлениеОВвозеТоваровТовары.СтавкаНДС,
	|	ЗаявлениеОВвозеТоваровТовары.СчетУчета,
	|	ВЫБОР
	|		КОГДА НЕ &СокращеннаяАналитика
	|			ТОГДА ЗаявлениеОВвозеТоваров.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПодгтовленныеГТД.НДСВключенВСтоимость
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыУчетаНДС.УчитываетсяВCтоимости)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыУчетаНДС.ПринимаетсяКВычету)
	|	КОНЕЦ КАК СпособУчетаНДС,
	|	ПодгтовленныеГТД.Номенклатура КАК Номенклатура,
	|	ПодгтовленныеГТД.Количество КАК Количество,
	|	ПодгтовленныеГТД.СуммаБезНДС КАК СуммаБезНДС,
	|	ПодгтовленныеГТД.СуммаНДС КАК СуммаНДС,
	|	ПодгтовленныеГТД.СтавкаНДС КАК СтавкаНДС,
	|	ПодгтовленныеГТД.СчетУчетаНДС КАК СчетУчетаНДС,
	|	ПодгтовленныеГТД.ДокументПартии КАК ДокументПоступления,
	|	ПодгтовленныеГТД.ВидыЦенностей КАК ВидЦенности,
	|	ПодгтовленныеГТД.ГТД КАК СчетФактура,
	|	ПодгтовленныеГТД.СчетУчета КАК СчетУчета,
	|	ПодгтовленныеГТД.Контрагент КАК Контрагент,
	|	NULL КАК ДоговорКонтрагента,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВх,
	|	"""" КАК НомерВх,
	|	ЛОЖЬ КАК СуммаВключаетНДС,
	|	ЛОЖЬ КАК НДСВключенВСтоимость,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК Дата,
	|	"""" КАК Номер,
	|	0 КАК СуммаДокумента,
	|	ЛОЖЬ КАК ПодготавливатьНДСКВычету
	|ИЗ
	|	ПодгтовленныеГТД КАК ПодгтовленныеГТД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПодготовленныеДопРасходы.НДСВключенВСтоимость
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыУчетаНДС.УчитываетсяВCтоимости)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыУчетаНДС.ПринимаетсяКВычету)
	|	КОНЕЦ,
	|	ПодготовленныеДопРасходы.Номенклатура,
	|	ПодготовленныеДопРасходы.Количество,
	|	ПодготовленныеДопРасходы.ИтоговаяСуммаБезНДС,
	|	ПодготовленныеДопРасходы.ИтоговаяСуммаНДС,
	|	ПодготовленныеДопРасходы.СтавкаНДС,
	|	ПодготовленныеДопРасходы.СчетУчетаНДС,
	|	ПодготовленныеДопРасходы.Поступление,
	|	ПодготовленныеДопРасходы.ВидыЦенностей,
	|	ПодготовленныеДопРасходы.ДопРасходы,
	|	ПодготовленныеДопРасходы.СчетУчета,
	|	ПодготовленныеДопРасходы.Контрагент,
	|	ПодготовленныеДопРасходы.ДоговорКонтрагента,
	|	ПодготовленныеДопРасходы.ДатаВходящегоДокумента,
	|	ПодготовленныеДопРасходы.НомерВходящегоДокумента,
	|	ПодготовленныеДопРасходы.СуммаВключаетНДС,
	|	ПодготовленныеДопРасходы.НДСВключенВСтоимость,
	|	ПодготовленныеДопРасходы.Дата,
	|	ПодготовленныеДопРасходы.Номер,
	|	ПодготовленныеДопРасходы.СуммаДокумента,
	|	ИСТИНА
	|ИЗ
	|	ПодготовленныеДопРасходы КАК ПодготовленныеДопРасходы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.СпособыУчетаНДС.ПринимаетсяКВычету),
	|	ПодготовленныеЗаявленияОВвозеТоваров.Номенклатура,
	|	ПодготовленныеЗаявленияОВвозеТоваров.Количество,
	|	ПодготовленныеЗаявленияОВвозеТоваров.СуммаБезНДС,
	|	ПодготовленныеЗаявленияОВвозеТоваров.СуммаНДС,
	|	ПодготовленныеЗаявленияОВвозеТоваров.СтавкаНДС,
	|	ПодготовленныеЗаявленияОВвозеТоваров.СчетУчетаНДС,
	|	ПодготовленныеЗаявленияОВвозеТоваров.ДокументПоступления,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ТаможенныйСоюз),
	|	ПодготовленныеЗаявленияОВвозеТоваров.СчетФактура,
	|	ПодготовленныеЗаявленияОВвозеТоваров.СчетУчета,
	|	ПодготовленныеЗаявленияОВвозеТоваров.Контрагент,
	|	NULL,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	"""",
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	"""",
	|	0,
	|	ЛОЖЬ
	|ИЗ
	|	ПодготовленныеЗаявленияОВвозеТоваров КАК ПодготовленныеЗаявленияОВвозеТоваров
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ДокументПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировкаПоступления.Ссылка КАК Партия,
	|	КорректировкаПоступления.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	КорректировкаПоступления.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	КорректировкаПоступления.ВалютаДокумента КАК ВалютаДокумента,
	|	КорректировкаПоступления.Дата КАК Дата,
	|	КорректировкаПоступления.ИсправляемыйДокументПоступления КАК ИсправляемыйДокументПоступления,
	|	КорректировкаПоступления.Контрагент КАК Контрагент,
	|	КорректировкаПоступления.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	КорректировкаПоступления.ДатаВходящегоДокумента КАК ДатаВх,
	|	КорректировкаПоступления.НомерВходящегоДокумента КАК НомерВх,
	|	КорректировкаПоступления.Номер КАК Номер,
	|	КорректировкаПоступления.СуммаДокумента КАК СуммаДокумента,
	|	КорректировкаПоступления.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение) КАК ОтдельнойСтрокой
	|ПОМЕСТИТЬ КорректировочныеДокументы
	|ИЗ
	|	ДокументыПартий КАК ДокументыПартий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|		ПО ДокументыПартий.Партия = КорректировкаПоступления.ИсправляемыйДокументПоступления
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаПоступления.Ссылка,
	|	КорректировкаПоступления.СуммаВключаетНДС,
	|	КорректировкаПоступления.НДСВключенВСтоимость,
	|	КорректировкаПоступления.ВалютаДокумента,
	|	КорректировкаПоступления.Дата,
	|	КорректировкаПоступления.ИсправляемыйДокументПоступления,
	|	КорректировкаПоступления.Контрагент,
	|	КорректировкаПоступления.ДоговорКонтрагента,
	|	КорректировкаПоступления.ДатаВходящегоДокумента,
	|	КорректировкаПоступления.НомерВходящегоДокумента,
	|	КорректировкаПоступления.Номер,
	|	КорректировкаПоступления.СуммаДокумента,
	|	КорректировкаПоступления.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	КорректировкаПоступления.Ссылка,
	|	КорректировкаПоступления.СуммаВключаетНДС,
	|	КорректировкаПоступления.НДСВключенВСтоимость,
	|	КорректировкаПоступления.ВалютаДокумента,
	|	КорректировкаПоступления.Дата,
	|	КорректировкаПоступления.ИсправляемыйДокументПоступления,
	|	КорректировкаПоступления.Контрагент,
	|	КорректировкаПоступления.ДоговорКонтрагента,
	|	КорректировкаПоступления.ДатаВходящегоДокумента,
	|	КорректировкаПоступления.НомерВходящегоДокумента,
	|	КорректировкаПоступления.Номер,
	|	КорректировкаПоступления.СуммаДокумента,
	|	КорректировкаПоступления.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|ИЗ
	|	ДокументыПартий КАК ДокументыПартий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|		ПО ДокументыПартий.Партия = КорректировкаПоступления.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаПоступления.Ссылка,
	|	КорректировкаПоступления.СуммаВключаетНДС,
	|	КорректировкаПоступления.НДСВключенВСтоимость,
	|	КорректировкаПоступления.ВалютаДокумента,
	|	КорректировкаПоступления.Дата,
	|	КорректировкаПоступления.ИсправляемыйДокументПоступления,
	|	КорректировкаПоступления.Контрагент,
	|	КорректировкаПоступления.ДоговорКонтрагента,
	|	КорректировкаПоступления.ДатаВходящегоДокумента,
	|	КорректировкаПоступления.НомерВходящегоДокумента,
	|	КорректировкаПоступления.Номер,
	|	КорректировкаПоступления.СуммаДокумента,
	|	КорректировкаПоступления.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия,
	|	ИсправляемыйДокументПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировочныеДокументы.Партия КАК Партия,
	|	КорректировочныеДокументы.ИсправляемыйДокументПоступления КАК ИсправляемыйДокументПоступления,
	|	КорректировкаПоступленияТовары.Номенклатура КАК Номенклатура,
	|	КорректировкаПоступленияТовары.НомерСтроки КАК НомерСтроки,
	|	КорректировкаПоступленияТовары.Количество - КорректировкаПоступленияТовары.КоличествоДоИзменения КАК Количество,
	|	КорректировкаПоступленияТовары.Сумма - КорректировкаПоступленияТовары.СуммаДоИзменения КАК Сумма,
	|	КорректировкаПоступленияТовары.СуммаНДС - КорректировкаПоступленияТовары.СуммаНДСДоИзменения КАК СуммаНДС,
	|	КорректировкаПоступленияТовары.СтавкаНДС КАК СтавкаНДС,
	|	КорректировкаПоступленияТовары.СчетУчетаНДС КАК СчетУчетаНДС,
	|	КорректировкаПоступленияТовары.СчетУчета КАК СчетУчета,
	|	КорректировочныеДокументы.ОтдельнойСтрокой КАК ОтдельнойСтрокой
	|ПОМЕСТИТЬ КорректировочныеДокументыТовары
	|ИЗ
	|	КорректировочныеДокументы КАК КорректировочныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления.Товары КАК КорректировкаПоступленияТовары
	|		ПО КорректировочныеДокументы.Партия = КорректировкаПоступленияТовары.Ссылка
	|ГДЕ
	|	(КорректировкаПоступленияТовары.Количество - КорректировкаПоступленияТовары.КоличествоДоИзменения <> 0
	|			ИЛИ КорректировкаПоступленияТовары.Сумма - КорректировкаПоступленияТовары.СуммаДоИзменения <> 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия,
	|	ИсправляемыйДокументПоступления,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка КАК Партия,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.НДСВключенВСтоимость
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыУчетаНДС.УчитываетсяВCтоимости)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыУчетаНДС.ПринимаетсяКВычету)
	|	КОНЕЦ КАК СпособыУчетаНДС,
	|	ПоступлениеТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДокументыПартий.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА НЕ &СокращеннаяАналитика
	|			ТОГДА ПоступлениеТоваровУслуг.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПоступлениеТоваровУслуг.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	ПоступлениеТоваровУслуг.ДатаВходящегоДокумента КАК ДатаВх,
	|	ПоступлениеТоваровУслуг.НомерВходящегоДокумента КАК НомерВх,
	|	ПоступлениеТоваровУслуг.Дата КАК Дата,
	|	ПоступлениеТоваровУслуг.Номер КАК Номер,
	|	ПоступлениеТоваровУслуг.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ ДокументыПТУ
	|ИЗ
	|	ДокументыПартий КАК ДокументыПартий
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ПО ДокументыПартий.Партия = ПоступлениеТоваровУслуг.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РублевыеСуммыДокументовВВалюте.НДС КАК НДС,
	|	РублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС КАК НалоговаяБазаНДС,
	|	РублевыеСуммыДокументовВВалюте.Регистратор КАК Регистратор,
	|	РублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
	|	РублевыеСуммыДокументовВВалюте.Всего КАК Всего
	|ПОМЕСТИТЬ РублевыеСуммыПоКорректировкамПослеИзменения
	|ИЗ
	|	КорректировочныеДокументы КАК КорректировочныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммыДокументовВВалюте
	|		ПО КорректировочныеДокументы.Партия = РублевыеСуммыДокументовВВалюте.Регистратор
	|ГДЕ
	|	(РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
	|			ИЛИ РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РублевыеСуммыДокументовВВалюте.НДС + РублевыеСуммыПоКорректировкамПослеИзменения.НДС КАК СуммаНДС,
	|	РублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
	|	РублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС + РублевыеСуммыПоКорректировкамПослеИзменения.НалоговаяБазаНДС КАК СуммаБезНДС,
	|	РублевыеСуммыДокументовВВалюте.Регистратор КАК Регистратор,
	|	РублевыеСуммыДокументовВВалюте.Всего + РублевыеСуммыПоКорректировкамПослеИзменения.Всего КАК Всего
	|ПОМЕСТИТЬ РублевыеСуммыДляКорректировокПоступления
	|ИЗ
	|	КорректировочныеДокументы КАК КорректировочныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммыДокументовВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РублевыеСуммыПоКорректировкамПослеИзменения КАК РублевыеСуммыПоКорректировкамПослеИзменения
	|			ПО РублевыеСуммыДокументовВВалюте.Регистратор = РублевыеСуммыПоКорректировкамПослеИзменения.Регистратор
	|				И РублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента = РублевыеСуммыПоКорректировкамПослеИзменения.НомерСтрокиДокумента
	|		ПО КорректировочныеДокументы.Партия = РублевыеСуммыДокументовВВалюте.Регистратор
	|ГДЕ
	|	(РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.ТоварыДоИзменения)
	|			ИЛИ РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыПТУ.Партия КАК СчетФактура,
	|	ДокументыПТУ.СпособыУчетаНДС КАК СпособыУчетаНДС,
	|	ДокументыПТУ.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровУслугОборудование.Количество КАК Количество,
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, ВЫБОР
	|			КОГДА ДокументыПТУ.СуммаВключаетНДС
	|				ТОГДА ПоступлениеТоваровУслугОборудование.Сумма - ПоступлениеТоваровУслугОборудование.СуммаНДС
	|			ИНАЧЕ ПоступлениеТоваровУслугОборудование.Сумма
	|		КОНЕЦ) КАК СуммаБезНДС,
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НДС, ПоступлениеТоваровУслугОборудование.СуммаНДС) КАК СуммаНДС,
	|	ПоступлениеТоваровУслугОборудование.СтавкаНДС КАК СтавкаНДС,
	|	ПоступлениеТоваровУслугОборудование.СчетУчетаНДС КАК СчетУчетаНДС,
	|	ДокументыПТУ.Партия КАК ДокументПоступления,
	|	НЕОПРЕДЕЛЕНО КАК ВидЦенности,
	|	ПоступлениеТоваровУслугОборудование.СчетУчета КАК СчетУчета,
	|	ДокументыПТУ.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.Всего, ВЫБОР
	|			КОГДА ДокументыПТУ.СуммаВключаетНДС
	|				ТОГДА ПоступлениеТоваровУслугОборудование.Сумма
	|			ИНАЧЕ ПоступлениеТоваровУслугОборудование.Сумма + ПоступлениеТоваровУслугОборудование.СуммаНДС
	|		КОНЕЦ) КАК Всего,
	|	ДокументыПТУ.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДокументыПТУ.ДатаВх КАК ДатаВх,
	|	ДокументыПТУ.НомерВх КАК НомерВх,
	|	ДокументыПТУ.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДокументыПТУ.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	ДокументыПТУ.Дата КАК Дата,
	|	ДокументыПТУ.Номер КАК Номер,
	|	ДокументыПТУ.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ СуммыПоНДС
	|ИЗ
	|	ДокументыПТУ КАК ДокументыПТУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Оборудование КАК ПоступлениеТоваровУслугОборудование
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммыДокументовВВалюте
	|			ПО ПоступлениеТоваровУслугОборудование.Ссылка = РублевыеСуммыДокументовВВалюте.Регистратор
	|				И ПоступлениеТоваровУслугОборудование.НомерСтроки = РублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|		ПО ДокументыПТУ.Партия = ПоступлениеТоваровУслугОборудование.Ссылка
	|			И ДокументыПТУ.Номенклатура = ПоступлениеТоваровУслугОборудование.Номенклатура
	|ГДЕ
	|	(РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Оборудование)
	|			ИЛИ РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента ЕСТЬ NULL)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыПТУ.Партия,
	|	ДокументыПТУ.СпособыУчетаНДС,
	|	ДокументыПТУ.Номенклатура,
	|	0,
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, ВЫБОР
	|			КОГДА ДокументыПТУ.СуммаВключаетНДС
	|				ТОГДА ПоступлениеТоваровУслугОбъектыСтроительства.Сумма - ПоступлениеТоваровУслугОбъектыСтроительства.СуммаНДС
	|			ИНАЧЕ ПоступлениеТоваровУслугОбъектыСтроительства.Сумма
	|		КОНЕЦ),
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НДС, ПоступлениеТоваровУслугОбъектыСтроительства.СуммаНДС),
	|	ПоступлениеТоваровУслугОбъектыСтроительства.СтавкаНДС,
	|	ПоступлениеТоваровУслугОбъектыСтроительства.СчетУчетаНДС,
	|	ДокументыПТУ.Партия,
	|	НЕОПРЕДЕЛЕНО,
	|	ПоступлениеТоваровУслугОбъектыСтроительства.СчетУчета,
	|	ДокументыПТУ.Контрагент,
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.Всего, ВЫБОР
	|			КОГДА ДокументыПТУ.СуммаВключаетНДС
	|				ТОГДА ПоступлениеТоваровУслугОбъектыСтроительства.Сумма
	|			ИНАЧЕ ПоступлениеТоваровУслугОбъектыСтроительства.Сумма + ПоступлениеТоваровУслугОбъектыСтроительства.СуммаНДС
	|		КОНЕЦ),
	|	ДокументыПТУ.ДоговорКонтрагента,
	|	ДокументыПТУ.ДатаВх,
	|	ДокументыПТУ.НомерВх,
	|	ДокументыПТУ.СуммаВключаетНДС,
	|	ДокументыПТУ.НДСВключенВСтоимость,
	|	ДокументыПТУ.Дата,
	|	ДокументыПТУ.Номер,
	|	ДокументыПТУ.СуммаДокумента
	|ИЗ
	|	ДокументыПТУ КАК ДокументыПТУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.ОбъектыСтроительства КАК ПоступлениеТоваровУслугОбъектыСтроительства
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммыДокументовВВалюте
	|			ПО ПоступлениеТоваровУслугОбъектыСтроительства.Ссылка = РублевыеСуммыДокументовВВалюте.Регистратор
	|				И ПоступлениеТоваровУслугОбъектыСтроительства.НомерСтроки = РублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|		ПО ДокументыПТУ.Партия = ПоступлениеТоваровУслугОбъектыСтроительства.Ссылка
	|			И ДокументыПТУ.Номенклатура = ПоступлениеТоваровУслугОбъектыСтроительства.ОбъектСтроительства
	|ГДЕ
	|	(РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.ОбъектыСтроительства)
	|			ИЛИ РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента ЕСТЬ NULL)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыПТУ.Партия,
	|	ДокументыПТУ.СпособыУчетаНДС,
	|	ДокументыПТУ.Номенклатура,
	|	ПоступлениеТоваровУслугТовары.Количество,
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, ВЫБОР
	|			КОГДА ДокументыПТУ.СуммаВключаетНДС
	|				ТОГДА ПоступлениеТоваровУслугТовары.Сумма - ПоступлениеТоваровУслугТовары.СуммаНДС
	|			ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма
	|		КОНЕЦ),
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НДС, ПоступлениеТоваровУслугТовары.СуммаНДС),
	|	ПоступлениеТоваровУслугТовары.СтавкаНДС,
	|	ПоступлениеТоваровУслугТовары.СчетУчетаНДС,
	|	ДокументыПТУ.Партия,
	|	НЕОПРЕДЕЛЕНО,
	|	ПоступлениеТоваровУслугТовары.СчетУчета,
	|	ДокументыПТУ.Контрагент,
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.Всего, ВЫБОР
	|			КОГДА ДокументыПТУ.СуммаВключаетНДС
	|				ТОГДА ПоступлениеТоваровУслугТовары.Сумма
	|			ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС
	|		КОНЕЦ),
	|	ДокументыПТУ.ДоговорКонтрагента,
	|	ДокументыПТУ.ДатаВх,
	|	ДокументыПТУ.НомерВх,
	|	ДокументыПТУ.СуммаВключаетНДС,
	|	ДокументыПТУ.НДСВключенВСтоимость,
	|	ДокументыПТУ.Дата,
	|	ДокументыПТУ.Номер,
	|	ДокументыПТУ.СуммаДокумента
	|ИЗ
	|	ДокументыПТУ КАК ДокументыПТУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммыДокументовВВалюте
	|			ПО ПоступлениеТоваровУслугТовары.Ссылка = РублевыеСуммыДокументовВВалюте.Регистратор
	|				И ПоступлениеТоваровУслугТовары.НомерСтроки = РублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|		ПО ДокументыПТУ.Партия = ПоступлениеТоваровУслугТовары.Ссылка
	|			И ДокументыПТУ.Номенклатура = ПоступлениеТоваровУслугТовары.Номенклатура
	|ГДЕ
	|	(РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
	|			ИЛИ РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента ЕСТЬ NULL)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыПТУ.Партия,
	|	ДокументыПТУ.СпособыУчетаНДС,
	|	ДокументыПТУ.Номенклатура,
	|	0,
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, ВЫБОР
	|			КОГДА ДокументыПТУ.СуммаВключаетНДС
	|				ТОГДА ПоступлениеТоваровУслугОсновныеСредства.Сумма - ПоступлениеТоваровУслугОсновныеСредства.СуммаНДС
	|			ИНАЧЕ ПоступлениеТоваровУслугОсновныеСредства.Сумма
	|		КОНЕЦ),
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НДС, ПоступлениеТоваровУслугОсновныеСредства.СуммаНДС),
	|	ПоступлениеТоваровУслугОсновныеСредства.СтавкаНДС,
	|	ПоступлениеТоваровУслугОсновныеСредства.СчетУчетаНДС,
	|	ДокументыПТУ.Партия,
	|	НЕОПРЕДЕЛЕНО,
	|	ПоступлениеТоваровУслугОсновныеСредства.СчетУчета,
	|	ДокументыПТУ.Контрагент,
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.Всего, ВЫБОР
	|			КОГДА ДокументыПТУ.СуммаВключаетНДС
	|				ТОГДА ПоступлениеТоваровУслугОсновныеСредства.Сумма
	|			ИНАЧЕ ПоступлениеТоваровУслугОсновныеСредства.Сумма + ПоступлениеТоваровУслугОсновныеСредства.СуммаНДС
	|		КОНЕЦ),
	|	ДокументыПТУ.ДоговорКонтрагента,
	|	ДокументыПТУ.ДатаВх,
	|	ДокументыПТУ.НомерВх,
	|	ДокументыПТУ.СуммаВключаетНДС,
	|	ДокументыПТУ.НДСВключенВСтоимость,
	|	ДокументыПТУ.Дата,
	|	ДокументыПТУ.Номер,
	|	ДокументыПТУ.СуммаДокумента
	|ИЗ
	|	ДокументыПТУ КАК ДокументыПТУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.ОсновныеСредства КАК ПоступлениеТоваровУслугОсновныеСредства
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммыДокументовВВалюте
	|			ПО ПоступлениеТоваровУслугОсновныеСредства.Ссылка = РублевыеСуммыДокументовВВалюте.Регистратор
	|				И ПоступлениеТоваровУслугОсновныеСредства.НомерСтроки = РублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|		ПО ДокументыПТУ.Партия = ПоступлениеТоваровУслугОсновныеСредства.Ссылка
	|			И ДокументыПТУ.Номенклатура = ПоступлениеТоваровУслугОсновныеСредства.ОсновноеСредство
	|ГДЕ
	|	(РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.ОсновныеСредства)
	|			ИЛИ РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента ЕСТЬ NULL)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыПартий.Партия,
	|	ВЫБОР
	|		КОГДА &СуммыБезПредъявленыхСФ
	|				ИЛИ АвансовыйОтчетТовары.ПредъявленСФ
	|			ТОГДА ВЫБОР
	|					КОГДА АвансовыйОтчет.НДСВключенВСтоимость
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыУчетаНДС.УчитываетсяВCтоимости)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыУчетаНДС.ПринимаетсяКВычету)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыУчетаНДС.Распределен)
	|	КОНЕЦ,
	|	ДокументыПартий.Номенклатура,
	|	АвансовыйОтчетТовары.Количество,
	|	ВЫБОР
	|		КОГДА &СуммыБезПредъявленыхСФ
	|				ИЛИ АвансовыйОтчетТовары.ПредъявленСФ
	|			ТОГДА ВЫБОР
	|					КОГДА АвансовыйОтчет.СуммаВключаетНДС
	|						ТОГДА (АвансовыйОтчетТовары.Сумма - АвансовыйОтчетТовары.СуммаНДС) * ВЫБОР
	|								КОГДА АвансовыйОтчет.КурсДокумента = 0
	|									ТОГДА 1
	|								ИНАЧЕ АвансовыйОтчет.КурсДокумента
	|							КОНЕЦ / ВЫБОР
	|								КОГДА АвансовыйОтчет.КратностьДокумента = 0
	|									ТОГДА 1
	|								ИНАЧЕ АвансовыйОтчет.КратностьДокумента
	|							КОНЕЦ
	|					ИНАЧЕ АвансовыйОтчетТовары.Сумма * ВЫБОР
	|							КОГДА АвансовыйОтчет.КурсДокумента = 0
	|								ТОГДА 1
	|							ИНАЧЕ АвансовыйОтчет.КурсДокумента
	|						КОНЕЦ / ВЫБОР
	|							КОГДА АвансовыйОтчет.КратностьДокумента = 0
	|								ТОГДА 1
	|							ИНАЧЕ АвансовыйОтчет.КратностьДокумента
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &СуммыБезПредъявленыхСФ
	|				ИЛИ АвансовыйОтчетТовары.ПредъявленСФ
	|			ТОГДА АвансовыйОтчетТовары.СуммаНДС * ВЫБОР
	|					КОГДА АвансовыйОтчет.КурсДокумента = 0
	|						ТОГДА 1
	|					ИНАЧЕ АвансовыйОтчет.КурсДокумента
	|				КОНЕЦ / ВЫБОР
	|					КОГДА АвансовыйОтчет.КратностьДокумента = 0
	|						ТОГДА 1
	|					ИНАЧЕ АвансовыйОтчет.КратностьДокумента
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	АвансовыйОтчетТовары.СтавкаНДС,
	|	АвансовыйОтчетТовары.СчетУчетаНДС,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчетТовары.ПредъявленСФ
	|			ТОГДА АвансовыйОтчетТовары.СчетФактура
	|		ИНАЧЕ ДокументыПартий.Партия
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	АвансовыйОтчетТовары.СчетУчета,
	|	ВЫБОР
	|		КОГДА НЕ &СокращеннаяАналитика
	|			ТОГДА АвансовыйОтчетТовары.Поставщик
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчет.СуммаВключаетНДС
	|			ТОГДА АвансовыйОтчетТовары.Сумма
	|		ИНАЧЕ АвансовыйОтчетТовары.Сумма - АвансовыйОтчетТовары.СуммаНДС
	|	КОНЕЦ * ВЫБОР
	|		КОГДА АвансовыйОтчет.КурсДокумента = 0
	|			ТОГДА 1
	|		ИНАЧЕ АвансовыйОтчет.КурсДокумента
	|	КОНЕЦ / ВЫБОР
	|		КОГДА АвансовыйОтчет.КратностьДокумента = 0
	|			ТОГДА 1
	|		ИНАЧЕ АвансовыйОтчет.КратностьДокумента
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	АвансовыйОтчетТовары.ДатаСФ,
	|	АвансовыйОтчетТовары.НомерСФ,
	|	АвансовыйОтчет.СуммаВключаетНДС,
	|	АвансовыйОтчет.НДСВключенВСтоимость,
	|	АвансовыйОтчет.Дата,
	|	АвансовыйОтчет.Номер,
	|	АвансовыйОтчет.СуммаДокумента
	|ИЗ
	|	ДокументыПартий КАК ДокументыПартий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АвансовыйОтчет.Товары КАК АвансовыйОтчетТовары
	|		ПО ДокументыПартий.Партия = АвансовыйОтчетТовары.Ссылка
	|			И ДокументыПартий.Номенклатура = АвансовыйОтчетТовары.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АвансовыйОтчет КАК АвансовыйОтчет
	|		ПО ДокументыПартий.Партия = АвансовыйОтчет.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыПартий.Партия,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыУчетаНДС.ПринимаетсяКВычету),
	|	ДокументыПартий.Номенклатура,
	|	ВозвратТоваровОтПокупателяТовары.Количество,
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, ВЫБОР
	|			КОГДА ВозвратТоваровОтПокупателя.СуммаВключаетНДС
	|				ТОГДА ВозвратТоваровОтПокупателяТовары.Сумма - ВозвратТоваровОтПокупателяТовары.СуммаНДС
	|			ИНАЧЕ ВозвратТоваровОтПокупателяТовары.Сумма
	|		КОНЕЦ),
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НДС, ВозвратТоваровОтПокупателяТовары.СуммаНДС),
	|	ВозвратТоваровОтПокупателяТовары.СтавкаНДС,
	|	&СчетНДС,
	|	ДокументыПартий.Партия,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Возврат),
	|	ВозвратТоваровОтПокупателяТовары.СчетУчета,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.Всего, ВЫБОР
	|			КОГДА ВозвратТоваровОтПокупателя.СуммаВключаетНДС
	|				ТОГДА ВозвратТоваровОтПокупателяТовары.Сумма
	|			ИНАЧЕ ВозвратТоваровОтПокупателяТовары.Сумма + ВозвратТоваровОтПокупателяТовары.СуммаНДС
	|		КОНЕЦ),
	|	ВозвратТоваровОтПокупателя.ДоговорКонтрагента,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	"""",
	|	ВозвратТоваровОтПокупателя.СуммаВключаетНДС,
	|	ИСТИНА,
	|	ВозвратТоваровОтПокупателя.Дата,
	|	ВозвратТоваровОтПокупателя.Номер,
	|	ВозвратТоваровОтПокупателя.СуммаДокумента
	|ИЗ
	|	ДокументыПартий КАК ДокументыПартий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммыДокументовВВалюте
	|			ПО ВозвратТоваровОтПокупателяТовары.Ссылка = РублевыеСуммыДокументовВВалюте.Регистратор
	|				И ВозвратТоваровОтПокупателяТовары.НомерСтроки = РублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|		ПО ДокументыПартий.Партия = ВозвратТоваровОтПокупателяТовары.Ссылка
	|			И ДокументыПартий.Номенклатура = ВозвратТоваровОтПокупателяТовары.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|		ПО ДокументыПартий.Партия = ВозвратТоваровОтПокупателя.Ссылка
	|ГДЕ
	|	(РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
	|			ИЛИ РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента ЕСТЬ NULL)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыПартий.Партия,
	|	ВЫБОР
	|		КОГДА КорректировочныеДокументы.НДСВключенВСтоимость
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыУчетаНДС.УчитываетсяВCтоимости)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыУчетаНДС.ПринимаетсяКВычету)
	|	КОНЕЦ,
	|	ДокументыПартий.Номенклатура,
	|	КорректировочныеДокументыТовары.Количество,
	|	ЕСТЬNULL(РублевыеСуммыДляКорректировокПоступления.СуммаБезНДС, ВЫБОР
	|			КОГДА КорректировочныеДокументы.СуммаВключаетНДС
	|				ТОГДА КорректировочныеДокументыТовары.Сумма - КорректировочныеДокументыТовары.СуммаНДС
	|			ИНАЧЕ КорректировочныеДокументыТовары.Сумма
	|		КОНЕЦ),
	|	ЕСТЬNULL(РублевыеСуммыДляКорректировокПоступления.СуммаНДС, КорректировочныеДокументыТовары.СуммаНДС),
	|	КорректировочныеДокументыТовары.СтавкаНДС,
	|	КорректировочныеДокументыТовары.СчетУчетаНДС,
	|	КорректировочныеДокументы.ИсправляемыйДокументПоступления,
	|	НЕОПРЕДЕЛЕНО,
	|	КорректировочныеДокументыТовары.СчетУчета,
	|	ВЫБОР
	|		КОГДА НЕ &СокращеннаяАналитика
	|			ТОГДА КорректировочныеДокументы.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорректировочныеДокументы.СуммаВключаетНДС
	|			ТОГДА КорректировочныеДокументыТовары.Сумма
	|		ИНАЧЕ КорректировочныеДокументыТовары.Сумма + КорректировочныеДокументыТовары.СуммаНДС
	|	КОНЕЦ,
	|	КорректировочныеДокументы.ДоговорКонтрагента,
	|	КорректировочныеДокументы.ДатаВх,
	|	КорректировочныеДокументы.НомерВх,
	|	КорректировочныеДокументы.СуммаВключаетНДС,
	|	КорректировочныеДокументы.НДСВключенВСтоимость,
	|	КорректировочныеДокументы.Дата,
	|	КорректировочныеДокументы.Номер,
	|	КорректировочныеДокументы.СуммаДокумента
	|ИЗ
	|	ДокументыПартий КАК ДокументыПартий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КорректировочныеДокументы КАК КорректировочныеДокументы
	|		ПО ДокументыПартий.Партия = КорректировочныеДокументы.Партия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КорректировочныеДокументыТовары КАК КорректировочныеДокументыТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РублевыеСуммыДляКорректировокПоступления КАК РублевыеСуммыДляКорректировокПоступления
	|			ПО КорректировочныеДокументыТовары.Партия = РублевыеСуммыДляКорректировокПоступления.Регистратор
	|				И КорректировочныеДокументыТовары.НомерСтроки = РублевыеСуммыДляКорректировокПоступления.НомерСтрокиДокумента
	|		ПО ДокументыПартий.Партия = КорректировочныеДокументыТовары.ИсправляемыйДокументПоступления
	|			И ДокументыПартий.Номенклатура = КорректировочныеДокументыТовары.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыПартий.Партия,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыУчетаНДС.ПринимаетсяКВычету),
	|	ДокументыПартий.Номенклатура,
	|	ПоступлениеВАрендуПредметыЛизинга.Количество,
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, ВЫБОР
	|			КОГДА ПоступлениеВАренду.СуммаВключаетНДС
	|				ТОГДА ПоступлениеВАрендуПредметыЛизинга.Сумма - ПоступлениеВАрендуПредметыЛизинга.СуммаНДС
	|			ИНАЧЕ ПоступлениеВАрендуПредметыЛизинга.Сумма
	|		КОНЕЦ),
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НДС, ПоступлениеВАрендуПредметыЛизинга.СуммаНДС),
	|	ПоступлениеВАрендуПредметыЛизинга.СтавкаНДС,
	|	ПоступлениеВАрендуПредметыЛизинга.СчетУчетаНДС,
	|	ДокументыПартий.Партия,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОС),
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА НЕ &СокращеннаяАналитика
	|			ТОГДА ПоступлениеВАренду.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.Всего, ВЫБОР
	|			КОГДА ПоступлениеВАренду.СуммаВключаетНДС
	|				ТОГДА ПоступлениеВАрендуПредметыЛизинга.Сумма
	|			ИНАЧЕ ПоступлениеВАрендуПредметыЛизинга.Сумма + ПоступлениеВАрендуПредметыЛизинга.СуммаНДС
	|		КОНЕЦ),
	|	ПоступлениеВАренду.ДоговорКонтрагента,
	|	ПоступлениеВАренду.ДатаВходящегоДокумента,
	|	ПоступлениеВАренду.НомерВходящегоДокумента,
	|	ПоступлениеВАренду.СуммаВключаетНДС,
	|	ПоступлениеВАренду.НДСВключенВСтоимость,
	|	ПоступлениеВАренду.Дата,
	|	ПоступлениеВАренду.Номер,
	|	ПоступлениеВАренду.СуммаДокумента
	|ИЗ
	|	ДокументыПартий КАК ДокументыПартий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеВАренду.ПредметыЛизинга КАК ПоступлениеВАрендуПредметыЛизинга
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммыДокументовВВалюте
	|			ПО ПоступлениеВАрендуПредметыЛизинга.Ссылка = РублевыеСуммыДокументовВВалюте.Регистратор
	|				И ПоступлениеВАрендуПредметыЛизинга.НомерСтроки = РублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|		ПО ДокументыПартий.Партия = ПоступлениеВАрендуПредметыЛизинга.Ссылка
	|			И ДокументыПартий.Номенклатура = ПоступлениеВАрендуПредметыЛизинга.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеВАренду КАК ПоступлениеВАренду
	|		ПО ДокументыПартий.Партия = ПоступлениеВАренду.Ссылка
	|ГДЕ
	|	(РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.ПредметыЛизинга)
	|			ИЛИ РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента ЕСТЬ NULL)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыПартий.Партия,
	|	ВЫБОР
	|		КОГДА ПоступлениеНМА.НДСВключенВСтоимость
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыУчетаНДС.УчитываетсяВCтоимости)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыУчетаНДС.ПринимаетсяКВычету)
	|	КОНЕЦ,
	|	ДокументыПартий.Номенклатура,
	|	0,
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, ВЫБОР
	|			КОГДА ПоступлениеНМА.СуммаВключаетНДС
	|				ТОГДА ПоступлениеНМАНематериальныеАктивы.Сумма - ПоступлениеНМАНематериальныеАктивы.СуммаНДС
	|			ИНАЧЕ ПоступлениеНМАНематериальныеАктивы.Сумма
	|		КОНЕЦ),
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НДС, ПоступлениеНМАНематериальныеАктивы.СуммаНДС),
	|	ПоступлениеНМАНематериальныеАктивы.СтавкаНДС,
	|	ПоступлениеНМАНематериальныеАктивы.СчетУчетаНДС,
	|	ДокументыПартий.Партия,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НМА),
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА НЕ &СокращеннаяАналитика
	|			ТОГДА ПоступлениеНМА.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.Всего, ВЫБОР
	|			КОГДА ПоступлениеНМА.СуммаВключаетНДС
	|				ТОГДА ПоступлениеНМАНематериальныеАктивы.Сумма
	|			ИНАЧЕ ПоступлениеНМАНематериальныеАктивы.Сумма + ПоступлениеНМАНематериальныеАктивы.СуммаНДС
	|		КОНЕЦ),
	|	ПоступлениеНМА.ДоговорКонтрагента,
	|	ПоступлениеНМА.ДатаВходящегоДокумента,
	|	ПоступлениеНМА.НомерВходящегоДокумента,
	|	ПоступлениеНМА.СуммаВключаетНДС,
	|	ПоступлениеНМА.НДСВключенВСтоимость,
	|	ПоступлениеНМА.Дата,
	|	ПоступлениеНМА.Номер,
	|	ПоступлениеНМА.СуммаДокумента
	|ИЗ
	|	ДокументыПартий КАК ДокументыПартий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНМА.НематериальныеАктивы КАК ПоступлениеНМАНематериальныеАктивы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммыДокументовВВалюте
	|			ПО ПоступлениеНМАНематериальныеАктивы.Ссылка = РублевыеСуммыДокументовВВалюте.Регистратор
	|				И ПоступлениеНМАНематериальныеАктивы.НомерСтроки = РублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|		ПО ДокументыПартий.Партия = ПоступлениеНМАНематериальныеАктивы.Ссылка
	|			И ДокументыПартий.Номенклатура = ПоступлениеНМАНематериальныеАктивы.НематериальныйАктив
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНМА КАК ПоступлениеНМА
	|		ПО ДокументыПартий.Партия = ПоступлениеНМА.Ссылка
	|ГДЕ
	|	(РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.НематериальныеАктивы)
	|			ИЛИ РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента ЕСТЬ NULL)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыПТУ.Партия,
	|	ДокументыПТУ.СпособыУчетаНДС,
	|	ДокументыПТУ.Номенклатура,
	|	0,
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, ВЫБОР
	|			КОГДА ДокументыПТУ.СуммаВключаетНДС
	|				ТОГДА ПоступлениеТоваровУслугУслуги.Сумма - ПоступлениеТоваровУслугУслуги.СуммаНДС
	|			ИНАЧЕ ПоступлениеТоваровУслугУслуги.Сумма
	|		КОНЕЦ),
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НДС, ПоступлениеТоваровУслугУслуги.СуммаНДС),
	|	ПоступлениеТоваровУслугУслуги.СтавкаНДС,
	|	ПоступлениеТоваровУслугУслуги.СчетУчетаНДС,
	|	ДокументыПТУ.Партия,
	|	НЕОПРЕДЕЛЕНО,
	|	ПоступлениеТоваровУслугУслуги.СчетЗатрат,
	|	ДокументыПТУ.Контрагент,
	|	ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.Всего, ВЫБОР
	|			КОГДА ДокументыПТУ.СуммаВключаетНДС
	|				ТОГДА ПоступлениеТоваровУслугУслуги.Сумма
	|			ИНАЧЕ ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС
	|		КОНЕЦ),
	|	ДокументыПТУ.ДоговорКонтрагента,
	|	ДокументыПТУ.ДатаВх,
	|	ДокументыПТУ.НомерВх,
	|	ДокументыПТУ.СуммаВключаетНДС,
	|	ДокументыПТУ.НДСВключенВСтоимость,
	|	ДокументыПТУ.Дата,
	|	ДокументыПТУ.Номер,
	|	ДокументыПТУ.СуммаДокумента
	|ИЗ
	|	ДокументыПТУ КАК ДокументыПТУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммыДокументовВВалюте
	|			ПО ПоступлениеТоваровУслугУслуги.Ссылка = РублевыеСуммыДокументовВВалюте.Регистратор
	|				И ПоступлениеТоваровУслугУслуги.НомерСтроки = РублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|		ПО ДокументыПТУ.Партия = ПоступлениеТоваровУслугУслуги.Ссылка
	|			И ДокументыПТУ.Номенклатура = ПоступлениеТоваровУслугУслуги.Субконто1
	|ГДЕ
	|	(РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги)
	|			ИЛИ РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента ЕСТЬ NULL)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировочныеДокументы.Партия,
	|	ВЫБОР
	|		КОГДА КорректировочныеДокументы.НДСВключенВСтоимость
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыУчетаНДС.УчитываетсяВCтоимости)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыУчетаНДС.ПринимаетсяКВычету)
	|	КОНЕЦ,
	|	ДокументыПартий.Номенклатура,
	|	КорректировочныеДокументыТовары.Количество,
	|	ЕСТЬNULL(РублевыеСуммыДляКорректировокПоступления.СуммаБезНДС, ВЫБОР
	|			КОГДА КорректировочныеДокументы.СуммаВключаетНДС
	|				ТОГДА КорректировочныеДокументыТовары.Сумма - КорректировочныеДокументыТовары.СуммаНДС
	|			ИНАЧЕ КорректировочныеДокументыТовары.Сумма
	|		КОНЕЦ),
	|	ЕСТЬNULL(РублевыеСуммыДляКорректировокПоступления.СуммаНДС, КорректировочныеДокументыТовары.СуммаНДС),
	|	КорректировочныеДокументыТовары.СтавкаНДС,
	|	КорректировочныеДокументыТовары.СчетУчетаНДС,
	|	КорректировочныеДокументы.ИсправляемыйДокументПоступления,
	|	НЕОПРЕДЕЛЕНО,
	|	КорректировочныеДокументыТовары.СчетУчета,
	|	ВЫБОР
	|		КОГДА НЕ &СокращеннаяАналитика
	|			ТОГДА КорректировочныеДокументы.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорректировочныеДокументы.СуммаВключаетНДС
	|			ТОГДА КорректировочныеДокументыТовары.Сумма
	|		ИНАЧЕ КорректировочныеДокументыТовары.Сумма + КорректировочныеДокументыТовары.СуммаНДС
	|	КОНЕЦ,
	|	КорректировочныеДокументы.ДоговорКонтрагента,
	|	КорректировочныеДокументы.ДатаВх,
	|	КорректировочныеДокументы.НомерВх,
	|	КорректировочныеДокументы.СуммаВключаетНДС,
	|	КорректировочныеДокументы.НДСВключенВСтоимость,
	|	КорректировочныеДокументы.Дата,
	|	КорректировочныеДокументы.Номер,
	|	КорректировочныеДокументы.СуммаДокумента
	|ИЗ
	|	ДокументыПартий КАК ДокументыПартий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КорректировочныеДокументы КАК КорректировочныеДокументы
	|		ПО (КорректировочныеДокументы.ОтдельнойСтрокой)
	|			И ДокументыПартий.Партия = КорректировочныеДокументы.ИсправляемыйДокументПоступления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КорректировочныеДокументыТовары КАК КорректировочныеДокументыТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РублевыеСуммыДляКорректировокПоступления КАК РублевыеСуммыДляКорректировокПоступления
	|			ПО КорректировочныеДокументыТовары.Партия = РублевыеСуммыДляКорректировокПоступления.Регистратор
	|				И КорректировочныеДокументыТовары.НомерСтроки = РублевыеСуммыДляКорректировокПоступления.НомерСтрокиДокумента
	|		ПО ДокументыПартий.Партия = КорректировочныеДокументыТовары.ИсправляемыйДокументПоступления
	|			И ДокументыПартий.Номенклатура = КорректировочныеДокументыТовары.Номенклатура
	|			И (КорректировочныеДокументыТовары.Количество > 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыПТУ.Партия КАК Партия,
	|	ДокументыПТУ.Номенклатура КАК Номенклатура,
	|	КорректировочныеДокументыТовары.Количество КАК Количество,
	|	ЕСТЬNULL(РублевыеСуммыДляКорректировокПоступления.СуммаНДС, КорректировочныеДокументыТовары.СуммаНДС) КАК СуммаНДС,
	|	ЕСТЬNULL(РублевыеСуммыДляКорректировокПоступления.СуммаБезНДС, ВЫБОР
	|			КОГДА КорректировочныеДокументы.СуммаВключаетНДС
	|				ТОГДА КорректировочныеДокументыТовары.Сумма - КорректировочныеДокументыТовары.СуммаНДС
	|			ИНАЧЕ КорректировочныеДокументыТовары.Сумма
	|		КОНЕЦ) КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА КорректировочныеДокументы.СуммаВключаетНДС
	|			ТОГДА КорректировочныеДокументыТовары.Сумма
	|		ИНАЧЕ КорректировочныеДокументыТовары.Сумма + КорректировочныеДокументыТовары.СуммаНДС
	|	КОНЕЦ КАК Всего,
	|	ВЫБОР
	|		КОГДА КорректировочныеДокументыТовары.ОтдельнойСтрокой
	|			ТОГДА ЗНАЧЕНИЕ(Документ.КорректировкаПоступления.ПустаяСсылка)
	|		ИНАЧЕ КорректировочныеДокументы.Партия
	|	КОНЕЦ КАК ИсправленныйСчетФактура
	|ПОМЕСТИТЬ Корректировки
	|ИЗ
	|	ДокументыПТУ КАК ДокументыПТУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КорректировочныеДокументы КАК КорректировочныеДокументы
	|		ПО ДокументыПТУ.Партия = КорректировочныеДокументы.ИсправляемыйДокументПоступления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КорректировочныеДокументыТовары КАК КорректировочныеДокументыТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РублевыеСуммыДляКорректировокПоступления КАК РублевыеСуммыДляКорректировокПоступления
	|			ПО КорректировочныеДокументыТовары.Партия = РублевыеСуммыДляКорректировокПоступления.Регистратор
	|				И КорректировочныеДокументыТовары.НомерСтроки = РублевыеСуммыДляКорректировокПоступления.НомерСтрокиДокумента
	|		ПО ДокументыПТУ.Партия = КорректировочныеДокументыТовары.ИсправляемыйДокументПоступления
	|			И ДокументыПТУ.Номенклатура = КорректировочныеДокументыТовары.Номенклатура
	|ГДЕ
	|	(КорректировочныеДокументыТовары.Количество < 0
	|			ИЛИ НЕ КорректировочныеДокументыТовары.ОтдельнойСтрокой)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыПоНДС.СпособыУчетаНДС КАК СпособУчетаНДС,
	|	СуммыПоНДС.Номенклатура КАК Номенклатура,
	|	СУММА(СуммыПоНДС.Количество + ЕСТЬNULL(Корректировки.Количество, 0)) КАК Количество,
	|	СУММА(СуммыПоНДС.СуммаБезНДС + ЕСТЬNULL(Корректировки.СуммаБезНДС, 0)) КАК СуммаБезНДС,
	|	СУММА(СуммыПоНДС.СуммаНДС + ЕСТЬNULL(Корректировки.СуммаНДС, 0)) КАК СуммаНДС,
	|	СуммыПоНДС.СтавкаНДС КАК СтавкаНДС,
	|	СуммыПоНДС.СчетУчетаНДС КАК СчетУчетаНДС,
	|	СуммыПоНДС.ДокументПоступления КАК ДокументПоступления,
	|	СуммыПоНДС.ВидЦенности КАК ВидЦенности,
	|	СуммыПоНДС.СчетФактура КАК СчетФактура,
	|	ЕСТЬNULL(Корректировки.ИсправленныйСчетФактура, ЗНАЧЕНИЕ(Документ.КорректировкаПоступления.ПустаяСсылка)) КАК ИсправленныйСчетФактура,
	|	СуммыПоНДС.СчетУчета КАК СчетУчета,
	|	СуммыПоНДС.Контрагент КАК Контрагент,
	|	СуммыПоНДС.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СуммыПоНДС.ДатаВх КАК ДатаВх,
	|	СуммыПоНДС.НомерВх КАК НомерВх,
	|	СуммыПоНДС.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	СуммыПоНДС.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	СуммыПоНДС.Дата КАК Дата,
	|	СуммыПоНДС.Номер КАК Номер,
	|	СУММА(СуммыПоНДС.Всего + ЕСТЬNULL(Корректировки.Всего, 0)) КАК Всего,
	|	СуммыПоНДС.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	СуммыПоНДС КАК СуммыПоНДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Корректировки КАК Корректировки
	|		ПО СуммыПоНДС.ДокументПоступления = Корректировки.Партия
	|			И СуммыПоНДС.Номенклатура = Корректировки.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыПоНДС.Номенклатура,
	|	СуммыПоНДС.СпособыУчетаНДС,
	|	СуммыПоНДС.СтавкаНДС,
	|	СуммыПоНДС.СчетУчетаНДС,
	|	СуммыПоНДС.ДокументПоступления,
	|	СуммыПоНДС.ВидЦенности,
	|	СуммыПоНДС.СчетФактура,
	|	СуммыПоНДС.СчетУчета,
	|	СуммыПоНДС.Контрагент,
	|	СуммыПоНДС.ДоговорКонтрагента,
	|	СуммыПоНДС.ДатаВх,
	|	СуммыПоНДС.НомерВх,
	|	СуммыПоНДС.СуммаВключаетНДС,
	|	СуммыПоНДС.НДСВключенВСтоимость,
	|	СуммыПоНДС.Дата,
	|	СуммыПоНДС.Номер,
	|	СуммыПоНДС.СуммаДокумента,
	|	ЕСТЬNULL(Корректировки.ИсправленныйСчетФактура, ЗНАЧЕНИЕ(Документ.КорректировкаПоступления.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ДокументПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвансовыеОтчетыКакРасходы.ДокАвансовыйОтчет КАК ДокАвансовыйОтчет,
	|	АвансовыеОтчетыКакРасходы.ОбъектУчета КАК Номенклатура,
	|	АвансовыеОтчетыКакРасходы.СчетУчета КАК СчетУчета,
	|	АвансовыйОтчетПрочее.СтавкаНДС КАК СтавкаНДС,
	|	АвансовыйОтчетПрочее.СчетУчетаНДС КАК СчетУчетаНДС,
	|	СУММА(ВЫБОР
	|			КОГДА АвансовыйОтчетПрочее.ПредъявленСФ
	|				ТОГДА ВЫБОР
	|						КОГДА АвансовыйОтчет.СуммаВключаетНДС
	|							ТОГДА (АвансовыйОтчетПрочее.Сумма - АвансовыйОтчетПрочее.СуммаНДС) * ВЫБОР
	|									КОГДА АвансовыйОтчет.КурсДокумента = 0
	|										ТОГДА 1
	|									ИНАЧЕ АвансовыйОтчет.КурсДокумента
	|								КОНЕЦ / ВЫБОР
	|									КОГДА АвансовыйОтчет.КратностьДокумента = 0
	|										ТОГДА 1
	|									ИНАЧЕ АвансовыйОтчет.КратностьДокумента
	|								КОНЕЦ
	|						ИНАЧЕ АвансовыйОтчетПрочее.Сумма * ВЫБОР
	|								КОГДА АвансовыйОтчет.КурсДокумента = 0
	|									ТОГДА 1
	|								ИНАЧЕ АвансовыйОтчет.КурсДокумента
	|							КОНЕЦ / ВЫБОР
	|								КОГДА АвансовыйОтчет.КратностьДокумента = 0
	|									ТОГДА 1
	|								ИНАЧЕ АвансовыйОтчет.КратностьДокумента
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаБезНДС,
	|	СУММА(ВЫБОР
	|			КОГДА АвансовыйОтчетПрочее.ПредъявленСФ
	|				ТОГДА АвансовыйОтчетПрочее.СуммаНДС * ВЫБОР
	|						КОГДА АвансовыйОтчет.КурсДокумента = 0
	|							ТОГДА 1
	|						ИНАЧЕ АвансовыйОтчет.КурсДокумента
	|					КОНЕЦ / ВЫБОР
	|						КОГДА АвансовыйОтчет.КратностьДокумента = 0
	|							ТОГДА 1
	|						ИНАЧЕ АвансовыйОтчет.КратностьДокумента
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНДС,
	|	АвансовыйОтчетПрочее.Субконто2 КАК Субконто2,
	|	АвансовыйОтчетПрочее.Субконто3 КАК Субконто3,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчетПрочее.ПредъявленСФ
	|			ТОГДА АвансовыйОтчетПрочее.СчетФактура
	|		ИНАЧЕ АвансовыеОтчетыКакРасходы.ДокАвансовыйОтчет
	|	КОНЕЦ КАК СчетФактура,
	|	НЕОПРЕДЕЛЕНО КАК ВидЦенности,
	|	ВЫБОР
	|		КОГДА НЕ &СокращеннаяАналитика
	|			ТОГДА АвансовыйОтчетПрочее.Поставщик
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ЛОЖЬ КАК ПодготавливатьНДСКВычету
	|ИЗ
	|	АвансовыеОтчетыКакРасходы КАК АвансовыеОтчетыКакРасходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АвансовыйОтчет КАК АвансовыйОтчет
	|		ПО АвансовыеОтчетыКакРасходы.ДокАвансовыйОтчет = АвансовыйОтчет.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АвансовыйОтчет.Прочее КАК АвансовыйОтчетПрочее
	|		ПО АвансовыеОтчетыКакРасходы.ДокАвансовыйОтчет = АвансовыйОтчетПрочее.Ссылка
	|			И АвансовыеОтчетыКакРасходы.ОбъектУчета = АвансовыйОтчетПрочее.Субконто1
	|			И АвансовыеОтчетыКакРасходы.СчетУчета = АвансовыйОтчетПрочее.СчетЗатрат
	|
	|СГРУППИРОВАТЬ ПО
	|	АвансовыеОтчетыКакРасходы.ОбъектУчета,
	|	АвансовыеОтчетыКакРасходы.ДокАвансовыйОтчет,
	|	АвансовыйОтчетПрочее.СтавкаНДС,
	|	АвансовыеОтчетыКакРасходы.СчетУчета,
	|	АвансовыйОтчетПрочее.СчетУчетаНДС,
	|	АвансовыйОтчетПрочее.Субконто3,
	|	АвансовыйОтчетПрочее.Субконто2,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчетПрочее.ПредъявленСФ
	|			ТОГДА АвансовыйОтчетПрочее.СчетФактура
	|		ИНАЧЕ АвансовыеОтчетыКакРасходы.ДокАвансовыйОтчет
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ &СокращеннаяАналитика
	|			ТОГДА АвансовыйОтчетПрочее.Поставщик
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ДокАвансовыйОтчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КорректировочныеДокументы.Партия КАК Партия,
	|	КорректировочныеДокументы.ИсправляемыйДокументПоступления КАК ИсправляемыйДокументПоступления
	|ИЗ
	|	КорректировочныеДокументы КАК КорректировочныеДокументы";
	
	
	ОписаниеПараметровЗапроса = Запрос.НайтиПараметры();
	Для Каждого Параметр Из ОписаниеПараметровЗапроса Цикл
		Запрос.УстановитьПараметр(Параметр.Имя, СтруктураПараметровДляПолученияНДС[Параметр.Имя]);
	КонецЦикла;
	
	Результат = Запрос.ВыполнитьПакет();
	
	Возврат Результат;
	
КонецФункции

// Возвращает текст запроса, для выборки остатков и оборотов по счетам кап вложений
//  Данные временных табиц:
//  0. Свойства счета, будет различное формирование остатков и распределение по партиям
//  в зависимости от того, есть количественный учет на счете или нет
//  1. Остатки по счетам по всей аналитике
//  2. По номенклатуре из остатков получены документы Требование накладная и Передача оборудования в монтаж
//  нужно чтобы получить табличные части документов и по ним провести распределения 
//  (по сути аналогично комплектации товаров)
//  3. Для поиска движений объединяем номенклатуру с остатков и из табличных частей из таблицы 2
//  4. Движений по счетам 07; 08
//  5. Корректировки движений по счетам 07; 08
//  6. Итоговая таблица Движений по счетам 07; 08 за вычетом партии на остатках и корректировок
//  7. Сгруппированная таблица 6, по этой таблице будет осуществляться распределение по партиям 
//  8. - 10 Движения по счету 10 для номенклатуры из ТЧ таблицы 2
//  11. Остатки по счетам 07;08 связанные со свойствами счета (количественный учет)
// 
// Возвращаемое значение:
//  Результат - Строка с текстом запроса
//
Функция ТекстЗапросаПоСчетамКапвложений() Экспорт
	
	ТекстЗапроса = 	
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет,
	|	Хозрасчетный.Количественный КАК КоличественныйУчет
	|ПОМЕСТИТЬ СвойстваСчета
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В (&СчетаКапВложений, &СчетаНПС)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Счет КАК Счет,
	|	ХозрасчетныйОстатки.Субконто1 КАК Номенклатура,
	|	&ПолеСклад КАК Склад,
	|	&ПолеПартия КАК Партия,
	|	ХозрасчетныйОстатки.Организация КАК Организация,
	|	ЕСТЬNULL(ХозрасчетныйОстатки.Подразделение, НЕОПРЕДЕЛЕНО) КАК Подразделение,
	|	ХозрасчетныйОстатки.КоличествоОстаток КАК Количество,
	|	0 КАК Сумма
	|ПОМЕСТИТЬ ОстаткиССуммойИлиКоличеством
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ГраницаОстатков, Счет В (&СчетаНПС), &ВидыСубконтоНПС, Организация = &Организация) КАК ХозрасчетныйОстатки
	|ГДЕ
	|	ХозрасчетныйОстатки.КоличествоОстаток > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Счет,
	|	ХозрасчетныйОстатки.Субконто1,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ХозрасчетныйОстатки.Организация,
	|	ЕСТЬNULL(ХозрасчетныйОстатки.Подразделение, НЕОПРЕДЕЛЕНО),
	|	0,
	|	ХозрасчетныйОстатки.СуммаОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ГраницаОстатков, Счет В (&СчетаКапВложений), , Организация = &Организация) КАК ХозрасчетныйОстатки
	|ГДЕ
	|	ХозрасчетныйОстатки.СуммаОстаток > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПередачаОборудованияВМонтажОборудование.Номенклатура КАК Номенклатура,
	|	ПередачаОборудованияВМонтажОборудование.Количество КАК Количество,
	|	ПередачаОборудованияВМонтажОборудование.СчетУчета КАК СчетКомплектующие,
	|	ПередачаОборудованияВМонтаж.ОбъектСтроительства КАК ОбъектУчета,
	|	ПередачаОборудованияВМонтаж.Ссылка КАК ДокументИсточник,
	|	ПередачаОборудованияВМонтаж.СчетУчетаОбъектаСтроительства КАК СчетУчетаОбъекта
	|ПОМЕСТИТЬ ПередачаОборудования
	|ИЗ
	|	Документ.ПередачаОборудованияВМонтаж КАК ПередачаОборудованияВМонтаж
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаОборудованияВМонтаж.Оборудование КАК ПередачаОборудованияВМонтажОборудование
	|		ПО ПередачаОборудованияВМонтаж.Ссылка = ПередачаОборудованияВМонтажОборудование.Ссылка
	|ГДЕ
	|	ПередачаОборудованияВМонтаж.ОбъектСтроительства В
	|			(ВЫБРАТЬ
	|				ОстаткиССуммойИлиКоличеством.Номенклатура КАК Номенклатура
	|			ИЗ
	|				ОстаткиССуммойИлиКоличеством КАК ОстаткиССуммойИлиКоличеством)
	|	И ПередачаОборудованияВМонтаж.Проведен
	|	И ПередачаОборудованияВМонтаж.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТребованиеНакладнаяМатериалы.Номенклатура,
	|	ТребованиеНакладнаяМатериалы.Количество,
	|	ТребованиеНакладнаяМатериалы.Счет,
	|	ТребованиеНакладная.Субконто1,
	|	ТребованиеНакладная.Ссылка,
	|	ТребованиеНакладная.СчетЗатрат
	|ИЗ
	|	Документ.ТребованиеНакладная КАК ТребованиеНакладная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТребованиеНакладная.Материалы КАК ТребованиеНакладнаяМатериалы
	|		ПО ТребованиеНакладная.Ссылка = ТребованиеНакладнаяМатериалы.Ссылка
	|ГДЕ
	|	ТребованиеНакладная.Субконто1 В
	|			(ВЫБРАТЬ
	|				ОстаткиССуммойИлиКоличеством.Номенклатура КАК Номенклатура
	|			ИЗ
	|				ОстаткиССуммойИлиКоличеством КАК ОстаткиССуммойИлиКоличеством)
	|	И ТребованиеНакладная.Проведен
	|	И ТребованиеНакладная.Организация = &Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПередачаОборудования.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ОбъектыИНоменклатура
	|ИЗ
	|	ПередачаОборудования КАК ПередачаОборудования
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиССуммойИКоличеством.Номенклатура
	|ИЗ
	|	ОстаткиССуммойИлиКоличеством КАК ОстаткиССуммойИКоличеством
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор,
	|	ХозрасчетныйОборотыДтКт.Период КАК Период,
	|	ХозрасчетныйОборотыДтКт.КоличествоОборотДт КАК Количество,
	|	ХозрасчетныйОборотыДтКт.СчетДт КАК СчетДт,
	|	ХозрасчетныйОборотыДтКт.СчетКт КАК СчетКт,
	|	ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК ОбъектУчета,
	|	ЕСТЬNULL(ХозрасчетныйОборотыДтКт.ПодразделениеДт, НЕОПРЕДЕЛЕНО) КАК ПодразделениеДт,
	|	0 КАК Сумма,
	|	&ОборотыПартия КАК Партия,
	|	&ОборотыСклад КАК Склад
	|ПОМЕСТИТЬ ДвиженияСКоличеством
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			,
	|			&ГраницаОстатков,
	|			Регистратор,
	|			СчетДт В (&СчетаНПС),
	|			&ВидыСубконтоНПС,
	|			,
	|			,
	|			Организация = &Организация
	|				И СубконтоДт1 В
	|					(ВЫБРАТЬ
	|						ОбъектыИНоменклатура.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ОбъектыИНоменклатура КАК ОбъектыИНоменклатура)) КАК ХозрасчетныйОборотыДтКт
	|ГДЕ
	|	ХозрасчетныйОборотыДтКт.СчетДт <> ХозрасчетныйОборотыДтКт.СчетКт
	|	И ХозрасчетныйОборотыДтКт.КоличествоОборотДт > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ХозрасчетныйОборотыДтКт.Регистратор КАК Документ.КорректировкаПоступления).ИсправляемыйДокументПоступления КАК Поступление,
	|	ХозрасчетныйОборотыДтКт.Период КАК Период,
	|	ХозрасчетныйОборотыДтКт.СчетДт КАК СчетДт,
	|	ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК ОбъектУчета,
	|	ХозрасчетныйОборотыДтКт.СуммаОборот КАК Сумма,
	|	-ХозрасчетныйОборотыДтКт.КоличествоОборотДт КАК Количество,
	|	ХозрасчетныйОборотыДтКт.СчетКт КАК СчетКт
	|ПОМЕСТИТЬ СторноПоКорректировкам
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			,
	|			&ГраницаОстатков,
	|			Регистратор,
	|			СчетДт В (&СчетаНПС),
	|			,
	|			,
	|			,
	|			Организация = &Организация
	|				И СубконтоДт1 В
	|					(ВЫБРАТЬ
	|						ОбъектыИНоменклатура.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ОбъектыИНоменклатура КАК ОбъектыИНоменклатура)) КАК ХозрасчетныйОборотыДтКт
	|ГДЕ
	|	ХозрасчетныйОборотыДтКт.КоличествоОборотДт < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияСКоличеством.Регистратор КАК Регистратор,
	|	ДвиженияСКоличеством.Период КАК Период,
	|	ДвиженияСКоличеством.СчетДт КАК Счет,
	|	ДвиженияСКоличеством.ОбъектУчета КАК ОбъектУчета,
	|	ДвиженияСКоличеством.Количество - ЕСТЬNULL(СторноПоКорректировкам.Количество, 0) - ЕСТЬNULL(ОстаткиССуммойИлиКоличеством.Количество, 0) КАК Количество,
	|	0 КАК Сумма,
	|	ДвиженияСКоличеством.Партия КАК Партия,
	|	ДвиженияСКоличеством.Склад КАК Склад,
	|	ДвиженияСКоличеством.ПодразделениеДт КАК Подразделение,
	|	ЕСТЬNULL(ДвиженияСКоличеством.СчетКт, СторноПоКорректировкам.СчетКт) КАК СчетПоступления
	|ПОМЕСТИТЬ ТаблицаДвижений
	|ИЗ
	|	ДвиженияСКоличеством КАК ДвиженияСКоличеством
	|		ЛЕВОЕ СОЕДИНЕНИЕ СторноПоКорректировкам КАК СторноПоКорректировкам
	|		ПО ДвиженияСКоличеством.ОбъектУчета = СторноПоКорректировкам.ОбъектУчета
	|			И ДвиженияСКоличеством.Регистратор = СторноПоКорректировкам.Поступление
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиССуммойИлиКоличеством КАК ОстаткиССуммойИлиКоличеством
	|		ПО ДвиженияСКоличеством.ОбъектУчета = ОстаткиССуммойИлиКоличеством.Номенклатура
	|			И ДвиженияСКоличеством.Регистратор = ОстаткиССуммойИлиКоличеством.Партия
	|			И ДвиженияСКоличеством.Склад = ОстаткиССуммойИлиКоличеством.Склад
	|			И ДвиженияСКоличеством.ПодразделениеДт = ОстаткиССуммойИлиКоличеством.Подразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.Регистратор,
	|	ХозрасчетныйОборотыДтКт.Период,
	|	ХозрасчетныйОборотыДтКт.СчетДт,
	|	ХозрасчетныйОборотыДтКт.СубконтоДт1,
	|	0,
	|	ХозрасчетныйОборотыДтКт.СуммаОборот,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЕСТЬNULL(ХозрасчетныйОборотыДтКт.ПодразделениеДт, НЕОПРЕДЕЛЕНО),
	|	ХозрасчетныйОборотыДтКт.СчетКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			,
	|			&ГраницаОстатков,
	|			Регистратор,
	|			СчетДт В (&СчетаКапВложений),
	|			,
	|			,
	|			,
	|			Организация = &Организация
	|				И СубконтоДт1 В
	|					(ВЫБРАТЬ
	|						ОбъектыИНоменклатура.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ОбъектыИНоменклатура КАК ОбъектыИНоменклатура)) КАК ХозрасчетныйОборотыДтКт
	|ГДЕ
	|	ХозрасчетныйОборотыДтКт.СуммаОборот > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДвижений.Регистратор КАК Регистратор,
	|	ТаблицаДвижений.Период КАК Период,
	|	ТаблицаДвижений.Счет КАК Счет,
	|	ТаблицаДвижений.ОбъектУчета КАК Номенклатура,
	|	СУММА(ТаблицаДвижений.Количество) КАК Количество,
	|	СУММА(ТаблицаДвижений.Сумма) КАК Сумма,
	|	ТаблицаДвижений.Партия КАК Партия,
	|	ТаблицаДвижений.Склад КАК Склад,
	|	ТаблицаДвижений.Подразделение КАК Подразделение,
	|	ТаблицаДвижений.СчетПоступления КАК СчетПоступления
	|ИЗ
	|	ТаблицаДвижений КАК ТаблицаДвижений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДвижений.ОбъектУчета,
	|	ТаблицаДвижений.Период,
	|	ТаблицаДвижений.Регистратор,
	|	ТаблицаДвижений.Счет,
	|	ТаблицаДвижений.Партия,
	|	ТаблицаДвижений.Склад,
	|	ТаблицаДвижений.Подразделение,
	|	ТаблицаДвижений.СчетПоступления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	Счет,
	|	Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.Период КАК Период,
	|	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор,
	|	ХозрасчетныйОборотыДтКт.СчетДт КАК СчетДт,
	|	ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК Номенклатура,
	|	ХозрасчетныйОборотыДтКт.КоличествоОборотДт КАК Количество
	|ПОМЕСТИТЬ ДвиженияПоНоменклатуре
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			,
	|			&ГраницаОстатков,
	|			Регистратор,
	|			СчетДт В ИЕРАРХИИ (&Счет10)
	|				ИЛИ СчетДт В ИЕРАРХИИ (&Счет41),
	|			,
	|			,
	|			,
	|			Организация = &Организация
	|				И (СубконтоДт1 В
	|						(ВЫБРАТЬ
	|							ОбъектыИНоменклатура.Номенклатура КАК Номенклатура
	|						ИЗ
	|							ОбъектыИНоменклатура КАК ОбъектыИНоменклатура)
	|					ИЛИ СубконтоДт1 В
	|						(ВЫБРАТЬ
	|							ОстаткиССуммойИлиКоличеством.Номенклатура КАК Номенклатура
	|						ИЗ
	|							ОстаткиССуммойИлиКоличеством КАК ОстаткиССуммойИлиКоличеством))) КАК ХозрасчетныйОборотыДтКт
	|ГДЕ
	|	НЕ(ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|				И ХозрасчетныйОборотыДтКт.СчетДт = ХозрасчетныйОборотыДтКт.СчетКт)
	|	И ХозрасчетныйОборотыДтКт.КоличествоОборотДт > 0
	|	И НЕ ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Счет КАК Счет,
	|	ХозрасчетныйОстатки.Субконто1 КАК Номенклатура,
	|	&ПолеПартия КАК Партия,
	|	ХозрасчетныйОстатки.КоличествоОстаток КАК Количество
	|ПОМЕСТИТЬ ОстаткиПоНоменклатуреДляИсключенияПартииСАналитики
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&ГраницаОстатков,
	|			Счет В ИЕРАРХИИ (&Счет10),
	|			&ВидыСубконтоНПС,
	|			Организация = &Организация
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						ОбъектыИНоменклатура.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ОбъектыИНоменклатура КАК ОбъектыИНоменклатура)) КАК ХозрасчетныйОстатки
	|ГДЕ
	|	ХозрасчетныйОстатки.СуммаОстаток > 0
	|	И ХозрасчетныйОстатки.КоличествоОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияПоНоменклатуре.Период КАК Период,
	|	ДвиженияПоНоменклатуре.Регистратор КАК Партия,
	|	ДвиженияПоНоменклатуре.СчетДт КАК Счет,
	|	ДвиженияПоНоменклатуре.Номенклатура КАК Номенклатура,
	|	ДвиженияПоНоменклатуре.Количество - ЕСТЬNULL(ОстаткиПоНоменклатуреДляИсключенияПартииСАналитики.Количество, 0) КАК Количество,
	|	ДвиженияПоНоменклатуре.Регистратор КАК Регистратор
	|ИЗ
	|	ДвиженияПоНоменклатуре КАК ДвиженияПоНоменклатуре
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоНоменклатуреДляИсключенияПартииСАналитики КАК ОстаткиПоНоменклатуреДляИсключенияПартииСАналитики
	|		ПО ДвиженияПоНоменклатуре.Номенклатура = ОстаткиПоНоменклатуреДляИсключенияПартииСАналитики.Номенклатура
	|			И ДвиженияПоНоменклатуре.Регистратор = ОстаткиПоНоменклатуреДляИсключенияПартииСАналитики.Партия
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	Счет,
	|	Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиССуммойИКоличеством.Счет КАК Счет,
	|	ОстаткиССуммойИКоличеством.Номенклатура КАК Номенклатура,
	|	ОстаткиССуммойИКоличеством.Склад КАК Склад,
	|	ОстаткиССуммойИКоличеством.Партия КАК Партия,
	|	ОстаткиССуммойИКоличеством.Организация КАК Организация,
	|	ОстаткиССуммойИКоличеством.Подразделение КАК Подразделение,
	|	ОстаткиССуммойИКоличеством.Количество КАК Количество,
	|	ОстаткиССуммойИКоличеством.Сумма КАК Сумма,
	|	СвойстваСчета.КоличественныйУчет КАК КоличественныйУчет
	|ИЗ
	|	ОстаткиССуммойИлиКоличеством КАК ОстаткиССуммойИКоличеством
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СвойстваСчета КАК СвойстваСчета
	|		ПО ОстаткиССуммойИКоличеством.Счет = СвойстваСчета.Счет";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает текст запроса, для выборки остатков и оборотов по товарным счетам
//  Данные временных таблиц:
//  0. ТаблицаИспользованныхПартий - Таблица с партиями, по которым уже были распределены остатки
//  при формировании остатков по счетам 07; 08, передается  как параметр
//  1. Остатки по счетам 10; 41; 45
//  2. Комплектации, по номенклатуре, которая есть на остатках
//  3. Номенклатура с остатков, объединненая с номенклатурой, которая выступает как комплектующие
//  Необходимо для поиска движений.
//  4. Движения по счетам
//  5. Корректировки по движениям
//  6. Итоговая таблица: Движения по счетам - Корректировки - Партии на аналитике 
//
// Возвращаемое значение:
//  Результат - Строка с текстом запроса
//
Функция ТестЗапросаОстаткиИДвиженияПоТоварнымСчетам() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаИспользованныхПартий.Номенклатура КАК Номенклатура,
	|	ТаблицаИспользованныхПартий.Счет КАК Счет,
	|	ТаблицаИспользованныхПартий.Партия КАК Партия,
	|	ТаблицаИспользованныхПартий.Количество КАК Количество
	|ПОМЕСТИТЬ ТаблицаИспользованныхПартий
	|ИЗ
	|	&ТаблицаИспользованныхПартий КАК ТаблицаИспользованныхПартий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Счет КАК Счет,
	|	ЕСТЬNULL(ХозрасчетныйОстатки.Субконто1, НЕОПРЕДЕЛЕНО) КАК Номенклатура,
	|	&ПолеСклад КАК Склад,
	|	&ПолеПартия КАК Партия,
	|	ХозрасчетныйОстатки.Организация КАК Организация,
	|	ЕСТЬNULL(ХозрасчетныйОстатки.Подразделение, НЕОПРЕДЕЛЕНО) КАК Подразделение,
	|	ХозрасчетныйОстатки.КоличествоОстаток КАК Количество
	|ПОМЕСТИТЬ ОстаткиНоменклатуры
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ГраницаОстатков, Счет В (&СчетаЗапасов), &ВидыСубконтоНСП, Организация = &Организация) КАК ХозрасчетныйОстатки
	|ГДЕ
	|	ХозрасчетныйОстатки.КоличествоОстаток > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Счет,
	|	ЕСТЬNULL(ХозрасчетныйОстатки.Субконто1, НЕОПРЕДЕЛЕНО),
	|	ЕСТЬNULL(ХозрасчетныйОстатки.Субконто2, НЕОПРЕДЕЛЕНО),
	|	&ПартияКакСубконто3,
	|	ХозрасчетныйОстатки.Организация,
	|	ЕСТЬNULL(ХозрасчетныйОстатки.Подразделение, НЕОПРЕДЕЛЕНО),
	|	ХозрасчетныйОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ГраницаОстатков, Счет В (&СчетаПередачи), &ВидыСубконтоНКП, Организация = &Организация) КАК ХозрасчетныйОстатки
	|ГДЕ
	|	ХозрасчетныйОстатки.КоличествоОстаток > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Счет,
	|	ЕСТЬNULL(ХозрасчетныйОстатки.Субконто1, НЕОПРЕДЕЛЕНО),
	|	ЕСТЬNULL(ХозрасчетныйОстатки.Субконто2, НЕОПРЕДЕЛЕНО),
	|	&ПартияКакСубконто3,
	|	ХозрасчетныйОстатки.Организация,
	|	ЕСТЬNULL(ХозрасчетныйОстатки.Подразделение, НЕОПРЕДЕЛЕНО),
	|	ХозрасчетныйОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ГраницаОстатков, Счет = &Счет4111, &ВидыСубконтоНСП4111, Организация = &Организация) КАК ХозрасчетныйОстатки
	|ГДЕ
	|	ХозрасчетныйОстатки.КоличествоОстаток > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КомплектацияНоменклатуры.Ссылка КАК Комплектация,
	|	КомплектацияНоменклатуры.Количество КАК Количество,
	|	КомплектацияНоменклатурыКомплектующие.СчетУчета КАК СчетУчета,
	|	КомплектацияНоменклатурыКомплектующие.Количество КАК КоличествоКомплектующие,
	|	КомплектацияНоменклатурыКомплектующие.Номенклатура КАК Комплектующие,
	|	КомплектацияНоменклатуры.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ Комплектации
	|ИЗ
	|	Документ.КомплектацияНоменклатуры КАК КомплектацияНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КомплектацияНоменклатуры.Комплектующие КАК КомплектацияНоменклатурыКомплектующие
	|		ПО КомплектацияНоменклатуры.Ссылка = КомплектацияНоменклатурыКомплектующие.Ссылка
	|ГДЕ
	|	КомплектацияНоменклатуры.Номенклатура В
	|			(ВЫБРАТЬ
	|				ОстаткиНоменклатуры.Номенклатура КАК Номенклатура
	|			ИЗ
	|				ОстаткиНоменклатуры КАК ОстаткиНоменклатуры)
	|	И КомплектацияНоменклатуры.Проведен = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Комплектующие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Комплектации.Комплектующие КАК Номенклатура
	|ПОМЕСТИТЬ НоменклатураДляПоискаДвижений
	|ИЗ
	|	Комплектации КАК Комплектации
	|
	|СГРУППИРОВАТЬ ПО
	|	Комплектации.Комплектующие
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНоменклатуры.Номенклатура
	|ИЗ
	|	ОстаткиНоменклатуры КАК ОстаткиНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.Период КАК Период,
	|	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор,
	|	ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК Номенклатура,
	|	ХозрасчетныйОборотыДтКт.СчетДт КАК Счет,
	|	ХозрасчетныйОборотыДтКт.СчетКт КАК КорСчет,
	|	ХозрасчетныйОборотыДтКт.КоличествоОборотДт КАК Количество,
	|	ЛОЖЬ КАК Сторнирующие
	|ПОМЕСТИТЬ ДокументыПоступлений
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			,
	|			&ГраницаОстатков,
	|			Регистратор,
	|			СчетДт В (&СчетаЗапасов, &СчетаПередачи)
	|				ИЛИ СчетДт = &Счет4111,
	|			&ВидыСубконтоН,
	|			,
	|			,
	|			Организация = &Организация
	|				И СубконтоДт1 В
	|					(ВЫБРАТЬ
	|						НоменклатураДляПоискаДвижений.Номенклатура КАК Номенклатура
	|					ИЗ
	|						НоменклатураДляПоискаДвижений КАК НоменклатураДляПоискаДвижений)) КАК ХозрасчетныйОборотыДтКт
	|ГДЕ
	|	НЕ(ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|				И ХозрасчетныйОборотыДтКт.СчетДт = ХозрасчетныйОборотыДтКт.СчетКт)
	|	И ХозрасчетныйОборотыДтКт.КоличествоОборотДт > 0
	|	И НЕ ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.Период,
	|	ХозрасчетныйОборотыДтКт.Регистратор,
	|	ХозрасчетныйОборотыДтКт.СубконтоКт1,
	|	ХозрасчетныйОборотыДтКт.СчетКт,
	|	ХозрасчетныйОборотыДтКт.СчетДт,
	|	-ХозрасчетныйОборотыДтКт.КоличествоОборотКт,
	|	ИСТИНА
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			,
	|			&ГраницаОстатков,
	|			Регистратор,
	|			,
	|			,
	|			СчетКт В (&СчетаЗапасов)
	|				ИЛИ СчетКт = &Счет4111,
	|			&ВидыСубконтоН,
	|			Организация = &Организация
	|				И СубконтоКт1 В
	|					(ВЫБРАТЬ
	|						НоменклатураДляПоискаДвижений.Номенклатура КАК Номенклатура
	|					ИЗ
	|						НоменклатураДляПоискаДвижений КАК НоменклатураДляПоискаДвижений)) КАК ХозрасчетныйОборотыДтКт
	|ГДЕ
	|	ХозрасчетныйОборотыДтКт.КоличествоОборотКт < 0
	|	И (ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ОперацияБух
	|			ИЛИ ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.СчетДт КАК Счет,
	|	ХозрасчетныйОборотыДтКт.КоличествоОборотДт КАК Количество,
	|	ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК Номенклатура,
	|	ВЫРАЗИТЬ(ХозрасчетныйОборотыДтКт.Регистратор КАК Документ.КорректировкаПоступления).ИсправляемыйДокументПоступления КАК Поступление
	|ПОМЕСТИТЬ КорректировкаДляДокументовПоступления
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			,
	|			&ГраницаОстатков,
	|			Регистратор,
	|			СчетДт В (&СчетаЗапасов)
	|				ИЛИ СчетДт = &Счет4111,
	|			,
	|			,
	|			,
	|			Организация = &Организация
	|				И СубконтоДт1 В
	|					(ВЫБРАТЬ
	|						НоменклатураДляПоискаДвижений.Номенклатура КАК Номенклатура
	|					ИЗ
	|						НоменклатураДляПоискаДвижений КАК НоменклатураДляПоискаДвижений)) КАК ХозрасчетныйОборотыДтКт
	|ГДЕ
	|	ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.КорректировкаПоступления
	|	И ХозрасчетныйОборотыДтКт.КоличествоОборотДт < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыПоступлений.Период КАК Период,
	|	ДокументыПоступлений.Регистратор КАК Партия,
	|	ДокументыПоступлений.Номенклатура КАК Номенклатура,
	|	ДокументыПоступлений.Счет КАК Счет,
	|	ДокументыПоступлений.КорСчет КАК КорСчет,
	|	ЕСТЬNULL(ДокументыПоступлений.Количество, 0) + ЕСТЬNULL(КорректировкаДляДокументовПоступления.Количество, 0) - ЕСТЬNULL(ТаблицаИспользованныхПартий.Количество, 0) КАК Количество
	|ИЗ
	|	ДокументыПоступлений КАК ДокументыПоступлений
	|		ЛЕВОЕ СОЕДИНЕНИЕ КорректировкаДляДокументовПоступления КАК КорректировкаДляДокументовПоступления
	|		ПО ДокументыПоступлений.Регистратор = КорректировкаДляДокументовПоступления.Поступление
	|			И ДокументыПоступлений.Номенклатура = КорректировкаДляДокументовПоступления.Номенклатура
	|			И ДокументыПоступлений.Счет = КорректировкаДляДокументовПоступления.Счет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИспользованныхПартий КАК ТаблицаИспользованныхПартий
	|		ПО ДокументыПоступлений.Номенклатура = ТаблицаИспользованныхПартий.Номенклатура
	|			И ДокументыПоступлений.Счет = ТаблицаИспользованныхПартий.Счет
	|			И ДокументыПоступлений.Регистратор = ТаблицаИспользованныхПартий.Партия
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	Счет,
	|	Период УБЫВ";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Распределяет остатки на счетах капитальных вложений по партиям
//
// Параметры: 
//  ТаблицаОстатков - Таблица значений - Таблица остатков с субконто и количеством
//  ТаблицаДвижений - Документы поступлений для распределения по ФИФО
//  ТаблицаОстатковПоПартиям - Таблица значений - Таблица для заполнения данных по найденным партиям
//  СтруктураОписанийТипов - Структура - Структура с описаниями типов,
//  влияющих на действия над строкой остатков в зависимости от типа партии
//  СтруктураПараметров - Структура - Общие параметры
//
Процедура РаспределитьОстаткиВложенийПоПартиям(ТаблицаОстатков, ТаблицаДвижений, ТаблицаОстатковПоПартиям,
												СтруктураОписанийТипов, СтруктураПараметров) Экспорт

	ВестиПартионныйУчет 		 = СтруктураПараметров.ВестиПартионныйУчет;
	ВедетсяСуммовойУчетПоСкладам = СтруктураПараметров.ВедетсяСуммовойУчетПоСкладам; 
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("КоличественныйУчет", Истина);
	
	// Сначала выполним распределение для счетов, на которых есть количественный учет (07, 08.04.1)
	// Потому что в данном случае распределение по партиям будет по количеству
	ОстаткиСКоличественнымУчетом = ТаблицаОстатков.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого СтрокаПоиска Из ОстаткиСКоличественнымУчетом Цикл 		
		// Полноценно ведется партионный учет и найден документ партии на остатках 
		Если СтрокаПоиска.Партия <> Неопределено Тогда
			СтрокаПартии = ТаблицаОстатковПоПартиям.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПартии,СтрокаПоиска);
			ОпределитьДопПараметрыПоСтроке(СтрокаПартии, СтруктураОписанийТипов, Ложь, СтрокаПоиска.Счет);
			СтрокаПартии.Сумма = 0; 
		Иначе
			// Партия в аналитике не заполнена, надо искать распределение.					
			СтруктураПоискаПартии = Новый Структура;
			СтруктураПоискаПартии.Вставить("Счет",	  		СтрокаПоиска.Счет);
			СтруктураПоискаПартии.Вставить("Номенклатура",	СтрокаПоиска.Номенклатура);
			Если ВестиПартионныйУчет Тогда
				СтруктураПоискаПартии.Вставить("Партия", СтрокаПоиска.Партия);
			КонецЕсли;
			Если ВедетсяСуммовойУчетПоСкладам Тогда 
				СтруктураПоискаПартии.Вставить("Склад", СтрокаПоиска.Склад);
			КонецЕсли;
			СтруктураПоискаПартии.Вставить("Подразделение", СтрокаПоиска.Подразделение);
			СтрокиДвижений = ТаблицаДвижений.НайтиСтроки(СтруктураПоискаПартии);
			КоличествоКРаспределению = СтрокаПоиска.Количество;
			Для Каждого СтрокаДвижений Из СтрокиДвижений Цикл
				Если СтрокаДвижений.Количество <= 0 И СтрокаДвижений.Сумма <= 0 Тогда
					Продолжить;
				КонецЕсли;
				Если СтрокаДвижений.Количество > 0  И КоличествоКРаспределению > 0 Тогда
					СтрокаПартии = ТаблицаОстатковПоПартиям.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаПартии,СтрокаПоиска);
					СтрокаПартии.Партия = СтрокаДвижений.Регистратор;
					СтрокаПартии.НетПартииНаОстатках = Истина;
					Если КоличествоКРаспределению <= СтрокаДвижений.Количество Тогда
						СтрокаПартии.Количество = КоличествоКРаспределению;
						СтрокаДвижений.Количество = СтрокаДвижений.Количество - КоличествоКРаспределению;
						КоличествоКРаспределению = 0;
					Иначе
						СтрокаПартии.Количество = СтрокаДвижений.Количество;
						КоличествоКРаспределению = КоличествоКРаспределению - СтрокаДвижений.Количество;
						СтрокаДвиженийКоличество = 0;							
					КонецЕсли;
					СтрокаПартии.Сумма = 0;
				КонецЕсли;
				ОпределитьДопПараметрыПоСтроке(СтрокаПартии, СтруктураОписанийТипов, Ложь, СтрокаПоиска.Счет, СтрокаДвижений.СчетПоступления);
				Если КоличествоКРаспределению = 0 Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если КоличествоКРаспределению > 0 Тогда
				СтрокаПартии = ТаблицаОстатковПоПартиям.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПартии,СтрокаПоиска);
				СтрокаПартии.Партия 		  = СтруктураПараметров.СлужебнаяПартия;
				СтрокаПартии.Сумма			  = 0;
				СтрокаПартии.НетПартииНаОстатках = Истина;
				ЗаполнитьДопПараметрыСтрокиПартии(СтрокаПартии, Ложь, Ложь, Ложь, Ложь); 
				КоличествоКРаспределению	  = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Необходимо выполнить распределение партий по суммам, для счетов 08.01; 08.02; 08.03; 08.04.2; 08.05; 08.08
	ПараметрыОтбора.КоличественныйУчет = Ложь;
	
	ОстаткиССуммовымУчетом = ТаблицаОстатков.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаПоиска Из ОстаткиССуммовымУчетом Цикл
		СтруктураПоискаДвижений = Новый Структура();
		СтруктураПоискаДвижений.Вставить("Счет", 			СтрокаПоиска.Счет);
		СтруктураПоискаДвижений.Вставить("Номенклатура", 	СтрокаПоиска.Номенклатура);
		СтруктураПоискаДвижений.Вставить("Подразделение", 	СтрокаПоиска.Подразделение);
		СтрокиДвижений = ТаблицаДвижений.НайтиСтроки(СтруктураПоискадвижений);
		КонтрольнаяСумма = СтрокаПоиска.Сумма;
		Для Каждого СтрокаДвижений Из СтрокиДвижений Цикл
			Если Окр(СтрокаДвижений.Сумма,0) = 0 Тогда 
				Продолжить;
			КонецЕсли;
			Если СтруктураОписанийТипов.ОписаниеТиповДляПартийПоВложениям.СодержитТип(ТипЗнч(СтрокаДвижений.Регистратор))
				Или СтруктураОписанийТипов.ОписаниеТиповДляДопПоискаПоВложениям.СодержитТип(ТипЗнч(СтрокаДвижений.Регистратор)) Тогда
				СтрокаПартии = ТаблицаОстатковПоПартиям.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПартии,СтрокаПоиска);
				СтрокаПартии.Партия = СтрокаДвижений.Регистратор;
				Если Окр(КонтрольнаяСумма, 0) <= Окр(СтрокаДвижений.Сумма,0) Тогда
					СтрокаПартии.Сумма = КонтрольнаяСумма;
					СтрокаДвижений.Сумма = СтрокаДвижений.Сумма - КонтрольнаяСумма;
					КонтрольнаяСумма = 0;
				Иначе
					СтрокаПартии.Сумма = СтрокаДвижений.Сумма;
					КонтрольнаяСумма = КонтрольнаяСумма - СтрокаДвижений.Сумма;
					СтрокаДвижений.Сумма = 0;
				КонецЕсли;
				ОпределитьДопПараметрыПоСтроке(СтрокаПартии, СтруктураОписанийТипов, Ложь, СтрокаПоиска.Счет); 
			Иначе
				КонтрольнаяСумма = КонтрольнаяСумма - СтрокаДвижений.Сумма;
			КонецЕсли;
			Если Окр(КонтрольнаяСумма,0) = 0 Тогда 
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Распределяет остатки на товарных счетах по партиям
//
// Параметры:
//  ТаблицаСПолнойАналитикой - Таблица значений - Таблица остатков с субконто и количеством
//  ТаблицаСЗаполненнымиПартиями - Таблица значений - Таблица для заполнения данных по найденным паритям
//  ТаблицаСДокументамиДвижений - Таблица значений - Документы поступлений для распределения по ФИФО
//  СтруктураОписанийТипов - Структура - Структура с описаниями типов,
//  влияющих на действия над строкой остатков в зависимости от типа партии
//
Процедура РаспределитьОстаткиТоваровПоПартиям(ТаблицаСПолнойАналитикой, ТаблицаСЗаполненнымиПартиями, 
												ТаблицаСДокументамиДвижений, СтруктураОписанийТипов) Экспорт
	
	Для Каждого СтрокаСАналитикой Из ТаблицаСПолнойАналитикой Цикл
		Если СтрокаСАналитикой.Партия <> Неопределено Тогда
			// Это позитивный вариант, партия есть, нужно определить, какого типа документ Партии
			// Чтобы решить, нужно по нему искать НДС, или будет только количественный учет
			СтрокаСАналитикой.НайденаПартия = Истина;
			СтрокаСАналитикой.ОсталосьКРаспределению = 0;
			НоваяСтрокаСПартией = ТаблицаСЗаполненнымиПартиями.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСПартией, СтрокаСАналитикой); 
			ОпределитьДопПараметрыПоСтроке(НоваяСтрокаСПартией, СтруктураОписанийТипов, Истина, СтрокаСАналитикой.Счет);
		Иначе
			// Если изначально документа партии не было, то необходимо
			// Во-первых найти его
			// Во-вторых, определить, конечный это документ партии, или требуются еще действия
			// Нужно ли к этому документу партии искать сумму НДС, или будет только количественный учет
			
			ПараметрыОтбораПартии = Новый Структура;
			ПараметрыОтбораПартии.Вставить("Номенклатура", СтрокаСАналитикой.Номенклатура);
			ПараметрыОтбораПартии.Вставить("Счет", 	 СтрокаСАналитикой.Счет); 
			ПоискПартии = ТаблицаСДокументамиДвижений.НайтиСтроки(ПараметрыОтбораПартии);
			КоличествоКРаспределению = СтрокаСАналитикой.Количество;
			Для Каждого СтрокаПартии Из ПоискПартии Цикл
				Если СтрокаПартии.Количество = 0 Тогда 
					Продолжить;
				Иначе
					Если НЕ КоличествоКРаспределению = 0 Тогда
						НоваяСтрокаСПартией = ТаблицаСЗаполненнымиПартиями.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаСПартией, СтрокаСАналитикой);
						НоваяСтрокаСПартией.Партия = СтрокаПартии.Партия;
						НоваяСтрокаСПартией.НетПартииНаОстатках = Истина;
						Если КоличествоКРаспределению <= СтрокаПартии.Количество Тогда
							НоваяСтрокаСПартией.Количество = КоличествоКРаспределению;
							СтрокаПартии.Количество = СтрокаПартии.Количество - КоличествоКРаспределению;
							КоличествоКРаспределению = 0;
						Иначе 
							НоваяСтрокаСПартией.Количество = СтрокаПартии.Количество;
							КоличествоКРаспределению = КоличествоКРаспределению - СтрокаПартии.Количество;
							СтрокаПартии.Количество = 0;
						КонецЕсли;
						ОпределитьДопПараметрыПоСтроке(НоваяСтрокаСПартией, СтруктураОписанийТипов, 
							Истина, СтрокаПартии.Счет, СтрокаПартии.КорСчет);
					Иначе
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если КоличествоКРаспределению = 0 Тогда
				СтрокаСАналитикой.НайденаПартия			 = Истина; 
				СтрокаСАналитикой.ОсталосьКРаспределению = 0;
			Иначе
				СтрокаСАналитикой.НайденаПартия 		 = Ложь; 
				СтрокаСАналитикой.ОсталосьКРаспределению = КоличествоКРаспределению;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

// Распределяет остатки на товарных счетах по партиям
//
// Параметры:
//  ПараметрыРаспределения - Структура - Таблицы, необходимые для распределения по паритям на основании 
//  документов Требование накладная и Передача оборудования в монтаж
//  ТаблицаКомплектующих - Таблица значений - Таблица для заполнения данных по найденным паритям
//  ТаблицаИспользованныхПартий - Таблица значений - Списанные партии
//  СтруктураОписанийТипов - Структура - Структура с описаниями типов,
//  влияющих на действия над строкой остатков в зависимости от типа партии
//
Процедура РаспределитьПоПартиямПоКомплектующим(ПараметрыРаспределения, ТаблицаКомплектующих,
												ТаблицаИспользованныхПартий, СтруктураОписанийТипов) Экспорт
	
	ПланСчетов = ПланыСчетов.Хозрасчетный;
	
	СтруктураДляДопПоиска = Новый Структура;
	СтруктураДляДопПоиска.Вставить("НуженДопПоиск", Истина);
	СтруктураДляДопПоиска.Вставить("ЭтоКомплектация", Истина);
	СтрокиДопРаспределения = ПараметрыРаспределения.ТаблицаОстатковПоПартиям.НайтиСтроки(СтруктураДляДопПоиска);
	
	Для Каждого Строка Из СтрокиДопРаспределения Цикл
		СтруктураПоискаКомплектующих = Новый Структура;
		СтруктураПоискаКомплектующих.Вставить("ДокументИсточник", Строка.Партия);
		ДатаПередачи = Строка.Партия.Дата;
		Комплектующие = ПараметрыРаспределения.ТаблицаСборкаОборудования.НайтиСтроки(СтруктураПоискаКомплектующих);
		Для Каждого СтрКомплектующая Из Комплектующие Цикл 			
			Если БухгалтерскийУчетПовтИсп.СчетВИерархии(СтрКомплектующая.СчетКомплектующие, ПланСчетов.Материалы) Тогда
				СтруктураОтбораДвижений = Новый Структура;
				СтруктураОтбораДвижений.Вставить("Счет", СтрКомплектующая.СчетКомплектующие);
				СтруктураОтбораДвижений.Вставить("Номенклатура", СтрКомплектующая.Номенклатура);
				ПоискПартийДляКомплектующих = ПараметрыРаспределения.ТаблицаДвижений10.НайтиСтроки(СтруктураОтбораДвижений);
				КоличествоКРаспределению = СтрКомплектующая.Количество;
				Для Каждого СтрокаДвижений Из ПоискПартийДляКомплектующих Цикл
					Если СтрокаДвижений.Количество <= 0 Тогда
						Продолжить;
					КонецЕсли;
					Если СтрокаДвижений.Период > ДатаПередачи Тогда
						Продолжить;
					КонецЕсли;
					СтрокаИсключений = ТаблицаИспользованныхПартий.Добавить();
					СтрокаИсключений.Номенклатура = СтрКомплектующая.Номенклатура;
					СтрокаИсключений.Счет		 = СтрКомплектующая.СчетКомплектующие;
					СтрокаИсключений.Партия		 = СтрокаДвижений.Регистратор;
					Если КоличествоКРаспределению <= СтрокаДвижений.Количество Тогда
						СтрокаИсключений.Количество	= КоличествоКРаспределению;
						СтрокаДвижений.Количество	= СтрокаДвижений.Количество - КоличествоКРаспределению;
						КоличествоКРаспределению	= 0;
					Иначе
						СтрокаИсключений.Количество = СтрокаДвижений.Количество;
						КоличествоКРаспределению	= КоличествоКРаспределению - СтрокаДвижений.Количество;
						СтрокаДвижений.Количество	= 0;
					КонецЕсли;
					Если СтруктураОписанийТипов.ОписаниеТиповПоиска10СчетаДля0708.СодержитТип(ТипЗнч(СтрокаДвижений.Регистратор)) Тогда
						СтрокаПартии = ТаблицаКомплектующих.Добавить(); 
						ЗаполнитьЗначенияСвойств(СтрокаПартии, СтрКомплектующая);
						СтрокаПартии.Это10Счет			= Истина;
						СтрокаПартии.Партия				= СтрокаДвижений.Регистратор;
						СтрокаПартии.ИскатьСуммуНДС		= Истина;
						СтрокаПартии.ИскатьДопРасходы	= Истина;
						СтрокаПартии.Количество			= СтрокаИсключений.Количество;
						СтрокаПартии.ИД					= Строка.ИД;
					КонецЕсли;
					Если КоличествоКРаспределению = 0 Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
			Иначе
				СтруктураОтбораДвижений = Новый Структура;
				СтруктураОтбораДвижений.Вставить("Счет", СтрКомплектующая.СчетКомплектующие);
				СтруктураОтбораДвижений.Вставить("Номенклатура", СтрКомплектующая.Номенклатура);
				ПоискПартийДляКомплектующих = ПараметрыРаспределения.ТаблицаДвижений0807.НайтиСтроки(СтруктураОтбораДвижений);
				КоличествоКРаспределению = СтрКомплектующая.Количество;
				Для Каждого СтрокаДвижений Из ПоискПартийДляКомплектующих Цикл
					Если СтрокаДвижений.Количество <= 0 И СтрокаДвижений.Сумма <= 0 Тогда
						Продолжить;
					КонецЕсли;
					Если СтрокаДвижений.Период > ДатаПередачи Тогда
						Продолжить;
					КонецЕсли;
					
					Если СтрокаДвижений.Количество > 0 И КоличествоКРаспределению > 0 Тогда
						СтрокаПартии = ТаблицаКомплектующих.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаПартии, СтрКомплектующая);
						СтрокаПартии.Партия = СтрокаДвижений.Регистратор;
						
						Если КоличествоКРаспределению <= СтрокаДвижений.Количество Тогда
							СтрокаПартии.Количество		= КоличествоКРаспределению;
							СтрокаДвижений.Количество	= СтрокаДвижений.Количество - КоличествоКРаспределению;
							КоличествоКРаспределению	= 0;
						Иначе
							СтрокаПартии.Количество		= СтрокаДвижений.Количество;
							КоличествоКРаспределению	= КоличествоКРаспределению - СтрокаДвижений.Количество;
							СтрокаДвиженийКоличество	= 0;
						КонецЕсли;
					КонецЕсли;
					Если СтруктураОписанийТипов.ОписаниеТиповДляПартийПоВложениям.СодержитТип(ТипЗнч(СтрокаПартии.Партия)) Тогда
						СтрокаПартии.ИскатьСуммуНДС		= Истина;
						СтрокаПартии.ИскатьДопРасходы	= Истина;
					Иначе
						СтрокаПартии.ИскатьСуммуНДС		= Ложь;
						СтрокаПартии.ИскатьДопРасходы	= Ложь;
					КонецЕсли;
					СтрокаПартии.ИД					= Строка.ИД;
					Если КоличествоКРаспределению	= 0 Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Типы документов, влияющие на действия над строкой остатков в зависимости от типа партии
//
// Возвращаемое значение:
//  СтруктураОписанийТипов - Структура
//
Функция ПолучитьСтруктуруОписанийТипов() Экспорт
	
	СтруктураОписанийТипов = Новый Структура;
	СтруктураОписанийТипов.Вставить("ОписаниеТиповДляПоискаСуммНДС",		ТипыДляПоискаСуммыНДС());
	СтруктураОписанийТипов.Вставить("ОписаниеТиповДляИнициацииДопПоиска",	ТипыДляИнициацииДопПоиска());
	СтруктураОписанийТипов.Вставить("ОписаниеТиповТолькоКоличество",		ТипыТолькоКоличество());
	СтруктураОписанийТипов.Вставить("ОписаниеТиповПартия",					ТипыПартийДляДополнительногоПоиска());
	СтруктураОписанийТипов.Вставить("ОписаниеТиповДляПартийПоВложениям",	ТипыДляПартийПоВложениям());
	СтруктураОписанийТипов.Вставить("ОписаниеТиповДляДопПоискаПоВложениям",	ТипыДляДопПоискаПоВложениям());
	СтруктураОписанийТипов.Вставить("ОписаниеТиповПоиска10СчетаДля0708",	ТипыПоиска10СчетаДля0708());
	
	Возврат СтруктураОписанийТипов;
	
КонецФункции

// Типы документов, по которым можно заявить к вычету НДС
//
// Возвращаемое значение:
//  ОписаниеТиповДляСуммНДС - Описание типов
//
Функция ТипыДляВозмещенияНДС() Экспорт
	
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
	МассивТипов.Добавить(Тип("ДокументСсылка.КорректировкаПоступления"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПоступлениеДопРасходов"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПоступлениеНМА"));
	
	ОписаниеТиповДляСуммНДС = Новый ОписаниеТипов(МассивТипов);
	
	Возврат ОписаниеТиповДляСуммНДС;
	
КонецФункции

// Осуществляет доп поиск пертий, например:
// Когда идет перемещение со счета на счет или поступление на 45 счет через РТУ
//
// Параметры:
//  ПараметрыОтбора - - Структура содержащая следующие поля:
//  - Номенклатура
//  - ДокументПоступления
//  ТаблицаСДокументамиДвижений - Таблица значений - Документы поступлений для распределения по ФИФО
//  ТаблицаСПартиями - Таблица значений - Таблица для заполнения данных по найденным паритям
//  КоличествоКРаспределению - Число - Количество остатков требующее дополнительного распределения по партиям
//  Стр - Строка таблицы значений - Строка из ТаблицаСПартиями, требующая дополнительного распределения по партиям
//  ПараметрыДляДопРаспределенияПоПартиям - Структура
//  ТаблицаИспользованныхПартий - Таблица значений - Списанные партии
//
Процедура РаспределитьПоПартиямДополнительно(ПараметрыОтбора, ТаблицаСДокументамиДвижений, ТаблицаСПартиями, 
												КоличествоКРаспределению, Стр, ПараметрыДляДопРаспределенияПоПартиям,
												ТаблицаИспользованныхПартий = Неопределено) Экспорт
											
		СтруктураОписанийТипов = ПараметрыДляДопРаспределенияПоПартиям.СтруктураОписанийТипов;
		ОписаниеТиповПартия = СтруктураОписанийТипов.ОписаниеТиповПартия;
		ОписаниеТиповДляПоискаСуммНДС = СтруктураОписанийТипов.ОписаниеТиповДляПоискаСуммНДС;
		ПоискПартии = ТаблицаСДокументамиДвижений.НайтиСтроки(ПараметрыОтбора);
		Для Каждого СтрокаПоискаПартии Из ПоискПартии Цикл
			Если НЕ КоличествоКРаспределению = 0 Тогда 
				Если СтрокаПоискаПартии.Количество = 0 Тогда
					Продолжить;
				Иначе
					Если ОписаниеТиповПартия.СодержитТип(ТипЗнч(СтрокаПоискаПартии.Партия)) Тогда 
						НоваяСтрокаПартии = ТаблицаСПартиями.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаПартии,Стр);
						НоваяСтрокаПартии.Партия = СтрокаПоискаПартии.Партия;
						НоваяСтрокаПартии.НетПартииНаОстатках = Истина;
						Если ПараметрыДляДопРаспределенияПоПартиям.ЭтоКомплектация Тогда
							НоваяСтрокаПартии.ИД = ПараметрыДляДопРаспределенияПоПартиям.ИД;
							НоваяСтрокаПартии.Номенклатура = Стр.Комплектующие;
						КонецЕсли;
						Если КоличествоКРаспределению < СтрокаПоискаПартии.Количество Тогда
							НоваяСтрокаПартии.Количество = КоличествоКРаспределению;
							СтрокаПоискаПартии.Количество = СтрокаПоискаПартии.Количество-КоличествоКРаспределению;
							КоличествоКРаспределению = 0;
						Иначе
							НоваяСтрокаПартии.Количество = СтрокаПоискаПартии.Количество;
							КоличествоКРаспределению = КоличествоКРаспределению-СтрокаПоискаПартии.Количество;
							СтрокаПоискаПартии.Количество = 0;
						КонецЕсли;
						Если НЕ ПараметрыДляДопРаспределенияПоПартиям.ЭтоКомплектация Тогда
							НоваяСтрокаПартии.НуженДопПоиск = Ложь; 
						КонецЕсли;
						Если ОписаниеТиповДляПоискаСуммНДС.СодержитТип(ТипЗнч(НоваяСтрокаПартии.Партия)) Тогда
							НоваяСтрокаПартии.ИскатьСуммуНДС	 = Истина;
							НоваяСтрокаПартии.ИскатьДопРасходы 	 = Истина;
						ИначеЕсли  ТипЗнч(НоваяСтрокаПартии.Партия) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда
							НоваяСтрокаПартии.ИскатьСуммуНДС	 = Ложь;
							НоваяСтрокаПартии.ИскатьДопРасходы 	 = Истина; 
						Иначе
							НоваяСтрокаПартии.ИскатьСуммуНДС 	= Ложь;
							НоваяСтрокаПартии.ИскатьДопРасходы  = Ложь; 
						КонецЕсли;
						Если ТаблицаИспользованныхПартий <> Неопределено Тогда
							СтрокаИспПартий = ТаблицаИспользованныхПартий.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаИспПартий, НоваяСтрокаПартии);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе 
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если КоличествоКРаспределению > 0 Тогда
			НоваяСтрокаПартии = ТаблицаСПартиями.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПартии,Стр);
			НоваяСтрокаПартии.Количество = КоличествоКРаспределению;
			Если НЕ ПараметрыДляДопРаспределенияПоПартиям.ЭтоКомплектация Тогда
				НоваяСтрокаПартии.НуженДопПоиск = Ложь; 
			Иначе
				НоваяСтрокаПартии.ИД 	= ПараметрыДляДопРаспределенияПоПартиям.ИД;
			КонецЕсли;
			НоваяСтрокаПартии.ИскатьСуммуНДС = Ложь;
			НоваяСтрокаПартии.Партия = Неопределено;
			НоваяСтрокаПартии.НетПартииНаОстатках = Истина;
			Если ТаблицаИспользованныхПартий <> Неопределено Тогда
							СтрокаИспПартий = ТаблицаИспользованныхПартий.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаИспПартий, НоваяСтрокаПартии);
			КонецЕсли;
		КонецЕсли;
		
КонецПроцедуры

//Заполняет поля строки переданными параметрами
Процедура ЗаполнитьДопПараметрыСтрокиПартии(Строка, ЭтоТовары, НуженДопПоиск, ИскатьСуммуНДС, 
											ИскатьДопРасходы, ЭтоКомплектация = Ложь) Экспорт
	Строка.НуженДопПоиск = НуженДопПоиск;
	Строка.ИскатьСуммуНДС = ИскатьСуммуНДС;
	Строка.ИскатьДопРасходы = ИскатьДопРасходы;
	Если ЭтоТовары Тогда
		Строка.ЭтоКомплектация = ЭтоКомплектация;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОпределитьДопПараметрыПоСтроке(НоваяСтрока, СтруктураОписанийТипов, ЭтоТовары, Счет, КорСчет = Неопределено) 
	
	Если СтруктураОписанийТипов.ОписаниеТиповДляПоискаСуммНДС.СодержитТип(ТипЗнч(НоваяСтрока.Партия)) Тогда
		ЗаполнитьДопПараметрыСтрокиПартии(НоваяСтрока, ЭтоТовары, Ложь, Истина, Истина, Ложь);
	ИначеЕсли СтруктураОписанийТипов.ОписаниеТиповТолькоКоличество.СодержитТип(ТипЗнч(НоваяСтрока.Партия)) Тогда
		ЗаполнитьДопПараметрыСтрокиПартии(НоваяСтрока, ЭтоТовары, Ложь, Ложь, Ложь, Ложь);
	ИначеЕсли ТипЗнч(НоваяСтрока.Партия) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда
		ЗаполнитьДопПараметрыСтрокиПартии(НоваяСтрока, ЭтоТовары, Ложь, Ложь, Истина, Ложь);
	ИначеЕсли ТипЗнч(НоваяСтрока.Партия) = Тип("ДокументСсылка.КомплектацияНоменклатуры") Тогда
		Если НоваяСтрока.Партия.ВидОперации = Перечисления.ВидыОперацийКомплектацияНоменклатуры.Разукомплектация Тогда
			НоваяСтрока.СчетПоступления	 = Счет;
			ЗаполнитьДопПараметрыСтрокиПартии(НоваяСтрока, ЭтоТовары, Ложь, Ложь, Ложь, Истина);
		Иначе
			ЗаполнитьДопПараметрыСтрокиПартии(НоваяСтрока, ЭтоТовары, Ложь, Ложь, Ложь, Истина);
		КонецЕсли;
		НоваяСтрока.ИД = Новый УникальныйИдентификатор;
	ИначеЕсли СтруктураОписанийТипов.ОписаниеТиповДляИнициацииДопПоиска.СодержитТип(ТипЗнч(НоваяСтрока.Партия)) Тогда
		ЗаполнитьДопПараметрыСтрокиПартии(НоваяСтрока, ЭтоТовары, Истина, Ложь, Ложь, Ложь);
		НоваяСтрока.СчетПоступления	 = КорСчет;
	ИначеЕсли ТипЗнч(НоваяСтрока.Партия) = Тип("ДокументСсылка.ПоступлениеИзПереработки") Тогда
		ЗаполнитьДопПараметрыСтрокиПартии(НоваяСтрока, ЭтоТовары, Истина, Ложь, Ложь, Ложь);
		НоваяСтрока.СчетПоступления	 = Счет;
	ИначеЕсли СтруктураОписанийТипов.ОписаниеТиповДляПартийПоВложениям.СодержитТип(ТипЗнч(НоваяСтрока.Партия)) Тогда
		ЗаполнитьДопПараметрыСтрокиПартии(НоваяСтрока, ЭтоТовары, Ложь, Истина, Истина);
	ИначеЕсли СтруктураОписанийТипов.ОписаниеТиповДляДопПоискаПоВложениям.СодержитТип(ТипЗнч(НоваяСтрока.Партия)) Тогда
		ЗаполнитьДопПараметрыСтрокиПартии(НоваяСтрока, Истина, Истина, Ложь, Ложь, Истина);
		НоваяСтрока.ИД = Новый УникальныйИдентификатор;
	Иначе
		ЗаполнитьДопПараметрыСтрокиПартии(НоваяСтрока, ЭтоТовары, Ложь, Ложь, Ложь, Ложь);
	КонецЕсли;
	
КонецПроцедуры

Функция ТипыДляПоискаСуммыНДС()
	
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ВозвратТоваровОтПокупателя"));
	МассивТипов.Добавить(Тип("ДокументСсылка.КорректировкаПоступления"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
	
	ОписаниеТиповДляСуммНДС = Новый ОписаниеТипов(МассивТипов);
	
	Возврат ОписаниеТиповДляСуммНДС;
	
КонецФункции

Функция ТипыДляИнициацииДопПоиска()
	
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("ДокументСсылка.ПеремещениеТоваров"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПередачаТоваров"));
	МассивТипов.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг")); 
	
	ОписаниеТиповИнициацииПоиска = Новый ОписаниеТипов(МассивТипов);
	
	Возврат ОписаниеТиповИнициацииПоиска;
	
КонецФункции

Функция ТипыТолькоКоличество()
	
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("ДокументСсылка.ОперацияБух"));
	МассивТипов.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));
	Если Метаданные.Документы.Найти("АвизоМПЗВходящее") <> Неопределено Тогда 
		ИмяДокумента = ("АвизоМПЗВходящее"); 		
		МассивТипов.Добавить(Тип("ДокументСсылка." + ИмяДокумента)); 
	КонецЕсли;
	МассивТипов.Добавить(Тип("ДокументСсылка.ВводНачальныхОстатков"));
	МассивТипов.Добавить(Тип("ДокументСсылка.Партия"));
	
	ОписаниеТиповТолькоКоличество = Новый ОписаниеТипов(МассивТипов);
	
	Возврат ОписаниеТиповТолькоКоличество;
	
КонецФункции

Функция ТипыПартийДляДополнительногоПоиска()
	
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОприходованиеТоваров"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОперацияБух"));
	МассивТипов.Добавить(Тип("ДокументСсылка.КорректировкаПоступления"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ВозвратТоваровОтПокупателя"));
	Если Метаданные.Документы.Найти("АвизоМПЗВходящее") <> Неопределено Тогда 
		ИмяДокумента = ("АвизоМПЗВходящее"); 		
		МассивТипов.Добавить(Тип("ДокументСсылка." + ИмяДокумента));
	КонецЕсли;
	МассивТипов.Добавить(Тип("ДокументСсылка.ВводНачальныхОстатков"));
	
	ОписаниеТиповПартия = Новый ОписаниеТипов(МассивТипов);
	
	Возврат ОписаниеТиповПартия;
	
КонецФункции

Функция ТипыДляПартийПоВложениям()
	
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ГТДИмпорт"));
	МассивТипов.Добавить(Тип("ДокументСсылка.КорректировкаПоступления"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПоступлениеВАренду"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПоступлениеДопРасходов")); 	
	МассивТипов.Добавить(Тип("ДокументСсылка.ПоступлениеНМА"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
	
	ОписаниеТиповДляПартийПоВложениям = Новый ОписаниеТипов(МассивТипов);
	
	Возврат ОписаниеТиповДляПартийПоВложениям;
	
КонецФункции

Функция ТипыДляДопПоискаПоВложениям()
	
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("ДокументСсылка.ПередачаОборудованияВМонтаж"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ТребованиеНакладная"));
	
	ОписаниеТиповДляДопПоискаПоВложениям = Новый ОписаниеТипов(МассивТипов);
	
	Возврат ОписаниеТиповДляДопПоискаПоВложениям;
	
КонецФункции

Функция ТипыПоиска10СчетаДля0708()
	
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОприходованиеТоваров"));
	МассивТипов.Добавить(Тип("ДокументСсылка.КорректировкаПоступления"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ВозвратТоваровОтПокупателя"));
	
	ОписаниеТиповПоиска10СчетаДля0708 = Новый ОписаниеТипов(МассивТипов);
	
	Возврат ОписаниеТиповПоиска10СчетаДля0708;
	
КонецФункции

#КонецОбласти