#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимОткрытияОкнаФормыНезависимый = ЭтотОбъект.РежимОткрытияОкна = РежимОткрытияОкнаФормы.Независимый;
	КоманднаяПанель.Видимость = Не РежимОткрытияОкнаФормыНезависимый;
	Элементы.ДокументыЭДО.Видимость = РежимОткрытияОкнаФормыНезависимый;
	
	ЗаписьНастройкиЭДОБЗК = РегистрыСведений.НастройкиЭДОБЗК.СоздатьМенеджерЗаписи();
	ЗаписьНастройкиЭДОБЗК.Прочитать();
	ЗначениеВРеквизитФормы(ЗаписьНастройкиЭДОБЗК, "НастройкиЭДОБЗК");
	
	ПрочитатьНастройкиИнтеграцииСРаботаРоссии();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"БизнесПроцессыГруппа",
		"Видимость",
		ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.БизнесПроцессыИЗадачи"));
	
	ОбновитьОтображение(ЭтотОбъект);
	
	ЭДОБЗКПереопределяемый.ПанельНастроекЭДОБЗКФормаПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы Тогда
		Если Модифицированность Тогда
			Отказ = Истина;
			ТекстВопроса = НСтр("ru = 'При закрытии формы настроек, изменения будут потеряны.
				|Сохранить изменения перед закрытием?'");
			Оповещение = Новый ОписаниеОповещения("ОбработкаОтветаОПотереИзмененийПриЗакрытии", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаОПотереИзмененийПриЗакрытии(Результат, Дополнительныепараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Закрыть(СохранитьНастройки());
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ИспользоватьБизнесПроцессыИЗадачи"
		Или Источник = "ОбсужденияПодключены"
		Или Источник = "ИспользоватьЭлектронныеПодписи"
		Или Источник = "ИспользоватьШифрование" Тогда
		ОбновитьОтображение(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьИнтеграциюСРаботаРоссииПриИзменении(Элемент)
	
	ТребуетсяОбновлениеИнтерфейса = Истина;
	
	Если РежимОткрытияОкнаФормыНезависимый Тогда
		Модифицированность = Ложь;
		СохранитьНастройки();
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормыИнтеграцииСРаботаРоссии(ЭтотОбъект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЭДОБЗКРегистрироватьЗаданияПриИзменении(Элемент)
	
	Если РежимОткрытияОкнаФормыНезависимый Тогда
		Модифицированность = Ложь;
		СохранитьНастройки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЭДОБЗКИспользоватьСистемуВзаимодействияПриИзменении(Элемент)
	
	Если РежимОткрытияОкнаФормыНезависимый Тогда
		Модифицированность = Ложь;
		СохранитьНастройки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПояснениеВключитьЭлектроннуюПодписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Обработка.ПанельАдминистрированияБСП.Форма.ОбщиеНастройки", , ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПояснениеНастройкиЭДОБЗКРегистрироватьЗаданияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Обработка.ПанельАдминистрированияБСП.Форма.Органайзер", , ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПояснениеНастройкиЭДОБЗКИспользоватьСистемуВзаимодействияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Обработка.ПанельАдминистрированияБИП.Форма.ИнтернетПоддержкаИСервисы", , ЭтотОбъект, Истина);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьИЗакрыть(Команда)
	
	Если Модифицированность Тогда
		Закрыть(СохранитьНастройки());
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПечатныхФормДекорацияНажатие(Элемент)
	
	ОткрытьФорму("РегистрСведений.НастройкиПечатныхФормБЗК.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыДокументовНажатие(Элемент)
	
	ОткрытьФорму("Справочник.ВидыДокументовЭДОБЗК.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СохранитьНастройкиНаСервере()
	
	Константы.ИспользоватьИнтеграциюСРаботаРоссии.Установить(ИспользоватьИнтеграциюСРаботаРоссии);
	Запись = РеквизитФормыВЗначение("НастройкиЭДОБЗК");
	Запись.Записать();
	
	Модифицированность = Ложь;
	
	Возврат ЭДОБЗК.НастройкиЭДОБЗК();
	
КонецФункции

&НаКлиенте
Функция СохранитьНастройки()
	
	Настройки = СохранитьНастройкиНаСервере();
	
	Если ЭтаФорма.ТребуетсяОбновлениеИнтерфейса Тогда
		ОбновитьИнтерфейс();
		ТребуетсяОбновлениеИнтерфейса = Ложь;
	КонецЕсли;
	
	Возврат Настройки;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьОтображение(УправляемаяФорма)
	
	Настройки = НастройкиИБ();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		УправляемаяФорма.Элементы,
		"ГруппаКабинетСотрудникаИспользуется",
		"Видимость",
		Настройки.ИспользуетсяЭДОБЗККабинетСотрудника);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		УправляемаяФорма.Элементы,
		"ГруппаКабинетСотрудникаНеИспользуется",
		"Видимость",
		Не Настройки.ИспользуетсяЭДОБЗККабинетСотрудника);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		УправляемаяФорма.Элементы,
		"НастройкиЭДОБЗКРегистрироватьЗадания",
		"ТолькоПросмотр",
		Не Настройки.ИспользуютсяБизнесПроцессыИЗадачи);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		УправляемаяФорма.Элементы,
		"НастройкиЭДОБЗКИспользоватьСистемуВзаимодействия",
		"ТолькоПросмотр",
		Не Настройки.СистемаВзаимодействийПодключена);
		
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		УправляемаяФорма.Элементы,
		"ПечатныеФормы",
		"Видимость",
		УправляемаяФорма.РежимОткрытияОкнаФормыНезависимый);
	
	УстановитьДоступностьЭлементовФормыИнтеграцииСРаботаРоссии(УправляемаяФорма, Настройки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкиИБ()
	Настройки = Новый Структура;
	НастройкиИнтеграции = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.НастройкиИнтеграции();
	Настройки.Вставить("ИспользуетсяЭДОБЗККабинетСотрудника", НастройкиИнтеграции.ИспользуетсяЭДОБЗК);
	Настройки.Вставить("ИспользуютсяБизнесПроцессыИЗадачи", Константы.ИспользоватьБизнесПроцессыИЗадачи.Получить());
	Настройки.Вставить("СистемаВзаимодействийПодключена", Обсуждения.СистемаВзаимодействийПодключена());
	Настройки.Вставить("ИспользуетсяЭлектроннаяПодпись", ЭлектроннаяПодпись.ИспользоватьЭлектронныеПодписи());
	Возврат Настройки;
КонецФункции

&НаСервере
Процедура ПрочитатьНастройкиИнтеграцииСРаботаРоссии()
	
	ИспользоватьИнтеграциюСРаботаРоссии = Константы.ИспользоватьИнтеграциюСРаботаРоссии.Получить();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементовФормыИнтеграцииСРаботаРоссии(Форма, Настройки)
	
	УсловияВыполнены = ?(Настройки = Неопределено, Истина, Настройки.ИспользуетсяЭлектроннаяПодпись);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ИспользоватьИнтеграциюСРаботаРоссии",
		"ТолькоПросмотр",
		Не УсловияВыполнены);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"РегистрационныеДанныеРаботаРоссии",
		"Видимость",
		УсловияВыполнены);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"РегистрационныеДанныеРаботаРоссии",
		"Доступность",
		Форма.ИспользоватьИнтеграциюСРаботаРоссии);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура РегистрационныеДанныеРаботаРоссии(Команда)
	
	Если Модифицированность Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
	    Ответ = Ждать ВопросАсинх(НСтр("ru = 'Настройки будут сохранены'"), Режим, 0);
	    Если Ответ = КодВозвратаДиалога.Нет Тогда
	        Возврат;
		КонецЕсли;
		СохранитьНастройки();
		
	КонецЕсли;
	
	ИнтеграцияСРаботаРоссииКлиент.ОткрытьНастройкиОрганизации();
	
КонецПроцедуры

#КонецОбласти
