#Область ПрограммныйИнтерфейс 

// Определяет параметры работы сервиса.
//
// Параметры:
//  Параметры - Структура:
//    * Использовать - Булево - Определяет используется ли сервис в прикладной конфигурации
//    * АдресСервиса - Строка - адрес сервиса по умолчанию
//
Процедура ПриОпределенииПараметров(Параметры) Экспорт
	
	Параметры.Использовать = Не ОбщегоНазначенияБП.ЭтоИнтерфейсИнтеграцииСБанком()
		И Не ОбщегоНазначенияБП.ЭтоЭТК();
	
КонецПроцедуры

// Дополнительная обработка после получении статусов самозанятости
// 
// Параметры:
//  СтатусыСамозанятости - Массив из Структура:
//    * ИНН - Строка - ИНН физического лица
//    * НаДату - Дата - дата, на которую выполнялась проверка
//    * ПлательщикНПД - Булево - Истина, если физ.лицо применяет НПД
//    * ДатаРегистрации - Дата, Неопределено - дата изменения статуса
//
Процедура ПриПолученииСтатусовСамозанятости(СтатусыСамозанятости) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	РегистрыСведений.СтатусыСамозанятых.ЗаписатьСтатусыСамозанятости(СтатусыСамозанятости);
	
КонецПроцедуры

#КонецОбласти
