
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = НСтр("ru = 'Реестр платежей'");  
	ДанныеПечати = Параметры.ТабличныйДокумент;   
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоЭлектроннойПочте(Команда) 	
		
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Результат", ДанныеПечати);
	ПараметрыОтчета.Вставить("Заголовок", НСтр("ru = 'Реестр платежей'"));
	
	ОтправкаПочтовыхСообщенийКлиент.ОтправитьОтчет(ПараметрыОтчета);  
	
КонецПроцедуры  

