#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ВключитьПриОбновлении");
	
КонецПроцедуры

// Описывает зависимости между агрегирующей (этой) и агрегируемой константами - эта константа включается,
// когда включены все, перечисленные в процедуре.
// Подробнее см. Обработки.ФункциональностьПрограммы.НастроитьАгрегирующуюКонстанту
//
// Параметры:
//  Функциональность - Массив из Строка - заполняемая коллекция, имена констант
//
Процедура ЗаполнитьАгрегируемаяФункциональность(Функциональность) Экспорт
	
	Функциональность.Добавить(Метаданные.Константы.РасширенныйФункционал.Имя);
	Функциональность.Добавить(Метаданные.Константы.ВедетсяУчетНМА.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновления

Процедура ВключитьПриОбновлении() Экспорт
	Обработки.ФункциональностьПрограммы.НастроитьАгрегирующуюКонстанту(Метаданные.Константы.РасширенныйФункционалНематериальныеАктивы.Имя);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
