
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
#Область ДляВызоваИзДругихПодсистем
	
// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры
	
// Конец СтандартныеПодсистемы.УправлениеДоступом
	
#КонецОбласти
	
#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции
	
Процедура ЗаписатьВРегистрПоказателиФинУслуги(Значение, ДатаАктуальности, Организация, ИмяПоказателя) Экспорт
	
	Набор = РегистрыСведений.КэшПоказателейФинУслуги.СоздатьМенеджерЗаписи();
	Набор.ДатаАктуальности = ДатаАктуальности;
	Набор.Организация = Организация;
	Набор.ИмяПоказателя = ИмяПоказателя;
	Набор.Значение = Значение;
	УстановитьПривилегированныйРежим(Истина);
	Набор.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
	
#КонецОбласти

#КонецЕсли