
#Область ПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("СформироватьОстатки", Истина);
	
КонецПроцедуры

// Формирование остатков по раздельном учету
Процедура СформироватьОстатки(Параметры, АдресХранилища) Экспорт
	
	Для Каждого Организация Из Параметры.Организации Цикл
		
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация,,, НСтр("ru = 'Подготовка параметров для формирования остатков'"));
		
		
		СтруктураПараметров = ПодготовитьПараметрыДляВводаОстатков(Организация, Параметры.Период);
		ДлительныеОперации.СообщитьПрогресс(, Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Выполняется формирование документов (1%) по организации ""%1"" ...'"), Организация));
		
		ТаблицаИспользованныхПартий =  ЗаполнитьПоСчетам0708(СтруктураПараметров);
		
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация,,,  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Сформированы остатки по счетам 07; 08 по организации ""%1'"""), Организация));
		
		ДлительныеОперации.СообщитьПрогресс(, Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Выполняется формирование документов (15%) по организации ""%1"" ...'"), Организация));
		
		ЗаполнитьПоТоварнымСчетам(СтруктураПараметров, ТаблицаИспользованныхПартий);
		
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация,,,  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Сформированы остатки по счетам 10; 41; 45 по организации ""%1""'"), Организация));
		
		ДлительныеОперации.СообщитьПрогресс(, Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Выполняется формирование документов (85%) по организации ""%1"" ...'"), Организация));
		
		ПлательщикНДСНаУСНБезВычетов = УчетнаяПолитика.ПлательщикНДСПрименяющийУСН(Организация, Параметры.Период)
			И НЕ УчетнаяПолитика.ПлательщикНДСНаУСНСВычетами(Организация, Параметры.Период);
			
		Если НЕ ПлательщикНДСНаУСНБезВычетов Тогда
			Обработки.ПомощникРасчетаНДС.СформироватьДвиженияПоСчету19(СтруктураПараметров);
			
			ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Информация,,,  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Заполнено пустое субконто по счету 19 по организации ""%1""'"), Организация));
				
			ДлительныеОперации.СообщитьПрогресс(, Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Выполняется формирование документов (95%) по организации ""%1"" ...'"), Организация));
			
		КонецЕсли;
			
		Для каждого ДокументОперации Из СтруктураПараметров.ДокументыОперации Цикл
			
			РегистрыСведений.ВыполнениеРегламентныхОперацийНДС.ЗафиксироватьФактВыполненияРегламентнойОперации(Параметры.Период,
			Организация,
			ДокументОперации,
			Перечисления.РегламентныеОперации.ФормированиеНачальныхОстатковДляВеденияРаздельногоУчетаНДС,
			Истина);
			
		КонецЦикла;
	КонецЦикла;
		
	РезультатВыполнения = Новый Структура();
	РезультатВыполнения.Вставить("ОстаткиВведены", Истина);
	
	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
	
КонецПроцедуры

//Осуществляется проверка, что в наличии есть остатки на счетах БУ для формаривания остатков по РУ.
// Входящие параметры:
// 		- Организация - СправочникСсылка.Организации
// 		- Период - Дата
// Возвращаемое значение:
// 		- Истина - есть остатки на счетах 07,08,10,41,45
// 		- Ложь - остатков нет
Функция ЕстьОстаткиДляФормированияПоРУ(Организация, Период) Экспорт
	
	Запрос = Новый Запрос();
	
	ПланСчетов = ПланыСчетов.Хозрасчетный;
	
	ПредопределенныеСчетаУчетаЗапасов = Новый Массив;
	ПредопределенныеСчетаУчетаЗапасов.Добавить(ПланСчетов.Материалы);                        				  // 10
	ПредопределенныеСчетаУчетаЗапасов.Добавить(ПланСчетов.Товары);                          				  // 41
	ПредопределенныеСчетаУчетаЗапасов.Добавить(ПланСчетов.ТоварыОтгруженные);               				  // 45
	ПредопределенныеСчетаУчетаЗапасов.Добавить(ПланСчетов.ОборудованиеКУстановке);     				          // 07
	ПредопределенныеСчетаУчетаЗапасов.Добавить(ПланСчетов.ВложенияВоВнеоборотныеАктивы);     				  // 08

	СчетаЗапасов = БухгалтерскийУчет.СформироватьМассивСубсчетов(ПредопределенныеСчетаУчетаЗапасов);
	
	ПредопределенныеИсключаемыеСчетаЗапасов = Новый Массив;
	ПредопределенныеИсключаемыеСчетаЗапасов.Добавить(ПланСчетов.ТопливоВБаке);                                // 10.03.2
	ПредопределенныеИсключаемыеСчетаЗапасов.Добавить(ПланСчетов.СпецоснасткаИСпецодеждаВЭксплуатации);        // 10.11
	ПредопределенныеИсключаемыеСчетаЗапасов.Добавить(ПланСчетов.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);  // 41.12
	ПредопределенныеИсключаемыеСчетаЗапасов.Добавить(ПланСчетов.КорректировкаТоваровПрошлогоПериода);         // 41.К
	ПредопределенныеИсключаемыеСчетаЗапасов.Добавить(ПланСчетов.ПереводМолоднякаЖивотныхВОсновноеСтадо);      // 08.06
	ПредопределенныеИсключаемыеСчетаЗапасов.Добавить(ПланСчетов.ПриобретениеВзрослыхЖивотных);   			  // 08.07
	ПредопределенныеИсключаемыеСчетаЗапасов.Добавить(ПланСчетов.НематериальныеПоисковыеАктивы);    		      // 08.11
	ПредопределенныеИсключаемыеСчетаЗапасов.Добавить(ПланСчетов.МатериальныеПоисковыеАктивы);    			  // 08.12
	
	СчетаЗапасов = ОбщегоНазначенияКлиентСервер.РазностьМассивов(СчетаЗапасов,
							БухгалтерскийУчет.СформироватьМассивСубсчетов(ПредопределенныеИсключаемыеСчетаЗапасов));
		
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("СчетаЗапасов", СчетаЗапасов);
	Запрос.УстановитьПараметр("ДатаОстатков", Новый Граница(Период - 1, ВидГраницы.Включая));
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ХозрасчетныйОстатки.Счет КАК Счет,
	|	ХозрасчетныйОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаОстатков, Счет В (&СчетаЗапасов), , Организация = &Организация) КАК ХозрасчетныйОстатки";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат.Количество() > 0;
	
КонецФункции

Процедура ОтменитьФормированиеНачальныхОстатковДляВеденияРаздельногоУчетаНДС(Организация, Период, СообщенияОбОшибках = Неопределено) Экспорт
	
	Обработки.ПомощникРасчетаНДС.ПометитьНаУдалениеСозданныеПоОперацииДокументы(
		Организация, 
		Период, 
		Перечисления.РегламентныеОперации.ФормированиеНачальныхОстатковДляВеденияРаздельногоУчетаНДС, 
		СообщенияОбОшибках);
	
КонецПроцедуры

// Получает дату включения раздельного учета НДС 
// Входящие параметры - Организация, для которой необходимо получить дату включения раздельного учета
// Возвращаемые параметры - структура с полями ВедетсяРаздельныйУчетНаСчете19 и Дата
// 		- ВедетсяРаздельныйУчетНаСчете19 поле типа Булево,
// 		возвращает Истина, если найдены настройки по включению раздельного учета НДС
// 		- Дата поле типа Дата, если есть настройки по раздельному учету,
// 		возвращает дату включения раздельного учета
Функция ДатаОстатков(Организация) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	НастройкиУчетаНДС.Период КАК Период
				|ИЗ
				|	РегистрСведений.НастройкиУчетаНДС КАК НастройкиУчетаНДС
				|ГДЕ
				|	НастройкиУчетаНДС.Организация = &Организация
				|	И НастройкиУчетаНДС.РаздельныйУчетНДСНаСчете19 = ИСТИНА
				|
				|УПОРЯДОЧИТЬ ПО
				|	Период
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ ПЕРВЫЕ 1
				|	ВыполнениеРегламентныхОперацийНДС.ПериодРегистрации КАК Период
				|ИЗ
				|	РегистрСведений.ВыполнениеРегламентныхОперацийНДС КАК ВыполнениеРегламентныхОперацийНДС
				|ГДЕ
				|	ВыполнениеРегламентныхОперацийНДС.Организация = &Организация
				|	И ВыполнениеРегламентныхОперацийНДС.РегламентнаяОперация = &РегламентнаяОперация";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("РегламентнаяОперация", Перечисления.РегламентныеОперации.ФормированиеНачальныхОстатковДляВеденияРаздельногоУчетаНДС);
	
	Результат = Запрос.ВыполнитьПакет();
	РегОперации = Результат[1].Выбрать();
	ИзменениеНастроек = Результат[0].Выбрать();
	СтруктураРезультат = Новый Структура;
	Если РегОперации.Следующий() Тогда
		СтруктураРезультат.Вставить("Дата", РегОперации.Период);
		СтруктураРезультат.Вставить("ВедетсяРаздельныйУчетНаСчете19", Истина);
		
	Иначе
		Если ИзменениеНастроек.Следующий() Тогда 
			СтруктураРезультат.Вставить("Дата",  ИзменениеНастроек.Период);
			СтруктураРезультат.Вставить("ВедетсяРаздельныйУчетНаСчете19",  Истина);
		Иначе
			СтруктураРезультат.Вставить("Дата", ТекущаяДата());
			СтруктураРезультат.Вставить("ВедетсяРаздельныйУчетНаСчете19", Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураРезультат;
	
КонецФункции

// Если сформированы остатки по раздельному учету НДС, необходимо контролировать их актуальность
// Если проводится закрытие месяца до даты ввода остатков, перенос границы последовательности
// Тогда необходимо у операций по формированию остатков сбросить признак актуальности операций
// Если последним документом в границе последовательности является сам документ Ввода остатков
// Тогда актуальность выплненных операций не будет сбрасываться
// Входящие параметры Организация и НачалоПроведения
// НачалоПроведения параметр типа Структура, в котором два поля Дата и Ссылка
// Поле Ссылка может быть не заполнено, например, если проводится перепроведение документов за период
// В остальных случаях поле Ссылка содержит документ границы последовательности
// Поле Дата - дата с которой совершается:
// Перенос граница последовательности/ перепроведение документов / закрытие месяца
Процедура СброситьАктуальностьОстатков(Организация, НачалоПроведения) Экспорт
	
	ВедетсяРУ = ДатаОстатков(Организация);
	
	Если ВедетсяРУ.ВедетсяРаздельныйУчетНаСчете19 Тогда
		Если ВедетсяРУ.Дата > НачалоПроведения.Дата Тогда 
			Если НачалоПроведения.Ссылка <> Неопределено Тогда
				ЭтоВводОстатковПоРУ = РегистрыСведений.ВыполнениеРегламентныхОперацийНДС.ЭтоРегламентнаяОперацияНДС(НачалоПроведения.Ссылка);
				Если НЕ ЭтоВводОстатковПоРУ Тогда
					РегистрыСведений.ВыполнениеРегламентныхОперацийНДС.СброситьФактВыполненияРегламентнойОперации(Организация, ВедетсяРУ.Дата,
						Перечисления.РегламентныеОперации.ФормированиеНачальныхОстатковДляВеденияРаздельногоУчетаНДС);
				КонецЕсли;
			Иначе
				РегистрыСведений.ВыполнениеРегламентныхОперацийНДС.СброситьФактВыполненияРегламентнойОперации(Организация, ВедетсяРУ.Дата,
					Перечисления.РегламентныеОперации.ФормированиеНачальныхОстатковДляВеденияРаздельногоУчетаНДС);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяСобытияЖурналаРегистрации()

	Возврат НСтр("ru = 'Формирование остатков по раздельному учету НДС'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецФункции

// Все запросы на получение данных

Функция ОстаткиПоСчетамУчетаТоваров(СтруктураПараметров, ТаблицаИспользованныхПартий)
	
	// Определяем параметры  
	ВедетсяПартионныйУчет = СтруктураПараметров.ВестиПартионныйУчет;
	ВедетсяСкладскойУчет  = СтруктураПараметров.ВестиСкладскойУчет; 
	
	ПланСчетов = ПланыСчетов.Хозрасчетный;
	
	// Сформируем массив счетов с возможной аналитикой номенклатура, склад, партия
	// Это счета на которые изначально ожидаются поступления    	
	ПредопределенныеСчетаУчетаЗапасов = Новый Массив;
	ПредопределенныеСчетаУчетаЗапасов.Добавить(ПланСчетов.Материалы);                        				  // 10
	ПредопределенныеСчетаУчетаЗапасов.Добавить(ПланСчетов.Товары);                          				  // 41
	СчетаЗапасов = БухгалтерскийУчет.СформироватьМассивСубсчетов(ПредопределенныеСчетаУчетаЗапасов);
	
	ПредопределенныеИсключаемыеСчетаЗапасов = Новый Массив;
	ПредопределенныеИсключаемыеСчетаЗапасов.Добавить(ПланСчетов.ТопливоВБаке);                                // 10.03.2
	ПредопределенныеИсключаемыеСчетаЗапасов.Добавить(ПланСчетов.МатериалыПереданныеВПереработку);       	  // 10.07 
	ПредопределенныеИсключаемыеСчетаЗапасов.Добавить(ПланСчетов.СпецоснасткаИСпецодеждаВЭксплуатации);        // 10.11
	ПредопределенныеИсключаемыеСчетаЗапасов.Добавить(ПланСчетов.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ);  // 41.11
	ПредопределенныеИсключаемыеСчетаЗапасов.Добавить(ПланСчетов.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);  // 41.12
	ПредопределенныеИсключаемыеСчетаЗапасов.Добавить(ПланСчетов.КорректировкаТоваровПрошлогоПериода);         // 41.К
	
	СчетаЗапасов = ОбщегоНазначенияКлиентСервер.РазностьМассивов(СчетаЗапасов,
							БухгалтерскийУчет.СформироватьМассивСубсчетов(ПредопределенныеИсключаемыеСчетаЗапасов));
		
	// Счет 41.11, на нем вне зависимости от ведения учета по складам есть субконто склад, 
	// Поэтому этот счет отличается от остальных в группе 41 счета
	Счет4111=ПланСчетов.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ;		 								      // 41.11
	
	// Массив счетов, которые используются для передачи, на них не бывает субконто "Склад", вместо него "Контрагент"
	ПредопределенныеСчетаУчетаПередачи = Новый Массив;
	ПредопределенныеСчетаУчетаПередачи.Добавить(ПланСчетов.МатериалыПереданныеВПереработку);				  // 10.07
	ПредопределенныеСчетаУчетаПередачи.Добавить(ПланСчетов.ТоварыОтгруженные);               				  // 45
	СчетаПередачи = БухгалтерскийУчет.СформироватьМассивСубсчетов(ПредопределенныеСчетаУчетаПередачи);

	ПредопределенныеИсключаемыеСчетаПередачи = Новый Массив;
	ПредопределенныеИсключаемыеСчетаПередачи.Добавить(ПланСчетов.ПереданныеОбъектыНедвижимости);       		  // 45.04
	
	СчетаПередачи = ОбщегоНазначенияКлиентСервер.РазностьМассивов(СчетаПередачи,
		БухгалтерскийУчет.СформироватьМассивСубсчетов(ПредопределенныеИсключаемыеСчетаПередачи));
		
	// Сформируем варианты по субконто
	ВидыСубконтоНСП = Новый Массив;
	ВидыСубконтоНСП.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	Если ВедетсяСкладскойУчет Тогда 	
		ВидыСубконтоНСП.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	КонецЕсли;
	Если ВедетсяПартионныйУчет Тогда 
		ВидыСубконтоНСП.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии);
	КонецЕсли;
	
	ВидыСубконтоНКП = Новый Массив;
	ВидыСубконтоНКП.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	ВидыСубконтоНКП.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	Если ВедетсяПартионныйУчет Тогда
		ВидыСубконтоНКП.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии);
	КонецЕсли;
	
	ВидыСубконтоНСП4111 = Новый Массив;
	ВидыСубконтоНСП4111.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	ВидыСубконтоНСП4111.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	Если ВедетсяПартионныйУчет Тогда 
		ВидыСубконтоНСП4111.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии);
	КонецЕсли;

	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("СчетаЗапасов", 					СчетаЗапасов);
	Запрос.УстановитьПараметр("Счет4111",						Счет4111);
	Запрос.УстановитьПараметр("СчетаПередачи", 					СчетаПередачи);
	Запрос.УстановитьПараметр("ГраницаОстатков", 				СтруктураПараметров.КонецКвартала);
	Запрос.УстановитьПараметр("Организация", 					СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("ВидыСубконтоНСП", 				ВидыСубконтоНСП);
	Запрос.УстановитьПараметр("ВидыСубконтоНКП", 				ВидыСубконтоНКП);
	Запрос.УстановитьПараметр("ВидыСубконтоНСП4111",			ВидыСубконтоНСП4111);
	Запрос.УстановитьПараметр("ТаблицаИспользованныхПартий", 	ТаблицаИспользованныхПартий);
	Запрос.УстановитьПараметр("ВидыСубконтоН",					ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	
	ПолеСклад  = ?(ВедетсяСкладскойУчет,   "ЕСТЬNULL(ХозрасчетныйОстатки.Субконто2, НЕОПРЕДЕЛЕНО)", "НЕОПРЕДЕЛЕНО");
	Если Не ВедетсяСкладскойУчет Тогда 
		ПолеПартия = ?(ВедетсяПартионныйУчет, "ЕСТЬNULL(ХозрасчетныйОстатки.Субконто2, НЕОПРЕДЕЛЕНО)", "НЕОПРЕДЕЛЕНО");
	Иначе
		ПолеПартия = ?(ВедетсяПартионныйУчет, "ЕСТЬNULL(ХозрасчетныйОстатки.Субконто3, НЕОПРЕДЕЛЕНО)", "НЕОПРЕДЕЛЕНО");
		
	КонецЕсли;
	ПартияКакСубконто3 = ?(ВедетсяПартионныйУчет, "ЕСТЬNULL(ХозрасчетныйОстатки.Субконто3, НЕОПРЕДЕЛЕНО)", "НЕОПРЕДЕЛЕНО");
	
	ТекстЗапроса = УчетНДСПоОстаткам.ТестЗапросаОстаткиИДвиженияПоТоварнымСчетам();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеСклад", ПолеСклад);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПартия", ПолеПартия);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПартияКакСубконто3", ПартияКакСубконто3);

	Запрос.Текст = ТекстЗапроса;
	
	Таблицы = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Возврат Таблицы;
	
КонецФункции

Функция ОстаткиПоСчетамКапВложений(СтруктураПараметров)
	
	ВедетсяСкладскойУчет  		 = СтруктураПараметров.ВестиСкладскойУчет;
	ВедетсяПартионныйУчет 		 = СтруктураПараметров.ВестиПартионныйУчет; 
	ВедетсяСуммовойУчетПоСкладам = СтруктураПараметров.ВедетсяСуммовойУчетПоСкладам;
	
	ВидыСубконтоНПС = Новый Массив;
	ВидыСубконтоНПС.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	Если ВедетсяПартионныйУчет Тогда 
		ВидыСубконтоНПС.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии);
	КонецЕсли;
	Если ВедетсяСкладскойУчет Тогда 	
		ВидыСубконтоНПС.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	КонецЕсли;
		
	ВидыСубконтоНП = Новый Массив;
	ВидыСубконтоНП.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	Если ВедетсяПартионныйУчет Тогда 
		ВидыСубконтоНП.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии);
	КонецЕсли;
	Если ВедетсяСуммовойУчетПоСкладам Тогда
		ВидыСубконтоНП.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	КонецЕсли;
	
	ПланСчетов = ПланыСчетов.Хозрасчетный;
	
	// Массив счетов, по которым ведется только суммовой учет	
	ПредопределенныйСчетУчетаКапвложений = Новый Массив;
	ПредопределенныйСчетУчетаКапвложений.Добавить(ПланСчетов.ВложенияВоВнеоборотныеАктивы);                    // 08
	СчетаВложений = БухгалтерскийУчет.СформироватьМассивСубсчетов(ПредопределенныйСчетУчетаКапвложений);
	
	ПредопределенныеИсключаемыеСчетаВложений = Новый Массив;
	ПредопределенныеИсключаемыеСчетаВложений.Добавить(ПланСчетов.ПриобретениеКомпонентовОсновныхСредств);     // 08.04.1
	ПредопределенныеИсключаемыеСчетаВложений.Добавить(ПланСчетов.ПереводМолоднякаЖивотныхВОсновноеСтадо);     // 08.06
	ПредопределенныеИсключаемыеСчетаВложений.Добавить(ПланСчетов.ПриобретениеВзрослыхЖивотных);   			  // 08.07
	ПредопределенныеИсключаемыеСчетаВложений.Добавить(ПланСчетов.НематериальныеПоисковыеАктивы);    		  // 08.11
	ПредопределенныеИсключаемыеСчетаВложений.Добавить(ПланСчетов.МатериальныеПоисковыеАктивы);    			  // 08.12	

		
	СчетаВложений = ОбщегоНазначенияКлиентСервер.РазностьМассивов(СчетаВложений,
		БухгалтерскийУчет.СформироватьМассивСубсчетов(ПредопределенныеИсключаемыеСчетаВложений));
		
	// Массив счетов, по которым ведется количественный учет	
	СчетаНПС = Новый Массив();
	СчетаНПС.Добавить(ПланСчетов.ОборудованиеКУстановке);                   // 07
	СчетаНПС.Добавить(ПланСчетов.ПриобретениеКомпонентовОсновныхСредств);  	// 08.04.1

	Запрос = Новый Запрос(); 
	
	Запрос.УстановитьПараметр("ГраницаОстатков", 	СтруктураПараметров.КонецКвартала);
	Запрос.УстановитьПараметр("Организация", 		СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("СчетаНПС",			СчетаНПС);
	Запрос.УстановитьПараметр("СчетаКапВложений", 	СчетаВложений);
	Запрос.УстановитьПараметр("ВидыСубконтоНПС", 	ВидыСубконтоНПС);
	Запрос.УстановитьПараметр("Счет10", 			ПланСчетов.Материалы); // 10
	Запрос.УстановитьПараметр("Счет41", 			ПланСчетов.Товары); // 41
	Запрос.УстановитьПараметр("ВидыСубконтоНП", 	ВидыСубконтоНП);
	
	ТекстЗапроса = УчетНДСПоОстаткам.ТекстЗапросаПоСчетамКапвложений();
	
	Если Не ВедетсяПартионныйУчет Тогда
		ПолеСклад							= ?(ВедетсяСкладскойУчет,   "ЕСТЬNULL(ХозрасчетныйОстатки.Субконто2, НЕОПРЕДЕЛЕНО)", "НЕОПРЕДЕЛЕНО"); 
		ВедетсяСуммовойУчетПоСкладамТекст	= ?(ВедетсяСуммовойУчетПоСкладам,
												"ЕСТЬNULL(ХозрасчетныйОстатки.Субконто2, НЕОПРЕДЕЛЕНО)", "НЕОПРЕДЕЛЕНО");
		ОборотыСклад						= ?(ВедетсяСкладскойУчет, "ЕСТЬNULL(ХозрасчетныйОборотыДтКт.СубконтоДт2, НЕОПРЕДЕЛЕНО)", "НЕОПРЕДЕЛЕНО");
		ОборотыВедетсяСуммовойУчетПоСкладам = ?(ВедетсяСуммовойУчетПоСкладам,
												"ЕСТЬNULL(ХозрасчетныйОборотыДтКт.Субконто2, НЕОПРЕДЕЛЕНО)", "НЕОПРЕДЕЛЕНО");
		
	Иначе
		ПолеСклад							= ?(ВедетсяСкладскойУчет,   "ЕСТЬNULL(ХозрасчетныйОстатки.Субконто3, НЕОПРЕДЕЛЕНО)", "НЕОПРЕДЕЛЕНО");
		ВедетсяСуммовойУчетПоСкладамТекст	= ?(ВедетсяСуммовойУчетПоСкладам,
												"ЕСТЬNULL(ХозрасчетныйОстатки.Субконто3, НЕОПРЕДЕЛЕНО)", "НЕОПРЕДЕЛЕНО");
		ОборотыСклад						= ?(ВедетсяСкладскойУчет,   "ЕСТЬNULL(ХозрасчетныйОборотыДтКт.СубконтоДт3, НЕОПРЕДЕЛЕНО)", "НЕОПРЕДЕЛЕНО");
		ОборотыВедетсяСуммовойУчетПоСкладам = ?(ВедетсяСуммовойУчетПоСкладам,
												"ЕСТЬNULL(ХозрасчетныйОборотыДтКт.Субконто3, НЕОПРЕДЕЛЕНО)", "НЕОПРЕДЕЛЕНО");
		
		
	КонецЕсли;
	
	ПолеПартия							= ?(ВедетсяПартионныйУчет, "ЕСТЬNULL(ХозрасчетныйОстатки.Субконто2, НЕОПРЕДЕЛЕНО)", "НЕОПРЕДЕЛЕНО");  	
	ОборотыПартия						= ?(ВедетсяПартионныйУчет,   "ЕСТЬNULL(ХозрасчетныйОборотыДтКт.СубконтоДт2, НЕОПРЕДЕЛЕНО)", "НЕОПРЕДЕЛЕНО");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеСклад",								ПолеСклад);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПартия",					  			ПолеПартия);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВедетсяСуммовойУчетПоСкладам",			ВедетсяСуммовойУчетПоСкладамТекст);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОборотыСклад", 				  			ОборотыСклад); 
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОборотыПартия", 				  			ОборотыПартия);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОборотыВедетсяСуммовойУчетПоСкладам", 	ОборотыВедетсяСуммовойУчетПоСкладам);

	Запрос.Текст = ТекстЗапроса; 
	
	Результат = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Возврат Результат;
	
КонецФункции

// Получение параметров, описаний типов  
Функция ПодготовитьПараметрыДляВводаОстатков(Организация,Период)
	
	ДатаВводаОстатков = Новый Граница(Период - 1, ВидГраницы.Включая);
	СлужебныйДокументПартии = Документы.Партия.СоздатьДокумент();
	СлужебныйДокументПартии.Организация = Организация;
	СлужебныйДокументПартии.Дата		= Период-1;
	КомментарийПартии = НСтр("ru = '#Создан автоматически при включении раздельного учета НДС'"); 
	СлужебныйДокументПартии.Комментарий	= КомментарийПартии;
	СлужебныйДокументПартии.ДополнительныеСвойства.Вставить("ПроведенВХронологическойПоследовательности", Истина);
	СлужебныйДокументПартии.Записать();
	
	ТекстКомментарияВводОстатков = 	НСтр("ru = '#Создан автоматически при включении раздельного учета НДС, %1 %2'");
	ТекстКомментария = 	НСтр("ru = '#Создан автоматически при включении раздельного учета НДС, заполнение субконто ""Способы учета НДС"" на 19 счете'");

	
	ПараметрыУчета = ОбщегоНазначенияБП.ОпределитьПараметрыУчета();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("КонецКвартала", 					ДатаВводаОстатков);
	СтруктураПараметров.Вставить("Период", 							Период-1);
	СтруктураПараметров.Вставить("Организация", 					Организация);
	СтруктураПараметров.Вставить("СлужебнаяПартия", 				СлужебныйДокументПартии.Ссылка);
	СтруктураПараметров.Вставить("СчетНДСПоУмолчанию",				ПланыСчетов.Хозрасчетный.НДСпоПриобретеннымМПЗ);
	СтруктураПараметров.Вставить("Комментарий", 					ТекстКомментария);
	СтруктураПараметров.Вставить("Содержание",						ТекстКомментария);
	СтруктураПараметров.Вставить("КомментарийВводОстатков",			ТекстКомментарияВводОстатков);
	СтруктураПараметров.Вставить("ВестиПартионныйУчет", 			ПараметрыУчета.ВестиПартионныйУчет);
	СтруктураПараметров.Вставить("ВестиСкладскойУчет",  			ПараметрыУчета.СкладскойУчет > 0);
	СтруктураПараметров.Вставить("ВедетсяСуммовойУчетПоСкладам",	ПараметрыУчета.СкладскойУчет = 2); 
	СтруктураПараметров.Вставить("Счета19КВычету",          		БухгалтерскийУчет.МассивСубСчетов19НДСКВычету());
	СтруктураПараметров.Вставить("СубконтоСчета19",        			БухгалтерскийУчет.МассивСубконтоСчета19());
	СтруктураПараметров.Вставить("СубконтоСчета1907",       		БухгалтерскийУчет.МассивСубконтоСчета1907());
	СтруктураПараметров.Вставить("Счет1907",               			ПланыСчетов.Хозрасчетный.НДСПоТоварамРеализованнымПоСтавке0);
	СтруктураПараметров.Вставить("ДокументыОперации",      			Новый Массив);
	СтруктураПараметров.Вставить("ДатаВключенияРУ", 				Период);
	СтруктураПараметров.Вставить("СокращеннаяАналитика",			
		УчетНДСРаздельный.СокращеннаяАналитика(Период));

	Возврат СтруктураПараметров;
	
КонецФункции

Функция СтруктураПараметровДляЗаполненияВНО()
	
	СтуктураПараметровДляВНО = Новый Структура;
	
	СтуктураПараметровДляВНО.Вставить("ТаблицаОстатков");
	СтуктураПараметровДляВНО.Вставить("ТаблицаКомплектующих");
	СтуктураПараметровДляВНО.Вставить("АВКакДопРасходы");
	СтуктураПараметровДляВНО.Вставить("СуммыДопРасходов");
	СтуктураПараметровДляВНО.Вставить("СуммыПоПоступлениям");
	
	Возврат СтуктураПараметровДляВНО;
	
КонецФункции

Функция ПараметрыДляДопРаспределенияПоПартиям()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтруктураОписанийТипов");
	СтруктураПараметров.Вставить("ЭтоКомплектация", Ложь);
	СтруктураПараметров.Вставить("ИД", Неопределено);
	
	Возврат СтруктураПараметров;
	
КонецФункции

Функция ПараметрыДляЗаполненияСтрокиПоПартии()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ключ");
	СтруктураПараметров.Вставить("СчетУчета");
	СтруктураПараметров.Вставить("СчетНДСПоУмолчанию");
	СтруктураПараметров.Вставить("ЭтоКомплектация");
	СтруктураПараметров.Вставить("СуммовойУчет", Ложь);
	
	Возврат СтруктураПараметров;
	
КонецФункции

Функция ПараметрыДляРаспределенияПартийПоКомплектующим()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТаблицаОстатковПоПартиям");
	СтруктураПараметров.Вставить("ТаблицаСборкаОборудования");
	СтруктураПараметров.Вставить("ТаблицаДвижений10");
	СтруктураПараметров.Вставить("ТаблицаДвижений0807");
	
	Возврат СтруктураПараметров;
	
КонецФункции

// Процедуры по заполнению шапки и строк документа 
Процедура ЗаполнитьШапкуДокумента(ВводОстатковОбъект, СтруктураПараметров, Строка, РазделУчета)
	
	ВводОстатковОбъект.Дата          					= СтруктураПараметров.Период;
	ВводОстатковОбъект.Организация   					= СтруктураПараметров.Организация;
	ВводОстатковОбъект.Ответственный 					= Пользователи.ТекущийПользователь();
	ВводостатковОбъект.ПодразделениеОрганизации			= ?(Строка.Подразделение <> Неопределено, Строка.Подразделение, 
															Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	ВводОстатковОбъект.РазделУчета						= РазделУчета;
	ВводОстатковОбъект.ОтражатьВБухгалтерскомУчете		= Ложь;
	ВводОстатковОбъект.ОтражатьВНалоговомУчете			= Ложь;
	ВводОстатковОбъект.ОтражатьПоСпециальнымРегистрам	= Истина;
	ВводОстатковОбъект.Комментарий  					= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
																		СтруктураПараметров.КомментарийВводОстатков,
																		Строка.Счет, Строка.Подразделение);
	

КонецПроцедуры

Процедура ЗаполнитьСтрокуПоДопРасходам(ПараметрыОтбора, КонтрольноеКоличество, ВводОстатковОбъект, СуммыДопРасходов,
										Ключ, СчетУчета, СуммаБезНДСПоСтроке)
	
	СтрокиСДопРасходами = СуммыДопРасходов.НайтиСтроки(ПараметрыОтбора);
	Для каждого СтрокаДопРасходов Из СтрокиСДопРасходами Цикл
		Если СтрокаДопРасходов.СуммаБезНДС = 0 И СтрокаДопРасходов.СуммаНДС = 0  Тогда
			Продолжить;
		КонецЕсли;
		СтрокаСФ = ВводОстатковОбъект.ДанныеПоСФ.Добавить();
		СтрокаСФ.Ключ = Ключ;
		ЗаполнитьЗначенияСвойств(СтрокаСФ,СтрокаДопРасходов);
		Если КонтрольноеКоличество = 0 Тогда 
			СтрокаСФ.СуммаБезНДС = СтрокаДопРасходов.СуммаБезНДС;
			СтрокаСФ.НДС = СтрокаДопРасходов.СуммаНДС;
		Иначе
			СтрокаСФ.СуммаБезНДС = Окр(СтрокаДопРасходов.СуммаБезНДС/СтрокаДопРасходов.Количество*КонтрольноеКоличество,2);
			СтрокаСФ.НДС = Окр(СтрокаДопРасходов.СуммаНДС/СтрокаДопРасходов.Количество*КонтрольноеКоличество,2);
		КонецЕсли;
		СтрокаСф.Количество = 0;
		Если СтрокаСФ.ВидЦенности = Перечисления.ВидыЦенностей.ТаможенныеПлатежи Тогда
			ВидЦенности = УчетНДС.ОпределитьВидЦенности(СтрокаДопРасходов.СчетУчета);
			Если ВидЦенности = Перечисления.ВидыЦенностей.ОС Тогда
				СтрокаСФ.ВидЦенности = Перечисления.ВидыЦенностей.ТаможенныеПлатежиОС;
			КонецЕсли;
		КонецЕсли;
		Если СтрокаДопРасходов.ВидЦенности = Неопределено Тогда
			СтрокаСФ.ВидЦенности = УчетНДС.ОпределитьВидЦенности(СчетУчета);
		КонецЕсли;
		Если Не Значениезаполнено(СтрокаСФ.СпособУчетаНДС) Тогда
			СтрокаСФ.СпособУчетаНДС = Перечисления.СпособыУчетаНДС.ПринимаетсяКВычету;
		КонецЕсли;
		СуммаБезНДСПоСтроке = СуммаБезНДСПоСтроке+СтрокаСФ.СуммаБезНДС;
		Если Не ЗначениеЗаполнено(СтрокаСФ.СтавкаНДС) Тогда
			СтрокаСФ.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуТолькоПоКоличеству(ВводОстатковОбъект, СтрокаОстатков, СчетНДСПоУмолчанию,
											СлужебнаяПартия = Неопределено, КоличествоОстаток = 0)

	СтрокаСФ = ВводОстатковОбъект.ДанныеПоСФ.Добавить(); 
	СтрокаСФ.Ключ			= СтрокаОстатков.Ключ;
	СтрокаСФ.ВидЦенности 	= УчетНДС.ОпределитьВидЦенности(СтрокаОстатков.СчетУчета);
	СтрокаСФ.СчетУчетаНДС 	= СчетНДСПоУмолчанию;
	СтрокаСФ.СтавкаНДС 		= Перечисления.СтавкиНДС.БезНДС;
	СтрокаСФ.Количество 	= ?(КоличествоОстаток = 0, СтрокаОСтатков.Количество, КоличествоОстаток);
	СтрокаСФ.СпособУчетаНДС	= Перечисления.СпособыУчетаНДС.Распределен;
	СтрокаСФ.СчетФактура	= ?(СлужебнаяПартия = Неопределено, СтрокаОстатков.Партия, СлужебнаяПартия);
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуПоПартии(ПараметрыОтбора, ВводОстатковОбъект, СуммыПоПоступлениям,
									ПараметрыДляЗаполненияСтрокиПоПартии, КонтрольноеКоличество, СуммаБезНДСПоСтроке)
	
	СтрокиССуммамиНДС = СуммыПоПоступлениям.НайтиСтроки(ПараметрыОтбора);
	СчетНДСПоУмолчанию = ПараметрыДляЗаполненияСтрокиПоПартии.СчетНДСПоУмолчанию;
	Для каждого СтрокаСНДС Из СтрокиССуммамиНДС Цикл
		Если СтрокаСНДС.Количество = 0  И Не ПараметрыДляЗаполненияСтрокиПоПартии.СуммовойУчет Тогда
			Продолжить;
		КонецЕсли;
		СтрокаСФ = ВводОстатковОбъект.ДанныеПоСФ.Добавить();
		СтрокаСФ.Ключ = ПараметрыДляЗаполненияСтрокиПоПартии.Ключ; 
		ЗаполнитьЗначенияСвойств(СтрокаСФ,СтрокаСНДС);
		Если КонтрольноеКоличество >= СтрокаСНДС.Количество Тогда    						
			КонтрольноеКоличество = КонтрольноеКоличество-СтрокаСНДС.Количество;
			СтрокаСФ.НДС			= СтрокаСНДС.СуммаНДС;
			СтрокаСНДС.Количество 	= 0;
			СтрокаСНДС.СуммаБезНДС = 0;
			СтрокаСНДС.СуммаНДС	= 0;
		Иначе						
			СтрокаСФ.СуммаБезНДС = Окр(СтрокаСНДС.СуммаБезНДС/СтрокаСНДС.Количество*КонтрольноеКоличество,2);
			СтрокаСФ.НДС = Окр(СтрокаСНДС.СуммаНДС/СтрокаСНДС.Количество*КонтрольноеКоличество,2);
			СтрокаСНДС.СуммаБезНДС = СтрокаСНДС.СуммаБезНДС-СтрокаСф.СуммаБезНДС;
			СтрокаСНДС.СуммаНДС = СтрокаСНДС.СуммаНДС-СтрокаСФ.НДС;
			СтрокаСНДС.Количество = СтрокаСНДС.Количество-КонтрольноеКоличество;
			СтрокаСф.Количество = КонтрольноеКоличество;				
			КонтрольноеКоличество = 0;
		КонецЕсли; 
		Если ПараметрыДляЗаполненияСтрокиПоПартии.ЭтоКомплектация Тогда
			СтрокаСф.Количество = 0;
		КонецЕсли;
		Если ТипЗнч(СтрокаСНДС.СчетФактура) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
			СтрокаСф.СчетФактура = СтрокаСНДС.ДокументПоступления;
		КонецЕсли;
		Если СтрокаСНДС.ВидЦенности = Неопределено Тогда
			МетаданныеДокумента = СтрокаСФ.СчетФактура.Метаданные();
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ДоговорКонтрагента", МетаданныеДокумента) Тогда 			 
				Договор = СтрокаСФ.СчетФактура.ДоговорКонтрагента;
				СтрокаСФ.ВидЦенности = УчетНДС.ОпределитьВидЦенностиПоОперации(СтрокаСНДС.Номенклатура, СтрокаСНДС.СчетУчета, ,
																				Договор.УчетАгентскогоНДС , Договор.ВидАгентскогоДоговора);
			Иначе
				СтрокаСФ.ВидЦенности = УчетНДС.ОпределитьВидЦенности(СтрокаСНДС.СчетУчета);
			КонецЕсли;
		КонецЕсли;
		Если СтрокаСФ.СуммаБезНДС = 0 Тогда 
			СтрокаСФ.СпособУчетаНДС = Перечисления.СпособыУчетаНДС.Распределен;
		ИначеЕсли Не ЗначениеЗаполнено(СтрокаСф.СпособУчетаНДС) Тогда
			СтрокаСФ.СпособУчетаНДС = Перечисления.СпособыУчетаНДС.ПринимаетсяКВычету;
		КонецЕсли;
		СтрокаСФ.Ключ = ПараметрыДляЗаполненияСтрокиПоПартии.Ключ; 
		СуммаБезНДСПоСтроке = СуммаБезНДСПоСтроке+СтрокаСФ.СуммаБезНДС;
		Если Не ЗначениеЗаполнено(СтрокаСФ.СчетУчетаНДС) Тогда
			СтрокаСФ.СчетУчетаНДС = СчетНДСПоУмолчанию;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаСФ.СтавкаНДС) Тогда
			СтрокаСФ.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		КонецЕсли;
		Если КонтрольноеКоличество = 0 Тогда
			Прервать;
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуСАналитикой(СтрокаОстатков, СтрокаСАналитикой, СлужебнаяПартия, РазделУчета)

	СтрокаОстатков.Ключ = Новый УникальныйИдентификатор;
	ЗаполнитьЗначенияСвойств(СтрокаОстатков,СтрокаСАналитикой);
	СтрокаОстатков.СчетУчета = СтрокаСАналитикой.Счет;
	Счет1007 = ПланыСчетов.Хозрасчетный.МатериалыПереданныеВПереработку;
	РодительСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОстатков.СчетУчета, "Родитель");
	
	Если РазделУчета=Перечисления.РазделыУчетаДляВводаОстатков.ТоварыОтгруженные Тогда
		СтрокаОстатков.Покупатель = СтрокаСАналитикой.Склад;
	ИначеЕсли СтрокаОстатков.СчетУчета = Счет1007 Или РодительСчета = Счет1007 Тогда
		СтрокаОстатков.Контрагент = СтрокаСАналитикой.Склад;
	Иначе
		СтрокаОстатков.Склад = СтрокаСАналитикой.Склад;
	КонецЕсли;
	МетаданныеНоменклатураНаСкладе = Метаданные.Документы.ВводНачальныхОстатков.ТабличныеЧасти.НоменклатураНаСкладе;
	Если МетаданныеНоменклатураНаСкладе.Реквизиты.Партия.Тип.СодержитТип(ТипЗнч(СтрокаСАналитикой.Партия)) Тогда
		СтрокаОстатков.Партия = СтрокаСАналитикой.Партия;
	Иначе
		СтрокаОстатков.Партия = СлужебнаяПартия;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаОстатков.Партия) Тогда
		СтрокаОстатков.Партия = СлужебнаяПартия;
	КонецЕсли;
	
КонецПроцедуры

// Необходимо заполнить и провести документ Ввод остатков
	// Шаг 1 Заполняем шапку документа 
	// Шаг 2 Заполняем верхную табличную часть, в зависимости от счетов могут быть следующие варианты
	// 		Номенклатура на складе - для счетов 10, 41, 07, 08 (исключая 41.11)
	// 		МПЗ отгруженные - для счетов 45
	// 		Товары в розничной торговле АТТ - 41.11?
	// Шаг 3 Заполняем табличную часть Данные по СФ:
	// 		 - Если по строке остатков предполагается только количественный учет, тогда заполняем в тч одну строку только по количеству
	// 		 - В остальных случаях ищем данные по НДС по документу Партии
	// 	 	 - Если как документ партии выступают Требование-накладная, Комплектация, Передача оборудования в монтаж, тогда заполняем 
	// 			партии для каждого комплектующего
	// 	 	 - Ищем к документу партии доп расходы	
Процедура ЗаполнитьДокументыВводаОстатков(ПараметрыДляВводаОстатков, СтруктураПараметров, ЭтоТовары)
	
	ТаблицаОстатков			= ПараметрыДляВводаОстатков.ТаблицаОстатков;
	ТаблицаКомплектующих	= ПараметрыДляВводаОстатков.ТаблицаКомплектующих;
	АВКакДопРасходы			= ПараметрыДляВводаОстатков.АВКакДопРасходы;
	СуммыДопРасходов		= ПараметрыДляВводаОстатков.СуммыДопРасходов;
	СуммыПоПоступлениям		= ПараметрыДляВводаОстатков.СуммыПоПоступлениям;
	
	ПараметрыДляЗаполненияСтрокиПоПартии = ПараметрыДляЗаполненияСтрокиПоПартии();
	ПараметрыДляЗаполненияСтрокиПоПартии.СчетНДСПоУмолчанию = СтруктураПараметров.СчетНДСПоУмолчанию;
	СчетаСОстатками = ТаблицаОстатков.Скопировать(,"Счет,Подразделение");
	СчетаСОстатками.Свернуть("Счет,Подразделение");
	
	МаксКоличествоСтрок = 9000;
	
	СубконтоСклад	= ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады;
	СубконтоПартия	= ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии;
	
	Счет1007 = Планысчетов.Хозрасчетный.МатериалыПереданныеВПереработку;
	Счет4111 = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ;

	Для каждого СтрСчет Из СчетаСОстатками Цикл
		РодительСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрСчет.Счет, "Родитель");
		РазделУчета = ПолучитьРазделУчета(СтрСчет.Счет);
		ВводОстатковОбъект = Документы.ВводНачальныхОстатков.СоздатьДокумент();
		ЗаполнитьШапкуДокумента(ВводОстатковОбъект, СтруктураПараметров, СтрСчет, РазделУчета);
		
		СтруктураОтбораАналитик = Новый Структура;
		СтруктураОтбораАналитик.Вставить("Счет", СтрСчет.Счет);
		СтруктураОтбораАналитик.Вставить("Подразделение", СтрСчет.Подразделение);
		СтрокиСАналитикой = ТаблицаОстатков.НайтиСтроки(СтруктураОтбораАналитик);
		Для каждого СтрокаСАналитикой Из СтрокиСАналитикой Цикл
			Если ВводОстатковОбъект.ДанныеПоСФ.Количество() + ВводОстатковОбъект.НоменклатураНаСкладе.Количество()
				+ ВводОстатковОбъект.ТоварыВРозничнойТорговлеАТТ.Количество() + ВводОстатковОбъект.МПЗОтгруженные.Количество()
				+ ВводОстатковОбъект.МатериалыПереданныеВПереработку.Количество() > МаксКоличествоСтрок Тогда
				Попытка
					ВВодостатковОбъект.ДополнительныеСвойства.Вставить("ПроведенВХронологическойПоследовательности", Истина);
					ВВодостатковОбъект.Записать(РежимЗаписиДокумента.Проведение);
					РегистрыСведений.ВыполнениеРегламентныхОперацийНДС.ЗафиксироватьФактВыполненияРегламентнойОперации(СтруктураПараметров.ДатаВключенияРУ,
						СтруктураПараметров.Организация,
						ВводостатковОбъект.Ссылка,
						Перечисления.РегламентныеОперации.ФормированиеНачальныхОстатковДляВеденияРаздельногоУчетаНДС,
						Истина,
						СтрСчет.Счет);
					
				Исключение
						ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
							УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());

				КонецПопытки; 
				ВводОстатковОбъект = Документы.ВводНачальныхОстатков.СоздатьДокумент();
				ЗаполнитьШапкуДокумента(ВводОстатковОбъект, СтруктураПараметров, СтрСчет, РазделУчета);
			КонецЕсли;
			
			Если РазделУчета = Перечисления.РазделыУчетаДляВводаОстатков.ТоварыОтгруженные Тогда
				СтрокаОстатков = ВводОстатковОбъект.МПЗОтгруженные.Добавить();
			ИначеЕсли СтрСчет.Счет = Счет4111 Тогда
				СтрокаОстатков = ВводОстатковОбъект.ТоварыВРозничнойТорговлеАТТ.Добавить();
			ИначеЕсли СтрСчет.Счет = Счет1007 Или РодительСчета = Счет1007 Тогда
				СтрокаОстатков = ВводОстатковОбъект.МатериалыПереданныеВПереработку.Добавить();
			Иначе
				СтрокаОстатков = ВводОстатковОбъект.НоменклатураНаСкладе.Добавить();
			КонецЕсли;
			
			// Заполнили строку в верхнюю табличную часть
			ЗаполнитьСтрокуСАналитикой(СтрокаОстатков, СтрокаСАналитикой, СтруктураПараметров.СлужебнаяПартия, РазделУчета);
			СуммаБезНДСПоСтроке = 0;
			
			// Теперь будет заполнение табличной части ДанныеПоСФ
			// Сначала заполнение по комплектации
			ЭтоКомплектация = Ложь;
			Если ЭтоТовары Тогда
				ЭтоКомплектация = СтрокаСАналитикой.ЭтоКомплектация;
			Иначе 				
				ЭтоКомплектация = СтрокаСАналитикой.НуженДопПоиск;
			КонецЕсли;
			
			Если ЭтоКомплектация Тогда
				Если СтрокаОстатков.Количество <> 0 Тогда
					СтрокаОстатков.Сумма = 0;
					ЗаполнитьСтрокуТолькоПоКоличеству(ВводОстатковОбъект, СтрокаОстатков, СтруктураПараметров.СчетНДСПоУмолчанию);
				КонецЕсли; 
				ОтборПоКом = Новый Структура;
				ОтборПоКом.Вставить("ИД", СтрокаСАналитикой.ИД);
				ИнфоПоКомплектующим = ТаблицаКомплектующих.НайтиСтроки(ОтборПоКом);
				Для каждого Комплектующая Из ИнфоПоКомплектующим Цикл
					Если Комплектующая.ИскатьСуммуНДС Тогда
						СтруктураОтбораПоПартии = Новый Структура;
						СтруктураОтбораПоПартии.Вставить("Номенклатура",		Комплектующая.Номенклатура);
						СтруктураОтбораПоПартии.Вставить("СчетФактура", 		Комплектующая.Партия);
						КонтрольноеКоличество = Комплектующая.Количество;
						
						ПараметрыДляЗаполненияСтрокиПоПартии.Ключ					= СтрокаОстатков.Ключ;
						ПараметрыДляЗаполненияСтрокиПоПартии.СчетУчета				= СтрокаОстатков.СчетУчета;
						ПараметрыДляЗаполненияСтрокиПоПартии.ЭтоКомплектация		= Истина;
						ПараметрыДляЗаполненияСтрокиПоПартии.СуммовойУчет			= Ложь;
						
						ЗаполнитьСтрокуПоПартии(СтруктураОтбораПоПартии, ВводОстатковОбъект, СуммыПоПоступлениям, ПараметрыДляЗаполненияСтрокиПоПартии,
							КонтрольноеКоличество, СуммаБезНДСПоСтроке);
						
						// Добавить суммы из документов ГТД, Доп расходы, Заявление о ввозе товаров
						СтруктураОтбораДопРасходов = Новый Структура;
						СтруктураОтбораДопРасходов.Вставить("Номенклатура",		   Комплектующая.Номенклатура);
						СтруктураОтбораДопРасходов.Вставить("ДокументПоступления", Комплектующая.Партия); 
						КонтрольноеКоличество = Комплектующая.Количество;  
						ЗаполнитьСтрокуПоДопРасходам(СтруктураОтбораДопРасходов, КонтрольноеКоличество, ВводОстатковОбъект, 
						СуммыДопРасходов, СтрокаОстатков.Ключ, СтрокаОстатков.СчетУчета, СуммаБезНДСПоСтроке);
					КонецЕсли;
				КонецЦикла;
			Иначе
				Если НЕ СтрокаСАналитикой.ИскатьСуммуНДС И НЕ  СтрокаСАналитикой.ИскатьДопРасходы И ЭтоТовары Тогда
					СтрокаОстатков.Сумма = 0; 					
					ЗаполнитьСтрокуТолькоПоКоличеству(ВводОстатковОбъект, СтрокаОстатков, СтруктураПараметров.СчетНДСПоУмолчанию);
				ИначеЕсли НЕ СтрокаСАналитикой.ИскатьСуммуНДС И СтрокаСАналитикой.ИскатьДопРасходы И ЭтоТовары Тогда
					ЗаполнитьСтрокуТолькоПоКоличеству(ВводОстатковОбъект, СтрокаОстатков, СтруктураПараметров.СчетНДСПОУмолчанию);
					СтруктураОтбораДопРасходов = Новый Структура;
					СтруктураОтбораДопРасходов.Вставить("Номенклатура",		СтрокаОстатков.Номенклатура);
					СтруктураОтбораДопРасходов.Вставить("ДокументПоступления", СтрокаОстатков.Партия);
					КонтрольноеКоличество = СтрокаОстатков.Количество; 
					ЗаполнитьСтрокуПоДопРасходам(СтруктураОтбораДопРасходов, КонтрольноеКоличество, ВводОстатковОбъект, 
					СуммыДопРасходов, СтрокаОстатков.Ключ, СтрокаОстатков.СчетУчета, СуммаБезНДСПоСтроке);
				Иначе  					
					// Заполним исходные суммы из документов поступлений:
					// Авансовый отчет, возврат и ПТУ
					СтруктураОтбораПоПартии = Новый Структура;
					СтруктураОтбораПоПартии.Вставить("Номенклатура",		СтрокаОстатков.Номенклатура);
					СтруктураОтбораПоПартии.Вставить("СчетФактура", 		СтрокаОстатков.Партия);
					КонтрольноеКоличество = СтрокаОстатков.Количество;
					
					ПараметрыДляЗаполненияСтрокиПоПартии.Ключ					= СтрокаОстатков.Ключ;
					ПараметрыДляЗаполненияСтрокиПоПартии.СчетУчета				= СтрокаОстатков.СчетУчета;
					ПараметрыДляЗаполненияСтрокиПоПартии.ЭтоКомплектация		= Ложь;

					Если ЭтоТовары Тогда
						ПараметрыДляЗаполненияСтрокиПоПартии.СуммовойУчет		= Ложь;
						ЗаполнитьСтрокуПоПартии(СтруктураОтбораПоПартии, ВводОстатковОбъект, СуммыПоПоступлениям, ПараметрыДляЗаполненияСтрокиПоПартии,
												КонтрольноеКоличество, СуммаБезНДСПоСтроке);
					Иначе
						ПараметрыДляЗаполненияСтрокиПоПартии.СуммовойУчет		= Не СтрокаСАналитикой.КоличественныйУчет;
						ЗаполнитьСтрокуПоПартии(СтруктураОтбораПоПартии, ВводОстатковОбъект, СуммыПоПоступлениям, ПараметрыДляЗаполненияСтрокиПоПартии,
												КонтрольноеКоличество, СуммаБезНДСПоСтроке);
					КонецЕсли;
					
					Если КонтрольноеКоличество > 0 Тогда
						ЗаполнитьСтрокуТолькоПоКоличеству(ВводОстатковОбъект, СтрокаОстатков, СтруктураПараметров.СчетНДСПОУмолчанию,
															СтруктураПараметров.СлужебнаяПартия, КонтрольноеКоличество);  
					КонецЕсли;
					// Суммы из документов ГТД, Доп расходы, Заявление о ввозе товаров
					СтруктураОтбораДопРасходов = Новый Структура;
					СтруктураОтбораДопРасходов.Вставить("Номенклатура",		СтрокаОстатков.Номенклатура);
					СтруктураОтбораДопРасходов.Вставить("ДокументПоступления", СтрокаОстатков.Партия);
					КонтрольноеКоличество = СтрокаОстатков.Количество; 
					ЗаполнитьСтрокуПоДопРасходам(СтруктураОтбораДопРасходов, КонтрольноеКоличество, ВводОстатковОбъект, 
									СуммыДопРасходов, СтрокаОстатков.Ключ, СтрокаОстатков.СчетУчета, СуммаБезНДСПоСтроке);
					Если НЕ ЭтоТовары Тогда
						СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрокаОстатков.СчетУчета);
						СтруктураОтбораПоПартии = Новый Структура;
						СтруктураОтбораПоПартии.Вставить("Номенклатура",		СтрокаОстатков.Номенклатура);
						СтруктураОтбораПоПартии.Вставить("ДокАвансовыйОтчет", 	СтрокаОстатков.Партия); 
						СтруктураОтбораПоПартии.Вставить("СчетУчета", СтрокаОстатков.СчетУчета);
						Если  СвойстваСчета["ВидСубконто2"] = СубконтоСклад Тогда
							СтруктураОтбораПоПартии.Вставить("Субконто2", СтрокаОстатков.Склад);
						ИначеЕсли СвойстваСчета["ВидСубконто3"] = СубконтоСклад Тогда
							СтруктураОтбораПоПартии.Вставить("Субконто3", СтрокаОстатков.Склад);
						КонецЕсли; 				
						КонтрольноеКоличество = 0;
						ЗаполнитьСтрокуПоДопРасходам(СтруктураОтбораПоПартии, КонтрольноеКоличество, ВводОстатковОбъект, 
											АВКакДопРасходы, СтрокаОстатков.Ключ, СтрокаОстатков.СчетУчета, СуммаБезНДСПоСтроке);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			СтрокаОстатков.Сумма = СуммаБезНДСПоСтроке; 	
			Если СтрокаОстатков.Сумма = 0 И НЕ ЗначениеЗаполнено(СтрокаОстатков.Количество) Тогда
				СтрокиПоСФ = ВводОстатковОбъект.ДанныеПоСФ.НайтиСтроки(Новый Структура("Ключ", СтрокаОстатков.Ключ));
				Для каждого СтрокаПоСФ Из СтрокиПоСФ Цикл
					ВводОстатковОбъект.ДанныеПоСФ.Удалить(СтрокаПоСФ);
				КонецЦикла;
				ВводОстатковОбъект.НоменклатураНаСкладе.Удалить(СтрокаОстатков);
			КонецЕсли;
		КонецЦикла;  
		
		Попытка
			Если ВводОстатковОбъект.НоменклатураНаСкладе.Количество() > 0 
				ИЛИ ВводОстатковОбъект.МПЗОтгруженные.Количество() > 0 
				ИЛИ ВводОстатковОбъект.ТоварыВРозничнойТорговлеАТТ.Количество() > 0
				ИЛИ ВводОстатковОбъект.МатериалыПереданныеВПереработку.Количество() > 0 Тогда
				ВводостатковОбъект.ДополнительныеСвойства.Вставить("ПроведенВХронологическойПоследовательности", Истина);
				ВводостатковОбъект.Записать(РежимЗаписиДокумента.Проведение);
				РегистрыСведений.ВыполнениеРегламентныхОперацийНДС.ЗафиксироватьФактВыполненияРегламентнойОперации(СтруктураПараметров.ДатаВключенияРУ,
					СтруктураПараметров.Организация,
					ВводостатковОбъект.Ссылка,
					Перечисления.РегламентныеОперации.ФормированиеНачальныхОстатковДляВеденияРаздельногоУчетаНДС,
					Истина,
					СтрСчет.Счет);
			КонецЕсли;
		Исключение
			ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Вспомогательные процедуры по распределению 

Процедура ЗаполнитьДопПараметрыСтрокиПартии(Строка, ЭтоТовары, НуженДопПоиск, ИскатьСуммуНДС, 
											ИскатьДопРасходы, ЭтоКомплектация = Ложь)
	Строка.НуженДопПоиск 		= НуженДопПоиск;
	Строка.ИскатьСуммуНДС		= ИскатьСуммуНДС;
	Строка.ИскатьДопРасходы 	= ИскатьДопРасходы;
	Если ЭтоТовары Тогда
		Строка.ЭтоКомплектация		= ЭтоКомплектация;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьРазделУчета(Счет)
	ПланСчетов = ПланыСчетов.Хозрасчетный;
	РазделУчета = Перечисления.РазделыУчетаДляВводаОстатков.Материалы;
	
	Если БухгалтерскийУчетПовтИсп.СчетВИерархии(Счет, ПланСчетов.Материалы) Тогда
		РазделУчета = Перечисления.РазделыУчетаДляВводаОстатков.Материалы;
	ИначеЕсли БухгалтерскийУчетПовтИсп.СчетВИерархии(Счет,ПланСчетов.Товары) Тогда
		РазделУчета = Перечисления.РазделыУчетаДляВводаОстатков.Товары;
	ИначеЕсли БухгалтерскийУчетПовтИсп.СчетВИерархии(Счет, ПланСчетов.ТоварыОтгруженные) Тогда
		РазделУчета = Перечисления.РазделыУчетаДляВводаОстатков.ТоварыОтгруженные;
	ИначеЕсли БухгалтерскийУчетПовтИсп.СчетВИерархии(Счет, ПланСчетов.ВложенияВоВнеоборотныеАктивы) 
		ИЛИ Счет = ПланСчетов.ОборудованиеКУстановке Тогда
		РазделУчета = Перечисления.РазделыУчетаДляВводаОстатков.КапитальныеВложения;
	КонецЕсли;

	Возврат РазделУчета;
	
КонецФункции

// Процедуры заполнения остатков по группам счетов
// Для раздельного учета остатки разделены на 2 группы. 
Процедура ЗаполнитьПоТоварнымСчетам(СтруктураПараметров, ТаблицаИспользованныхПартий) 
	
	ПланСчетов = ПланыСчетов.Хозрасчетный;
	
	Таблицы = ОстаткиПоСчетамУчетаТоваров(СтруктураПараметров, ТаблицаИспользованныхПартий);
	
	ТаблицаСПолнойАналитикой 	= Таблицы[1].Выгрузить();
	ТаблицаКомплектаций			= Таблицы[2].Выгрузить();
	ТаблицаСдокументамиДвижений = Таблицы[6].Выгрузить();
	
	ТаблицаСЗаполненнымиПартиями = ТаблицаСПолнойАналитикой.СкопироватьКолонки();
	ТаблицаСЗаполненнымиПартиями.Колонки.Удалить("Партия");
	ТаблицаСЗаполненнымиПартиями.Колонки.Добавить("Партия", Новый ОписаниеТипов(Документы.ТипВсеСсылки().Типы()));
	ТаблицаСЗаполненнымиПартиями.Колонки.Добавить("ИскатьСуммуНДС", Новый ОписаниеТипов("Булево"));
	ТаблицаСЗаполненнымиПартиями.Колонки.Добавить("НуженДопПоиск", Новый ОписаниеТипов("Булево"));
	ТаблицаСЗаполненнымиПартиями.Колонки.Добавить("СчетПоступления",
		Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ТаблицаСЗаполненнымиПартиями.Колонки.Добавить("ИскатьДопРасходы", Новый ОписаниеТипов("Булево"));
	ТаблицаСЗаполненнымиПартиями.Колонки.Добавить("ЭтоКомплектация", Новый ОписаниеТипов("Булево"));
	ТаблицаСЗаполненнымиПартиями.Колонки.Добавить("ИД", Новый ОписаниеТипов("УникальныйИдентификатор"));
	ТаблицаСЗаполненнымиПартиями.Колонки.Добавить("НетПартииНаОстатках", Новый ОписаниеТипов("Булево"));
	
	ТаблицаСПолнойАналитикой.Колонки.Добавить("НайденаПартия");
	ТаблицаСПолнойАналитикой.Колонки.Добавить("ОсталосьКРаспределению");
	
	СтруктураОписанийТипов = УчетНДСПоОстаткам.ПолучитьСтруктуруОписанийТипов();
	ПараметрыДляДопРаспределенияПоПартиям = ПараметрыДляДопРаспределенияПоПартиям();
	ПараметрыДляДопРаспределенияПоПартиям.СтруктураОписанийТипов = СтруктураОписанийТипов;
	// Попрбуем выполнить распределение по партиям, сначала осуществляем первичный проход 
	УчетНДСПоОстаткам.РаспределитьОстаткиТоваровПоПартиям(ТаблицаСПолнойАналитикой,
											ТаблицаСЗаполненнымиПартиями,
											ТаблицаСДокументамиДвижений,
											СтруктураОписанийТипов);
	
	ДлительныеОперации.СообщитьПрогресс(, Символы.ПС +СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Выполняется формирование документов (40%) по организации ""%1"" ...'"), СтруктураПараметров.Организация));

		
	// Для некоторых документов надо осуществить доп поиск, например:
	// Когда идет перемещение со счета на счет или поступление на 45 счет через РТУ
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("НуженДопПоиск", Истина);
	СтрокиТребующиеДопПоиска = ТаблицаСЗаполненнымиПартиями.НайтиСтроки(ПараметрыОтбора);
	Для каждого Стр Из СтрокиТребующиеДопПоиска Цикл
		ПараметрыОтбораПартии = Новый Структура;
		ПараметрыОтбораПартии.Вставить("Номенклатура", Стр.Номенклатура);
		ПараметрыОтбораПартии.Вставить("Счет", 	   Стр.СчетПоступления); 
		КоличествоКРаспределению = Стр.Количество;  
		УчетНДСПоОстаткам.РаспределитьПоПартиямДополнительно(ПараметрыОтбораПартии, ТаблицаСДокументамиДвижений,
											ТаблицаСЗаполненнымиПартиями, КоличествоКРаспределению, Стр, 
											ПараметрыДляДопРаспределенияПоПартиям);
		ТаблицаСЗаполненнымиПартиями.Удалить(Стр);
	КонецЦикла;
	
	// Если вдруг, что-то пошло не по плану и остались не распределенные остатки,
	// То оставшиеся остатки добавим в ТаблицуСЗаполненнымиПартиями, по таким остаткам будет заполнено только количество
	ОтборНеРаспределенныхСтрок = Новый Структура;
	ОтборНеРаспределенныхСтрок.Вставить("НайденаПартия", Ложь);
	НеРаспределенныеСтроки = ТаблицаСПолнойАналитикой.НайтиСтроки(ОтборНеРаспределенныхСтрок);
	Для Каждого Стр Из НеРаспределенныеСтроки Цикл
		НоваяСтрокаСПартией = ТаблицаСЗаполненнымиПартиями.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСПартией,Стр);
		ЗаполнитьДопПараметрыСтрокиПартии(НоваяСтрокаСПартией, Истина, Ложь, Ложь, Ложь, Ложь);  
		НоваяСтрокаСпартией.Количество			 = Стр.ОсталосьКРаспределению;
		НоваяСтрокаСПартией.Партия				 = Неопределено;
		НоваяСтрокаСПартией.НетПартииНаОстатках = Истина;
		Стр.НайденаПартия = Истина;
	КонецЦикла;

	ДлительныеОперации.СообщитьПрогресс(, Символы.ПС +НСтр("ru='Выполняется формирование документов (50%)...'"));
	
	// Если в качестве партии выступали комплектации, то для комплектующих надо идентифицировать документ партии
	ОтборКомплектаций = Новый Структура;
	ОтборКомплектаций.Вставить("ЭтоКомплектация", Истина);
	СтрокиКомплектации = ТаблицаСЗаполненнымиПартиями.НайтиСтроки(ОтборКомплектаций); 
	
	ПартииДляКомплектующих = ТаблицаКомплектаций.СкопироватьКолонки();
	ПартииДляКомплектующих.Колонки.Удалить("КоличествоКомплектующие");
	ПартииДляКомплектующих.Колонки.Удалить("Комплектующие");
	ПартииДляКомплектующих.Колонки.Добавить("ИД");
	ПартииДляКомплектующих.Колонки.Добавить("Партия", СтруктураОписанийТипов.ОписаниеТиповПартия); 
	ПартииДляКомплектующих.Колонки.Добавить("ИскатьСуммуНДС");
	ПартииДляКомплектующих.Колонки.Добавить("ИскатьДопРасходы");
	ПартииДляКомплектующих.Колонки.Добавить("НетПартииНаОстатках");
	
	
	Для каждого Строка Из СтрокиКомплектации Цикл
		ОтборПоКомплектации = Новый Структура;
		ОтборПоКомплектации.Вставить("Комплектация", Строка.Партия);
		СтрокиСКомплектующими = ТаблицаКомплектаций.НайтиСтроки(ОтборПоКомплектации);
		Для каждого СтрКомплектующая Из СтрокиСКомплектующими Цикл
			Если Строка.Количество < СтрКомплектующая.Количество Тогда 
				КоличествоКомплектующихКРаспределению = Окр(СтрКомплектующая.КоличествоКомплектующие / СтрКомплектующая.Количество * Строка.Количество,2);
			Иначе
				КоличествоКомплектующихКРаспределению = СтрКомплектующая.КоличествоКомплектующие;
			КонецЕсли;
			ПараметрыОтбораПартии = Новый Структура;
			ПараметрыОтбораПартии.Вставить("Номенклатура", СтрКомплектующая.Комплектующие);
			ПараметрыОтбораПартии.Вставить("Счет", СтрКомплектующая.СчетУчета);
			
			ПараметрыДляДопРаспределенияПоПартиям.ЭтоКомплектация	= Истина;
			ПараметрыДляДопРаспределенияПоПартиям.ИД				= Строка.ИД;
			
			УчетНДСПоОстаткам.РаспределитьПоПартиямДополнительно(ПараметрыОтбораПартии,
												ТаблицаСДокументамиДвижений, ПартииДляКомплектующих, 
												КоличествоКомплектующихКРаспределению, СтрКомплектующая, 
												ПараметрыДляДопРаспределенияПоПартиям);
		КонецЦикла; 	
	КонецЦикла;	
		
	ДлительныеОперации.СообщитьПрогресс(, Символы.ПС +НСтр("ru='Выполняется формирование документов (60%)...'"));
	
	// На данный момент все партии найдены, необходимо к подобранным партиям найти данные по НДС
	// И найти доп расходы (ГТД на Импорт, Заявление о ввозе товаров и Поступление доп расходов
	// Подготовим таблицы с партиями и номенклатурой, по которым будет осуществлени поиск данных по НДС
	
	ПараметрыПоискаОсновныхСуммНДС = Новый Структура;
	ПараметрыПоискаОсновныхСуммНДС.Вставить("ИскатьСуммуНДС", Истина);
	ТЧПоискаНДС = ТаблицаСЗаполненнымиПартиями.Скопировать(ПараметрыПоискаОсновныхСуммНДС,"Номенклатура,Партия");
	
	ТЧПоискаНДСК = ПартииДляКомплектующих.Скопировать(ПараметрыПоискаОсновныхСуммНДС,"Номенклатура,Партия");
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТЧПоискаНДСК,ТЧПоискаНДС);
	
	ПараметрыПоискаДопСуммНДС = Новый Структура;
	ПараметрыПоискаДопСуммНДС.Вставить("ИскатьДопРасходы", Истина);
	ТЧПоискаДопРасходов = ТаблицаСЗаполненнымиПартиями.Скопировать(ПараметрыПоискаДопСуммНДС, "Номенклатура,Партия");
	
	ТЧПоискаДопРасходовК = ПартииДляКомплектующих.Скопировать(ПараметрыПоискаДопСуммНДС, "Номенклатура,Партия");
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТЧПоискаДопРасходовК,ТЧПоискаДопРасходов);
	
	ТЧПоискаНДС.Свернуть("Номенклатура, Партия");
	ТЧПоискаДопРасходов.Свернуть("Номенклатура, Партия");
	
	ТЧАвансовыйОтчетКакРасходы = Новый ТаблицаЗначений;
	ТЧАвансовыйОтчетКакРасходы.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЧАвансовыйОтчетКакРасходы.Колонки.Добавить("Партия", Новый ОписаниеТипов("ДокументСсылка.АвансовыйОтчет"));
	ТЧАвансовыйОтчетКакРасходы.Колонки.Добавить("Счет", Новый ОписаниеТипов ("ПланСчетовСсылка.Хозрасчетный"));
	
	
	СтруктураПараметровДляПолученияНДС = Новый Структура;
	СтруктураПараметровДляПолученияНДС.Вставить("Организация",				СтруктураПараметров.Организация);
	СтруктураПараметровДляПолученияНДС.Вставить("Период",					СтруктураПараметров.Период);
	СтруктураПараметровДляПолученияНДС.Вставить("СчетНДС",					СтруктураПараметров.СчетНДСПоУмолчанию);
	СтруктураПараметровДляПолученияНДС.Вставить("ДокументыПартий", 			ТЧПоискаНДС);
	СтруктураПараметровДляПолученияНДС.Вставить("ОснованияДляДопРасходов",	ТЧПоискаДопРасходов);
	СтруктураПараметровДляПолученияНДС.Вставить("АвансовыйОтчетКакРасходы",	ТЧАвансовыйОтчетКакРасходы);  
	СтруктураПараметровДляПолученияНДС.Вставить("СокращеннаяАналитика",		СтруктураПараметров.СокращеннаяАналитика);
	СтруктураПараметровДляПолученияНДС.Вставить("СуммыБезПредъявленыхСФ",	Ложь);
	
	СуммыПоНДС = УчетНДСПоОстаткам.ДанныеНДСПоДокументам(СтруктураПараметровДляПолученияНДС);
	ПараметрыДляВводаОстатков = СтруктураПараметровДляЗаполненияВНО();

	ПараметрыДляВводаОстатков.СуммыПоПоступлениям	= СуммыПоНДС[19].Выгрузить();
	ПараметрыДляВводаОстатков.СуммыДопРасходов		= СуммыПоНДС[11].Выгрузить(); 
	ПараметрыДляВводаОстатков.АВКакДопРасходы		= СуммыПоНДС[20].Выгрузить();
	ПараметрыДляВводаОстатков.ТаблицаОстатков		= ТаблицаСЗаполненнымиПартиями;
	ПараметрыДляВводаОстатков.ТаблицаКомплектующих	= ПартииДляКомплектующих;
	
	ДлительныеОперации.СообщитьПрогресс(, Символы.ПС +СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Выполняется формирование документов (70%) по организации ""%1"" ...'"), СтруктураПараметров.Организация));
	
	ЗаполнитьДокументыВводаОстатков(ПараметрыДляВводаОстатков, СтруктураПараметров, Истина);

КонецПроцедуры

Функция ЗаполнитьПоСчетам0708(СтруктураПараметров)
	
	СтруктураОписанийТипов = УчетНДСПоОстаткам.ПолучитьСтруктуруОписанийТипов();
	ПланСчетов = ПланыСчетов.Хозрасчетный;
	
	ТаблицыОстатковДвижений = ОстаткиПоСчетамКапВложений(СтруктураПараметров);
	
	ТаблицаОстатков 					= ТаблицыОстатковДвижений[11].Выгрузить();
	ТаблицаСборкаОборудования	 		= ТаблицыОстатковДвижений[2].Выгрузить();
	ТаблицаДвижений0807					= ТаблицыОстатковДвижений[7].Выгрузить();
	ТаблицаДвижений10					= ТаблицыОстатковДвижений[10].Выгрузить();
	
	ТаблицаОстатковПоПартиям = ТаблицаОстатков.СкопироватьКолонки(); 
	ТаблицаОстатковПоПартиям.Колонки.Удалить("Партия");
	ТаблицаОстатковПоПартиям.Колонки.Добавить("Партия",              Новый ОписаниеТипов(Документы.ТипВсеСсылки().Типы())); 
	ТаблицаОстатковПоПартиям.Колонки.Добавить("НуженДопПоиск",       Новый ОписаниеТипов("Булево"));
	ТаблицаОстатковПоПартиям.Колонки.Добавить("ИскатьСуммуНДС",      Новый ОписаниеТипов("Булево"));
	ТаблицаОстатковПоПартиям.Колонки.Добавить("ИскатьДопРасходы",    Новый ОписаниеТипов("Булево")); 
	ТаблицаОстатковПоПартиям.Колонки.Добавить("ИД",                  Новый ОписаниеТипов("УникальныйИдентификатор"));
	ТаблицаОстатковПоПартиям.Колонки.Добавить("НетПартииНаОстатках", Новый ОписаниеТипов("Булево"));
	ТаблицаОстатковПоПартиям.Колонки.Добавить("СчетПоступления",     Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ТаблицаОстатковПоПартиям.Колонки.Добавить("ЭтоКомплектация",     Новый ОписаниеТипов("Булево"));

	ТаблицаИспользованныхПартий = Новый ТаблицаЗначений;
	ТаблицаИспользованныхПартий.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаИспользованныхПартий.Колонки.Добавить("Счет",         Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ТаблицаИспользованныхПартий.Колонки.Добавить("Партия",       Новый ОписаниеТипов(Документы.ТипВсеСсылки().Типы()));
	ТаблицаИспользованныхПартий.Колонки.Добавить("Количество",   Новый ОписаниеТипов("Число"));
	
	// Использованные партии надо будет потом исключить, когда будем осуществляться заполнение остатков по счетам 10,41,45
	// Здесь материалы с 10 счета могут быть в требовании накладной и передаче оборудования в монтаж, как составные объекта строительства
	
	УчетНДСПоОстаткам.РаспределитьОстаткиВложенийПоПартиям(ТаблицаОстатков, ТаблицаДвижений0807, ТаблицаОстатковПоПартиям,
																СтруктураОписанийТипов, СтруктураПараметров);
	
	// Могут быть случаи, когда на счета 08.04.1, 07 были сделаны перемещения со счетов 10, 41
	// В этом случае надо искать партию поступления на счета, с которых осуществлялось перемещение
	СтруктураОписанийТипов = УчетНДСПоОстаткам.ПолучитьСтруктуруОписанийТипов();
	ПараметрыДляДопРаспределенияПоПартиям = ПараметрыДляДопРаспределенияПоПартиям();
	ПараметрыДляДопРаспределенияПоПартиям.СтруктураОписанийТипов = СтруктураОписанийТипов;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("НуженДопПоиск",   Истина);
	ПараметрыОтбора.Вставить("ЭтоКомплектация", Ложь);
	СтрокиТребующиеДопПоиска = ТаблицаОстатковПоПартиям.НайтиСтроки(ПараметрыОтбора);
	Для каждого Стр Из СтрокиТребующиеДопПоиска Цикл
		ПараметрыОтбораПартии = Новый Структура;
		ПараметрыОтбораПартии.Вставить("Номенклатура", Стр.Номенклатура);
		ПараметрыОтбораПартии.Вставить("Счет", 	       Стр.СчетПоступления); 
		КоличествоКРаспределению = Стр.Количество;  
		УчетНДСПоОстаткам.РаспределитьПоПартиямДополнительно(ПараметрыОтбораПартии, ТаблицаДвижений10,
											ТаблицаОстатковПоПартиям, КоличествоКРаспределению, Стр, 
											ПараметрыДляДопРаспределенияПоПартиям,
											ТаблицаИспользованныхПартий);
		ТаблицаОстатковПоПартиям.Удалить(Стр);
	КонецЦикла;

	ТаблицаКомплектующих = ТаблицаСборкаОборудования.СкопироватьКолонки();
	ТаблицаКомплектующих.Колонки.Добавить("ИД"); 	
	ТаблицаКомплектующих.Колонки.Добавить("Партия"); 
	ТаблицаКомплектующих.Колонки.Добавить("ИскатьСуммуНДС");
	ТаблицаКомплектующих.Колонки.Добавить("ИскатьДопРасходы");
	ТаблицаКомплектующих.Колонки.Добавить("Это10Счет");
	
	ПараметрыДляРаспределенияПоПартиямПоКомплектующим = ПараметрыДляРаспределенияПартийПоКомплектующим();
	ПараметрыДляРаспределенияПоПартиямПоКомплектующим.ТаблицаОстатковПоПартиям		= ТаблицаОстатковПоПартиям;
	ПараметрыДляРаспределенияПоПартиямПоКомплектующим.ТаблицаСборкаОборудования 	= ТаблицаСборкаОборудования;
	ПараметрыДляРаспределенияПоПартиямПоКомплектующим.ТаблицаДвижений10				= ТаблицаДвижений10;
	ПараметрыДляРаспределенияПоПартиямПоКомплектующим.ТаблицаДвижений0807			= ТаблицаДвижений0807;
	
	УчетНДСПоОстаткам.РаспределитьПоПартиямПоКомплектующим(ПараметрыДляРаспределенияПоПартиямПоКомплектующим,
															ТаблицаКомплектующих, ТаблицаИспользованныхПартий, СтруктураОписанийТипов);
	
	ПараметрыПоискаОсновныхСуммНДС = Новый Структура;
	ПараметрыПоискаОсновныхСуммНДС.Вставить("ИскатьСуммуНДС", Истина);
	ТЧПоискаНДС = ТаблицаОстатковПоПартиям.Скопировать(ПараметрыПоискаОсновныхСуммНДС,"Номенклатура,Партия");
	
	ТЧПоискаНДСК = ТаблицаКомплектующих.Скопировать(ПараметрыПоискаОсновныхСуммНДС,"Номенклатура,Партия");
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТЧПоискаНДСК,ТЧПоискаНДС);
	
	ПараметрыПоискаДопСуммНДС = Новый Структура;
	ПараметрыПоискаДопСуммНДС.Вставить("ИскатьДопРасходы", Истина);
	ТЧПоискаДопРасходов = ТаблицаОстатковПоПартиям.Скопировать(ПараметрыПоискаДопСуммНДС, "Номенклатура,Партия");
	
	ТЧПоискаДопРасходовК = ТаблицаКомплектующих.Скопировать(ПараметрыПоискаДопСуммНДС, "Номенклатура,Партия");
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТЧПоискаДопРасходовК,ТЧПоискаДопРасходов);
	
	ТЧАвансовыйОтчетКакРасходы = ТаблицаОстатковПоПартиям.Скопировать(ПараметрыПоискаОсновныхСуммНДС, "Номенклатура,Партия,Счет");
	
	ТЧПоискаНДС.Свернуть("Номенклатура, Партия");
	ТЧПоискаДопРасходов.Свернуть("Номенклатура, Партия");
	ТЧАвансовыйОтчетКакРасходы.Свернуть("Номенклатура, Партия, Счет");
	
	
	СтруктураПараметровДляПолученияНДС = Новый Структура;
	СтруктураПараметровДляПолученияНДС.Вставить("Организация",				СтруктураПараметров.Организация);
	СтруктураПараметровДляПолученияНДС.Вставить("Период",					СтруктураПараметров.Период);
	СтруктураПараметровДляПолученияНДС.Вставить("СчетНДС",					СтруктураПараметров.СчетНДСПоУмолчанию);
	СтруктураПараметровДляПолученияНДС.Вставить("ДокументыПартий", 			ТЧПоискаНДС);
	СтруктураПараметровДляПолученияНДС.Вставить("ОснованияДляДопРасходов",	ТЧПоискаДопРасходов);
	СтруктураПараметровДляПолученияНДС.Вставить("АвансовыйОтчетКакРасходы",	ТЧАвансовыйОтчетКакРасходы);
	СтруктураПараметровДляПолученияНДС.Вставить("СокращеннаяАналитика",		СтруктураПараметров.СокращеннаяАналитика);
	СтруктураПараметровДляПолученияНДС.Вставить("СуммыБезПредъявленыхСФ",	Ложь);
		
	ПараметрыДляВводаОстатков = СтруктураПараметровДляЗаполненияВНО();

	СуммыПоНДС = УчетНДСПоОстаткам.ДанныеНДСПоДокументам(СтруктураПараметровДляПолученияНДС);
	ПараметрыДляВводаОстатков.СуммыПоПоступлениям	= СуммыПоНДС[19].Выгрузить();
	ПараметрыДляВводаОстатков.СуммыДопРасходов		= СуммыПоНДС[11].Выгрузить(); 
	ПараметрыДляВводаОстатков.АВКакДопРасходы		= СуммыПоНДС[20].Выгрузить();
	ПараметрыДляВводаОстатков.ТаблицаОстатков	    = ТаблицаОстатковПоПартиям;
	ПараметрыДляВводаОстатков.ТаблицаКомплектующих	= ТаблицаКомплектующих;
	
	ЗаполнитьДокументыВводаОстатков(ПараметрыДляВводаОстатков, СтруктураПараметров, Ложь);
		
	
	Возврат ТаблицаИспользованныхПартий;
	
КонецФункции

#КонецОбласти