
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("АдресТаблицыУслуг") Тогда
		Возврат;
	КонецЕсли;
	ТаблицаУслуг = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыУслуг);   
	ТаблицаОсновныхУслугРазмещения.Загрузить(ТаблицаУслуг);
	ТаблицаОсновныхУслугРазмещения.Сортировать("НомерСтроки");
	УстановитьУсловноеОформление(); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда) 
	ВыбратьСтроку(); 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормы

&НаКлиенте
Процедура ТаблицаОсновныхУслугРазмещенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьСтроку(); 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьСтроку() 
	ТекущиеДанные = Элементы.ТаблицаОсновныхУслугРазмещения.ТекущиеДанные;
	Закрыть(ТекущиеДанные.ИдентификаторСтроки);
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТаблицаОсновныхУслугРазмещенияСодержание");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ТаблицаОсновныхУслугРазмещения.Содержание", ВидСравненияКомпоновкиДанных.НеЗаполнено, Истина);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

#КонецОбласти