
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если МобильныйКлиентБПКлиент.ЭтоМобильныйКлиент() Тогда
		МобильныйКлиентБПКлиент.ПоказатьФормуНедоступнаяФункциональность(
			"Оценить риски предстоящих проверок");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Отчет.КалендарьПроверокКонтролирующимиОрганами.Форма", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		Истина, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
