#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
//
// Возвращаемое значение: Массив(Строка) - массив имен реквизитов, образующих
//  естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	
	Результат.Добавить("Код");
	
	Возврат Результат;
	
КонецФункции

// Получает таблицу списка кодов ОКВЭД для определенной формы статистики.
//
// Параметры:
//  ОбъектНаблюдения - СправочникСсылка.ОбъектыСтатистическогоНаблюдения Или Неопределено.
//  ИмяОтчета - Строка Или Неопределено.
// 
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция ЭлементыКлассификатораИзМакета(ОбъектНаблюдения = Неопределено, ИмяОтчета = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ОбъектНаблюдения) И Не ЗначениеЗаполнено(ИмяОтчета) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ИмяОтчета = "РегламентированныйОтчетСтатистикаФорма1П"
		Или ОбъектНаблюдения <> Неопределено И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектНаблюдения, "Код") = "ПроизводствоИПродажи" Тогда
		ИмяОтчета = "РегламентированныйОтчетСтатистикаФорма1П";
		СписокВерсий = ИнтерфейсыВзаимодействияБРО.ПолучитьВерсииСписковОтчета(ИмяОтчета);
		Если СписокВерсий.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ИмяМакетаСписков = СписокВерсий[СписокВерсий.Количество() - 1].Значение;
		ЭлементыКлассификатораИзМакета = ЭлементыКлассификатораПроизводствоИПродажи(ИмяОтчета, ИмяМакетаСписков);
	Иначе
		ИмяСправочникаДетализации = "КлассификаторВидовЭкономическойДеятельности";
		ПараметрыКлассификатора = ИнтерфейсыВзаимодействияБРО.ПолучитьРасположениеКлассификатораСтатистики(ИмяСправочникаДетализации);
		ДополнятьКодПриЧтенииДанныхКлассификатора = Справочники[ИмяСправочникаДетализации].ДополнятьКодПриЧтенииДанныхКлассификатора();
		ДлинаКодаСправочника = Метаданные.Справочники[ИмяСправочникаДетализации].ДлинаКода;
		
		СписокВерсий = ИнтерфейсыВзаимодействияБРО.ПолучитьВерсииСписковОтчета(ПараметрыКлассификатора.ОтчетИсточникДанных);
		Если СписокВерсий.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ИмяМакетаСписков = СписокВерсий[СписокВерсий.Количество() - 1].Значение;
		ЭлементыКлассификатораИзМакета = ИнтерфейсыВзаимодействияБРО.ПолучитьЗначенияИзСпискаВыбораОтчета(
			ПараметрыКлассификатора.ОтчетИсточникДанных,
			ИмяМакетаСписков,
			ПараметрыКлассификатора.ОбластьИсточникДанных,
			ДополнятьКодПриЧтенииДанныхКлассификатора,
			ДлинаКодаСправочника);
	КонецЕсли;
	
	Возврат ЭлементыКлассификатораИзМакета;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭлементыКлассификатораПроизводствоИПродажи(ИмяОтчета, ИмяМакетаСписков)
	
	ИмяСписка = "ОКВЭД8_9";
	МакетСоставаПоказателей = Отчеты[ИмяОтчета].ПолучитьМакет(ИмяМакетаСписков);
	Список = МакетСоставаПоказателей.Области.Найти(ИмяСписка);
	
	ТаблицаСписка = Новый ТаблицаЗначений;
	Если Список = Неопределено Тогда
		Возврат ТаблицаСписка;
	КонецЕсли;
	
	Если Список.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Строки Тогда
		
		ВерхОбласти = Список.Верх;
		НизОбласти = Список.Низ;
		
		ТаблицаСписка.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20)));
		ТаблицаСписка.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(255)));
		
		Для НомСтр = ВерхОбласти По НизОбласти Цикл
			КодПоказателя = СокрП(МакетСоставаПоказателей.Область(НомСтр, 1).Текст);
			
			НовСтрока = ТаблицаСписка.Добавить();
			НовСтрока.Код = КодПоказателя;
			НовСтрока.Наименование = СокрП(МакетСоставаПоказателей.Область(НомСтр, 2).Текст);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаСписка;
	
КонецФункции

#КонецОбласти

#КонецЕсли