#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает первую найденную настройку рассылки запросов на сверку. Если настроек еще нет, то создает
// поставляемые варианты.
// Если настроек несколько, то приоритет более "безопасной" - той, которая только отправляет запросы,
// но не создает и не отправляет акты сверки или список неполученных оригиналов.
// Параметры:
//   Организация - СправочникСсылка.Организации - организация, для которой требуется получить настройки рассылки
//                 запросов на сверку с контрагентами.
//                 Если требуется создать настройки, то учитывает особенности организации
//                 (например, нужно ли в тексте письма указывать параметры ЭДО).
//
// Возвращаемое значение:
//   СправочникСсылка.НастройкиРассылкиЗапросовНаСверку - первая настройка рассылки запросов на сверку
//   Неопределено - если настроек нет
//
Функция НастройкаПоУмолчанию(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Настройки.Ссылка КАК Ссылка,
	|	Настройки.ПорядокСверки = ЗНАЧЕНИЕ(Перечисление.ПорядокСверкиРасчетовСКонтрагентами.ЗапроситьАктСверки) КАК
	|		ЗапроситьАктСверки,
	|	Настройки.СпособЗапросаПоЭДО = ЗНАЧЕНИЕ(Перечисление.СпособыЗапросаСверкиЭДО.ОтправитьАктСверки) КАК
	|		ОтправитьАктСверкиПоЭДО,
	|	Настройки.ЗапрашиватьОригиналы КАК ЗапрашиватьОригиналы
	|ИЗ
	|	Справочник.НастройкиРассылкиЗапросовНаСверку КАК Настройки
	|ГДЕ
	|	НЕ Настройки.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗапроситьАктСверки,
	|	ОтправитьАктСверкиПоЭДО,
	|	ЗапрашиватьОригиналы,
	|	Настройки.Ссылка";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		// Блокируем весь справочник, чтобы избежать создания элементов конкурирующими сеансами
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.НастройкиРассылкиЗапросовНаСверку");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Настройка = Выборка.Ссылка;
		Иначе
			Настройки = СоздатьТиповыеНастройкиРассылки(Организация);
			Настройка = Настройки.ЗапроситьАкты;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
		
		ОтменитьТранзакцию();
		ТекстОшибки = ОписаниеОшибки().ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Настройки рассылки запросов на сверку'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка, , , 
			ТекстОшибки);
			
		ВызватьИсключение ТекстОшибки;
	
	КонецПопытки;
	
	Возврат Настройка;
	
КонецФункции

// Возвращает html-текст шаблона по его имени
// Параметры:
//   ИмяШаблона - Строка - имя шаблона
//
// Возвращаемое значение:
//   Строка - html-текст шаблона
//
Функция ТекстШаблона(ИмяШаблона) Экспорт
	
	Шаблон = ПолучитьМакет(ИмяШаблона);
	Возврат Шаблон.ПолучитьТекст();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НачальноеЗаполнение

Функция СоздатьТиповыеНастройкиРассылки(Организация)

	Настройки = Новый Структура("ЗапроситьАкты, ОтправитьАкты");

	ИспользуетсяОбменЭлектроннымиДокументами = НастройкиЭДО.ИспользуетсяОбменЭлектроннымиДокументами()
		И СинхронизацияЭДО.ЕстьУчетныеЗаписи(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация));
	
	ДоступныеФорматы = УправлениеПечатью.НастройкиФорматовСохраненияТабличногоДокумента();
	ФорматыПриложений = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДоступныеФорматы[0].ТипФайлаТабличногоДокумента);
	
	// 1. "Запросить акты"
	ЗапроситьАкты = СоздатьЭлемент();
	ЗапроситьАкты.Наименование = НСтр("ru='Запросить акты'");
	ЗапроситьАкты.ПорядокСверки = Перечисления.ПорядокСверкиРасчетовСКонтрагентами.ЗапроситьАктСверки;
	
	ЗапроситьАкты.ШаблонТемы = ТекстШаблона("ШаблонТемы_ЗапроситьАкт");
	Если ИспользуетсяОбменЭлектроннымиДокументами Тогда
		ЗапроситьАкты.ШаблонПисьма = ТекстШаблона("ШаблонПисьма_ЗапроситьАкт");
	Иначе
		ЗапроситьАкты.ШаблонПисьма = ТекстШаблона("ШаблонПисьма_ЗапроситьАкт_НетЭДО");
	КонецЕсли;
	
	ЗапроситьАкты.ФорматыВложенийАктаСверки = Новый ХранилищеЗначения(ФорматыПриложений);
	ЗапроситьАкты.ФорматыВложенийНеПолученыОригиналы = Новый ХранилищеЗначения(ФорматыПриложений);
	
	ЗапроситьАкты.СпособЗапросаПоЭДО = Перечисления.СпособыЗапросаСверкиЭДО.ОтправитьПисьмо;
	
	ЗапроситьАкты.Записать();
	
	Настройки.ЗапроситьАкты = ЗапроситьАкты.Ссылка;

	// 2. "Запросить сверку (отправить акты)"
	ОтправитьАкты = СоздатьЭлемент();
	ОтправитьАкты.Наименование = НСтр("ru='Запросить сверку (отправить акты)'");
	ОтправитьАкты.ПорядокСверки = Перечисления.ПорядокСверкиРасчетовСКонтрагентами.ОтправитьНашАктСверки;
	
	ОтправитьАкты.ШаблонТемы = ТекстШаблона("ШаблонТемы_ОтправитьАкт");
	Если ИспользуетсяОбменЭлектроннымиДокументами Тогда
		ОтправитьАкты.ШаблонПисьма = ТекстШаблона("ШаблонПисьма_ОтправитьАкт");
	Иначе
		ОтправитьАкты.ШаблонПисьма = ТекстШаблона("ШаблонПисьма_ОтправитьАкт_НетЭДО");
	КонецЕсли;
	
	ОтправитьАкты.ФорматыВложенийАктаСверки = Новый ХранилищеЗначения(ФорматыПриложений);
	ОтправитьАкты.ФорматыВложенийНеПолученыОригиналы = Новый ХранилищеЗначения(ФорматыПриложений);
	
	ОтправитьАкты.СпособЗапросаПоЭДО = Перечисления.СпособыЗапросаСверкиЭДО.ОтправитьПисьмо;
	
	ОтправитьАкты.Записать();
	
	Настройки.ОтправитьАкты = ОтправитьАкты.Ссылка;
	
	Возврат Настройки;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли