#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Взаимодействия.УстановитьПредметПоДаннымЗаполнения(Параметры, Предмет);
	КонецЕсли;
	
	Взаимодействия.ПодготовитьОповещения(ЭтотОбъект, Параметры);
	
	Если Параметры.Свойство("ДанныеУчастника") И Объект.Контрагент <> Параметры.ДанныеУчастника.Контакт Тогда
		ЗаполнитьНаОснованииУчастника(Параметры.ДанныеУчастника);
	КонецЕсли;
	
	Если Параметры.Свойство("ЗначенияЗаполнения") И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения) Тогда
		ЗначенияЗаполнения = Параметры.ЗначенияЗаполнения;
		Если ТипЗнч(ЗначенияЗаполнения) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(Объект, ЗначенияЗаполнения);
			
			Если ЗначенияЗаполнения.Свойство("ПредметВзаимодействия")
				И ЗначениеЗаполнено(ЗначенияЗаполнения.ПредметВзаимодействия) Тогда
				Предмет = ЗначенияЗаполнения.ПредметВзаимодействия;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	ВзаимодействияФормыБП.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
			
	СписокВыборкаАдресовЭлектроннойПочты = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Параметры, "СписокАдресовЭлектроннойПочты");

	Если СписокВыборкаАдресовЭлектроннойПочты <> Неопределено Тогда
		Элементы.ЭлектроннаяПочтаКонтактногоЛица.СписокВыбора.ЗагрузитьЗначения(
			СписокВыборкаАдресовЭлектроннойПочты.ВыгрузитьЗначения());
			Элементы.ЭлектроннаяПочтаКонтактногоЛица.КнопкаВыпадающегоСписка = СписокВыборкаАдресовЭлектроннойПочты.Количество() > 1;
	КонецЕсли;
	
	ИзменилисьКонтакты = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПроверитьЗаполнениеРеквизитов(Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Предмет = Предмет;
	Взаимодействия.ПередЗаписьюВзаимодействияИзФормы(ЭтотОбъект, ТекущийОбъект, ИзменилисьКонтакты);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("ИзмененоСостояниеЛидов") Тогда
		ПараметрыЗаписи.Вставить("ИзмененоСостояниеЛидов", ТекущийОбъект.ДополнительныеСвойства.ИзмененоСостояниеЛидов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ИзмененоСостояниеЛидов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыЗаписи, "ИзмененоСостояниеЛидов", Ложь);
	Если ИзмененоСостояниеЛидов Тогда
		ОповеститьОбИзменении(Тип("СправочникСсылка.КонтактныеЛица"));
		Оповестить("ИзмененоСостояниеЛидов", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.КонтактноеЛицо));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтактноеЛицоПриИзменении(Элемент)
	
	ОчиститьКонтактнуюИнформацию();
	Если ЗначениеЗаполнено(Объект.КонтактноеЛицо) Тогда
		УстановитьКонтактнуюИнформацию();
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьПротоколВстречи(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Модифицированность Тогда
		ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ПроверкаДокументаЗавершение",
			ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Документ не записан. Записать?'");
		ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ПараметрыФормы = ПараметрыФормыВзаимодействия();
		ВзаимодействияКлиентБП.СоздатьПисьмо(ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеРеквизиты(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("Ответственный", Объект.Ответственный);
	СтруктураЗаполнения.Вставить("Тема", Объект.Тема);
	СтруктураЗаполнения.Вставить("Описание", Объект.Описание);
	СтруктураЗаполнения.Вставить("Контрагент", Объект.Контрагент);
	СтруктураЗаполнения.Вставить("КонтактноеЛицо", Объект.КонтактноеЛицо);
	АдресаТаблиц =  АдресаТаблиц();
	СтруктураЗаполнения.Вставить("Участники", АдресаТаблиц.Участники);
	
	СтруктураЗаполнения.Вставить("ПредметВзаимодействия", Предмет);
	
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", СтруктураЗаполнения);
	ОткрытьФорму("Документ.Встреча.ФормаОбъекта", ПараметрыФормы, ВладелецФормы);
	
	Модифицированность = Ложь;
	
	Закрыть();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьКонтактнуюИнформацию()
	
	ВзаимодействияФормыБП.УстановитьКонтактнуюИнформацию(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКонтактнуюИнформацию()
	
	Объект.Участники.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаДокументаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если Записать() Тогда
		
		ПараметрыФормы = ПараметрыФормыВзаимодействия();
		ВзаимодействияКлиентБП.СоздатьПисьмо(ПараметрыФормы);
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыФормыВзаимодействия()
	
	ЭлектроннаяПочта = "";
	
	Если Объект.Участники.Количество() > 0 Тогда
		ЭлектроннаяПочта = Объект.Участники[0].КакСвязаться;
	КонецЕсли;
	
	ПараметрыФормыВзаимодействия = ВзаимодействияКлиентБП.ПараметрыФормыНовогоПисьмаНаОсновании(ЭтотОбъект, ЭлектроннаяПочта);
	
	Возврат ПараметрыФормыВзаимодействия;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНаОснованииУчастника(ДанныеУчастника)
	
	Если ТипЗнч(ДанныеУчастника.Контакт) = Тип("СправочникСсылка.Контрагенты") Тогда
		Объект.Контрагент = ДанныеУчастника.Контакт;
		Объект.КонтактноеЛицо = Справочники.КонтактныеЛица.КонтактноеЛицоПоУмолчанию(ДанныеУчастника.Контакт);
	ИначеЕсли ТипЗнч(ДанныеУчастника.Контакт) = Тип("СправочникСсылка.КонтактныеЛица") Тогда
		Объект.КонтактноеЛицо = ДанныеУчастника.Контакт;
		Объект.Контрагент = 
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеУчастника.Контакт, "ОбъектВладелец");
	КонецЕсли;
	
	Если Объект.Участники.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Участник = Объект.Участники.Добавить();
	
	Если ПустаяСтрока(ДанныеУчастника.КакСвязаться) Тогда
		
		УстановитьКонтактнуюИнформацию();
		
	Иначе
		Участник.Контакт = ДанныеУчастника.Контакт;
		Участник.ПредставлениеКонтакта = Строка(ДанныеУчастника.Контакт);
		Участник.ЭлектроннаяПочта = ДанныеУчастника.КакСвязаться;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция АдресаТаблиц()
	АдресаТаблиц = Новый Структура;
	АдресаТаблиц.Вставить("Участники", ПоместитьВоВременноеХранилище(Объект.Участники.Выгрузить(),
		Новый УникальныйИдентификатор()));
	Возврат АдресаТаблиц;
КонецФункции

&НаКлиенте
Процедура ПроверитьЗаполнениеРеквизитов(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.Тема) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, , НСтр("ru = 'Тема'"));
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				ТекстСообщения,
				,
				"Тема",
				"Объект",
				Отказ);
			КонецЕсли; 
			
	Если Не ЗначениеЗаполнено(Объект.Описание) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, , НСтр("ru = 'Описание события'"));
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				ТекстСообщения,
				,
				"Описание",
				"Объект",
				Отказ);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Контрагент)
		И Не ЗначениеЗаполнено(Объект.КонтактноеЛицо) Тогда
				
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, , НСтр("ru = 'Контактное лицо'"));
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				ТекстСообщения,
				,
				"КонтактноеЛицо",
				"Объект",
				Отказ);
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

