
#Область СлужебныеПроцедурыИФункции

Процедура ПечатьДокументовВыполнитьКоманду(Форма, Команда) Экспорт
	
	СсылкаНаОбъект = Неопределено;
	Если Форма.Параметры.Свойство("ПараметрКоманды")
			И ТипЗнч(Форма.Параметры.ПараметрКоманды) = Тип("Массив")
			И ЗначениеЗаполнено(Форма.Параметры.ПараметрКоманды) Тогда
		СсылкаНаОбъект = Форма.Параметры.ПараметрКоманды[0];
	КонецЕсли;
	
	ПараметрыВыполненияКоманды = Новый Структура("Источник", Форма);
	
	Если Команда.Имя = "ОтправитьДокументПоЭлектроннойПочте" Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьПечатныеФормыПоПочтеНастройкаУчетнойЗаписиПредложена", Форма);
		РаботаСПочтовымиСообщениямиКлиент.ПроверитьНаличиеУчетнойЗаписиДляОтправкиПочты(ОписаниеОповещения);
	ИначеЕсли Команда.Имя = "ОтправитьСсылкуНаДокумент" И ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ИнтеграцияShareКлиент.ПоделитьсяДокументом(СсылкаНаОбъект, ПараметрыВыполненияКоманды);
	ИначеЕсли Команда.Имя = "ОтправитьЭлектронныйДокументПоЭДО" И ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ЭлектронныеДокументыЭДОКлиент.СформироватьПодписатьОтправитьЭД(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СсылкаНаОбъект), ПараметрыВыполненияКоманды);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьДокументПоЭлектроннойПочте(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяФормыДокумента" , ПараметрыВыполненияКоманды.Форма.ИмяФормы);
	ПараметрыФормы.Вставить("ОбъектыОтправки"   , ПараметрКоманды);
	
	ОткрытьФорму("ОбщаяФорма.ОтправкаДокументовПоЭлектроннойПочте", ПараметрыФормы);
	
КонецПроцедуры

Процедура ОтправитьСсылкуНаДокумент(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	ИнтеграцияShareКлиент.ПоделитьсяДокументом(ПараметрКоманды, ПараметрыВыполненияКоманды);
	
КонецПроцедуры

Процедура ОтправитьЭлектронныйДокументПоЭДО(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьЭлектронныйДокументОбъектаУчетаКоманда(ПараметрКоманды);
	
КонецПроцедуры

Процедура ОтправитьПроизвольныйДокументПоЭДО(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьНовыйПроизвольныйЭлектронныйДокументНаОсновании(ПараметрКоманды);
	
КонецПроцедуры

#КонецОбласти
