#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПрочитатьРеквизитыФормы(ЭтотОбъект);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрочитатьРеквизитыФормы(ЭтотОбъект);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ПрочитатьРеквизитыФормы(Форма)
	
	Запись = Форма.Запись;
	
	Форма.ДатаИзменения = МестноеВремя(Запись.ДатаИзменения, ЧасовойПоясСеанса());
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Запись = Форма.Запись;
	Элементы = Форма.Элементы;
	
	Элементы.ДатаИзменения.Заголовок = ЗаголовокДатаИзменения(Запись.Статус);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокДатаИзменения(Знач Статус)
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыОповещенийПлатформыСамозанятые.НеПрочитано") Тогда
		Возврат НСтр("ru = 'Отправлено'");
	Иначе
		Возврат Строка(Статус);
	КонецЕсли;
	
КонецФункции

#КонецОбласти
