
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием(ПараметрыВыполненияКоманды);
	ПараметрыОткрытия.Заголовок               = НСтр("ru = 'Заявления о ввозе товаров'");
	ПараметрыОткрытия.ИмяФормы                = "Документ.ЗаявлениеОВвозеТоваров.ФормаСписка";
	ПараметрыОткрытия.Уникальность            = "ФормаСписка_ЗаявлениеОВвозеТоваров";
	ПараметрыОткрытия.ЗамерПроизводительности = "СозданиеФормыСпискаЗаявлениеОВвозеТоваров";
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок",   ПараметрыОткрытия.Заголовок);
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийВвозТоваровИзЕАЭС.ЗаявлениеОВвозе"));
	
	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыФормы);

КонецПроцедуры
