#Область ОписаниеПеременных

&НаКлиенте
Перем ОткрытыеФормы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ОчередьЧековККТ.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьФискальныйРегистратор")
		И ПолучитьФункциональнуюОпцию("УчетЗарплатыИКадровВоВнешнейПрограмме");
	
	МобильныйКлиентАдаптацияФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИнвентаризацияКассы(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ИнвентаризацияКассы.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КассовыеДокументы(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("ЖурналДокументов.Деньги.Форма.КассовыеДокументы",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацииПоПлатежнымКартам(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ОплатаПлатежнойКартой.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДенежныеДокументы(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("ЖурналДокументов.ДенежныеДокументы.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПробитыеКассовыеЧеки(Команда)
	
	ПараметрыФормы = Новый Структура("Заголовок", НСтр("ru = 'Пробитые кассовые чеки'"));
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы(
		"РегистрСведений.ФискальныеОперации.Форма.ФормаПросмотраФискальныхОпераций",
			ЭтотОбъект, ПараметрыФормы, , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчередьЧековККТ(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("РегистрСведений.ОчередьЧековККТ.Форма.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанели(ЭтотОбъект,
		"КассовыеДокументы,ОперацииПоПлатежнымКартам");
	
КонецПроцедуры

#КонецОбласти
