
#Область ПрограммныйИнтерфейс

Функция СчетНаОплатуПокупателюПредставление(СчетНаОплатуПокупателю) Экспорт
	Если НЕ ЗначениеЗаполнено(СчетНаОплатуПокупателю) Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	РеквизитыСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		СчетНаОплатуПокупателю, 
		"Дата, Номер");

	Возврат РеализацияТоваровУслугФормы.ПредставлениеСчетаНаОплату(РеквизитыСчета);
КонецФункции

Функция ОстатокТовараПоСчету(Номенклатура, СчетНаОплатуПокупателю, Регистратор) Экспорт
	МассивСчетов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СчетНаОплатуПокупателю);
	
	РеализацииПоСчету = Документы.СчетНаОплатуПокупателю.РеализацииПоСчетам(МассивСчетов);
	
	СтрокиКУдалению = РеализацииПоСчету.НайтиСтроки(Новый Структура("Реализация", Регистратор));
	Для каждого Строка Из СтрокиКУдалению Цикл
		РеализацииПоСчету.Удалить(Строка);
	КонецЦикла;
	
	// Товары и услуги
	ТоварыУслугиКРеализации = Документы.СчетНаОплатуПокупателю.ТоварыУслугиКРеализацииПоСчету(
		СчетНаОплатуПокупателю, РеализацииПоСчету);
		
	СтрокаНоменклатура = ТоварыУслугиКРеализации.Найти(Номенклатура, "Номенклатура");
	Если СтрокаНоменклатура <> Неопределено Тогда
		Возврат СтрокаНОменклатура.Количество;
	Иначе
		Возврат 0;
	КонецЕсли; 
КонецФункции

Функция EстьРеализацияВЕАЭС( Знач СтранаРеализации, Знач Контрагент) Экспорт
	
	Если ЗначениеЗаполнено(СтранаРеализации) Тогда
		Возврат Справочники.СтраныМира.ГосударствоЧленТаможенногоСоюза(СтранаРеализации);
	КонецЕсли;
	
	Возврат Справочники.Контрагенты.КонтрагентРезидентТаможенногоСоюза(Контрагент);
	
КонецФункции

Функция ОписаниеТипаРеквизитаДокументОприходования() Экспорт
	
	Возврат Метаданные.Документы.РеализацияТоваровУслуг.ТабличныеЧасти.Товары.Реквизиты.ДокументОприходования.Тип;
	
КонецФункции

Функция ОписаниеТипаРеквизитаДокументАванса() Экспорт
	
	Возврат Метаданные.Документы.РеализацияТоваровУслуг.ТабличныеЧасти.ЗачетАвансов.Реквизиты.ДокументАванса.Тип
	
КонецФункции

#Область РаботаСАдресами

Функция ПредставлениеКонтактнойИнформации(КонтактнаяИнформация) Экспорт
	Возврат УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформации(КонтактнаяИнформация);
КонецФункции

Процедура ПроверитьАдрес(АдресДоставки, АдресДоставкиЗначение) Экспорт
	Если ПредставлениеКонтактнойИнформации(АдресДоставкиЗначение) = АдресДоставки Тогда
		Возврат;
	КонецЕсли;
	
	АдресДоставкиЗначение = "";
КонецПроцедуры

#КонецОбласти

#Область РаботасЭТрН

Функция РеквизитыЭТрН(Основание) Экспорт
	Возврат ОбменСКонтрагентамиБП.РеквизитыЭТрН(Основание);
КонецФункции

Функция НастроенОбменЭПД(Организация, Грузополучатель, Перевозчик) Экспорт
	Возврат ОбменСГИСЭПДБП.ДокументооборотНастроен(Организация, Грузополучатель) 
		  И ОбменСГИСЭПДБП.ДокументооборотНастроен(Организация, Перевозчик);
КонецФункции

#КонецОбласти

#КонецОбласти
