#Область ОБработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	
	Если (НЕ ЗначениеЗаполнено(Объект.ВидНоменклатуры))
		И (ЗначениеЗаполнено(Объект.Родитель)) Тогда
		Объект.ВидНоменклатуры = РодительПриИзмененииНаСервере(Объект.Родитель);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция РодительПриИзмененииНаСервере(Родитель)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родитель, "ВидНоменклатуры");
	
КонецФункции

#КонецОбласти

