
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	

	Если ДополнительныеСвойства.Свойство("ФайлыРегистраУчета") Тогда
		
		ФайлыРегистраУчета = ДополнительныеСвойства.ФайлыРегистраУчета;
		
		ОписаниеФайлаРегистраУчета = ФайлыРегистраУчета[0];
		
		ФорматСохраненияПервогоФайла = Перечисления.ФорматыСохраненияОтчетов.MXL;
		
		ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(Описание);
		
		ПараметрыФайла = Новый Структура();
		ПараметрыФайла.Вставить("Автор", Пользователи.ТекущийПользователь());
		ПараметрыФайла.Вставить("ВладелецФайлов", Ссылка);
		ПараметрыФайла.Вставить("ИмяБезРасширения", ИмяФайла);
		ПараметрыФайла.Вставить("РасширениеБезТочки", ОписаниеФайлаРегистраУчета.Расширение);
		ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Дата);
		
		ДобавленныйФайл = РаботаСФайлами.ДобавитьФайл(
			ПараметрыФайла, ОписаниеФайлаРегистраУчета.ПутьКФайлуВоВременномХранилище, "", Описание);
			
		Если ФайлыРегистраУчета.Количество() > 1 Тогда
				
			ОписаниеФайлаРегистраУчета = ФайлыРегистраУчета[1];

			ПараметрыФайла.Вставить("РасширениеБезТочки", ОписаниеФайлаРегистраУчета.Расширение);
			ДобавленныйФайл = РаботаСФайлами.ДобавитьФайл(
				ПараметрыФайла, ОписаниеФайлаРегистраУчета.ПутьКФайлуВоВременномХранилище, "", Описание);
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		ЭтотОбъект.Дата = ТекущаяДатаСеанса();
		ЭтотОбъект.ФорматСохраненияФайла = Документы.РегистрУчета.ПолучитьФорматСохраненияРегистров();
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
