#Область ПрограммныйИнтерфейс

// Рассчитывает показатели баланса организации за период. Рассчитываются показатели всей организации (включая
// филиалы, данные которых доступны пользователю) в разрезе филиалов. При использовании функции для сравнительного
// анализа данных текущего и предыдущих периодов необходимо соблюдать следующие два правила: данные текущего периода
// необходимо получать без учета движений межотчетного периода (ВключаяМежотчетныйПериод = Ложь); данные предыдущих
// периодов необходимо получать с учетом движений межотчетного периода (ВключаяМежотчетныйПериод = Истина). Выполнение
// этих правил минимизирует расхождение данных смежных лет, между которыми изменились правила учета, в том числе
// изменился стандарт учета. Если правила учета изменились в конце предыдущего года, то получаемые на конец предыдущего
// года данные будут приведены к ним. Если правила учета изменились в конце текущего года, то получаемые на конец
// текущего года данные будут соответствовать действующим в этом году положениям. Таким образом, обеспечивается
// максимальное приведение данных разных лет к одним правилам учета.
// 
// Параметры:
//  Период - Дата
//  Организация - СправочникСсылка.Организации
//  ТолькоГруппыПоказателей - Булево - Ложь, если нужно включить детальные показатели (не имеющие кодов показателей)
//  ВключаяМежотчетныйПериод - Булево - Истина, если нужно учитывать движения межотчетного периода
//  ДатаУчетнойПолитики - Дата - дата, на которую определяются настройки учетной политики
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. НовыйЗначенияПоказателей
//
Функция ПоказателиБаланс(Период, Организация, ТолькоГруппыПоказателей = Истина, ВключаяМежотчетныйПериод = Ложь, ДатаУчетнойПолитики = '00010101') Экспорт
	
	ЗначенияПоказателей = НовыйЗначенияПоказателей();
	
	ДоступныеОрганизации = ОбщегоНазначенияБПВызовСервераПовтИсп.ВсеОрганизацииДанныеКоторыхДоступныПоRLS(Ложь);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВсяОрганизация = Справочники.Организации.ВсяОрганизация(Организация, Период);
	
	НедоступныеОрганизации = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ВсяОрганизация, ДоступныеОрганизации);
	ОрганизацииДляЗаполнения = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ВсяОрганизация, НедоступныеОрганизации);
	
	ДатаКонцаПериода = КонецМесяца(Период);
	Если ЗначениеЗаполнено(ДатаУчетнойПолитики) Тогда
		КонецОтчетногоПериода = ДатаУчетнойПолитики;
	Иначе
		КонецОтчетногоПериода = ДатаКонцаПериода;
	КонецЕсли;
	АвансыРазделеныПоВидамАктивов = РегламентированнаяОтчетность.АвансыРазделеныПоВидамАктивов(Организация, Период);
	СчетаСРеквизитами = ЗаполнениеБухгалтерскойОтчетностиИтоги.СчетаСРеквизитами();
	ПараметрыСчетов      = ПараметрыСчетов_Баланс2025Кв1();
	
	Для Каждого Филиал Из ОрганизацииДляЗаполнения Цикл
		
		ПараметрыЗаполнения = НовыеПараметрыЗаполненияБаланс();
		ПараметрыЗаполнения.Организация = Филиал;
		// Механика получения итогов не может определить итоги только на конец периода,
		// она для удобства разработчика всегда заодно получает сальдо на начало периода и обороты за период.
		// Для сокращения негативного влияния этой особенности реализации на производительность, передаем такую дату,
		// чтобы получение ненужных данных с большей вероятностью сводилось к чтению из тех же записей физической таблицы итогов,
		// что содержат и нужные данные.
		ПараметрыЗаполнения.НачалоПериодаОтчета   = НачалоМесяца(ДатаКонцаПериода);
		Уточнение = 0;
		Если ВключаяМежотчетныйПериод Тогда
			Уточнение = БухгалтерскийУчет.ВерхняяГраницаУточненияПериода();
		КонецЕсли;
		ПараметрыЗаполнения.КонецПериодаОтчета    = Новый МоментВремениСУточнениемПериода(ДатаКонцаПериода, Уточнение);
		ПараметрыЗаполнения.КонецОтчетногоПериода = КонецОтчетногоПериода;
		
		ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов = АвансыРазделеныПоВидамАктивов;
		ПараметрыЗаполнения.СчетаСРеквизитами = СчетаСРеквизитами;
		
		ПроцессорПоказателя = НовыйПроцессорПоказателя();
		ПроцессорПоказателя.Организация   = Филиал;
		ПроцессорПоказателя.НачалоПериода = ПараметрыЗаполнения.НачалоПериодаОтчета;
		ПроцессорПоказателя.КонецПериода  = ПараметрыЗаполнения.КонецПериодаОтчета;
		ПроцессорПоказателя.ИмяРаздела = "Баланс";
		ПроцессорПоказателя.СчетаСРеквизитами    = СчетаСРеквизитами;
		ПроцессорПоказателя.ПараметрыСчетов      = ПараметрыСчетов;
		ПроцессорПоказателя.ТекстыРасшифровки    = ТекстыРасшифровкиПоказателейАренды(ПараметрыЗаполнения);
		
		//@skip-check query-in-loop
		ОбщиеИтогиПоСчетам = РассчитатьБухгалтерскиеВеличиныФормаОтчета2025Кв1_Баланс(ПараметрыЗаполнения);
		//@skip-check query-in-loop
		ПроцессорПоказателя.РассчитанныеЗначения = БухгалтерскиеИтоги_Баланс2025Кв1(
			ПараметрыЗаполнения.Организация,
			ПараметрыЗаполнения.КонецПериодаОтчета,
			ОбщиеИтогиПоСчетам);
		
		ПараметрыЗаполнения.ПроцессорПоказателя = ПроцессорПоказателя;
		
		ПараметрыАлгоритмов = ПараметрыАлгоритмовБаланса2025(ПараметрыЗаполнения, ОбщиеИтогиПоСчетам);
		Алгоритмы = АлгоритмыБО2025Кв1_Баланс(ПараметрыАлгоритмов);
	
		ЗначенияПоказателейФилиала = РассчитатьПоказателиБаланс(ПроцессорПоказателя, Алгоритмы);
		
		Для Каждого ЗначениеПоказателя Из ЗначенияПоказателейФилиала Цикл
			Если ТолькоГруппыПоказателей И Не ЗначениеЗаполнено(ЗначениеПоказателя.КодПоказателя) Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ЗначенияПоказателей.Добавить(), ЗначениеПоказателя);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ЗначенияПоказателей;
	
КонецФункции

// Конструктор коллекции, содержащей рассчитанные значения показателей отчета.
// Здесь Показатель используется в терминологии ФСБУ 4. Соответственно, код показателя - из числа установленных Приложением 10 к ФСБУ 4.
// Только показатели верхнего уровня (агрегированные, группы показателей) обладают кодом, для детальных - пустая строка.
// Следует отличать от терминологии, применяемой в ПроцессорПоказателя. В частности там применяются самодельные "коды".
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
// * Организация - СправочникСсылка.Организации - 
// * КодПоказателя - Строка - из числа установленных Приложением 10 к ФСБУ 4, указывается у групп показателей 
// * Идентификатор - Строка - для получения используется ИдентификаторЗначенияПоказателя
// * Наименование - Строка - как правило, заполнено
// * ЗначениеПоказателя - Число - в рублях
// * НаименованиеПоказателя - Строка - используется во внутренней механике расчета, может быть не заполнено
// * Расшифровка - Массив из Структура - описание порядка расчета
Функция НовыйЗначенияПоказателей() Экспорт
	
	ЗначенияПоказателей = Новый ТаблицаЗначений;
	
	ЗначенияПоказателей.Колонки.Добавить("Организация",            Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ЗначенияПоказателей.Колонки.Добавить("КодПоказателя",          Новый ОписаниеТипов("Строка")); 
	ЗначенияПоказателей.Колонки.Добавить("Идентификатор",          Новый ОписаниеТипов("Строка"));
	ЗначенияПоказателей.Колонки.Добавить("Наименование",           Новый ОписаниеТипов("Строка"));
	// Следующие поля совпадают с ПроцессорПоказателя.Показатель 
	ЗначенияПоказателей.Колонки.Добавить("ЗначениеПоказателя",     Новый ОписаниеТипов("Число"));
	ЗначенияПоказателей.Колонки.Добавить("НаименованиеПоказателя", Новый ОписаниеТипов("Строка"));
	ЗначенияПоказателей.Колонки.Добавить("Расшифровка",            Новый ОписаниеТипов("Массив"));
	
	ЗначенияПоказателей.Индексы.Добавить("Идентификатор");
	
	Возврат ЗначенияПоказателей;
	
КонецФункции

// Рассчитывает итог раздела баланса.
// 
// Параметры:
//  ИмяРаздела - Строка - Имя раздела по БухгалтерскаяОтчетностьБРО.КодыРазделовБаланса
//  ЗначенияПоказателей - см. НовыйЗначенияПоказателей - заранее рассчитанные значения показателей, например, с помощью ПоказателиБаланс
// 
// Возвращаемое значение:
//  Число - итог по разделу баланса
Функция ИтогРазделаБаланса(ИмяРаздела, ЗначенияПоказателей) Экспорт
	
	Итоги = ИтогиРазделовБаланса(ЗначенияПоказателей, ИмяРаздела);
	
	Если Не Итоги.Свойство(ИмяРаздела) Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Итоги[ИмяРаздела];
	
КонецФункции

// Рассчитывает итоги разделов баланса - всех, или с отбором. Для одного раздела см. также ИтогРазделаБаланса 
// 
// Параметры:
//  ЗначенияПоказателей - см. НовыйЗначенияПоказателей - заранее рассчитанные значения показателей, например, с помощью ПоказателиБаланс
//  Отбор - Неопределено - все показатели, без отбора
//        - Массив из Строка - имена разделов по БухгалтерскаяОтчетностьБРО.КодыРазделовБаланса
//        - Строка - имена разделов по БухгалтерскаяОтчетностьБРО.КодыРазделовБаланса, разделенные запятыми
// 
// Возвращаемое значение:
//  Структура Из КлючИЗначение - Итоги разделов баланса:
//         * Ключ - Строка - из числа БухгалтерскаяОтчетностьБРО.КодыРазделовБаланса (с учетом отбора)
//         * Значение - Число - итог по разделу баланса
//
Функция ИтогиРазделовБаланса(ЗначенияПоказателей, Отбор = Неопределено) Экспорт
	
	Итоги = Новый Структура;
	
	Поиск = Новый Соответствие;
	
	ЗначенияОтбора = Новый Массив;
	Если ТипЗнч(Отбор) = Тип("Строка") Тогда
		ЗначенияОтбора = СтрРазделить(Отбор, ",");
	ИначеЕсли ТипЗнч(Отбор) = Тип("Массив") Тогда
		ЗначенияОтбора = Отбор;
	КонецЕсли;
	
	КодыРазделов = БухгалтерскаяОтчетностьБРО.КодыРазделовБаланса();
	
	Если ЗначениеЗаполнено(ЗначенияОтбора) Тогда
		Для Каждого ЗначениеОтбора Из ЗначенияОтбора Цикл
			ЗначениеОтбора = СокрЛП(ЗначениеОтбора);
			КодРаздела = "";
			Если КодыРазделов.Свойство(ЗначениеОтбора, КодРаздела) Тогда
				Поиск.Вставить(КодРаздела, ЗначениеОтбора);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого ОписаниеКодаРаздела Из КодыРазделов Цикл
			Поиск.Вставить(ОписаниеКодаРаздела.Значение, ОписаниеКодаРаздела.Ключ);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ЗначениеПоиска Из Поиск Цикл
		Итоги.Вставить(ЗначениеПоиска.Значение, 0);
	КонецЦикла;
	
	Для Каждого ЗначениеПоказателя Из ЗначенияПоказателей Цикл
		
		Если ПустаяСтрока(ЗначениеПоказателя.КодПоказателя) Тогда
			Продолжить;
		КонецЕсли;
		
		КодРаздела = БухгалтерскаяОтчетностьБРО.КодРазделаОтчета(ЗначениеПоказателя.КодПоказателя);
		
		ИмяРаздела = Поиск[КодРаздела];
		Если ИмяРаздела = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Итоги[ИмяРаздела] = Итоги[ИмяРаздела] + ЗначениеПоказателя.ЗначениеПоказателя;
		
	КонецЦикла;
	
	Возврат Итоги;
	
КонецФункции

// Определяет идентификатор ячейки фиксированной строки бухгалтерской отчетности.
// 
// Параметры:
//  КодСтроки - Строка - Код показателя согласно Приложению 10 к ФСБУ 4
//  НомерГрафы - Строка - Номер графы (колонки регламентированного отчета БРО)
// 
// Возвращаемое значение:
//  Строка - Идентификатор ячейки
//
Функция ИдентификаторЯчейки(КодСтроки, НомерГрафы) Экспорт
	
	ИдентификаторСтроки = БухгалтерскаяОтчетностьБРО.ИдентификаторФиксированнойСтрокиДляЯчеек(КодСтроки);
	Возврат БухгалтерскаяОтчетностьБРО.ИдентификаторЯчейки(ИдентификаторСтроки, НомерГрафы);
	
КонецФункции

#Область УпрощеннаяОтчетность

// Добавляет в описание показателей упрощенного баланса заполняемые этим модулем.
// 
// Параметры:
//  ПоказателиОтчета - Структура - заполняемая коллекция; для добавления элементов следует использовать РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру 
// 
Процедура ДобавитьЗаполняемыеПоказателиУпрощеннаяОтчетность(ПоказателиОтчета) Экспорт

	ГрафыБаланса = Новый Массив;
	ГрафыБаланса.Добавить("04");
	ГрафыБаланса.Добавить("05");
	ГрафыБаланса.Добавить("06");
	
	Для Каждого Раздел Из БухгалтерскаяОтчетностьБРО.РазделыОтчета() Цикл
	
		СхемаУпрощенногоБаланса = ЗаполнениеБухгалтерскойОтчетностиУпрощенная.СхемаСокращенияУпрощеннойОтчетности(Раздел);
		
		Для Каждого ГруппаПоказателей Из СхемаУпрощенногоБаланса Цикл
			Для Каждого КодПоказателя Из ГруппаПоказателей.Значение Цикл
				Для Каждого КодГрафы Из ГрафыБаланса Цикл
					КодЯчейки = ИдентификаторЯчейки(КодПоказателя, КодГрафы);
					РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, КодЯчейки, Истина, Истина);
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

// Заполняет РегламентированныйОтчетБухОтчетность по форме ФормаОтчета2025Кв1.
//
// Параметры:
//  ПараметрыОтчета - Структура - набор именованных параметров для определения вариантов заполнения отчета:
//    * Организация - СправочникСсылка.Организации
//    * ДатаНачалаПериодаОтчета - Дата
//    * ДатаКонцаПериодаОтчета - Дата, МоментВремениСУточнениемПериода -
//    * ГруппаОрганизаций - СписокЗначений из  СправочникСсылка.Организации
//    * ЗаполняемыеРазделы - Структура
//    * АдресВоВременномХранилище - Строка
//    * ЭтоБалансНекоммерческойОрганизации - Булево
//  Контейнер - ДеревоЗначений - данные разделов.
//  ЭтоУпрощеннаяОтчетность - Булево - Истина для упрощенной отчетности
//
Процедура ЗаполнитьОтчетБухОтчетностьФормаОтчета2025Кв1(ПараметрыОтчета, Контейнер, ЭтоУпрощеннаяОтчетность = Ложь) Экспорт
	
	ОсновнаяОрганизация = ПараметрыОтчета.Организация;
	
	НачалоПериодаОтчета = ПараметрыОтчета.ДатаНачалаПериодаОтчета;
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.ДатаКонцаПериодаОтчета;
	КонецПериодаОтчета = Новый МоментВремениСУточнениемПериода(ДатаКонцаПериодаОтчета, 0);
	
	НачалоПериодаПредыдущегоГода = НачалоГода(ДобавитьМесяц(НачалоПериодаОтчета, -12));
	ДатаКонцаПредыдущегоГода = КонецГода(НачалоПериодаПредыдущегоГода);
	КонецПериодаПредыдущегоГода = Новый МоментВремениСУточнениемПериода(ДатаКонцаПредыдущегоГода,
		БухгалтерскийУчет.ВерхняяГраницаУточненияПериода());
	
	НачалоПериодаГодаПредшествующегоПредыдущему = НачалоГода(ДобавитьМесяц(НачалоПериодаПредыдущегоГода, -12));
	ДатаКонцаГодаПредшествующегоПредыдущему = КонецГода(НачалоПериодаГодаПредшествующегоПредыдущему);
	КонецПериодаГодаПредшествующегоПредыдущему = Новый МоментВремениСУточнениемПериода(
		ДатаКонцаГодаПредшествующегоПредыдущему,
		БухгалтерскийУчет.ВерхняяГраницаУточненияПериода());
	
	ДоступныеОрганизации = ОбщегоНазначенияБПВызовСервераПовтИсп.ВсеОрганизацииДанныеКоторыхДоступныПоRLS(Ложь);
	
	ПолныйСписокОрганизаций = Новый Массив; // Массив из СправочникСсылка.Организации
	
	Если ДоступныеОрганизации.Найти(ОсновнаяОрганизация) <> Неопределено Тогда
		ПолныйСписокОрганизаций.Добавить(ОсновнаяОрганизация);
	КонецЕсли;
	
	Если ПараметрыОтчета.Свойство("ГруппаОрганизаций") Тогда
		Для Каждого Организация Из ПараметрыОтчета.ГруппаОрганизаций Цикл
			Если ДоступныеОрганизации.Найти(Организация.Значение) <> Неопределено Тогда
				ПолныйСписокОрганизаций.Добавить(Организация.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СчетаСРеквизитами = ЗаполнениеБухгалтерскойОтчетностиИтоги.СчетаСРеквизитами();
	
	ЗаполнятьБаланс = ПараметрыОтчета.ЗаполняемыеРазделы.Баланс;
	ЗаполнятьОИК = ПараметрыОтчета.ЗаполняемыеРазделы.ОИК;
	
	ЗаполнятьПредыдущиеПериоды = НЕ РасширенныйПериодОтчета(НачалоПериодаОтчета);
	
	// Бухгалтерский баланс.
	Если ЗаполнятьБаланс Тогда
		ПараметрыЗаполненияБаланс = НовыеПараметрыЗаполненияБаланс();
		ПараметрыЗаполненияБаланс.Контейнер = Контейнер;
		ПараметрыЗаполненияБаланс.КонецОтчетногоПериода = КонецДня(ДатаКонцаПериодаОтчета);
		ПараметрыЗаполненияБаланс.ЭтоБалансНекоммерческойОрганизации =
			ПараметрыОтчета.ЭтоБалансНекоммерческойОрганизации;
		ПараметрыЗаполненияБаланс.ЭтоУпрощеннаяОтчетность = ЭтоУпрощеннаяОтчетность;
				
		ПараметрыЗаполненияБаланс.СчетаСРеквизитами = СчетаСРеквизитами;
		
		ПараметрыЗаполненияБаланс.Графа = "04";
		ПараметрыЗаполненияБаланс.ЗаголовокГрафы =
			"На " + Формат(ДатаКонцаПериодаОтчета, "ДФ = 'дд ММММ гггг'")+ " г.";
		ПараметрыЗаполненияБаланс.НачалоПериодаОтчета = НачалоПериодаОтчета;
		ПараметрыЗаполненияБаланс.КонецПериодаОтчета = КонецПериодаОтчета;
		
		ЗаполнитьОтчетБухОтчетностьФормаОтчета2025Кв1_БалансПоГрафе(ПараметрыЗаполненияБаланс, ПолныйСписокОрганизаций);
		
		Если ЗаполнятьПредыдущиеПериоды Тогда
			ПараметрыЗаполненияБаланс.Графа = "05";
			ПараметрыЗаполненияБаланс.ЗаголовокГрафы =
				"На " + Формат(ДатаКонцаПредыдущегоГода, "ДФ = 'дд ММММ гггг'")+ " г.";
			ПараметрыЗаполненияБаланс.НачалоПериодаОтчета = НачалоПериодаПредыдущегоГода;
			ПараметрыЗаполненияБаланс.КонецПериодаОтчета = КонецПериодаПредыдущегоГода;
			
			ЗаполнитьОтчетБухОтчетностьФормаОтчета2025Кв1_БалансПоГрафе(ПараметрыЗаполненияБаланс, ПолныйСписокОрганизаций);
			
			ПараметрыЗаполненияБаланс.Графа = "06";
			ПараметрыЗаполненияБаланс.ЗаголовокГрафы =
				"На " + Формат(ДатаКонцаГодаПредшествующегоПредыдущему, "ДФ = 'дд ММММ гггг'")+ " г.";
			ПараметрыЗаполненияБаланс.НачалоПериодаОтчета = НачалоПериодаГодаПредшествующегоПредыдущему;
			ПараметрыЗаполненияБаланс.КонецПериодаОтчета = КонецПериодаГодаПредшествующегоПредыдущему;
			
			ЗаполнитьОтчетБухОтчетностьФормаОтчета2025Кв1_БалансПоГрафе(ПараметрыЗаполненияБаланс, ПолныйСписокОрганизаций);
			
		КонецЕсли;
		
	КонецЕсли;
		
	Для Каждого Организация Из ПолныйСписокОрганизаций Цикл
			
		// Отчет об изменениях капитала.
		Если ЗаполнятьОИК Тогда
			ПараметрыЗаполненияОИК = НовыеПараметрыЗаполненияОИК();
			ПараметрыЗаполненияОИК.Организация = Организация;
			ПараметрыЗаполненияОИК.Контейнер = Контейнер;
			ПараметрыЗаполненияОИК.НачалоОтчетногоПериода = НачалоПериодаОтчета;
			ПараметрыЗаполненияОИК.КонецОтчетногоПериода = КонецДня(ДатаКонцаПериодаОтчета);
			ПараметрыЗаполненияОИК.СчетаСРеквизитами = СчетаСРеквизитами;
			
			ЗаполнитьОтчетБухОтчетностьФормаОтчета2025Кв1_ОИК(ПараметрыЗаполненияОИК);
			
		КонецЕсли;
		
	КонецЦикла;
	
	КонтекстОтчета = КонтекстОтчета(
		НачалоПериодаОтчета,
		КонецПериодаОтчета,
		ЗаполнятьПредыдущиеПериоды,
		НачалоПериодаПредыдущегоГода,
		КонецПериодаПредыдущегоГода,
		ПолныйСписокОрганизаций,
		ЭтоУпрощеннаяОтчетность);
		
	ЗаполнитьОтчетПоНастройкам(
		Контейнер,
		ПараметрыОтчета.ЗаполняемыеРазделы,
		КонтекстОтчета,
		ПолныйСписокОрганизаций,
		ПараметрыОтчета.НастройкиЗаполненияСтрок);
		
	ЗаполнитьТаблицыОтчета(
		Контейнер,
		ПараметрыОтчета.ЗаполняемыеРазделы,
		КонтекстОтчета,
		ПолныйСписокОрганизаций);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Контейнер", Контейнер);
	
	ПоместитьВоВременноеХранилище(СтруктураДанных, ПараметрыОтчета.АдресВоВременномХранилище);
	
КонецПроцедуры

// Создает таблицу с остатками по авансам с учетом вида актива
// 
// Параметры:
//  Организации - Массив из СправочникСсылка.Организации
//  Период - Дата
//  РазделятьАвансыПоВидамАктивов - Булево
//  АвансыПоВидамАктивов - Неопределено
//                       - Структура
// Возвращаемое значение:
//  см. НовыйАвансыПоВидамАктивовСводно
//
Функция АвансыПоВидамАктивовСводно(Организации, Период, РазделятьАвансыПоВидамАктивов, АвансыПоВидамАктивов = Неопределено) Экспорт
	
	АвансыСводно = НовыйАвансыПоВидамАктивовСводно();
	
	Если Не РазделятьАвансыПоВидамАктивов Тогда
		Возврат АвансыСводно;
	КонецЕсли;
	
	ИменаТаблиц = Новый Массив;
	ИменаТаблиц.Добавить("СтруктураСКД_60_02");
	ИменаТаблиц.Добавить("СтруктураСКД_60_22");
	ИменаТаблиц.Добавить("СтруктураСКД_60_32");
	
	Для Каждого Организация Из Организации Цикл
		Если АвансыПоВидамАктивов = Неопределено Тогда
			СтруктураСКД_60_02 = РазделенноеСальдоСчетаУчетаАвансов2025(
			Счет("60.02"), Период, РазделятьАвансыПоВидамАктивов, Организация);
			СтруктураСКД_60_22 = РазделенноеСальдоСчетаУчетаАвансов2025(
			Счет("60.22"), Период, РазделятьАвансыПоВидамАктивов, Организация);
			СтруктураСКД_60_32 = РазделенноеСальдоСчетаУчетаАвансов2025(
			Счет("60.32"), Период, РазделятьАвансыПоВидамАктивов, Организация);
			
			АвансыПоВидамАктивов = Новый Структура;
			АвансыПоВидамАктивов.Вставить("РазделятьАвансыПоВидамАктивов", РазделятьАвансыПоВидамАктивов);
			АвансыПоВидамАктивов.Вставить("СтруктураСКД_60_02", СтруктураСКД_60_02);
			АвансыПоВидамАктивов.Вставить("СтруктураСКД_60_22", СтруктураСКД_60_22);
			АвансыПоВидамАктивов.Вставить("СтруктураСКД_60_32", СтруктураСКД_60_32);
		КонецЕсли;
		
		Для Каждого ИмяТаблицы Из ИменаТаблиц Цикл
			Для Каждого СтрокаТаблицы Из АвансыПоВидамАктивов[ИмяТаблицы] Цикл
				СтрокаАвансы = АвансыСводно.Добавить();
				СтрокаАвансы.Организация = Организация;
				СтрокаАвансы.ВидАктива = СтрокаТаблицы.ВидАктива;
				СтрокаАвансы.ОстатокНДС = СтрокаТаблицы.СуммаОстатокКтНДСАвансов;
				СтрокаАвансы.ОстатокРезерва = СтрокаТаблицы.СуммаОстатокКтРезервы;
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	АвансыСводно.Свернуть("Организация, ВидАктива", "ОстатокНДС, ОстатокРезерва");
	
	Возврат АвансыСводно;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьОтчетБухОтчетностьФормаОтчета2025Кв1_БалансПоГрафе(ПараметрыЗаполнения, ПолныйСписокОрганизаций)
	
	ИмяРаздела = "Баланс";
	
	НачалоПериодаОтчета = ПараметрыЗаполнения.НачалоПериодаОтчета;
	КонецПериодаОтчета = ПараметрыЗаполнения.КонецПериодаОтчета;
	
	ПроцессорПоказателя = НовыйПроцессорПоказателя();
	ПроцессорПоказателя.ИмяРаздела = ИмяРаздела;
	ПроцессорПоказателя.НачалоПериода = НачалоПериодаОтчета;
	ПроцессорПоказателя.КонецПериода  = КонецПериодаОтчета;
	ПроцессорПоказателя.СчетаСРеквизитами = ПараметрыЗаполнения.СчетаСРеквизитами;
	ПроцессорПоказателя.ПараметрыСчетов = ПараметрыСчетов_Баланс2025Кв1();
	ПроцессорПоказателя.ТекстыРасшифровки = ТекстыРасшифровкиПоказателейАренды(ПараметрыЗаполнения);
	
	ЗначенияПоказателейПоВсемОрганизациям = Новый Массив; // из см. НовыйЗначенияПоказателей;
		
	Для Каждого Организация Из ПолныйСписокОрганизаций Цикл
		
		ПараметрыЗаполнения.Организация = Организация;
		
		ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов =
			РегламентированнаяОтчетность.АвансыРазделеныПоВидамАктивов(Организация, ПараметрыЗаполнения.КонецОтчетногоПериода);
	
		//@skip-check query-in-loop
		ОбщиеИтогиПоСчетам = РассчитатьБухгалтерскиеВеличиныФормаОтчета2025Кв1_Баланс(ПараметрыЗаполнения);

		//@skip-check query-in-loop
		ПроцессорПоказателя.РассчитанныеЗначения = БухгалтерскиеИтоги_Баланс2025Кв1(
			Организация,
			КонецПериодаОтчета,
			ОбщиеИтогиПоСчетам,
			ПараметрыЗаполнения.КлассифицироватьАктивыОбязательстваПоСрокам);
			
		ПроцессорПоказателя.Организация = Организация;
		
		ПараметрыЗаполнения.ПроцессорПоказателя = ПроцессорПоказателя;
		
		ПараметрыАлгоритмов = ПараметрыАлгоритмовБаланса2025(ПараметрыЗаполнения, ОбщиеИтогиПоСчетам);
		Алгоритмы = АлгоритмыБО2025Кв1_Баланс(ПараметрыАлгоритмов);
		ПараметрыЗаполнения.Вставить("Алгоритмы", Алгоритмы);
		ПараметрыЗаполнения.Вставить("РассчитанныеПараметры", ОбщиеИтогиПоСчетам);
		
		ЗначенияПоказателей = РассчитатьПоказателиБаланс(ПроцессорПоказателя, Алгоритмы);
		ЗначенияПоказателейПоВсемОрганизациям.Добавить(ЗначенияПоказателей);
		
	КонецЦикла;
	
	ЗаполнитьОтчетБухОтчетностьФормаОтчета2025Кв1_БалансПоГрафеПоАлгоритмам(ПараметрыЗаполнения, ЗначенияПоказателейПоВсемОрганизациям);
	
КонецПроцедуры

// Конструктор параметров заполнения бухгалтерского баланса.
// 
// Возвращаемое значение:
//   Структура - Новые параметры заполнения баланс:
//     * Организация - СправочникСсылка.Организации 
//     * Контейнер - ДеревоЗначений
//     * СчетаСРеквизитами - ТаблицаЗначений:
//       ** УсловныйКод - Строка
//       ** Ссылка - ПланСчетовСсылка.Хозрасчетный
//       ** Код - Строка
//       ** Наименование - Строка
//     * Графа - Строка
//     * ЗаголовокГрафы - Строка
//     * НачалоПериодаОтчета - Дата
//     * КонецПериодаОтчета - Дата
//                          - МоментВремениСУточнениемПериода
//     * ПроцессорПоказателя - Структура
//     * Алгоритмы - Массив из Структура
//     * РассчитанныеПараметры - Структура
//
Функция НовыеПараметрыЗаполненияБаланс()
	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("Контейнер", Новый ДеревоЗначений);
	ПараметрыЗаполнения.Вставить("ЭтоБалансНекоммерческойОрганизации", Ложь);
	ПараметрыЗаполнения.Вставить("ЭтоУпрощеннаяОтчетность", Ложь);
	
	ПараметрыЗаполнения.Вставить("РазделятьАвансыПоВидамАктивов", Ложь);
	ПараметрыЗаполнения.Вставить("НастройкаВключенаКлассифицироватьАктивыОбязательства", Ложь);
	ПараметрыЗаполнения.Вставить("КлассифицироватьАктивыОбязательстваПоСрокам", Ложь);
	ПараметрыЗаполнения.Вставить("КонецОтчетногоПериода", '0001-01-01');
	ПараметрыЗаполнения.Вставить("УчетНа70ВедетсяСводно", ЗаполнениеБухгалтерскойОтчетности.УчетНа70ВедетсяСводно());
	ПараметрыЗаполнения.Вставить("ИспользуетсяВалютныйУчет", БухгалтерскийУчетПереопределяемый.ИспользоватьВалютныйУчет());
	
	СчетаСРеквизитами = Новый ТаблицаЗначений;
	СчетаСРеквизитами.Колонки.Добавить("УсловныйКод", Новый ОписаниеТипов("Строка"));
	СчетаСРеквизитами.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	СчетаСРеквизитами.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка"));
	СчетаСРеквизитами.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	ПараметрыЗаполнения.Вставить("СчетаСРеквизитами", СчетаСРеквизитами);
	
	ПараметрыЗаполнения.Вставить("Графа", "");
	ПараметрыЗаполнения.Вставить("ЗаголовокГрафы", "");
	ПараметрыЗаполнения.Вставить("НачалоПериодаОтчета", '0001-01-01');
	ПараметрыЗаполнения.Вставить("КонецПериодаОтчета", '0001-01-01');
	
	// Параметры, заполняемые и используемые в процессе заполнения отчета сведениями из ИБ.
	ПараметрыЗаполнения.Вставить("ПроцессорПоказателя", Новый Структура);
	ПараметрыЗаполнения.Вставить("Алгоритмы", Новый Массив);
	ПараметрыЗаполнения.Вставить("РассчитанныеПараметры", Новый Структура);
	
	ПараметрыЗаполнения.Вставить("ПоказателиУпрощеннойОтчетности", Новый Соответствие); // Ключ - номер обобщающей строки, Значение - идентификатор раскрывающей строки
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

Функция РассчитатьБухгалтерскиеВеличиныФормаОтчета2025Кв1_Баланс(ПараметрыЗаполнения)
	
	Организация = ПараметрыЗаполнения.Организация;
	НачалоПериодаОтчета = ПараметрыЗаполнения.НачалоПериодаОтчета;
	КонецПериодаОтчета = ПараметрыЗаполнения.КонецПериодаОтчета;
	
	// На дату отчетного периода определяется настройка в учетной политике "Классифицировать активы и обязательства по срокам".
	// Если она включена, то для сравнительного периода также определяется соответствующая настройка,
	// в случае её отсутствия - наличие регламентной операции «Классификация задолженности по срокам» за этот период.
	ГоловнаяОрганизация = БухгалтерскийУчетПереопределяемый.ГоловнаяОрганизация(Организация);
	ПараметрыЗаполнения.НастройкаВключенаКлассифицироватьАктивыОбязательства = УчетнаяПолитика.КлассифицироватьАктивыОбязательстваПоСрокам(ПараметрыЗаполнения.КонецОтчетногоПериода, ГоловнаяОрганизация);
	Если КонецДня(ПараметрыЗаполнения.КонецОтчетногоПериода) = КонецДня(КонецПериодаОтчета.Дата) Тогда
		ПараметрыЗаполнения.КлассифицироватьАктивыОбязательстваПоСрокам = ПараметрыЗаполнения.НастройкаВключенаКлассифицироватьАктивыОбязательства;
	Иначе
		ПараметрыЗаполнения.КлассифицироватьАктивыОбязательстваПоСрокам = 
			КлассификацияЗадолженности.КлассифицироватьАктивыОбязательстваПоСрокамВБалансе(КонецПериодаОтчета.Дата, ГоловнаяОрганизация, ПараметрыЗаполнения.НастройкаВключенаКлассифицироватьАктивыОбязательства);
	КонецЕсли;
	
	НастройкиПолученияБухитогов = Новый Структура;
	НастройкиПолученияБухитогов.Вставить("Организация",   Организация);
	НастройкиПолученияБухитогов.Вставить("НачалоПериода", НачалоПериодаОтчета);
	НастройкиПолученияБухитогов.Вставить("КонецПериода",  КонецПериодаОтчета);
	
	ОбщиеИтогиПоСчетам = Новый Структура;
	
	СальдоИОборотыПоСчетам = ЗаполнениеБухгалтерскойОтчетностиИтоги.СальдоИОборотыПоСчетам(НастройкиПолученияБухитогов);
	ОбщиеИтогиПоСчетам.Вставить("СальдоИОборотыПоСчетам", СальдоИОборотыПоСчетам);
	
	СчетаДляРасчета = "76.01.1, 76.03, 76.05, 76.06, 76.09, 76.17, 76.21, 76.25, 76.26, 76.29, 76.35, 76.36, 76.39, 76.41, 76.49, 76.К";
	СубконтоДляРасчета = "Контрагенты";
	
	СиО_Контрагенты = СальдоИОборотыПоСчетамИСубконто(НастройкиПолученияБухитогов, СчетаДляРасчета, СубконтоДляРасчета);
	ОбщиеИтогиПоСчетам.Вставить("СиО_Контрагенты", СиО_Контрагенты);
	
	СчетаДляРасчета = "60.01, 60.21, 60.31, 62.01, 62.21, 62.31,
	                  |76.01.1, 76.03, 76.05, 76.06, 76.09, 76.21, 76.25, 76.26, 76.29, 76.35, 76.36, 76.39, 76.К, 76.НА, 76.07, 76.27, 76.37";
	СубконтоДляРасчета = "Контрагенты, Договоры";
	
	СиО_КонтрагентыДоговоры = СальдоИОборотыПоСчетамИСубконто(НастройкиПолученияБухитогов, СчетаДляРасчета, СубконтоДляРасчета);
	ОбщиеИтогиПоСчетам.Вставить("СиО_КонтрагентыДоговоры", СиО_КонтрагентыДоговоры);
	
	СчетаДляРасчета = "68.01, 68.02, 68.03, 68.06, 68.07, 68.08, 68.09, 68.11, 68.12, 68.13, 68.14, 68.15, 68.16, 68.17, 68.21, 68.34, 68.52,
	                  |69.01, 69.02.1, 69.02.2, 69.02.3, 69.02.4, 69.02.5, 69.02.6, 69.02.7,
	                  |69.03.1, 69.03.2, 69.04, 69.05.1, 69.05.2, 69.06.1, 69.06.2, 69.06.3, 69.06.4, 69.06.5, 69.06.6,
	                  |69.09, 69.11, 69.12,
	                  |68.04.1, 68.10";
	СубконтоДляРасчета = "ВидыПлатежейВГосБюджет";
	
	СиО_ВидыПлатежей = СальдоИОборотыПоСчетамИСубконто(НастройкиПолученияБухитогов, СчетаДляРасчета, СубконтоДляРасчета);
	ОбщиеИтогиПоСчетам.Вставить("СиО_ВидыПлатежей", СиО_ВидыПлатежей);
	
	СчетаДляРасчета = "68.04.1, 68.10";
	СубконтоДляРасчета = "ВидыПлатежейВГосБюджет, УровниБюджетов";
	
	СиО_ВидыПлатежейУровниБюджетов = СальдоИОборотыПоСчетамИСубконто(НастройкиПолученияБухитогов, СчетаДляРасчета, СубконтоДляРасчета);
	ОбщиеИтогиПоСчетам.Вставить("СиО_ВидыПлатежейУровниБюджетов", СиО_ВидыПлатежейУровниБюджетов);
	
	СчетаДляРасчета = "70, 71, 73.03, 76.10";
	СубконтоДляРасчета = "РаботникиОрганизаций";
	
	СиО_Работники = СальдоИОборотыПоСчетамИСубконто(НастройкиПолученияБухитогов, СчетаДляРасчета, СубконтоДляРасчета);
	ОбщиеИтогиПоСчетам.Вставить("СиО_Работники", СиО_Работники);
	
	СчетаДляРасчета = "96.09";
	СубконтоДляРасчета = "Резервы";
	
	СиО_Резервы = СальдоИОборотыПоСчетамИСубконто(НастройкиПолученияБухитогов, СчетаДляРасчета, СубконтоДляРасчета);
	ОбщиеИтогиПоСчетам.Вставить("СиО_Резервы", СиО_Резервы);
	
	РазделятьАвансыПоВидамАктивов = ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов;
	
	СтруктураСКД_60_02 = РазделенноеСальдоСчетаУчетаАвансов2025(
		Счет("60.02"), КонецПериодаОтчета, РазделятьАвансыПоВидамАктивов, Организация);
	СтруктураСКД_60_22 = РазделенноеСальдоСчетаУчетаАвансов2025(
		Счет("60.22"), КонецПериодаОтчета, РазделятьАвансыПоВидамАктивов, Организация);
	СтруктураСКД_60_32 = РазделенноеСальдоСчетаУчетаАвансов2025(
		Счет("60.32"), КонецПериодаОтчета, РазделятьАвансыПоВидамАктивов, Организация);
	
	АвансыПоВидамАктивов = Новый Структура;
	АвансыПоВидамАктивов.Вставить("РазделятьАвансыПоВидамАктивов", РазделятьАвансыПоВидамАктивов);
	АвансыПоВидамАктивов.Вставить("СтруктураСКД_60_02", СтруктураСКД_60_02);
	АвансыПоВидамАктивов.Вставить("СтруктураСКД_60_22", СтруктураСКД_60_22);
	АвансыПоВидамАктивов.Вставить("СтруктураСКД_60_32", СтруктураСКД_60_32);
	
	ОбщиеИтогиПоСчетам.Вставить("АвансыПоВидамАктивов", АвансыПоВидамАктивов);
	
	Если ПараметрыЗаполнения.КлассифицироватьАктивыОбязательстваПоСрокам Тогда
		КонтекстРасчета = Новый Структура;
		Организации = Новый Массив;
		Организации.Добавить(ПараметрыЗаполнения.Организация);
		КонтекстРасчета.Вставить("Организации",   Организации);
		КонтекстРасчета.Вставить("Организация",   ПараметрыЗаполнения.Организация);
		КонтекстРасчета.Вставить("НачалоПериода", НачалоПериодаОтчета);
		КонтекстРасчета.Вставить("КонецПериода",      КонецПериодаОтчета);
		КонтекстРасчета.Вставить("КонецПериодаДата",  КонецПериодаОтчета.Дата);
		КонтекстРасчета.Вставить("РазделятьАвансыПоВидамАктивов", ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов);
		КонтекстРасчета.Вставить("ИспользуетсяВалютныйУчет",     ПараметрыЗаполнения.ИспользуетсяВалютныйУчет);
		КонтекстРасчета.Вставить("СчетаСРеквизитами",     ПараметрыЗаполнения.СчетаСРеквизитами);
		КонтекстРасчета.Вставить("СчетаСвернутоеСальдоКредиторская", КлассификацияЗадолженности.СчетаСвернутоеСальдоКредиторская());
		КонтекстРасчета.Вставить("КлассифицироватьАктивыОбязательстваПоСрокам", ПараметрыЗаполнения.КлассифицироватьАктивыОбязательстваПоСрокам);
		КонтекстРасчета.Вставить("ЭтоБалансНекоммерческойОрганизации", ПараметрыЗаполнения.ЭтоБалансНекоммерческойОрганизации);
		
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		КлассификацияЗадолженности.СоздатьВременныеТаблицыРасчетыПоАренде(МенеджерВременныхТаблиц, КонтекстРасчета);
		АвансыПоВидамАктивовСводно = АвансыПоВидамАктивовСводно(Организации, КонецПериодаОтчета, РазделятьАвансыПоВидамАктивов, АвансыПоВидамАктивов);
		КлассификацияЗадолженности.СоздатьВременныеТаблицыОбщийНДСАвансовВыданных(МенеджерВременныхТаблиц, КонтекстРасчета, РазделятьАвансыПоВидамАктивов, АвансыПоВидамАктивовСводно);
		КлассификацияЗадолженности.СоздатьВременныеТаблицыОбщийРезервПоСомнительнымДолгам(МенеджерВременныхТаблиц, КонтекстРасчета, РазделятьАвансыПоВидамАктивов, АвансыПоВидамАктивовСводно);

		ДанныеЗаполненияКредиторскаяЗадолженность = ДанныеЗаполненияКредиторскаяЗадолженность(МенеджерВременныхТаблиц, КонтекстРасчета);
		
		ОбщиеИтогиПоСчетам.Вставить("ДанныеЗаполненияДебиторскаяЗадолженность",  ДанныеЗаполненияДебиторскаяЗадолженность(МенеджерВременныхТаблиц, КонтекстРасчета));
		ОбщиеИтогиПоСчетам.Вставить("ДанныеЗаполненияКредиторскаяЗадолженность", ДанныеЗаполненияКредиторскаяЗадолженность.Задолженность);
		ОбщиеИтогиПоСчетам.Вставить("ДанныеЗаполненияРасчетыПоАренде",           ДанныеЗаполненияКредиторскаяЗадолженность.РасчетыПоАренде);
		ОбщиеИтогиПоСчетам.Вставить("ДанныеЗаполненияЗаемныеСредства",           ДанныеЗаполненияЗаемныеСредства(КонтекстРасчета));
	КонецЕсли;
	
	Возврат ОбщиеИтогиПоСчетам;
	
КонецФункции

Функция РазделенноеСальдоСчетаУчетаАвансов2025(СчетУчетаАвансов, КонецПериода, РазделятьАвансыПоВидамАктивов,
	Организация)
	
	СчетРезервов = Счет("63");
	СчетНДСАвансов = Счет("76.ВА");
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	ВидыСубконтоСФ = Новый Массив;
	ВидыСубконтоСФ.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконтоСФ.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СФПолученные);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыАктивовДляАвансов.Ссылка КАК ВидАктива
		|ПОМЕСТИТЬ ВТ_ВидыАктивовДляАвансов
		|ИЗ
		|	Перечисление.ВидыАктивовДляАвансов КАК ВидыАктивовДляАвансов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляАвансов.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Счет КАК Счет,
		|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
		|	ВТ_КонтрагентыДоговорыСФ.ДоговорКонтрагента КАК Договор,
		|	СУММА(ХозрасчетныйОстатки.СуммаОстатокКт) КАК СуммаОстатокКт
		|ПОМЕСТИТЬ ВТ_ВсеСФАвансов
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонПериода, Счет В (&СчетаНДСАвансов), &ВидыСубконтоСФ,
		|		Организация = &Организация) КАК ХозрасчетныйОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтрагентыДоговорыСФ КАК ВТ_КонтрагентыДоговорыСФ
		|		ПО ХозрасчетныйОстатки.Субконто2 = ВТ_КонтрагентыДоговорыСФ.Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОстатки.Счет,
		|	ХозрасчетныйОстатки.Субконто1,
		|	ВТ_КонтрагентыДоговорыСФ.ДоговорКонтрагента
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Контрагент,
		|	Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОстаткиОсновной.Субконто2 КАК Справочник.ДоговорыКонтрагентов).ВидАктива ЕСТЬ NULL
		|		ИЛИ НЕ &РазделятьАвансыПоВидамАктивов
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляАвансов.ПустаяСсылка)
		|		ИНАЧЕ ВЫРАЗИТЬ(ХозрасчетныйОстаткиОсновной.Субконто2 КАК Справочник.ДоговорыКонтрагентов).ВидАктива
		|	КОНЕЦ КАК ВидАктива,
		|	СУММА(ХозрасчетныйОстаткиОсновной.СуммаОстатокДт) КАК СуммаКонечныйОстатокДт,
		|	СУММА(ХозрасчетныйОстаткиРезервы.СуммаОстатокКт) КАК СуммаОстатокКтРезервы,
		|	СУММА(ВТ_ВсеСФАвансов.СуммаОстатокКт) КАК СуммаОстатокКтНДСАвансов
		|ПОМЕСТИТЬ ВТ_Сальдо
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонПериода, Счет В (&СчетаУчета), &ВидыСубконто,
		|		Организация = &Организация) КАК ХозрасчетныйОстаткиОсновной
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(&КонПериода, Счет В (&СчетаРезервов), &ВидыСубконто,
		|			Организация = &Организация) КАК ХозрасчетныйОстаткиРезервы
		|		ПО ХозрасчетныйОстаткиОсновной.Субконто2 = ХозрасчетныйОстаткиРезервы.Субконто2
		|		И ХозрасчетныйОстаткиОсновной.Субконто1 = ХозрасчетныйОстаткиРезервы.Субконто1
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеСФАвансов КАК ВТ_ВсеСФАвансов
		|		ПО ХозрасчетныйОстаткиОсновной.Субконто2 = ВТ_ВсеСФАвансов.Договор
		|		И ХозрасчетныйОстаткиОсновной.Субконто1 = ВТ_ВсеСФАвансов.Контрагент
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОстаткиОсновной.Субконто2 КАК Справочник.ДоговорыКонтрагентов).ВидАктива ЕСТЬ NULL
		|		ИЛИ НЕ &РазделятьАвансыПоВидамАктивов
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляАвансов.ПустаяСсылка)
		|		ИНАЧЕ ВЫРАЗИТЬ(ХозрасчетныйОстаткиОсновной.Субконто2 КАК Справочник.ДоговорыКонтрагентов).ВидАктива
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВидыАктивовДляАвансов.ВидАктива КАК ВидАктива,
		|	ЕСТЬNULL(ВТ_Сальдо.СуммаКонечныйОстатокДт, 0) КАК СуммаКонечныйОстатокДт,
		|	ЕСТЬNULL(ВТ_Сальдо.СуммаОстатокКтРезервы, 0) КАК СуммаОстатокКтРезервы,
		|	ЕСТЬNULL(ВТ_Сальдо.СуммаОстатокКтНДСАвансов, 0) КАК СуммаОстатокКтНДСАвансов
		|ИЗ
		|	ВТ_ВидыАктивовДляАвансов КАК ВТ_ВидыАктивовДляАвансов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сальдо КАК ВТ_Сальдо
		|		ПО ВТ_ВидыАктивовДляАвансов.ВидАктива = ВТ_Сальдо.ВидАктива";
	
	ПараметрыДополнения = ЗаполнениеБухгалтерскойОтчетностиИтоги.НовыеПараметрыДополненияТекстаЗапросаПоДоговорамСчетовФактур();
	ПараметрыДополнения.Организация = Организация;
	ПараметрыДополнения.КонецПериода = Новый Граница(КонецПериода, ВидГраницы.Включая);
	ПараметрыДополнения.СчетаСоСчетамиФактурами.Добавить(СчетНДСАвансов);
	ПараметрыДополнения.ВидСчетовФактур = "СФПолученные";
	
	ЗаполнениеБухгалтерскойОтчетностиИтоги.ДополнитьТекстЗапросаПоДоговорамСчетовФактур(Запрос, ПараметрыДополнения);
	
	Запрос.УстановитьПараметр("КонПериода", Новый Граница(КонецПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетаУчета", БухгалтерскийУчетПовтИсп.СчетаВИерархии(СчетУчетаАвансов));
	Запрос.УстановитьПараметр("СчетаРезервов", БухгалтерскийУчетПовтИсп.СчетаВИерархии(СчетРезервов));
	Запрос.УстановитьПараметр("СчетаНДСАвансов", БухгалтерскийУчетПовтИсп.СчетаВИерархии(СчетНДСАвансов));
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	Запрос.УстановитьПараметр("ВидыСубконтоСФ", ВидыСубконтоСФ);
	Запрос.УстановитьПараметр("РазделятьАвансыПоВидамАктивов", РазделятьАвансыПоВидамАктивов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция РазделенноеСальдоСчета_59(КонецПериода, Организация)
	
	СчетаФинансовыхВложений = "58.01, 58.02, 58.03, 58.04, 58.05";
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ФинансовыеВложения.Счет КАК Счет,
		|	ФинансовыеВложения.Субконто1 КАК Контрагент,
		|	ФинансовыеВложения.СуммаОстатокДт КАК СуммаОстатокДт,
		|	Резервы.СуммаОстатокКт КАК СуммаОстатокКт
		|ПОМЕСТИТЬ ВТ_ВсеПроводки
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериода, Счет В (&СчетаУчета), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты), Организация = &Организация) КАК ФинансовыеВложения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериода, Счет В (&СчетаРезервов), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты), Организация = &Организация) КАК Резервы
		|		ПО ФинансовыеВложения.Субконто1 = Резервы.Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеПроводки.Контрагент КАК Контрагент,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ВсеПроводки.Счет) КАК Счет
		|ПОМЕСТИТЬ ВТ_КонтрагентыПоКоличеству
		|ИЗ
		|	ВТ_ВсеПроводки КАК ВТ_ВсеПроводки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВсеПроводки.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КонтрагентыПоКоличеству.Контрагент КАК Контрагент,
		|	ВТ_КонтрагентыПоКоличеству.Счет КАК Счет
		|ПОМЕСТИТЬ ВТ_ПростыеСлучаи
		|ИЗ
		|	ВТ_КонтрагентыПоКоличеству КАК ВТ_КонтрагентыПоКоличеству
		|ГДЕ
		|	ВТ_КонтрагентыПоКоличеству.Счет = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КонтрагентыПоКоличеству.Контрагент КАК Контрагент,
		|	ВТ_КонтрагентыПоКоличеству.Счет КАК Счет
		|ПОМЕСТИТЬ ВТ_СоставныеСлучаи
		|ИЗ
		|	ВТ_КонтрагентыПоКоличеству КАК ВТ_КонтрагентыПоКоличеству
		|ГДЕ
		|	ВТ_КонтрагентыПоКоличеству.Счет <> 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПриведениеСчетов.СчетАлгоритма КАК Счет,
		|	СУММА(ВТ_ВсеПроводки.СуммаОстатокКт) КАК Резерв
		|ИЗ
		|	ВТ_ВсеПроводки КАК ВТ_ВсеПроводки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПростыеСлучаи КАК ВТ_ПростыеСлучаи
		|		ПО ВТ_ВсеПроводки.Контрагент = ВТ_ПростыеСлучаи.Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПриведениеСчетов КАК ВТ_ПриведениеСчетов
		|		ПО ВТ_ВсеПроводки.Счет = ВТ_ПриведениеСчетов.СчетУчета
		|			И (ВТ_ПриведениеСчетов.СчетАлгоритма В (&СчетаАлгоритма))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПриведениеСчетов.СчетАлгоритма";
	
	ЗаполнениеБухгалтерскойОтчетностиИтоги.ДополнитьТекстЗапросаПоВременнымТаблицам(Запрос);
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(КонецПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СчетаАлгоритма",
		ЗаполнениеБухгалтерскойОтчетности.СчетаИзСписка(СчетаФинансовыхВложений));
	Запрос.УстановитьПараметр("СчетаУчета", БухгалтерскийУчетПовтИсп.СчетаВИерархии(Счет("58")));
	Запрос.УстановитьПараметр("СчетаРезервов", БухгалтерскийУчетПовтИсп.СчетаВИерархии(Счет("59")));
	
	ИтоговаяТаблица = Запрос.Выполнить().Выгрузить();
	// Нулевые значения для свертки.
	Для Каждого КодСчета Из Список(СчетаФинансовыхВложений) Цикл
		НоваяСтрокаПоСчету = ИтоговаяТаблица.Добавить();
		НоваяСтрокаПоСчету.Счет = Счет(КодСчета);
	КонецЦикла;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВТ_ПриведениеСчетов.СчетАлгоритма КАК Счет,
		|	ВТ_ВсеПроводки.Контрагент КАК Контрагент,
		|	ВТ_ВсеПроводки.СуммаОстатокДт КАК Вложения,
		|	ВТ_ВсеПроводки.СуммаОстатокКт КАК Резервы
		|ИЗ
		|	ВТ_ВсеПроводки КАК ВТ_ВсеПроводки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СоставныеСлучаи КАК ВТ_СоставныеСлучаи
		|		ПО ВТ_ВсеПроводки.Контрагент = ВТ_СоставныеСлучаи.Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПриведениеСчетов КАК ВТ_ПриведениеСчетов
		|		ПО ВТ_ВсеПроводки.Счет = ВТ_ПриведениеСчетов.СчетУчета
		|			И (ВТ_ПриведениеСчетов.СчетАлгоритма В (&СчетаАлгоритма))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_ВсеПроводки.СуммаОстатокДт УБЫВ
		|ИТОГИ
		|	СУММА(Вложения),
		|	МИНИМУМ(Резервы)
		|ПО
		|	Контрагент,
		|	Счет";
	
	СоставныеСлучаи = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для Каждого СтрокаКонтрагента Из СоставныеСлучаи.Строки Цикл
		ОбщаяСуммаВложений = СтрокаКонтрагента.Вложения;
		ОбщаяСуммаРезервов = СтрокаКонтрагента.Резервы;
		РаспределямыйРезерв = ОбщаяСуммаРезервов;
		
		Для Каждого СтрокаСчета Из СтрокаКонтрагента.Строки Цикл
			ЭтоПоследняяСтрока =
				(СтрокаКонтрагента.Строки.Индекс(СтрокаСчета) = СтрокаКонтрагента.Строки.Количество() - 1);
			
			Если ЭтоПоследняяСтрока Тогда
				РезервПоСчету = РаспределямыйРезерв;
			Иначе
				СуммаВложения = СтрокаСчета.Вложения;
				РезервПоСчету = Мин(РаспределямыйРезерв,
					Окр(СуммаВложения / ОбщаяСуммаВложений * ОбщаяСуммаРезервов, 2));
				РаспределямыйРезерв = РаспределямыйРезерв - РезервПоСчету;
			КонецЕсли;
			
			НоваяСтрокаПоСчету = ИтоговаяТаблица.Добавить();
			НоваяСтрокаПоСчету.Счет = СтрокаСчета.Счет;
			НоваяСтрокаПоСчету.Резерв = РезервПоСчету;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ИтоговаяТаблица.Свернуть("Счет", "Резерв");
	// Вспомогательные коды для формирования расчетных величин.
	ИтоговаяТаблица.Колонки.Добавить("ВспомогательныйКод", Новый ОписаниеТипов("Строка"));
	Для Каждого КодСчета Из Список(СчетаФинансовыхВложений) Цикл
		ИскомаяСтрока = ИтоговаяТаблица.Найти(Счет(КодСчета));
		ИскомаяСтрока.ВспомогательныйКод = Стрзаменить(КодСчета, ".", "_");
	КонецЦикла;
	
	Возврат ИтоговаяТаблица;
	
КонецФункции

#Область КлассификацияЗадолженности

#Область ДебиторскаяЗадолженность

Функция ГруппыДебиторскаяКраткосрочнаяЗадолженность()
	
	ВидыСчетов = Новый Массив;
	ВидыСчетов.Добавить(ВидСчета.Активный);
	ВидыСчетов.Добавить(ВидСчета.АктивноПассивный);
	
	Группы = НовыйГруппы();
	
	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расчеты с покупателями и заказчиками'");
	Группа.Код = "12301";
	СчетаСписком = "62";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расчеты с поставщиками и подрядчиками'");
	Группа.Код = "12302";
	СчетаСписком = "60";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);
	
	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расчеты по налогам и сборам'");
	Группа.Код = "12303";
	СчетаСписком = "68";
	СчетаИсключенияСписком = "68.02, 68.22, 68.90, 68.04.2";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов, СчетаИсключенияСписком);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расчеты по НДС, не отраженные на ЕНС'");
	Группа.Код = "12304";
	СчетаСписком = "68.02";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Сальдо по ЕНС'");
	Группа.Код = "12305";
	СчетаСписком = "68.90";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расчеты по социальному страхованию и обеспечению'");
	Группа.Код = "12306";
	СчетаСписком = "69";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расчеты с персоналом по оплате труда'");
	Группа.Код = "12307";
	СчетаСписком = "70";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расчеты с подотчетными лицами'");
	Группа.Код = "12308";
	СчетаСписком = "71";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);
	
	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расчеты с персоналом по прочим операциям'");
	Группа.Код = "12309";
	СчетаСписком = "73";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расчеты по вкладам в уставный (складочный) капитал'");
	Группа.Код = "12310";
	СчетаСписком = "75";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расчеты с разными дебиторами и кредиторами'");
	Группа.Код = "12311";
	СчетаСписком = "76";
	СчетаИсключенияСписком = "76.01.2, 76.01.9, 76.07, 76.27, 76.37, 76.13, 76.08, 76.28, 76.38, 76.41, 76.АВ, 76.НА, 76.ОТ";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов, СчетаИсключенияСписком);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расходы будущих периодов'");
	Группа.Код = "12312";
	СчетаСписком = "76.01.2, 76.01.9, 97";
	СчетаБезОтбора = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);
	Группа.СчетаРасчетов = ЗаполнениеБухгалтерскойОтчетностиТабличное.СчетаПоСубконто(СчетаБезОтбора, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РасходыБудущихПериодов);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Выполненные этапы по незавершенным работам'");
	Группа.Код = "12313";
	СчетаСписком = "46";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расчеты с факторинговыми компаниями'");
	Группа.Код = "12314";
	СчетаСписком = "76.13";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Авансы по аренде (лизингу)'");
	Группа.Код = "12315";
	СчетаСписком = "76.07, 76.27, 76.37";
	Группа.СчетаРасчетов = ЗаполнениеБухгалтерскойОтчетности.СчетаИзСписка(СчетаСписком);
	
	Возврат Группы;
	
КонецФункции

Функция ДанныеЗаполненияДебиторскаяЗадолженность(МенеджерВременныхТаблиц, КонтекстРасчета)
	
	ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская;
	
	СчетаДебиторская = КлассификацияЗадолженности.СчетаРасчетовДебиторскаяЗадолженность();
	
	СчетаРасчетовДебиторскаяБезАвансов = ОбщегоНазначения.СкопироватьРекурсивно(СчетаДебиторская.СчетаРасчетов);
	
	СчетаУчетаАвансов = КлассификацияЗадолженности.СчетаУчетаАвансовВыданных();
	Для Каждого СчетАвансов Из СчетаУчетаАвансов Цикл
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(СчетаРасчетовДебиторскаяБезАвансов, СчетАвансов);
	КонецЦикла;

	СписокВидовСубконто = КлассификацияЗадолженности.СписокВидовСубконто();
	НаборыСчетов = КлассификацияЗадолженности.НаборыСчетовБаланса(ВидЗадолженности, СписокВидовСубконто);
	ТаблицаСчетов = КлассификацияЗадолженности.НовыйТаблицаСчетов();
	
	КлассификацияЗадолженности.ЗаполнитьНаборыСчетами(НаборыСчетов, СчетаДебиторская.СчетаРасчетов, ТаблицаСчетов);
	
	// дополним таблицу остальными счетами, которые отражены в балансе Дебиторской задолженности
	Счета = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Счета, СчетаДебиторская.СчетаРасчетовПоАренде);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Счета, СчетаДебиторская.СчетаУчетаРБП);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Счета, СчетаДебиторская.СчетаУчетаНМА);
	
	СчетаСРеквизитами = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Счета, "Код, Порядок, Вид");
	
	Для Каждого Счет Из Счета Цикл
		СтрокаТаблицы = ТаблицаСчетов.Добавить();
		СтрокаТаблицы.Счет = Счет;
		СтрокаТаблицы.Код = СчетаСРеквизитами[Счет].Код;
		СтрокаТаблицы.Порядок = СчетаСРеквизитами[Счет].Порядок;
		СтрокаТаблицы.ВидСчета = СчетаСРеквизитами[Счет].Вид;
	КонецЦикла;
	
	Группы = ГруппыДебиторскаяКраткосрочнаяЗадолженность();
	ОпределитьГруппуСчетов(ТаблицаСчетов, Группы);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапросаСводныеДанныеДебиторскаяЗадолженность(НаборыСчетов, КонтекстРасчета, ВидЗадолженности);
	Запрос.УстановитьПараметр("Организации",      КонтекстРасчета.Организации);
	Запрос.УстановитьПараметр("НачалоПериода",    НачалоМесяца(КонтекстРасчета.КонецПериодаДата));
	Запрос.УстановитьПараметр("КонецПериода",     Новый Граница(КонтекстРасчета.КонецПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериодаДата", КонецДня(КонтекстРасчета.КонецПериодаДата));
	Запрос.УстановитьПараметр("ДатаНачалаДолгосрочногоПериода", КонецМесяца(ДобавитьМесяц(КонтекстРасчета.КонецПериодаДата, 12)) + 1);
	Запрос.УстановитьПараметр("ВидЗадолженности", ВидЗадолженности);
	Запрос.УстановитьПараметр("СчетаУчетаАвансов", СчетаУчетаАвансов);
	Запрос.УстановитьПараметр("СчетаУчетаРБП", СчетаДебиторская.СчетаУчетаРБП);
	Запрос.УстановитьПараметр("СчетаУчетаНМА", СчетаДебиторская.СчетаУчетаНМА);
	Запрос.УстановитьПараметр("СчетаРасчетовПоАренде", СчетаДебиторская.СчетаРасчетовПоАренде);
	Запрос.УстановитьПараметр("СчетаРасчетовДебиторская", СчетаДебиторская.СчетаРасчетов);
	Запрос.УстановитьПараметр("СчетаРасчетовДебиторскаяБезАвансов", СчетаРасчетовДебиторскаяБезАвансов);
	Запрос.УстановитьПараметр("ТаблицаСчетов", ТаблицаСчетов);
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	Запрос.УстановитьПараметр("ВидАктиваДебиторскаяЗадолженность", Перечисления.ВидыАктивовДляРБП.ДебиторскаяЗадолженность);
	Запрос.УстановитьПараметр("СчетаРезервов", БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам));
	Запрос.УстановитьПараметр("РазделятьАвансыПоВидамАктивов", КонтекстРасчета.РазделятьАвансыПоВидамАктивов);

	ИсключаемыеВидыАктиваАвансов = Новый Массив;
	Если КонтекстРасчета.РазделятьАвансыПоВидамАктивов Тогда
		ИсключаемыеВидыАктиваАвансов.Добавить(Перечисления.ВидыАктивовДляАвансов.Запасы);
		ИсключаемыеВидыАктиваАвансов.Добавить(Перечисления.ВидыАктивовДляАвансов.ИнвестиционнаяНедвижимость);
		ИсключаемыеВидыАктиваАвансов.Добавить(Перечисления.ВидыАктивовДляАвансов.НематериальныеАктивы);
		ИсключаемыеВидыАктиваАвансов.Добавить(Перечисления.ВидыАктивовДляАвансов.ПрочиеВнеоборотные);
		ИсключаемыеВидыАктиваАвансов.Добавить(Перечисления.ВидыАктивовДляАвансов.ОсновныеСредства);
		ИсключаемыеВидыАктиваАвансов.Добавить(Перечисления.ВидыАктивовДляАвансов.ПрочиеОборотные);
	КонецЕсли;
	Запрос.УстановитьПараметр("ИсключаемыеВидыАктиваАвансов", ИсключаемыеВидыАктиваАвансов);

	// Виды субконто
	Для Каждого ВидыСубконто Из СписокВидовСубконто Цикл
		Запрос.УстановитьПараметр(ВидыСубконто.Ключ, ВидыСубконто.Значение);
	КонецЦикла;
	
	// Наборы счетов
	Для Каждого Набор Из НаборыСчетов Цикл
		Запрос.УстановитьПараметр(Набор.ИмяНабора, Набор.СписокСчетов);
	КонецЦикла;
		
	Результат = Запрос.ВыполнитьПакет();
	ПоследнийИндекс = Результат.ВГраница();
	
	РасчетныеДанные = Новый Структура;
	РасчетныеДанные.Вставить("Задолженность", Результат[ПоследнийИндекс - 2]);
	РасчетныеДанные.Вставить("РасчетыПоАренде", Результат[ПоследнийИндекс - 1]);
	РасчетныеДанные.Вставить("НераспределенныеВеличины", Результат[ПоследнийИндекс].Выгрузить());

	ДанныеЗаполнения = НовыйДанныеЗаполненияЗадолженности();
	ДанныеЗаполнения.ГруппыКраткосрочная = Группы;
	ОпределитьСоставляющиеБалансаДебиторскаяЗадолженность(ДанныеЗаполнения, РасчетныеДанные, КонтекстРасчета);

	ОбщегоНазначенияБП.УничтожитьВременныеТаблицы(МенеджерВременныхТаблиц);
	
	Возврат ДанныеЗаполнения;

КонецФункции

Функция ТекстЗапросаСводныеДанныеДебиторскаяЗадолженность(НаборыСчетов, КонтекстРасчета, ВидЗадолженности)
	
	ТекстыЗапросов = Новый Массив;
	// Остатки задолженности по счетам, которые участвуют в классификации задолженности по срокам погашения
	КонтекстЗапроса = КлассификацияЗадолженности.НовыйКонтекстЗапросаОстаткиЗадолженности();
	ТекстЗапросаОстатки = КлассификацияЗадолженности.ТекстЗапросаОстаткиЗадолженности(НаборыСчетов, КонтекстЗапроса, ВидЗадолженности);
	Если ЗначениеЗаполнено(ТекстЗапросаОстатки) Тогда
		ТекстыЗапросов.Добавить(ТекстЗапросаОстатки);
	КонецЕсли;
	
	ТекстРасчеты =
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Организация КАК Организация,
	|	ХозрасчетныйОстатки.Счет КАК Счет,
	|	СУММА(ХозрасчетныйОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Субконто1 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА ХозрасчетныйОстатки.Субконто2 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА ХозрасчетныйОстатки.Субконто3 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РасходыБудущихПериодов.ПустаяСсылка)
	|	КОНЕЦ КАК СтатьяРБП
	|ПОМЕСТИТЬ ОстаткиРасходовБудущихПериодов
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериода, Счет В (&СчетаУчетаРБП), , Организация В (&Организации)) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстатки.Организация,
	|	ХозрасчетныйОстатки.Счет,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Субконто1 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА ХозрасчетныйОстатки.Субконто2 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА ХозрасчетныйОстатки.Субконто3 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РасходыБудущихПериодов.ПустаяСсылка)
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяРБП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расчеты.Организация КАК Организация,
	|	Расчеты.Счет КАК Счет,
	|	СУММА(Расчеты.ОстатокДт) КАК ОстатокБУ
	|ПОМЕСТИТЬ ДолгБУ
	|ИЗ
	|	Расчеты КАК Расчеты
	|
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Организация,
	|	Расчеты.Счет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Авансы.Организация,
	|	Авансы.Счет,
	|	СУММА(Авансы.ОстатокДт)
	|ИЗ
	|	Авансы КАК Авансы
	|ГДЕ
	|	&ТекстРазделятьАвансыПоВидамАктивов
	|
	|СГРУППИРОВАТЬ ПО
	|	Авансы.Организация,
	|	Авансы.Счет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АвансыПоАренде.Организация,
	|	АвансыПоАренде.Счет,
	|	СУММА(АвансыПоАренде.ОстатокБУ)
	|ИЗ
	|	АвансыПоАренде КАК АвансыПоАренде
	|
	|СГРУППИРОВАТЬ ПО
	|	АвансыПоАренде.Организация,
	|	АвансыПоАренде.Счет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиРасходовБудущихПериодов.Организация,
	|	ОстаткиРасходовБудущихПериодов.Счет,
	|	СУММА(ОстаткиРасходовБудущихПериодов.СуммаОстаток)
	|ИЗ
	|	ОстаткиРасходовБудущихПериодов КАК ОстаткиРасходовБудущихПериодов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РасходыБудущихПериодов КАК СтатьиРБП
	|		ПО ОстаткиРасходовБудущихПериодов.СтатьяРБП = СтатьиРБП.Ссылка
	|ГДЕ
	|	СтатьиРБП.ВидАктива = &ВидАктиваДебиторскаяЗадолженность
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиРасходовБудущихПериодов.Организация,
	|	ОстаткиРасходовБудущихПериодов.Счет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Организация,
	|	ХозрасчетныйОстатки.Счет,
	|	СУММА(ХозрасчетныйОстатки.СуммаОстаток)
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериода, Счет В (&СчетаУчетаНМА), , Организация В (&Организации)) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстатки.Организация,
	|	ХозрасчетныйОстатки.Счет";
	
	Если КонтекстРасчета.РазделятьАвансыПоВидамАктивов Тогда
		ТекстРасчеты = СтрЗаменить(ТекстРасчеты, "&ТекстРазделятьАвансыПоВидамАктивов", "НЕ Авансы.Субконто2.ВидАктива В (&ИсключаемыеВидыАктиваАвансов)");
	Иначе
		ТекстРасчеты = СтрЗаменить(ТекстРасчеты, "&ТекстРазделятьАвансыПоВидамАктивов", "ИСТИНА");
	КонецЕсли;
	ТекстыЗапросов.Добавить(ТекстРасчеты);
	
	ТекстКлассификация =
	"ВЫБРАТЬ
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Организация КАК Организация,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Счет КАК Счет,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.ДатаПогашения >= &ДатаНачалаДолгосрочногоПериода КАК Долгосрочный,
	|	СУММА(КлассификацияПоСрокамОтдельныхВидовЗадолженности.ОстатокДолга) КАК ОстатокДолга,
	|	СУММА(КлассификацияПоСрокамОтдельныхВидовЗадолженности.РезервПоСомнительнымДолгам) КАК РезервПоСомнительнымДолгам,
	|	СУММА(КлассификацияПоСрокамОтдельныхВидовЗадолженности.НДСАвансов) КАК НДСАвансов
	|ПОМЕСТИТЬ КлассификацияЗадолженности
	|ИЗ
	|	РегистрСведений.КлассификацияПоСрокамОтдельныхВидовЗадолженности КАК КлассификацияПоСрокамОтдельныхВидовЗадолженности
	|ГДЕ
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Активность
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.Организация В(&Организации)
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.ПериодРасчета МЕЖДУ &НачалоПериода И &КонецПериодаДата
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.Счет В (&СчетаРасчетовДебиторскаяБезАвансов, &СчетаРасчетовПоАренде)
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.ВидЗадолженности = &ВидЗадолженности
	|
	|СГРУППИРОВАТЬ ПО
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Организация,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Счет,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.ДатаПогашения >= &ДатаНачалаДолгосрочногоПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Организация,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Счет,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.ДатаПогашения >= &ДатаНачалаДолгосрочногоПериода,
	|	СУММА(КлассификацияПоСрокамОтдельныхВидовЗадолженности.ОстатокДолга),
	|	СУММА(КлассификацияПоСрокамОтдельныхВидовЗадолженности.РезервПоСомнительнымДолгам),
	|	СУММА(КлассификацияПоСрокамОтдельныхВидовЗадолженности.НДСАвансов)
	|ИЗ
	|	РегистрСведений.КлассификацияПоСрокамОтдельныхВидовЗадолженности КАК КлассификацияПоСрокамОтдельныхВидовЗадолженности
	|ГДЕ
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Активность
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.Организация В(&Организации)
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.ПериодРасчета МЕЖДУ &НачалоПериода И &КонецПериодаДата
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.Счет В(&СчетаУчетаАвансов)
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.ВидЗадолженности = &ВидЗадолженности
	|	И &ТекстРазделятьАвансыПоВидамАктивов
	|
	|СГРУППИРОВАТЬ ПО
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Организация,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Счет,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.ДатаПогашения >= &ДатаНачалаДолгосрочногоПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КлассификацияПоСрокамРасходовБудущихПериодов.Организация,
	|	КлассификацияПоСрокамРасходовБудущихПериодов.Счет,
	|	ИСТИНА,
	|	СУММА(КлассификацияПоСрокамРасходовБудущихПериодов.СуммаДолгосрочная),
	|	СУММА(0),
	|	СУММА(0)
	|ИЗ
	|	РегистрСведений.КлассификацияПоСрокамРасходовБудущихПериодов КАК КлассификацияПоСрокамРасходовБудущихПериодов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РасходыБудущихПериодов КАК СправочникРасходыБудущихПериодов
	|		ПО (ВЫБОР
	|				КОГДА КлассификацияПоСрокамРасходовБудущихПериодов.Субконто1 ССЫЛКА Справочник.РасходыБудущихПериодов
	|					ТОГДА КлассификацияПоСрокамРасходовБудущихПериодов.Субконто1
	|				КОГДА КлассификацияПоСрокамРасходовБудущихПериодов.Субконто2 ССЫЛКА Справочник.РасходыБудущихПериодов
	|					ТОГДА КлассификацияПоСрокамРасходовБудущихПериодов.Субконто2
	|				КОГДА КлассификацияПоСрокамРасходовБудущихПериодов.Субконто3 ССЫЛКА Справочник.РасходыБудущихПериодов
	|					ТОГДА КлассификацияПоСрокамРасходовБудущихПериодов.Субконто3
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РасходыБудущихПериодов.ПустаяСсылка)
	|			КОНЕЦ = СправочникРасходыБудущихПериодов.Ссылка)
	|			И (СправочникРасходыБудущихПериодов.ВидАктива = &ВидАктиваДебиторскаяЗадолженность)
	|ГДЕ
	|	КлассификацияПоСрокамРасходовБудущихПериодов.Активность
	|	И КлассификацияПоСрокамРасходовБудущихПериодов.Организация В(&Организации)
	|	И КлассификацияПоСрокамРасходовБудущихПериодов.ПериодРасчета МЕЖДУ &НачалоПериода И &КонецПериодаДата
	|	И КлассификацияПоСрокамРасходовБудущихПериодов.Счет В(&СчетаУчетаРБП)
	|	И КлассификацияПоСрокамРасходовБудущихПериодов.СуммаДолгосрочная <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	КлассификацияПоСрокамРасходовБудущихПериодов.Организация,
	|	КлассификацияПоСрокамРасходовБудущихПериодов.Счет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КлассификацияПоСрокамРасходовБудущихПериодов.Организация,
	|	КлассификацияПоСрокамРасходовБудущихПериодов.Счет,
	|	ИСТИНА,
	|	СУММА(КлассификацияПоСрокамРасходовБудущихПериодов.СуммаДолгосрочная),
	|	СУММА(0),
	|	СУММА(0)
	|ИЗ
	|	РегистрСведений.КлассификацияПоСрокамРасходовБудущихПериодов КАК КлассификацияПоСрокамРасходовБудущихПериодов
	|ГДЕ
	|	КлассификацияПоСрокамРасходовБудущихПериодов.Активность
	|	И КлассификацияПоСрокамРасходовБудущихПериодов.Организация В(&Организации)
	|	И КлассификацияПоСрокамРасходовБудущихПериодов.ПериодРасчета МЕЖДУ &НачалоПериода И &КонецПериодаДата
	|	И КлассификацияПоСрокамРасходовБудущихПериодов.Счет В(&СчетаУчетаНМА)
	|	И КлассификацияПоСрокамРасходовБудущихПериодов.СуммаДолгосрочная <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	КлассификацияПоСрокамРасходовБудущихПериодов.Организация,
	|	КлассификацияПоСрокамРасходовБудущихПериодов.Счет";

	Если КонтекстРасчета.РазделятьАвансыПоВидамАктивов Тогда
		ТекстКлассификация = СтрЗаменить(ТекстКлассификация, "&ТекстРазделятьАвансыПоВидамАктивов", "НЕ КлассификацияПоСрокамОтдельныхВидовЗадолженности.Субконто2.ВидАктива В (&ИсключаемыеВидыАктиваАвансов)");
	Иначе
		ТекстКлассификация = СтрЗаменить(ТекстКлассификация, "&ТекстРазделятьАвансыПоВидамАктивов", "ИСТИНА");
	КонецЕсли;
	ТекстыЗапросов.Добавить(ТекстКлассификация);
	
	ТекстыЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ТаблицаСчетов.Счет КАК Счет,
	|	ТаблицаСчетов.Код КАК Код,
	|	ТаблицаСчетов.КодГруппы КАК КодГруппы,
	|	ТаблицаСчетов.Порядок КАК Порядок,
	|	ТаблицаСчетов.ВидСчета КАК ВидСчета,
	|	ТаблицаСчетов.ВидСубконто1 КАК ВидСубконто1,
	|	ТаблицаСчетов.ВидСубконто2 КАК ВидСубконто2,
	|	ТаблицаСчетов.ВидСубконто3 КАК ВидСубконто3
	|ПОМЕСТИТЬ СчетаНаборов
	|ИЗ
	|	&ТаблицаСчетов КАК ТаблицаСчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация,
	|	СчетаНаборов.Счет КАК Счет,
	|	СчетаНаборов.Код КАК Код,
	|	СчетаНаборов.КодГруппы КАК КодГруппы,
	|	СчетаНаборов.Порядок КАК Порядок,
	|	СчетаНаборов.ВидСчета КАК ВидСчета,
	|	СчетаНаборов.ВидСубконто1 КАК ВидСубконто1,
	|	СчетаНаборов.ВидСубконто2 КАК ВидСубконто2,
	|	СчетаНаборов.ВидСубконто3 КАК ВидСубконто3
	|ПОМЕСТИТЬ СчетаОрганизации
	|ИЗ
	|	СчетаНаборов КАК СчетаНаборов,
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка В(&Организации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СводныеДанные.Организация КАК Организация,
	|	СводныеДанные.Счет КАК Счет,
	|	СУММА(СводныеДанные.ОстатокДолга) КАК ОстатокДолга,
	|	ВЫБОР
	|		КОГДА СУММА(СводныеДанные.ОстатокДолгаДолгосрочный) < 0
	|				ИЛИ СУММА(СводныеДанные.ОстатокДолга) < 0
	|			ТОГДА 0
	|		КОГДА СУММА(СводныеДанные.ОстатокДолгаДолгосрочный) < СУММА(СводныеДанные.ОстатокДолга)
	|			ТОГДА СУММА(СводныеДанные.ОстатокДолгаДолгосрочный)
	|		ИНАЧЕ СУММА(СводныеДанные.ОстатокДолга)
	|	КОНЕЦ КАК ОстатокДолгаДолгосрочный,
	|	СУММА(СводныеДанные.РезервПоСомнительнымДолгам) КАК РезервПоСомнительнымДолгам,
	|	СУММА(СводныеДанные.НДСАвансов) КАК НДСАвансов,
	|	СУММА(СводныеДанные.РезервПоСомнительнымДолгамДолгосрочнойЧасти) КАК РезервПоСомнительнымДолгамДолгосрочнойЧасти,
	|	СУММА(СводныеДанные.НДСАвансовДолгосрочнойЧасти) КАК НДСАвансовДолгосрочнойЧасти
	|ПОМЕСТИТЬ ДанныеБаланса
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДолгБУ.Организация КАК Организация,
	|		ДолгБУ.Счет КАК Счет,
	|		СУММА(ДолгБУ.ОстатокБУ) КАК ОстатокДолга,
	|		0 КАК ОстатокДолгаДолгосрочный,
	|		0 КАК РезервПоСомнительнымДолгам,
	|		0 КАК НДСАвансов,
	|		0 КАК РезервПоСомнительнымДолгамДолгосрочнойЧасти,
	|		0 КАК НДСАвансовДолгосрочнойЧасти
	|	ИЗ
	|		ДолгБУ КАК ДолгБУ
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДолгБУ.Организация,
	|		ДолгБУ.Счет
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлассификацияЗадолженности.Организация,
	|		КлассификацияЗадолженности.Счет,
	|		0,
	|		0,
	|		СУММА(КлассификацияЗадолженности.РезервПоСомнительнымДолгам),
	|		СУММА(КлассификацияЗадолженности.НДСАвансов),
	|		0,
	|		0
	|	ИЗ
	|		КлассификацияЗадолженности КАК КлассификацияЗадолженности
	|	ГДЕ
	|		НЕ КлассификацияЗадолженности.Долгосрочный
	|	
	|	СГРУППИРОВАТЬ ПО
	|		КлассификацияЗадолженности.Организация,
	|		КлассификацияЗадолженности.Счет
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлассификацияЗадолженности.Организация,
	|		КлассификацияЗадолженности.Счет,
	|		0,
	|		СУММА(КлассификацияЗадолженности.ОстатокДолга),
	|		0,
	|		0,
	|		СУММА(КлассификацияЗадолженности.РезервПоСомнительнымДолгам),
	|		СУММА(КлассификацияЗадолженности.НДСАвансов)
	|	ИЗ
	|		КлассификацияЗадолженности КАК КлассификацияЗадолженности
	|	ГДЕ
	|		КлассификацияЗадолженности.Долгосрочный
	|	
	|	СГРУППИРОВАТЬ ПО
	|		КлассификацияЗадолженности.Организация,
	|		КлассификацияЗадолженности.Счет) КАК СводныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	СводныеДанные.Организация,
	|	СводныеДанные.Счет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Счета.Организация КАК Организация,
	|	ЕСТЬNULL(ДанныеБаланса.ОстатокДолга, 0) КАК ОстатокДолга,
	|	ЕСТЬNULL(ДанныеБаланса.ОстатокДолгаДолгосрочный, 0) КАК ОстатокДолгаДолгосрочнойЧасти,
	|	ЕСТЬNULL(ДанныеБаланса.ОстатокДолгаДолгосрочный <> 0, ЛОЖЬ) КАК ЕстьДолгосрочнаяЧасть,
	|	ЕСТЬNULL(ДанныеБаланса.РезервПоСомнительнымДолгам <> 0, ЛОЖЬ) КАК ЕстьРезерв,
	|	ЕСТЬNULL(ДанныеБаланса.НДСАвансов <> 0, ЛОЖЬ) КАК ЕстьНДСАвансов,
	|	ЕСТЬNULL(ДанныеБаланса.РезервПоСомнительнымДолгамДолгосрочнойЧасти <> 0, ЛОЖЬ) КАК ЕстьРезервДолгосрочнойЧасти,
	|	ЕСТЬNULL(ДанныеБаланса.НДСАвансовДолгосрочнойЧасти <> 0, ЛОЖЬ) КАК ЕстьНДСАвансовДолгосрочнойЧасти,
	|	ЕСТЬNULL(ДанныеБаланса.РезервПоСомнительнымДолгам, 0) КАК РезервПоСомнительнымДолгам,
	|	ЕСТЬNULL(ДанныеБаланса.НДСАвансов, 0) КАК НДСАвансов,
	|	ЕСТЬNULL(ДанныеБаланса.РезервПоСомнительнымДолгамДолгосрочнойЧасти, 0) КАК РезервПоСомнительнымДолгамДолгосрочнойЧасти,
	|	ЕСТЬNULL(ДанныеБаланса.НДСАвансовДолгосрочнойЧасти, 0) КАК НДСАвансовДолгосрочнойЧасти,
	|	Счета.Счет В (&СчетаУчетаАвансов)
	|		И &РазделятьАвансыПоВидамАктивов КАК РазделятьАвансыПоВидамАктивов,
	|	Счета.Счет В (&СчетаУчетаРБП) КАК ЭтоСчетРБП,
	|	Счета.Счет В (&СчетаУчетаНМА) КАК ЭтоСчетНМА,
	|	Счета.Счет В (&СчетаРасчетовПоАренде) КАК ЭтоСчетАренды,
	|	Счета.Счет КАК Счет,
	|	Счета.Код КАК Код,
	|	Счета.КодГруппы КАК КодГруппы,
	|	Счета.Порядок КАК Порядок,
	|	Счета.ВидСчета КАК ВидСчета,
	|	Счета.ВидСубконто1 КАК ВидСубконто1,
	|	Счета.ВидСубконто2 КАК ВидСубконто2,
	|	Счета.ВидСубконто3 КАК ВидСубконто3
	|ПОМЕСТИТЬ ВсяЗадолженность
	|ИЗ
	|	СчетаОрганизации КАК Счета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеБаланса КАК ДанныеБаланса
	|		ПО Счета.Организация = ДанныеБаланса.Организация
	|			И Счета.Счет = ДанныеБаланса.Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсяЗадолженность.Организация КАК Организация,
	|	ВсяЗадолженность.ОстатокДолга КАК ОстатокДолга,
	|	ВсяЗадолженность.ОстатокДолгаДолгосрочнойЧасти КАК ОстатокДолгаДолгосрочнойЧасти,
	|	ВсяЗадолженность.ЕстьДолгосрочнаяЧасть КАК ЕстьДолгосрочнаяЧасть,
	|	ВсяЗадолженность.ЕстьРезерв КАК ЕстьРезерв,
	|	ВсяЗадолженность.ЕстьНДСАвансов КАК ЕстьНДСАвансов,
	|	ВсяЗадолженность.ЕстьРезервДолгосрочнойЧасти КАК ЕстьРезервДолгосрочнойЧасти,
	|	ВсяЗадолженность.ЕстьНДСАвансовДолгосрочнойЧасти КАК ЕстьНДСАвансовДолгосрочнойЧасти,
	|	ВсяЗадолженность.РезервПоСомнительнымДолгам КАК РезервПоСомнительнымДолгам,
	|	ВсяЗадолженность.НДСАвансов КАК НДСАвансов,
	|	ВсяЗадолженность.РезервПоСомнительнымДолгамДолгосрочнойЧасти КАК РезервПоСомнительнымДолгамДолгосрочнойЧасти,
	|	ВсяЗадолженность.НДСАвансовДолгосрочнойЧасти КАК НДСАвансовДолгосрочнойЧасти,
	|	ВсяЗадолженность.РазделятьАвансыПоВидамАктивов КАК РазделятьАвансыПоВидамАктивов,
	|	ВсяЗадолженность.ЭтоСчетРБП КАК ЭтоСчетРБП,
	|	ВсяЗадолженность.ЭтоСчетНМА КАК ЭтоСчетНМА,
	|	ВсяЗадолженность.ЭтоСчетАренды КАК ЭтоСчетАренды,
	|	ВсяЗадолженность.Счет КАК Счет,
	|	ВсяЗадолженность.Код КАК Код,
	|	ВсяЗадолженность.КодГруппы КАК КодГруппы,
	|	ВсяЗадолженность.Порядок КАК Порядок,
	|	ВсяЗадолженность.ВидСчета КАК ВидСчета,
	|	ВсяЗадолженность.ВидСубконто1 КАК ВидСубконто1,
	|	ВсяЗадолженность.ВидСубконто2 КАК ВидСубконто2,
	|	ВсяЗадолженность.ВидСубконто3 КАК ВидСубконто3
	|ИЗ
	|	ВсяЗадолженность КАК ВсяЗадолженность
	|ГДЕ
	|	НЕ ВсяЗадолженность.ЭтоСчетАренды
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсяЗадолженность.Организация КАК Организация,
	|	ВсяЗадолженность.КодГруппы КАК КодГруппы,
	|	СУММА(ВсяЗадолженность.ОстатокДолга) КАК ОстатокДолга,
	|	СУММА(ВсяЗадолженность.НДСАвансов) КАК НДСАвансов
	|ИЗ
	|	ВсяЗадолженность КАК ВсяЗадолженность
	|ГДЕ
	|	ВсяЗадолженность.ЭтоСчетАренды
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсяЗадолженность.Организация,
	|	ВсяЗадолженность.КодГруппы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаточныеКорректирующиеВеличины.Организация КАК Организация,
	|	ОстаточныеКорректирующиеВеличины.Счет КАК Счет,
	|	СУММА(ОстаточныеКорректирующиеВеличины.РезервПоСомнительнымДолгам) КАК РезервПоСомнительнымДолгам,
	|	СУММА(ОстаточныеКорректирующиеВеличины.НДСАвансов) КАК НДСАвансов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОбщийРезервПоСомнительнымДолгам.Организация КАК Организация,
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам) КАК Счет,
	|		ОбщийРезервПоСомнительнымДолгам.РезервБУ КАК РезервПоСомнительнымДолгам,
	|		0 КАК НДСАвансов
	|	ИЗ
	|		ОбщийРезервПоСомнительнымДолгам КАК ОбщийРезервПоСомнительнымДолгам
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОбщийНДС.Организация,
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСпоАвансамИПредоплатамВыданным),
	|		0,
	|		СУММА(ОбщийНДС.НДСАвансовБУ)
	|	ИЗ
	|		ОбщийНДСВыданный КАК ОбщийНДС
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ОбщийНДС.Организация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлассификацияЗадолженности.Организация,
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам),
	|		-1 * КлассификацияЗадолженности.РезервПоСомнительнымДолгам,
	|		0
	|	ИЗ
	|		КлассификацияЗадолженности КАК КлассификацияЗадолженности
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлассификацияЗадолженности.Организация,
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСпоАвансамИПредоплатамВыданным),
	|		0,
	|		-1 * КлассификацияЗадолженности.НДСАвансов
	|	ИЗ
	|		КлассификацияЗадолженности КАК КлассификацияЗадолженности) КАК ОстаточныеКорректирующиеВеличины
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаточныеКорректирующиеВеличины.Организация,
	|	ОстаточныеКорректирующиеВеличины.Счет
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ОстаточныеКорректирующиеВеличины.РезервПоСомнительнымДолгам) <> 0
	|		ИЛИ СУММА(ОстаточныеКорректирующиеВеличины.НДСАвансов) <> 0)");

	Возврат СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
КонецФункции

Процедура ОпределитьСоставляющиеБалансаДебиторскаяЗадолженность(ДанныеЗаполнения, РасчетныеДанные, КонтекстРасчета)
	
	СчетРезервов = ПланыСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам;
	СчетНДСАвансов = ПланыСчетов.Хозрасчетный.НДСпоАвансамИПредоплатамВыданным;

	Счета = Новый Массив;
	Счета.Добавить(СчетРезервов);
	Счета.Добавить(СчетНДСАвансов);
	
	СчетаСРеквизитами = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Счета, "Код");

	Шаблоны = ШаблоныРасшифровкиДебиторскаяЗадолженность();
	ПараметрыТекста = ПараметрыТекстаРасшифровкиДебиторскаяЗадолженность(КонтекстРасчета, СчетаСРеквизитами);
	ТекстыРасшифровкиПоказателейАренды = ТекстыРасшифровкиПоказателейАренды(КонтекстРасчета);
	
	СоставляющиеКраткосрочная = ДанныеЗаполнения.СоставляющиеКраткосрочная;
	СоставляющиеДолгосрочная = ДанныеЗаполнения.СоставляющиеДолгосрочная;
	
	СтрокаДолг = РасчетныеДанные.Задолженность.Выбрать();
	Пока СтрокаДолг.Следующий() Цикл
		
		// Краткосрочная задолженность
		Составляющая = СоставляющиеКраткосрочная.Добавить();
		Составляющая.Описание = СтрШаблон("+ Задолженность_КД %1", СтрокаДолг.Код);
		Составляющая.КодГруппы = СтрокаДолг.КодГруппы;
		Составляющая.СчетРасчетов = СтрокаДолг.Счет;
		Составляющая.Значение = СтрокаДолг.ОстатокДолга;
		Составляющая.ТекстРасшифровки = ТекстРасшифровкиДебиторскаяЗадолженность(Шаблоны, СтрокаДолг, ПараметрыТекста, "ОбщаяЗадолженность", КонтекстРасчета);
		ОпределитьТипЗадолженности(Составляющая, СтрокаДолг);
		
		Если СтрокаДолг.ЕстьДолгосрочнаяЧасть Тогда
			Составляющая = СоставляющиеКраткосрочная.Добавить();
			Составляющая.Описание = СтрШаблон("- Задолженность_КД %1", СтрокаДолг.Код);
			Составляющая.КодГруппы = СтрокаДолг.КодГруппы;
			Составляющая.СчетРасчетов = СтрокаДолг.Счет;
			Составляющая.Значение = СтрокаДолг.ОстатокДолгаДолгосрочнойЧасти;
			Составляющая.ТекстРасшифровки = ТекстРасшифровкиДебиторскаяЗадолженность(Шаблоны, СтрокаДолг, ПараметрыТекста, "ДолгосрочнаяЧасть", КонтекстРасчета);
			ОпределитьТипЗадолженности(Составляющая, СтрокаДолг);
		КонецЕсли;
		
		Если СтрокаДолг.ЕстьРезерв Тогда
			Составляющая = СоставляющиеКраткосрочная.Добавить();
			Составляющая.Описание = СтрШаблон("- Задолженность_КД %1, %2", СчетаСРеквизитами[СчетРезервов].Код, СтрокаДолг.Код);
			Составляющая.КодГруппы = СтрокаДолг.КодГруппы;
			Составляющая.СчетРасчетов = СтрокаДолг.Счет;
			Составляющая.СчетКорректирующий = СчетРезервов;
			Составляющая.Значение = СтрокаДолг.РезервПоСомнительнымДолгам;
			Составляющая.ТекстРасшифровки = ТекстРасшифровкиДебиторскаяЗадолженность(Шаблоны, СтрокаДолг, ПараметрыТекста, "РезервПоСомнительнымДолгам", КонтекстРасчета);
		КонецЕсли;
		
		Если СтрокаДолг.ЕстьНДСАвансов Тогда
			Составляющая = СоставляющиеКраткосрочная.Добавить();
			Составляющая.Описание = СтрШаблон("- Задолженность_КД %1, %2", СчетаСРеквизитами[СчетНДСАвансов].Код, СтрокаДолг.Код);
			Составляющая.КодГруппы = СтрокаДолг.КодГруппы;
			Составляющая.СчетРасчетов = СтрокаДолг.Счет;
			Составляющая.СчетКорректирующий = СчетНДСАвансов;
			Составляющая.Значение = СтрокаДолг.НДСАвансов;
			Составляющая.ТекстРасшифровки = ТекстРасшифровкиДебиторскаяЗадолженность(Шаблоны, СтрокаДолг, ПараметрыТекста, "НДСАвансов", КонтекстРасчета);
		КонецЕсли;
		
		// Долгосрочная задолженность
		Если СтрокаДолг.ЕстьДолгосрочнаяЧасть Тогда
			Составляющая = СоставляющиеДолгосрочная.Добавить();
			Составляющая.Описание = СтрШаблон("+ Задолженность_ДД %1", СтрокаДолг.Код);
			Составляющая.КодГруппы = СтрокаДолг.КодГруппы;
			Составляющая.СчетРасчетов = СтрокаДолг.Счет;
			Составляющая.Значение = СтрокаДолг.ОстатокДолгаДолгосрочнойЧасти;
			Составляющая.ТекстРасшифровки = ТекстРасшифровкиДебиторскаяЗадолженность(Шаблоны, СтрокаДолг, ПараметрыТекста, "ДолгосрочнаяЧасть", КонтекстРасчета);
			ОпределитьТипЗадолженности(Составляющая, СтрокаДолг);
			
			Если СтрокаДолг.ЕстьРезервДолгосрочнойЧасти Тогда
				Составляющая = СоставляющиеДолгосрочная.Добавить();
				Составляющая.Описание = СтрШаблон("- Задолженность_ДД %1, %2", СчетаСРеквизитами[СчетРезервов].Код, СтрокаДолг.Код);
				Составляющая.КодГруппы = СтрокаДолг.КодГруппы;
				Составляющая.СчетРасчетов = СтрокаДолг.Счет;
				Составляющая.СчетКорректирующий = СчетРезервов;
				Составляющая.Значение = СтрокаДолг.РезервПоСомнительнымДолгамДолгосрочнойЧасти;
				Составляющая.ТекстРасшифровки = ТекстРасшифровкиДебиторскаяЗадолженность(Шаблоны, СтрокаДолг, ПараметрыТекста, "РезервПоСомнительнымДолгам", КонтекстРасчета);
			КонецЕсли;
			
			Если СтрокаДолг.ЕстьНДСАвансовДолгосрочнойЧасти Тогда
				Составляющая = СоставляющиеДолгосрочная.Добавить();
				Составляющая.Описание = СтрШаблон("- Задолженность_ДД %1, %2", СчетаСРеквизитами[СчетНДСАвансов].Код, СтрокаДолг.Код);
				Составляющая.КодГруппы = СтрокаДолг.КодГруппы;
				Составляющая.СчетРасчетов = СтрокаДолг.Счет;
				Составляющая.СчетКорректирующий = СчетНДСАвансов;
				Составляющая.Значение = СтрокаДолг.НДСАвансовДолгосрочнойЧасти;
				Составляющая.ТекстРасшифровки = ТекстРасшифровкиДебиторскаяЗадолженность(Шаблоны, СтрокаДолг, ПараметрыТекста, "НДСАвансов", КонтекстРасчета);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// добавляем составляющие, которые отражают остаточную сумму корректирующих величин
	СтрокиГрупп = СоставляющиеКраткосрочная.НайтиСтроки(Новый Структура("КодГруппы", "12301"));
	Если ЗначениеЗаполнено(СтрокиГрупп) Тогда 
		ИндексСтроки = СоставляющиеКраткосрочная.Индекс(СтрокиГрупп[СтрокиГрупп.Количество() - 1]);
		Составляющая = СоставляющиеКраткосрочная.Вставить(ИндексСтроки + 1);
	Иначе
		Составляющая = СоставляющиеКраткосрочная.Добавить();
	КонецЕсли;
	Составляющая.Описание = СтрШаблон("- Задолженность_КД %1", СчетаСРеквизитами[СчетРезервов].Код);
	Составляющая.КодГруппы = "12301";
	Составляющая.СчетРасчетов = СчетРезервов;
	Составляющая.СчетКорректирующий = СчетРезервов;
	СтрокиТаблицы = РасчетныеДанные.НераспределенныеВеличины.НайтиСтроки(Новый Структура("Счет", СчетРезервов));
	Если ЗначениеЗаполнено(СтрокиТаблицы) Тогда
		Составляющая.Значение = СтрокиТаблицы[0].РезервПоСомнительнымДолгам;
	КонецЕсли;
	Составляющая.ТекстРасшифровки = ТекстРасшифровкиДебиторскаяЗадолженность(Шаблоны, СтрокаДолг, ПараметрыТекста, "ОстаточныйРезервПоСомнительнымДолгам", КонтекстРасчета);
	Составляющая.Тип = "ОстаточныйРезерв";
	
	СтрокиГрупп = СоставляющиеКраткосрочная.НайтиСтроки(Новый Структура("КодГруппы", "12302"));
	Если ЗначениеЗаполнено(СтрокиГрупп) Тогда 
		ИндексСтроки = СоставляющиеКраткосрочная.Индекс(СтрокиГрупп[СтрокиГрупп.Количество() - 1]);
		Составляющая = СоставляющиеКраткосрочная.Вставить(ИндексСтроки + 1);
	Иначе
		Составляющая = СоставляющиеКраткосрочная.Добавить();
	КонецЕсли;
	Составляющая.Описание = СтрШаблон("- Задолженность_КД %1", СчетаСРеквизитами[СчетНДСАвансов].Код);
	Составляющая.КодГруппы = "12302";
	Составляющая.СчетРасчетов = СчетНДСАвансов;
	Составляющая.СчетКорректирующий = СчетНДСАвансов;
	СтрокиТаблицы = РасчетныеДанные.НераспределенныеВеличины.НайтиСтроки(Новый Структура("Счет", СчетНДСАвансов));
	Если ЗначениеЗаполнено(СтрокиТаблицы) Тогда
		Составляющая.Значение = СтрокиТаблицы[0].НДСАвансов;
	КонецЕсли;
	Составляющая.ТекстРасшифровки = ТекстРасшифровкиДебиторскаяЗадолженность(Шаблоны, СтрокаДолг, ПараметрыТекста, "ОстаточныйНДСАвансов", КонтекстРасчета);
	Составляющая.Тип = "ОстаточныйНДСАвансов";
	
	// Авансы по аренде
	СтрокаДолг = РасчетныеДанные.РасчетыПоАренде.Выбрать();
	Пока СтрокаДолг.Следующий() Цикл
		Составляющая = СоставляющиеКраткосрочная.Добавить();
		Составляющая.Описание = "+ Задолженность_КК 76.07";
		Составляющая.КодГруппы = СтрокаДолг.КодГруппы;
		Составляющая.Значение = СтрокаДолг.ОстатокДолга - СтрокаДолг.НДСАвансов;
		Составляющая.ТекстРасшифровки = ТекстыРасшифровкиПоказателейАренды["СК_РасчетыПоАрендеАвансы"];
		Составляющая.Тип = "Аренда";
	КонецЦикла;
	
КонецПроцедуры

Функция ШаблоныРасшифровкиДебиторскаяЗадолженность()
	
	Шаблоны = Новый Структура;

	Шаблоны.Вставить("ШаблонЗадолженность", 
	                 НСтр("ru = 'Сальдо на конец периода по дебету счета [СчетРасчетов]'"));
	Шаблоны.Вставить("ШаблонАвансыРазделятьПоВидамАктивов", 
	                 НСтр("ru = 'Сальдо на конец периода по дебету счета [СчетРасчетов][ИсключаемыеВидыАктивов]'"));
	Шаблоны.Вставить("ШаблонЗадолженностьРБП", 
	                 НСтр("ru = 'Сальдо на конец периода по дебету счета [СчетРасчетов] по статьям с видом актива в балансе ""[ВидАктиваДебиторскаяЗадолженность]""'"));
	Шаблоны.Вставить("ШаблонЗадолженностьРазвернутое",
	                 НСтр("ru = 'Сальдо на конец периода по дебету счета [СчетРасчетов], развернутое по субконто [ВидыСубконто]'"));
	Шаблоны.Вставить("ШаблонЗадолженностьДолгосрочная",
	                 НСтр("ru = 'Сальдо на конец периода по дебету счета [СчетРасчетов] (суммы со сроком погашения задолженности не ранее [ДатаДолгосрочногоПериода])'"));
	Шаблоны.Вставить("ШаблонАвансыРазделятьПоВидамАктивовДолгосрочная",
	                 НСтр("ru = 'Сальдо на конец периода по дебету счета [СчетРасчетов][ИсключаемыеВидыАктивов] (суммы со сроком погашения задолженности не ранее [ДатаДолгосрочногоПериода])'"));
	Шаблоны.Вставить("ШаблонЗадолженностьДолгосрочнаяРБП", 
	                 НСтр("ru = 'Сальдо на конец периода по дебету счета [СчетРасчетов] по статьям с видом актива в балансе ""[ВидАктиваДебиторскаяЗадолженность]"" (суммы со сроком погашения задолженности не ранее [ДатаДолгосрочногоПериода])'")); 
	 Шаблоны.Вставить("ШаблонЗадолженностьДолгосрочнаяРазвернутое",
	                 НСтр("ru = 'Сальдо на конец периода по дебету счета [СчетРасчетов], развернутое по субконто [ВидыСубконто] (суммы со сроком погашения задолженности не ранее [ДатаДолгосрочногоПериода])'"));
	Шаблоны.Вставить("ШаблонРезервПоОбъектам",
	                 НСтр("ru = 'Сальдо на конец периода по кредиту счета [СчетРезервов] по объектам, учитываемым на счете [СчетРасчетов]'"));
	Шаблоны.Вставить("ШаблонРезервОстаточный",
	                 НСтр("ru = 'Сальдо на конец периода по кредиту счета [СчетРезервов], уменьшенное на величины, выделенные по объектам учета'"));
	Шаблоны.Вставить("ШаблонНДСПоОбъектам",
	                 НСтр("ru = 'Сальдо на конец периода по кредиту счета [СчетНДС], учитываемым на счете [СчетРасчетов]'"));
	Шаблоны.Вставить("ШаблонНДСОстаточный",
	                 НСтр("ru = 'Сальдо на конец периода по кредиту счета [СчетНДС], уменьшенное на величины, выделенные по объектам учета'"));
	
	Возврат Шаблоны;
	
КонецФункции

Функция ТекстРасшифровкиДебиторскаяЗадолженность(Шаблоны, СтрокаСчет, ПараметрыТекста, МеткаСоставляющей, КонтекстРасчета)
	
	ПараметрыТекста.Вставить("ВидыСубконто", "");
	ПараметрыТекста.СчетРасчетов = СтрокаСчет.Код;
	ВидыСубконто = Новый Массив;
	Если СтрокаСчет.ВидСчета = ВидСчета.АктивноПассивный Тогда
		Если ЗначениеЗаполнено(СтрокаСчет.ВидСубконто1) Тогда
			ВидыСубконто.Добавить(СтрШаблон("""%1""", СтрокаСчет.ВидСубконто1));
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаСчет.ВидСубконто2) Тогда
			ВидыСубконто.Добавить(СтрШаблон("""%1""", СтрокаСчет.ВидСубконто2));
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаСчет.ВидСубконто3) Тогда
			ВидыСубконто.Добавить(СтрШаблон("""%1""", СтрокаСчет.ВидСубконто3));
		КонецЕсли;
		ПараметрыТекста.ВидыСубконто = СтрСоединить(ВидыСубконто, ",");
	КонецЕсли;

	Если МеткаСоставляющей = "ОбщаяЗадолженность" Тогда
		Если СтрокаСчет.ЭтоСчетРБП Тогда
			ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонЗадолженностьРБП, ПараметрыТекста);
		ИначеЕсли СтрокаСчет.ВидСчета = ВидСчета.АктивноПассивный И ЗначениеЗаполнено(ВидыСубконто) Тогда
			ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонЗадолженностьРазвернутое, ПараметрыТекста);
		ИначеЕсли СтрокаСчет.РазделятьАвансыПоВидамАктивов Тогда
			ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонАвансыРазделятьПоВидамАктивов, ПараметрыТекста);
		Иначе
			ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонЗадолженность, ПараметрыТекста);
		КонецЕсли;
	ИначеЕсли МеткаСоставляющей = "ДолгосрочнаяЧасть" Тогда
		Если СтрокаСчет.ЭтоСчетРБП Тогда
			ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонЗадолженностьДолгосрочнаяРБП, ПараметрыТекста);
		ИначеЕсли СтрокаСчет.ВидСчета = ВидСчета.АктивноПассивный И ЗначениеЗаполнено(ВидыСубконто) Тогда
			ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонЗадолженностьДолгосрочнаяРазвернутое, ПараметрыТекста);
		ИначеЕсли СтрокаСчет.РазделятьАвансыПоВидамАктивов Тогда
			ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонАвансыРазделятьПоВидамАктивовДолгосрочная, ПараметрыТекста);
		Иначе
			ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонЗадолженностьДолгосрочная, ПараметрыТекста);
		КонецЕсли;
	ИначеЕсли МеткаСоставляющей = "РезервПоСомнительнымДолгам" Тогда
		ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонРезервПоОбъектам, ПараметрыТекста);
	ИначеЕсли МеткаСоставляющей = "НДСАвансов" Тогда
		ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонНДСПоОбъектам, ПараметрыТекста);
	ИначеЕсли МеткаСоставляющей = "ОстаточныйРезервПоСомнительнымДолгам" Тогда
		ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонРезервОстаточный, ПараметрыТекста);
	ИначеЕсли МеткаСоставляющей = "ОстаточныйНДСАвансов" Тогда
		ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонНДСОстаточный, ПараметрыТекста);
	КонецЕсли;
	
	Возврат ТекстРасшифровки;
	
КонецФункции

Функция ПараметрыТекстаРасшифровкиДебиторскаяЗадолженность(КонтекстРасчета, СчетаСРеквизитами)
	
	ПараметрыТекста = Новый Структура;
	ПараметрыТекста.Вставить("ДатаДолгосрочногоПериода", Формат(КонецМесяца(ДобавитьМесяц(КонтекстРасчета.КонецПериодаДата, 12)) + 1, "ДЛФ=DD"));
	ПараметрыТекста.Вставить("СчетРезервов", СчетаСРеквизитами[ПланыСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам].Код);
	ПараметрыТекста.Вставить("СчетНДС",      СчетаСРеквизитами[ПланыСчетов.Хозрасчетный.НДСпоАвансамИПредоплатамВыданным].Код);
	ПараметрыТекста.Вставить("СчетРасчетов", "");
	ПараметрыТекста.Вставить("ВидыСубконто", "");
	ПараметрыТекста.Вставить("ВидАктиваДебиторскаяЗадолженность", Перечисления.ВидыАктивовДляРБП.ДебиторскаяЗадолженность);
	ПараметрыТекста.Вставить("ИсключаемыеВидыАктивов", "");
	
	Если КонтекстРасчета.РазделятьАвансыПоВидамАктивов Тогда
		ПараметрыТекста.ИсключаемыеВидыАктивов = НСтр("ru = ' по договорам, с признаком отражения в балансе не отнесенным к ""Основным средствам"", ""Инвестиционной недвижимости"", ""Нематериальным активам"", ""Прочим внеоборотным активам"", ""Запасам"" или ""Прочим оборотным активам""'");
	КонецЕсли;
	
	Возврат ПараметрыТекста;
	
КонецФункции

#КонецОбласти

#Область КредиторскаяЗадолженность

Функция ГруппыКредиторскаяКраткосрочнаяЗадолженность(КонтекстРасчета)
	
	ВидыСчетов = Новый Массив;
	ВидыСчетов.Добавить(ВидСчета.Пассивный);
	ВидыСчетов.Добавить(ВидСчета.АктивноПассивный);
	
	Группы = НовыйГруппы();
	
	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расчеты с поставщиками и подрядчиками'");
	Группа.Код = "15201";
	СчетаСписком = "60";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расчеты с покупателями и заказчиками'");
	Группа.Код = "15202";
	СчетаСписком = "62";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);
	
	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расчеты по налогам и сборам'");
	Группа.Код = "15203";
	СчетаСписком = "68";
	СчетаИсключенияСписком = "68.02, 68.90, 68.04.2";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов, СчетаИсключенияСписком);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расчеты по НДС, не отраженные на ЕНС'");
	Группа.Код = "15204";
	СчетаСписком = "68.02, 76.НА";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Сальдо по ЕНС'");
	Группа.Код = "15205";
	СчетаСписком = "68.90";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расчеты по социальному страхованию и обеспечению'");
	Группа.Код = "15206";
	СчетаСписком = "69";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расчеты с персоналом по оплате труда'");
	Группа.Код = "15207";
	СчетаСписком = "70";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расчеты с подотчетными лицами'");
	Группа.Код = "15208";
	СчетаСписком = "71";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);
	
	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расчеты с персоналом по прочим операциям'");
	Группа.Код = "15209";
	СчетаСписком = "73";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расчеты по вкладам в уставный (складочный) капитал'");
	Группа.Код = "15210";
	СчетаСписком = "75";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Расчеты с разными дебиторами и кредиторами'");
	Группа.Код = "15211";
	СчетаСписком = "76";
	СчетаИсключенияСписком = "76.07, 76.27, 76.37, 76.ВА, 76.НА";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов, СчетаИсключенияСписком);
	
	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Доходы, полученные в счет будущих периодов'");
	Группа.Код = "15212";
	СчетаСписком = "98.01";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);

	Если НЕ КонтекстРасчета.ЭтоБалансНекоммерческойОрганизации Тогда
		Группа = Группы.Добавить();
		Группа.Наименование = НСтр("ru = 'Целевое финансирование'");
		Группа.Код = "15213";
		СчетаСписком = "86";
		Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);
	КонецЕсли;

	Возврат Группы;
	
КонецФункции

Функция ГруппыРасчетыПоАрендеЗадолженность()

	Группы = НовыйГруппы();
	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Обязательство по аренде (лизингу)'");
	Группа.ЭтоАренда = Истина;
	
	Возврат Группы;

КонецФункции

Функция ДанныеЗаполненияКредиторскаяЗадолженность(МенеджерВременныхТаблиц, КонтекстРасчета)
	
	ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская;
	
	// Заполняем счетами расчетов и счетами аренды
	СчетаКредиторская =  КлассификацияЗадолженности.СчетаРасчетовКредиторскаяЗадолженность();

	СписокВидовСубконто = КлассификацияЗадолженности.СписокВидовСубконто();
	НаборыСчетов = КлассификацияЗадолженности.НаборыСчетовБаланса(ВидЗадолженности, СписокВидовСубконто);
	ТаблицаСчетов = КлассификацияЗадолженности.НовыйТаблицаСчетов();
	
	КлассификацияЗадолженности.ЗаполнитьНаборыСчетами(НаборыСчетов, СчетаКредиторская.СчетаРасчетов, ТаблицаСчетов);

	Группы = ГруппыКредиторскаяКраткосрочнаяЗадолженность(КонтекстРасчета);
	ОпределитьГруппуСчетов(ТаблицаСчетов, Группы);
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапросаСводныеДанныеКредиторскаяЗадолженность(НаборыСчетов, КонтекстРасчета, ВидЗадолженности);

	Запрос.УстановитьПараметр("Организации",      КонтекстРасчета.Организации);
	Запрос.УстановитьПараметр("НачалоПериода",    НачалоМесяца(КонтекстРасчета.КонецПериодаДата));
	Запрос.УстановитьПараметр("КонецПериода",     Новый Граница(КонтекстРасчета.КонецПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериодаДата", КонецДня(КонтекстРасчета.КонецПериодаДата));
	Запрос.УстановитьПараметр("ДатаНачалаДолгосрочногоПериода", КонецМесяца(ДобавитьМесяц(КонтекстРасчета.КонецПериодаДата, 12)) + 1);
	Запрос.УстановитьПараметр("СчетаРасчетовКредиторская", СчетаКредиторская.СчетаРасчетов);
	Запрос.УстановитьПараметр("СчетаРасчетовПоАренде",   СчетаКредиторская.СчетаРасчетовПоАренде);
	Запрос.УстановитьПараметр("ВидЗадолженности", ВидЗадолженности);
	Запрос.УстановитьПараметр("ТаблицаСчетов",    ТаблицаСчетов);
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	Запрос.УстановитьПараметр("СчетаНДСАвансовПолученных", БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.НДСпоАвансамИПредоплатам));

	СубконтоКонтрагентыСФВыданные = Новый Массив;
	СубконтоКонтрагентыСФВыданные.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	СубконтоКонтрагентыСФВыданные.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СФВыданные);
	Запрос.УстановитьПараметр("СубконтоКонтрагентыСФВыданные", СубконтоКонтрагентыСФВыданные);

	Запрос.УстановитьПараметр("СчетаПроцентовПоРассрочке", ПланыСчетов.Хозрасчетный.СчетаПроцентовПоРассрочке());
	
	// Виды субконто
	Для Каждого ВидыСубконто Из СписокВидовСубконто Цикл
		Запрос.УстановитьПараметр(ВидыСубконто.Ключ, ВидыСубконто.Значение);
	КонецЦикла;
	
	// Наборы счетов
	Для Каждого Набор Из НаборыСчетов Цикл
		Запрос.УстановитьПараметр(Набор.ИмяНабора, Набор.СписокСчетов);
	КонецЦикла;
	
	Результат = Запрос.ВыполнитьПакет();
	КоличествоЗапросов = Результат.ВГраница();
	
	РасчетныеДанные = Новый Структура;
	РасчетныеДанные.Вставить("Задолженность", Результат[КоличествоЗапросов - 2]);
	РасчетныеДанные.Вставить("НераспределенныеВеличины", Результат[КоличествоЗапросов].Выгрузить());

	ДанныеЗаполненияЗадолженности = НовыйДанныеЗаполненияЗадолженности();
	ДанныеЗаполненияЗадолженности.Вставить("ГруппыКраткосрочная", Группы);
	ОпределитьСоставляющиеБалансаКредиторскаяЗадолженность(ДанныеЗаполненияЗадолженности, РасчетныеДанные, КонтекстРасчета);
	
	РасчетныеДанные = Новый Структура;
	РасчетныеДанные.Вставить("Задолженность", Результат[КоличествоЗапросов - 1]);
	
	ДанныеЗаполненияАренды = НовыйДанныеЗаполненияЗадолженности();
	ДанныеЗаполненияАренды.Вставить("ГруппыКраткосрочная", ГруппыРасчетыПоАрендеЗадолженность());
	ОпределитьСоставляющиеБалансаАренды(ДанныеЗаполненияАренды, РасчетныеДанные, КонтекстРасчета);
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Задолженность",   ДанныеЗаполненияЗадолженности);
	ДанныеЗаполнения.Вставить("РасчетыПоАренде", ДанныеЗаполненияАренды);

	ОбщегоНазначенияБП.УничтожитьВременныеТаблицы(МенеджерВременныхТаблиц,,"ОбщийНДСВыданный,ОбщийРезервПоСомнительнымДолгам,ОбязательстваПоАренде,АвансыПоАренде,НДСАвансовРасчетыПоАренде");

	Возврат ДанныеЗаполнения;

КонецФункции

Функция ТекстЗапросаСводныеДанныеКредиторскаяЗадолженность(НаборыСчетов, КонтекстРасчета, ВидЗадолженности)
	
	ТекстыЗапросов = Новый Массив;
	// Остатки задолженности по счетам, которые участвуют в классификации задолженности по срокам погашения
	КонтекстЗапроса = КлассификацияЗадолженности.НовыйКонтекстЗапросаОстаткиЗадолженности();
	ТекстЗапросаОстатки = КлассификацияЗадолженности.ТекстЗапросаОстаткиЗадолженности(НаборыСчетов, КонтекстЗапроса, ВидЗадолженности);
	Если ЗначениеЗаполнено(ТекстЗапросаОстатки) Тогда
		ТекстыЗапросов.Добавить(ТекстЗапросаОстатки);
	КонецЕсли;
	
	ТекстыЗапросов.Добавить(
	"ВЫБРАТЬ
	|	Расчеты.Организация КАК Организация,
	|	Расчеты.Счет КАК Счет,
	|	СУММА(Расчеты.ОстатокКт) КАК ОстатокБУ
	|ПОМЕСТИТЬ ДолгБУ
	|ИЗ
	|	Расчеты КАК Расчеты
	|
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Организация,
	|	Расчеты.Счет");
	
	ТекстыЗапросов.Добавить(
	"ВЫБРАТЬ
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Организация КАК Организация,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Счет КАК Счет,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.ДатаПогашения >= &ДатаНачалаДолгосрочногоПериода КАК Долгосрочный,
	|	СУММА(КлассификацияПоСрокамОтдельныхВидовЗадолженности.ОстатокДолга) КАК ОстатокДолга,
	|	СУММА(КлассификацияПоСрокамОтдельныхВидовЗадолженности.НДСАвансов) КАК НДСАвансов,
	|	СУММА(КлассификацияПоСрокамОтдельныхВидовЗадолженности.ПроцентыПоРассрочке) КАК ПроцентыПоРассрочке
	|ПОМЕСТИТЬ КлассификацияЗадолженности
	|ИЗ
	|	РегистрСведений.КлассификацияПоСрокамОтдельныхВидовЗадолженности КАК КлассификацияПоСрокамОтдельныхВидовЗадолженности
	|ГДЕ
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Активность
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.Организация В(&Организации)
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.ПериодРасчета МЕЖДУ &НачалоПериода И &КонецПериодаДата
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.Счет В(&СчетаРасчетовКредиторская)
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.ВидЗадолженности = &ВидЗадолженности
	|
	|СГРУППИРОВАТЬ ПО
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Организация,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Счет,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.ДатаПогашения >= &ДатаНачалаДолгосрочногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Организация КАК Организация,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Счет КАК Счет,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокамОтдельныхВидовЗадолженности.Субконто1) = &ПустойУникальныйИдентификатор
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ КлассификацияПоСрокамОтдельныхВидовЗадолженности.Субконто1
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокамОтдельныхВидовЗадолженности.Субконто2) = &ПустойУникальныйИдентификатор
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ КлассификацияПоСрокамОтдельныхВидовЗадолженности.Субконто2
	|	КОНЕЦ КАК Субконто2,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.ОстатокДолга КАК ОстатокДолга,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.ДатаПогашения КАК ДатаПогашения
	|ПОМЕСТИТЬ КлассификацияАрендныхОбязательств
	|ИЗ
	|	РегистрСведений.КлассификацияПоСрокамОтдельныхВидовЗадолженности КАК КлассификацияПоСрокамОтдельныхВидовЗадолженности
	|ГДЕ
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Активность
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.Организация В(&Организации)
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.ПериодРасчета МЕЖДУ &НачалоПериода И &КонецПериодаДата
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.Счет В(&СчетаРасчетовПоАренде)
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.ВидЗадолженности = &ВидЗадолженности");
	
	ТекстыЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ТаблицаСчетов.Счет КАК Счет,
	|	ТаблицаСчетов.Код КАК Код,
	|	ТаблицаСчетов.КодГруппы КАК КодГруппы,
	|	ТаблицаСчетов.Порядок КАК Порядок,
	|	ТаблицаСчетов.ВидСчета КАК ВидСчета,
	|	ТаблицаСчетов.ВидСубконто1 КАК ВидСубконто1,
	|	ТаблицаСчетов.ВидСубконто2 КАК ВидСубконто2,
	|	ТаблицаСчетов.ВидСубконто3 КАК ВидСубконто3
	|ПОМЕСТИТЬ СчетаНаборов
	|ИЗ
	|	&ТаблицаСчетов КАК ТаблицаСчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация,
	|	СчетаНаборов.Счет КАК Счет,
	|	СчетаНаборов.Код КАК Код,
	|	СчетаНаборов.КодГруппы КАК КодГруппы,
	|	СчетаНаборов.Порядок КАК Порядок,
	|	СчетаНаборов.ВидСчета КАК ВидСчета,
	|	СчетаНаборов.ВидСубконто1 КАК ВидСубконто1,
	|	СчетаНаборов.ВидСубконто2 КАК ВидСубконто2,
	|	СчетаНаборов.ВидСубконто3 КАК ВидСубконто3
	|ПОМЕСТИТЬ СчетаОрганизации
	|ИЗ
	|	СчетаНаборов КАК СчетаНаборов,
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка В(&Организации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СводныеДанные.Организация КАК Организация,
	|	СводныеДанные.Счет КАК Счет,
	|	СУММА(СводныеДанные.ОстатокДолга) КАК ОстатокДолга,
	|	ВЫБОР
	|		КОГДА СУММА(СводныеДанные.ОстатокДолгаДолгосрочный) < 0
	|				ИЛИ СУММА(СводныеДанные.ОстатокДолга) < 0
	|			ТОГДА 0
	|		КОГДА СУММА(СводныеДанные.ОстатокДолгаДолгосрочный) < СУММА(СводныеДанные.ОстатокДолга)
	|			ТОГДА СУММА(СводныеДанные.ОстатокДолгаДолгосрочный)
	|		ИНАЧЕ СУММА(СводныеДанные.ОстатокДолга)
	|	КОНЕЦ КАК ОстатокДолгаДолгосрочный,
	|	СУММА(СводныеДанные.НДСАвансов) КАК НДСАвансов,
	|	СУММА(СводныеДанные.ПроцентыПоРассрочке) КАК ПроцентыПоРассрочке,
	|	СУММА(СводныеДанные.НДСАвансовДолгосрочнойЧасти) КАК НДСАвансовДолгосрочнойЧасти,
	|	СУММА(СводныеДанные.ПроцентыПоРассрочкеДолгосрочнойЧасти) КАК ПроцентыПоРассрочкеДолгосрочнойЧасти
	|ПОМЕСТИТЬ ДанныеБаланса
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДолгБУ.Организация КАК Организация,
	|		ДолгБУ.Счет КАК Счет,
	|		СУММА(ДолгБУ.ОстатокБУ) КАК ОстатокДолга,
	|		0 КАК ОстатокДолгаДолгосрочный,
	|		0 КАК НДСАвансов,
	|		0 КАК ПроцентыПоРассрочке,
	|		0 КАК НДСАвансовДолгосрочнойЧасти,
	|		0 КАК ПроцентыПоРассрочкеДолгосрочнойЧасти
	|	ИЗ
	|		ДолгБУ КАК ДолгБУ
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДолгБУ.Организация,
	|		ДолгБУ.Счет
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлассификацияЗадолженности.Организация,
	|		КлассификацияЗадолженности.Счет,
	|		0,
	|		0,
	|		СУММА(КлассификацияЗадолженности.НДСАвансов),
	|		СУММА(КлассификацияЗадолженности.ПроцентыПоРассрочке),
	|		0,
	|		0
	|	ИЗ
	|		КлассификацияЗадолженности КАК КлассификацияЗадолженности
	|	ГДЕ
	|		НЕ КлассификацияЗадолженности.Долгосрочный
	|	
	|	СГРУППИРОВАТЬ ПО
	|		КлассификацияЗадолженности.Организация,
	|		КлассификацияЗадолженности.Счет
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлассификацияЗадолженности.Организация,
	|		КлассификацияЗадолженности.Счет,
	|		0,
	|		СУММА(КлассификацияЗадолженности.ОстатокДолга),
	|		0,
	|		0,
	|		СУММА(КлассификацияЗадолженности.НДСАвансов),
	|		СУММА(КлассификацияЗадолженности.ПроцентыПоРассрочке)
	|	ИЗ
	|		КлассификацияЗадолженности КАК КлассификацияЗадолженности
	|	ГДЕ
	|		КлассификацияЗадолженности.Долгосрочный
	|	
	|	СГРУППИРОВАТЬ ПО
	|		КлассификацияЗадолженности.Организация,
	|		КлассификацияЗадолженности.Счет) КАК СводныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	СводныеДанные.Организация,
	|	СводныеДанные.Счет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Счета.Организация КАК Организация,
	|	ЕСТЬNULL(ДанныеБаланса.ОстатокДолга, 0) КАК ОстатокДолга,
	|	ЕСТЬNULL(ДанныеБаланса.ОстатокДолгаДолгосрочный, 0) КАК ОстатокДолгаДолгосрочнойЧасти,
	|	ЕСТЬNULL(ДанныеБаланса.ОстатокДолгаДолгосрочный <> 0, ЛОЖЬ) КАК ЕстьДолгосрочнаяЧасть,
	|	ЕСТЬNULL(ДанныеБаланса.ПроцентыПоРассрочке <> 0, ЛОЖЬ) КАК ЕстьПроцентыПоРассрочке,
	|	ЕСТЬNULL(ДанныеБаланса.НДСАвансов <> 0, ЛОЖЬ) КАК ЕстьНДСАвансов,
	|	ЕСТЬNULL(ДанныеБаланса.ПроцентыПоРассрочкеДолгосрочнойЧасти <> 0, ЛОЖЬ) КАК ЕстьПроцентыПоРассрочкеДолгосрочнойЧасти,
	|	ЕСТЬNULL(ДанныеБаланса.НДСАвансовДолгосрочнойЧасти <> 0, ЛОЖЬ) КАК ЕстьНДСАвансовДолгосрочнойЧасти,
	|	ЕСТЬNULL(ДанныеБаланса.ПроцентыПоРассрочке, 0) КАК ПроцентыПоРассрочке,
	|	ЕСТЬNULL(ДанныеБаланса.НДСАвансов, 0) КАК НДСАвансов,
	|	ЕСТЬNULL(ДанныеБаланса.ПроцентыПоРассрочкеДолгосрочнойЧасти, 0) КАК ПроцентыПоРассрочкеДолгосрочнойЧасти,
	|	ЕСТЬNULL(ДанныеБаланса.НДСАвансовДолгосрочнойЧасти, 0) КАК НДСАвансовДолгосрочнойЧасти,
	|	Счета.Счет КАК Счет,
	|	Счета.Код КАК Код,
	|	Счета.КодГруппы КАК КодГруппы,
	|	Счета.Порядок КАК Порядок,
	|	Счета.ВидСчета КАК ВидСчета,
	|	Счета.ВидСубконто1 КАК ВидСубконто1,
	|	Счета.ВидСубконто2 КАК ВидСубконто2,
	|	Счета.ВидСубконто3 КАК ВидСубконто3
	|ИЗ
	|	СчетаОрганизации КАК Счета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеБаланса КАК ДанныеБаланса
	|		ПО Счета.Организация = ДанныеБаланса.Организация
	|			И Счета.Счет = ДанныеБаланса.Счет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоАренде.Организация КАК Организация,
	|	СУММА(РасчетыПоАренде.ОстатокДолгаДолгосрочнойЧасти) КАК ОстатокДолгаДолгосрочнойЧасти,
	|	СУММА(РасчетыПоАренде.ОстатокДолгаКраткосрочнойЧасти) КАК ОстатокДолгаКраткосрочнойЧасти
	|ИЗ
	|	(ВЫБРАТЬ
	|		КлассификацияАрендныхОбязательств.Организация КАК Организация,
	|		ВЫБОР
	|			КОГДА КлассификацияАрендныхОбязательств.ДатаПогашения >= &ДатаНачалаДолгосрочногоПериода
	|				ТОГДА КлассификацияАрендныхОбязательств.ОстатокДолга
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ОстатокДолгаДолгосрочнойЧасти,
	|		ВЫБОР
	|			КОГДА КлассификацияАрендныхОбязательств.ДатаПогашения < &ДатаНачалаДолгосрочногоПериода
	|				ТОГДА КлассификацияАрендныхОбязательств.ОстатокДолга
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ОстатокДолгаКраткосрочнойЧасти
	|	ИЗ
	|		КлассификацияАрендныхОбязательств КАК КлассификацияАрендныхОбязательств
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбязательстваПоАренде КАК ОбязательстваПоАренде
	|			ПО КлассификацияАрендныхОбязательств.Организация = ОбязательстваПоАренде.Организация
	|				И КлассификацияАрендныхОбязательств.Счет = ОбязательстваПоАренде.Счет
	|				И КлассификацияАрендныхОбязательств.Субконто1 = ОбязательстваПоАренде.Субконто1
	|				И КлассификацияАрендныхОбязательств.Субконто2 = ОбязательстваПоАренде.Субконто2
	|				И (НЕ ОбязательстваПоАренде.ЕстьРасхождениеОстаткаДолга)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОбязательстваПоАренде.Организация,
	|		0,
	|		ОбязательстваПоАренде.ОстатокБУ
	|	ИЗ
	|		ОбязательстваПоАренде КАК ОбязательстваПоАренде
	|	ГДЕ
	|		ОбязательстваПоАренде.ЕстьРасхождениеОстаткаДолга) КАК РасчетыПоАренде
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоАренде.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаточныеКорректирующиеВеличины.Организация КАК Организация,
	|	ОстаточныеКорректирующиеВеличины.Счет КАК Счет,
	|	СУММА(ОстаточныеКорректирующиеВеличины.НДСАвансов) КАК НДСАвансов,
	|	СУММА(ОстаточныеКорректирующиеВеличины.ПроцентыПоРассрочке) КАК ПроцентыПоРассрочке
	|ИЗ
	|	(ВЫБРАТЬ
	|		ХозрасчетныйОстатки.Организация КАК Организация,
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСпоАвансамИПредоплатам) КАК Счет,
	|		ХозрасчетныйОстатки.СуммаОстаток КАК НДСАвансов,
	|		0 КАК ПроцентыПоРассрочке
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериода, Счет В (&СчетаНДСАвансовПолученных), &СубконтоКонтрагентыСФВыданные, Организация В (&Организации)) КАК ХозрасчетныйОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ХозрасчетныйОстатки.Организация,
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПроцентыПоРассрочке),
	|		0,
	|		ХозрасчетныйОстатки.СуммаОстаток
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериода, Счет В (&СчетаПроцентовПоРассрочке), &СубконтоКонтрагентыДоговоры, Организация В (&Организации)) КАК ХозрасчетныйОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлассификацияЗадолженности.Организация,
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСпоАвансамИПредоплатам),
	|		-1 * КлассификацияЗадолженности.НДСАвансов,
	|		0
	|	ИЗ
	|		КлассификацияЗадолженности КАК КлассификацияЗадолженности
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлассификацияЗадолженности.Организация,
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПроцентыПоРассрочке),
	|		0,
	|		-1 * КлассификацияЗадолженности.ПроцентыПоРассрочке
	|	ИЗ
	|		КлассификацияЗадолженности КАК КлассификацияЗадолженности) КАК ОстаточныеКорректирующиеВеличины
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаточныеКорректирующиеВеличины.Организация,
	|	ОстаточныеКорректирующиеВеличины.Счет
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ОстаточныеКорректирующиеВеличины.НДСАвансов) <> 0
	|		ИЛИ СУММА(ОстаточныеКорректирующиеВеличины.ПроцентыПоРассрочке) <> 0)");

	Возврат СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
КонецФункции

Процедура ОпределитьСоставляющиеБалансаКредиторскаяЗадолженность(ДанныеЗаполнения, РасчетныеДанные, КонтекстРасчета)

	СчетПроцентовПоРассрочке = ПланыСчетов.Хозрасчетный.ПроцентыПоРассрочке; // передаем в состявляющей только 76.08, но значение составляющей включает в себя еще 76.28, 76.38
	СчетНДСАвансов = ПланыСчетов.Хозрасчетный.НДСпоАвансамИПредоплатам;
	
	Счета = Новый Массив;
	Счета.Добавить(СчетПроцентовПоРассрочке);
	Счета.Добавить(СчетНДСАвансов);
	
	СчетаСРеквизитами = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Счета, "Код");

	Шаблоны = ШаблоныРасшифровкиКредиторскаяЗадолженность();
	ПараметрыТекста = ПараметрыТекстаРасшифровкиКредиторскаяЗадолженность(КонтекстРасчета, СчетаСРеквизитами);
	
	СоставляющиеКраткосрочная = ДанныеЗаполнения.СоставляющиеКраткосрочная;
	СоставляющиеДолгосрочная = ДанныеЗаполнения.СоставляющиеДолгосрочная;
	
	СтрокаДолг = РасчетныеДанные.Задолженность.Выбрать();
	Пока СтрокаДолг.Следующий() Цикл
		
		// Краткосрочная задолженность
		Составляющая = СоставляющиеКраткосрочная.Добавить();
		Составляющая.Описание = СтрШаблон("+ Задолженность_КК %1", СтрокаДолг.Код);
		Составляющая.КодГруппы = СтрокаДолг.КодГруппы;
		Составляющая.СчетРасчетов = СтрокаДолг.Счет;
		Составляющая.Значение = СтрокаДолг.ОстатокДолга;
		Составляющая.ТекстРасшифровки = ТекстРасшифровкиКредиторскаяЗадолженность(Шаблоны, СтрокаДолг, ПараметрыТекста, "ОбщаяЗадолженность", КонтекстРасчета);
		
		Если СтрокаДолг.ЕстьДолгосрочнаяЧасть Тогда
			Составляющая = СоставляющиеКраткосрочная.Добавить();
			Составляющая.Описание = СтрШаблон("- Задолженность_КК %1", СтрокаДолг.Код);
			Составляющая.КодГруппы = СтрокаДолг.КодГруппы;
			Составляющая.СчетРасчетов = СтрокаДолг.Счет;
			Составляющая.Значение = СтрокаДолг.ОстатокДолгаДолгосрочнойЧасти;
			Составляющая.ТекстРасшифровки = ТекстРасшифровкиКредиторскаяЗадолженность(Шаблоны, СтрокаДолг, ПараметрыТекста, "ДолгосрочнаяЧасть", КонтекстРасчета);
		КонецЕсли;
		
		Если СтрокаДолг.ЕстьПроцентыПоРассрочке Тогда
			Составляющая = СоставляющиеКраткосрочная.Добавить();
			Составляющая.Описание = СтрШаблон("- Задолженность_КК %1, %2", СчетаСРеквизитами[СчетПроцентовПоРассрочке].Код, СтрокаДолг.Код);
			Составляющая.КодГруппы = СтрокаДолг.КодГруппы;
			Составляющая.СчетРасчетов = СтрокаДолг.Счет;
			Составляющая.СчетКорректирующий = СчетПроцентовПоРассрочке;
			Составляющая.Значение = СтрокаДолг.ПроцентыПоРассрочке;
			Составляющая.ТекстРасшифровки = ТекстРасшифровкиКредиторскаяЗадолженность(Шаблоны, СтрокаДолг, ПараметрыТекста, "ПроцентыПоРассрочке", КонтекстРасчета);
		КонецЕсли;
		
		Если СтрокаДолг.ЕстьНДСАвансов Тогда
			Составляющая = СоставляющиеКраткосрочная.Добавить();
			Составляющая.Описание = СтрШаблон("- Задолженность_КК %1, %2", СчетаСРеквизитами[СчетНДСАвансов].Код, СтрокаДолг.Код);
			Составляющая.КодГруппы = СтрокаДолг.КодГруппы;
			Составляющая.СчетРасчетов = СчетНДСАвансов;
			Составляющая.Значение = СтрокаДолг.НДСАвансов;
			Составляющая.ТекстРасшифровки = ТекстРасшифровкиКредиторскаяЗадолженность(Шаблоны, СтрокаДолг, ПараметрыТекста, "НДСАвансов", КонтекстРасчета);
		КонецЕсли;
		
		// Долгосрочная задолженность
		Если СтрокаДолг.ЕстьДолгосрочнаяЧасть Тогда
			Составляющая = СоставляющиеДолгосрочная.Добавить();
			Составляющая.Описание = СтрШаблон("+ Задолженность_ДК %1", СтрокаДолг.Код);
			Составляющая.КодГруппы = СтрокаДолг.КодГруппы;
			Составляющая.СчетРасчетов = СтрокаДолг.Счет;
			Составляющая.Значение = СтрокаДолг.ОстатокДолгаДолгосрочнойЧасти;
			Составляющая.ТекстРасшифровки = ТекстРасшифровкиКредиторскаяЗадолженность(Шаблоны, СтрокаДолг, ПараметрыТекста, "ДолгосрочнаяЧасть", КонтекстРасчета);
			
			Если СтрокаДолг.ЕстьПроцентыПоРассрочкеДолгосрочнойЧасти Тогда
				Составляющая = СоставляющиеДолгосрочная.Добавить();
				Составляющая.Описание = СтрШаблон("- Задолженность_ДК %1, %2", СчетаСРеквизитами[СчетПроцентовПоРассрочке].Код, СтрокаДолг.Код);
				Составляющая.КодГруппы = СтрокаДолг.КодГруппы;
				Составляющая.СчетРасчетов = СтрокаДолг.Счет;
				Составляющая.СчетКорректирующий = СчетПроцентовПоРассрочке;
				Составляющая.Значение = СтрокаДолг.ПроцентыПоРассрочкеДолгосрочнойЧасти;
				Составляющая.ТекстРасшифровки = ТекстРасшифровкиКредиторскаяЗадолженность(Шаблоны, СтрокаДолг, ПараметрыТекста, "ПроцентыПоРассрочке", КонтекстРасчета);
			КонецЕсли;
			
			Если СтрокаДолг.ЕстьНДСАвансовДолгосрочнойЧасти Тогда
				Составляющая = СоставляющиеДолгосрочная.Добавить();
				Составляющая.Описание = СтрШаблон("- Задолженность_ДК %1, %2", СчетаСРеквизитами[СчетНДСАвансов].Код, СтрокаДолг.Код);
				Составляющая.КодГруппы = СтрокаДолг.КодГруппы;
				Составляющая.СчетРасчетов = СчетНДСАвансов;
				Составляющая.Значение = СтрокаДолг.НДСАвансовДолгосрочнойЧасти;
				Составляющая.ТекстРасшифровки = ТекстРасшифровкиКредиторскаяЗадолженность(Шаблоны, СтрокаДолг, ПараметрыТекста, "НДСАвансов", КонтекстРасчета);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// добавляем составляющие, которые отражают остаточную сумму корректирующих величин
	СтрокиТаблицы = РасчетныеДанные.НераспределенныеВеличины.НайтиСтроки(Новый Структура("Счет", СчетПроцентовПоРассрочке));
	Если ЗначениеЗаполнено(СтрокиТаблицы) Тогда
		СтрокиГрупп = СоставляющиеКраткосрочная.НайтиСтроки(Новый Структура("КодГруппы", "15201"));
		Если ЗначениеЗаполнено(СтрокиГрупп) Тогда 
			ИндексСтроки = СоставляющиеКраткосрочная.Индекс(СтрокиГрупп[СтрокиГрупп.Количество() - 1]);
			Составляющая = СоставляющиеКраткосрочная.Вставить(ИндексСтроки + 1);
		Иначе
			Составляющая = СоставляющиеКраткосрочная.Добавить();
		КонецЕсли;
		Составляющая.Описание = СтрШаблон("- Задолженность_КК %1", СчетаСРеквизитами[СчетПроцентовПоРассрочке].Код);
		Составляющая.КодГруппы = "15201";
		Составляющая.СчетРасчетов = СчетПроцентовПоРассрочке;
		Составляющая.СчетКорректирующий = СчетПроцентовПоРассрочке;
		Составляющая.Значение = СтрокиТаблицы[0].ПроцентыПоРассрочке;
		Составляющая.ТекстРасшифровки = ТекстРасшифровкиКредиторскаяЗадолженность(Шаблоны, СтрокаДолг, ПараметрыТекста, "ОстаточныйПроценты", КонтекстРасчета);
		Составляющая.Тип = "ОстаточныйПроценты";
	КонецЕсли;
	
	СтрокиГрупп = СоставляющиеКраткосрочная.НайтиСтроки(Новый Структура("КодГруппы", "15202"));
	Если ЗначениеЗаполнено(СтрокиГрупп) Тогда 
		ИндексСтроки = СоставляющиеКраткосрочная.Индекс(СтрокиГрупп[СтрокиГрупп.Количество() - 1]);
		Составляющая = СоставляющиеКраткосрочная.Вставить(ИндексСтроки + 1);
	Иначе
		Составляющая = СоставляющиеКраткосрочная.Добавить();
	КонецЕсли;
	Составляющая.Описание = СтрШаблон("- Задолженность_КК %1", СчетаСРеквизитами[СчетНДСАвансов].Код);
	Составляющая.КодГруппы = "15202";
	Составляющая.СчетРасчетов = СчетНДСАвансов;
	Составляющая.СчетКорректирующий = СчетНДСАвансов;
	СтрокиТаблицы = РасчетныеДанные.НераспределенныеВеличины.НайтиСтроки(Новый Структура("Счет", СчетНДСАвансов));
	Если ЗначениеЗаполнено(СтрокиТаблицы) Тогда
		Составляющая.Значение = СтрокиТаблицы[0].НДСАвансов;
	КонецЕсли;
	Составляющая.Тип = "ОстаточныйНДСАвансов";
	
	Составляющая.ТекстРасшифровки = ТекстРасшифровкиКредиторскаяЗадолженность(Шаблоны, СтрокаДолг, ПараметрыТекста, "ОстаточныйНДСАвансов", КонтекстРасчета);
	
КонецПроцедуры

Процедура ОпределитьСоставляющиеБалансаАренды(ДанныеЗаполнения, РасчетныеДанные, КонтекстРасчета)
	
	ТекстыРасшифровкиПоказателейАренды = ТекстыРасшифровкиПоказателейАренды(КонтекстРасчета);
	
	СоставляющиеКраткосрочная = ДанныеЗаполнения.СоставляющиеКраткосрочная;
	СоставляющиеДолгосрочная = ДанныеЗаполнения.СоставляющиеДолгосрочная;
	
	СтрокаДолг = РасчетныеДанные.Задолженность.Выбрать();
	Пока СтрокаДолг.Следующий() Цикл
		// Краткосрочная задолженность
		Составляющая = СоставляющиеКраткосрочная.Добавить();
		Составляющая.Описание = "+ ККЗ_РасчетыПоАренде 76.07";
		Составляющая.Значение = СтрокаДолг.ОстатокДолгаКраткосрочнойЧасти;
		Составляющая.ТекстРасшифровки = ТекстыРасшифровкиПоказателейАренды["СК_РасчетыПоАрендеКраткосрочное"];
		
		// Долгосрочная задолженность
		Составляющая = СоставляющиеДолгосрочная.Добавить();
		Составляющая.Описание = "+ ДКЗ_РасчетыПоАренде 76.07";
		Составляющая.Значение = СтрокаДолг.ОстатокДолгаДолгосрочнойЧасти;
		Составляющая.ТекстРасшифровки = ТекстыРасшифровкиПоказателейАренды["СК_РасчетыПоАрендеДолгосрочное"];
	КонецЦикла;
	
КонецПроцедуры

Функция ШаблоныРасшифровкиКредиторскаяЗадолженность()
	
	Шаблоны = Новый Структура;

	Шаблоны.Вставить("ШаблонЗадолженностьСвернутоеСальдо", 
	                 НСтр("ru = 'Сальдо на конец периода по счету [СчетРасчетов]'"));
	Шаблоны.Вставить("ШаблонЗадолженность", 
	                 НСтр("ru = 'Сальдо на конец периода по кредиту счета [СчетРасчетов]'"));
	Шаблоны.Вставить("ШаблонЗадолженностьРазвернутое",
	                 НСтр("ru = 'Сальдо на конец периода по кредиту счета [СчетРасчетов], развернутое по субконто [ВидыСубконто]'"));
	Шаблоны.Вставить("ШаблонЗадолженностьСвернутоеСальдоДолгосрочная", 
	                 НСтр("ru = 'Сальдо на конец периода по счету [СчетРасчетов] (суммы со сроком погашения задолженности не ранее [ДатаДолгосрочногоПериода])'"));
	Шаблоны.Вставить("ШаблонЗадолженностьДолгосрочная",
	                 НСтр("ru = 'Сальдо на конец периода по кредиту счета [СчетРасчетов] (суммы со сроком погашения задолженности не ранее [ДатаДолгосрочногоПериода])'")); 
	Шаблоны.Вставить("ШаблонЗадолженностьДолгосрочнаяРазвернутое",
	                 НСтр("ru = 'Сальдо на конец периода по кредиту счета [СчетРасчетов], развернутое по субконто [ВидыСубконто] (суммы со сроком погашения задолженности не ранее [ДатаДолгосрочногоПериода])'"));
	Шаблоны.Вставить("ШаблонПроцентыПоОбъектам",
	                 НСтр("ru = 'Сальдо на конец периода по дебету счетов [СчетаПроцентовПоРассрочке] по объектам, учитываемым на счете [СчетРасчетов]'"));
	Шаблоны.Вставить("ШаблонПроцентыОстаточный",
	                 НСтр("ru = 'Сальдо на конец периода по дебету счетов [СчетаПроцентовПоРассрочке], уменьшенное на величины, выделенные по объектам учета'"));
	Шаблоны.Вставить("ШаблонНДСПоОбъектам",
	                 НСтр("ru = 'Сальдо на конец периода по дебету счета [СчетНДС], учитываемым на счете [СчетРасчетов]'"));
	Шаблоны.Вставить("ШаблонНДСОстаточный",
	                 НСтр("ru = 'Сальдо на конец периода по дебету счета [СчетНДС], уменьшенное на величины, выделенные по объектам учета'"));
	
	Возврат Шаблоны;
	
КонецФункции

Функция ТекстРасшифровкиКредиторскаяЗадолженность(Шаблоны, СтрокаСчет, ПараметрыТекста, МеткаСоставляющей, КонтекстРасчета)
	
	ПараметрыТекста.СчетРасчетов = СтрокаСчет.Код;
	ВидыСубконто = Новый Массив;
	Если СтрокаСчет.ВидСчета = ВидСчета.АктивноПассивный Тогда
		Если ЗначениеЗаполнено(СтрокаСчет.ВидСубконто1) Тогда
			ВидыСубконто.Добавить(СтрШаблон("""%1""", СтрокаСчет.ВидСубконто1));
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаСчет.ВидСубконто2) Тогда
			ВидыСубконто.Добавить(СтрШаблон("""%1""", СтрокаСчет.ВидСубконто2));
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаСчет.ВидСубконто3) Тогда
			ВидыСубконто.Добавить(СтрШаблон("""%1""", СтрокаСчет.ВидСубконто3));
		КонецЕсли;
		ПараметрыТекста.ВидыСубконто = СтрСоединить(ВидыСубконто, ",");
	КонецЕсли;

	Если МеткаСоставляющей = "ОбщаяЗадолженность" Тогда
		Если КонтекстРасчета.СчетаСвернутоеСальдоКредиторская.Найти(СтрокаСчет.Счет) <> Неопределено Тогда
			ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонЗадолженностьСвернутоеСальдо, ПараметрыТекста);
		ИначеЕсли СтрокаСчет.ВидСчета = ВидСчета.АктивноПассивный И ЗначениеЗаполнено(ВидыСубконто) Тогда
			ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонЗадолженностьРазвернутое, ПараметрыТекста);
		Иначе
			ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонЗадолженность, ПараметрыТекста);
		КонецЕсли;
	ИначеЕсли МеткаСоставляющей = "ДолгосрочнаяЧасть" Тогда
		Если КонтекстРасчета.СчетаСвернутоеСальдоКредиторская.Найти(СтрокаСчет.Счет) <> Неопределено Тогда
			ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонЗадолженностьСвернутоеСальдоДолгосрочная, ПараметрыТекста);
		ИначеЕсли СтрокаСчет.ВидСчета = ВидСчета.АктивноПассивный И ЗначениеЗаполнено(ВидыСубконто) Тогда
			ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонЗадолженностьДолгосрочнаяРазвернутое, ПараметрыТекста);
		Иначе
			ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонЗадолженностьДолгосрочная, ПараметрыТекста);
		КонецЕсли;
	ИначеЕсли МеткаСоставляющей = "ПроцентыПоРассрочке" Тогда
		ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонПроцентыПоОбъектам, ПараметрыТекста);
	ИначеЕсли МеткаСоставляющей = "НДСАвансов" Тогда
		ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонНДСПоОбъектам, ПараметрыТекста);
	ИначеЕсли МеткаСоставляющей = "ОстаточныйПроценты" Тогда
		ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонПроцентыОстаточный, ПараметрыТекста);
	ИначеЕсли МеткаСоставляющей = "ОстаточныйНДСАвансов" Тогда
		ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонНДСОстаточный, ПараметрыТекста);
	КонецЕсли;
	
	Возврат ТекстРасшифровки;
	
КонецФункции

Функция ПараметрыТекстаРасшифровкиКредиторскаяЗадолженность(КонтекстРасчета, СчетаСРеквизитами)
	
	СчетаПроцентовПоРассрочке = ПланыСчетов.Хозрасчетный.СчетаПроцентовПоРассрочке();
	КодыСчетовПроцентовПоРассрочке = Новый Массив;
	Для Каждого Счет Из СчетаПроцентовПоРассрочке Цикл
		КодыСчетовПроцентовПоРассрочке.Добавить(Счет.Код);
	КонецЦикла;
		
	ПараметрыТекста = Новый Структура;
	ПараметрыТекста.Вставить("ДатаДолгосрочногоПериода", Формат(КонецМесяца(ДобавитьМесяц(КонтекстРасчета.КонецПериодаДата, 12)) + 1, "ДЛФ=DD"));
	ПараметрыТекста.Вставить("СчетаПроцентовПоРассрочке", СтрСоединить(КодыСчетовПроцентовПоРассрочке, ","));
	ПараметрыТекста.Вставить("СчетНДС", СчетаСРеквизитами[ПланыСчетов.Хозрасчетный.НДСпоАвансамИПредоплатам].Код);
	ПараметрыТекста.Вставить("СчетРасчетов", "");
	ПараметрыТекста.Вставить("ВидыСубконто", "");
	
	Возврат ПараметрыТекста;
	
КонецФункции

#КонецОбласти

#Область ЗаемныеСредства

Функция ГруппыДолгосрочныеЗаемныеСредства()
	
	ВидыСчетов = Новый Массив;
	ВидыСчетов.Добавить(ВидСчета.Пассивный);
	ВидыСчетов.Добавить(ВидСчета.АктивноПассивный);
	
	Группы = НовыйГруппы();
	
	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Долгосрочные кредиты'");
	Группа.Код = "14101";
	СчетаСписком = "67.01";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Долгосрочные займы'");
	Группа.Код = "14102";
	СчетаСписком = "67.03, 67.05";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);
	
	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Долгосрочные кредиты (в валюте)'");
	Группа.Код = "14103";
	СчетаСписком = "67.21";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);

	Группа = Группы.Добавить();
	Группа.Наименование = НСтр("ru = 'Долгосрочные займы (в валюте)'");
	Группа.Код = "14104";
	СчетаСписком = "67.23, 67.25";
	Группа.СчетаРасчетов = КлассификацияЗадолженности.СчетаИзСписка(СчетаСписком, ВидыСчетов);
	
	Возврат Группы;
	
КонецФункции

Функция ДанныеЗаполненияЗаемныеСредства(КонтекстРасчета)
	
	ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская;
	
	СчетаКредитыЗаймы = КлассификацияЗадолженности.СчетаДолгосрочныхКредитовЗаймов();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетаКредитыЗаймы", СчетаКредитыЗаймы);
	Запрос.текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет,
	|	Хозрасчетный.Код КАК Код,
	|	ВЫРАЗИТЬ("""" КАК Строка(10)) КАК КодГруппы,
	|	Хозрасчетный.Порядок КАК Порядок,
	|	Хозрасчетный.Вид КАК ВидСчета
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В(&СчетаКредитыЗаймы)";
	
	ТаблицаСчетов = Запрос.Выполнить().Выгрузить();
	
	Группы = ГруппыДолгосрочныеЗаемныеСредства();
	ОпределитьГруппуСчетов(ТаблицаСчетов, Группы);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организации",       КонтекстРасчета.Организации);
	Запрос.УстановитьПараметр("НачалоПериода",     НачалоМесяца(КонтекстРасчета.КонецПериодаДата));
	Запрос.УстановитьПараметр("КонецПериодаДата",  КонтекстРасчета.КонецПериодаДата);
	Запрос.УстановитьПараметр("КонецПериода",     Новый Граница(КонтекстРасчета.КонецПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ВидЗадолженностиКредиторская", ВидЗадолженности);
	Запрос.УстановитьПараметр("ТаблицаСчетов", ТаблицаСчетов);
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	Запрос.УстановитьПараметр("ДатаНачалаДолгосрочногоПериода", НачалоДня(КонецМесяца(ДобавитьМесяц(КонтекстРасчета.КонецПериодаДата, 12)) + 1));
	Запрос.УстановитьПараметр("СчетаКредитыЗаймы", СчетаКредитыЗаймы);

	СубконтоКонтрагентыДоговоры = Новый Массив;
	СубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	СубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	Запрос.УстановитьПараметр("СубконтоКонтрагентыДоговоры", СубконтоКонтрагентыДоговоры);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСчетов.Счет КАК Счет,
	|	ТаблицаСчетов.Код КАК Код,
	|	ТаблицаСчетов.КодГруппы КАК КодГруппы,
	|	ТаблицаСчетов.Порядок КАК Порядок,
	|	ТаблицаСчетов.ВидСчета КАК ВидСчета
	|ПОМЕСТИТЬ Счета
	|ИЗ
	|	&ТаблицаСчетов КАК ТаблицаСчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация,
	|	Счета.Счет КАК Счет,
	|	Счета.Код КАК Код,
	|	Счета.КодГруппы КАК КодГруппы,
	|	Счета.Порядок КАК Порядок,
	|	Счета.ВидСчета КАК ВидСчета
	|ПОМЕСТИТЬ СчетаОрганизации
	|ИЗ
	|	Счета КАК Счета,
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка В(&Организации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расчеты.Организация КАК Организация,
	|	Расчеты.Счет КАК Счет,
	|	СУММА(Расчеты.ОстатокДолга) КАК ОстатокДолга,
	|	ВЫБОР
	|		КОГДА СУММА(Расчеты.ОстатокДолгаКраткосрочнойЧасти) < 0
	|				ИЛИ СУММА(Расчеты.ОстатокДолга) < 0
	|			ТОГДА 0
	|		КОГДА СУММА(Расчеты.ОстатокДолгаКраткосрочнойЧасти) < СУММА(Расчеты.ОстатокДолга)
	|			ТОГДА СУММА(Расчеты.ОстатокДолгаКраткосрочнойЧасти)
	|		ИНАЧЕ СУММА(Расчеты.ОстатокДолга)
	|	КОНЕЦ КАК ОстатокДолгаКраткосрочнойЧасти
	|ПОМЕСТИТЬ ДанныеБаланса
	|ИЗ
	|	(ВЫБРАТЬ
	|		ХозрасчетныйОстаткиИОбороты.Организация КАК Организация,
	|		ХозрасчетныйОстаткиИОбороты.Счет КАК Счет,
	|		ХозрасчетныйОстаткиИОбороты.СуммаОстатокКт КАК ОстатокДолга,
	|		0 КАК ОстатокДолгаКраткосрочнойЧасти
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериода, Счет В (&СчетаКредитыЗаймы), , Организация В (&Организации)) КАК ХозрасчетныйОстаткиИОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлассификацияПоСрокамОтдельныхВидовЗадолженности.Организация,
	|		КлассификацияПоСрокамОтдельныхВидовЗадолженности.Счет,
	|		СУММА(0),
	|		СУММА(КлассификацияПоСрокамОтдельныхВидовЗадолженности.ОстатокДолга)
	|	ИЗ
	|		РегистрСведений.КлассификацияПоСрокамОтдельныхВидовЗадолженности КАК КлассификацияПоСрокамОтдельныхВидовЗадолженности
	|	ГДЕ
	|		КлассификацияПоСрокамОтдельныхВидовЗадолженности.Активность
	|		И КлассификацияПоСрокамОтдельныхВидовЗадолженности.Организация В(&Организации)
	|		И КлассификацияПоСрокамОтдельныхВидовЗадолженности.Счет В(&СчетаКредитыЗаймы)
	|		И КлассификацияПоСрокамОтдельныхВидовЗадолженности.ВидЗадолженности = &ВидЗадолженностиКредиторская
	|		И КлассификацияПоСрокамОтдельныхВидовЗадолженности.ПериодРасчета МЕЖДУ &НачалоПериода И &КонецПериодаДата
	|		И КлассификацияПоСрокамОтдельныхВидовЗадолженности.ДатаПогашения < &ДатаНачалаДолгосрочногоПериода
	|	
	|	СГРУППИРОВАТЬ ПО
	|		КлассификацияПоСрокамОтдельныхВидовЗадолженности.Организация,
	|		КлассификацияПоСрокамОтдельныхВидовЗадолженности.Счет) КАК Расчеты
	|
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Организация,
	|	Расчеты.Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Счета.Организация КАК Организация,
	|	ЕСТЬNULL(СУММА(ДанныеБаланса.ОстатокДолга), 0) КАК ОстатокДолга,
	|	ЕСТЬNULL(СУММА(ДанныеБаланса.ОстатокДолгаКраткосрочнойЧасти), 0) КАК ОстатокДолгаКраткосрочнойЧасти,
	|	ЕСТЬNULL(СУММА(ДанныеБаланса.ОстатокДолгаКраткосрочнойЧасти) <> 0, ЛОЖЬ) КАК ЕстьКраткосрочнаяЧасть,
	|	Счета.Счет КАК Счет,
	|	Счета.Код КАК Код,
	|	Счета.КодГруппы КАК КодГруппы,
	|	Счета.Порядок КАК Порядок,
	|	Счета.ВидСчета КАК ВидСчета
	|ИЗ
	|	СчетаОрганизации КАК Счета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеБаланса КАК ДанныеБаланса
	|		ПО Счета.Организация = ДанныеБаланса.Организация
	|			И Счета.Счет = ДанныеБаланса.Счет
	|
	|СГРУППИРОВАТЬ ПО
	|	Счета.Организация,
	|	Счета.Счет,
	|	Счета.Код,
	|	Счета.Порядок,
	|	Счета.ВидСчета,
	|	Счета.КодГруппы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Порядок";
	
	РасчетныеДанные = Новый Структура;
	РасчетныеДанные.Вставить("Задолженность", Запрос.Выполнить());
	
	ДанныеЗаполнения = НовыйДанныеЗаполненияЗадолженности();
	ДанныеЗаполнения.Вставить("ГруппыДолгосрочная", Группы);
	ОпределитьСоставляющиеБалансаЗаемныеСредства(ДанныеЗаполнения, РасчетныеДанные, КонтекстРасчета);
	
	Возврат ДанныеЗаполнения;

КонецФункции

Процедура ОпределитьСоставляющиеБалансаЗаемныеСредства(ДанныеЗаполнения, РасчетныеДанные, КонтекстРасчета)
	
	Шаблоны = ШаблоныРасшифровкиЗаемныеСредства();
	ПараметрыТекста = ПараметрыТекстаРасшифровкиЗаемныеСредства(КонтекстРасчета);
	
	СоставляющиеКраткосрочная = ДанныеЗаполнения.СоставляющиеКраткосрочная;
	СоставляющиеДолгосрочная = ДанныеЗаполнения.СоставляющиеДолгосрочная;
	
	СтрокаДолг = РасчетныеДанные.Задолженность.Выбрать();
	Пока СтрокаДолг.Следующий() Цикл
		// Долгосрочная задолженность
		Составляющая = СоставляющиеДолгосрочная.Добавить();
		Составляющая.Описание = СтрШаблон("+ Задолженность_КК %1", СтрокаДолг.Код);
		Составляющая.КодГруппы = СтрокаДолг.КодГруппы;
		Составляющая.СчетРасчетов = СтрокаДолг.Счет;
		Составляющая.Значение = СтрокаДолг.ОстатокДолга;
		Составляющая.ТекстРасшифровки = ТекстРасшифровкиЗаемныеСредства(Шаблоны, СтрокаДолг, ПараметрыТекста, "ОбщаяЗадолженность", КонтекстРасчета);
		
		Если СтрокаДолг.ЕстьКраткосрочнаяЧасть Тогда
			Составляющая = СоставляющиеДолгосрочная.Добавить();
			Составляющая.Описание = СтрШаблон("- Задолженность_КК %1", СтрокаДолг.Код);
			Составляющая.КодГруппы = СтрокаДолг.КодГруппы;
			Составляющая.СчетРасчетов = СтрокаДолг.Счет;
			Составляющая.Значение = СтрокаДолг.ОстатокДолгаКраткосрочнойЧасти;
			Составляющая.ТекстРасшифровки = ТекстРасшифровкиЗаемныеСредства(Шаблоны, СтрокаДолг, ПараметрыТекста, "КраткосрочнаяЧасть", КонтекстРасчета);
		КонецЕсли;
		
		// Краткосрочная задолженность
		Если СтрокаДолг.ЕстьКраткосрочнаяЧасть Тогда
			Составляющая = СоставляющиеКраткосрочная.Добавить();
			Составляющая.Описание = СтрШаблон("+ Задолженность_ДК %1", СтрокаДолг.Код);
			Составляющая.КодГруппы = СтрокаДолг.КодГруппы;
			Составляющая.СчетРасчетов = СтрокаДолг.Счет;
			Составляющая.Значение = СтрокаДолг.ОстатокДолгаКраткосрочнойЧасти;
			Составляющая.ТекстРасшифровки = ТекстРасшифровкиЗаемныеСредства(Шаблоны, СтрокаДолг, ПараметрыТекста, "КраткосрочнаяЧасть", КонтекстРасчета);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ШаблоныРасшифровкиЗаемныеСредства()
	
	Шаблоны = Новый Структура;

	Шаблоны.Вставить("ШаблонЗадолженность", 
	                 НСтр("ru = 'Сальдо на конец периода по кредиту счета [СчетРасчетов]'"));
	Шаблоны.Вставить("ШаблонЗадолженностьКраткосрочная",
	                 НСтр("ru = 'Сальдо на конец периода по кредиту счета [СчетРасчетов] (суммы со сроком погашения задолженности ранее [ДатаДолгосрочногоПериода])'")); 
	Возврат Шаблоны;
	
КонецФункции

Функция ТекстРасшифровкиЗаемныеСредства(Шаблоны, СтрокаСчет, ПараметрыТекста, МеткаСоставляющей, КонтекстРасчета)
	
	ПараметрыТекста.СчетРасчетов = СтрокаСчет.Код;

	Если МеткаСоставляющей = "ОбщаяЗадолженность" Тогда
		ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонЗадолженность, ПараметрыТекста);
	ИначеЕсли МеткаСоставляющей = "КраткосрочнаяЧасть" Тогда
		ТекстРасшифровки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблоны.ШаблонЗадолженностьКраткосрочная, ПараметрыТекста);
	КонецЕсли;
	
	Возврат ТекстРасшифровки;
	
КонецФункции

Функция ПараметрыТекстаРасшифровкиЗаемныеСредства(КонтекстРасчета)
	
	ПараметрыТекста = Новый Структура;
	ПараметрыТекста.Вставить("ДатаДолгосрочногоПериода", Формат(КонецМесяца(ДобавитьМесяц(КонтекстРасчета.КонецПериодаДата, 12)) + 1, "ДЛФ=DD"));
	ПараметрыТекста.Вставить("СчетРасчетов", "");
	
	Возврат ПараметрыТекста;
	
КонецФункции

#КонецОбласти

Функция НовыйАвансыПоВидамАктивовСводно()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Таблица.Колонки.Добавить("ВидАктива", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыАктивовДляАвансов"));
	Таблица.Колонки.Добавить("ОстатокНДС", БухгалтерскийУчетКлиентСервер.ТипСумма());
	Таблица.Колонки.Добавить("ОстатокРезерва", БухгалтерскийУчетКлиентСервер.ТипСумма());

	Возврат Таблица;
	
КонецФункции

Функция НовыйГруппы()

	Группы = Новый ТаблицаЗначений;
	Группы.Колонки.Добавить("Наименование",  ОбщегоНазначения.ОписаниеТипаСтрока(100));
	Группы.Колонки.Добавить("Код",           ОбщегоНазначения.ОписаниеТипаСтрока(10));
	Группы.Колонки.Добавить("СчетаРасчетов", Новый ОписаниеТипов("Массив"));
	Группы.Колонки.Добавить("ЭтоАренда",     Новый ОписаниеТипов("Булево"));

	Возврат Группы;
		
КонецФункции

Процедура ОпределитьГруппуСчетов(ТаблицаСчетов, Группы)
	
	Для Каждого Группа Из Группы Цикл
		Для Каждого СчетГруппы Из Группа.СчетаРасчетов Цикл
			СтрокиСчетов = ТаблицаСчетов.НайтиСтроки(Новый Структура("Счет", СчетГруппы));
			Для Каждого СтрокаСчета Из СтрокиСчетов Цикл
				СтрокаСчета.КодГруппы = Группа.Код;
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция НовыйДанныеЗаполненияЗадолженности()
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("СоставляющиеКраткосрочная", НовыйСоставляющиеЗадолженности());
	ДанныеЗаполнения.Вставить("ГруппыКраткосрочная",       НовыйГруппы());
	ДанныеЗаполнения.Вставить("СоставляющиеДолгосрочная",  НовыйСоставляющиеЗадолженности());
	ДанныеЗаполнения.Вставить("ГруппыДолгосрочная",        НовыйГруппы());
	
	Возврат ДанныеЗаполнения;
КонецФункции

Функция НовыйДополнительныеПараметрыЗадолженности()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СчетРасчетов");
	ДополнительныеПараметры.Вставить("СчетКорректирующий");
	ДополнительныеПараметры.Вставить("ТекстРасшифровки");
	ДополнительныеПараметры.Вставить("Значение", 0);
	ДополнительныеПараметры.Вставить("Тип", "");
	
	Возврат ДополнительныеПараметры;
	
КонецФункции

Функция НовыйСоставляющиеЗадолженности()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Описание", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Таблица.Колонки.Добавить("КодГруппы", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	Таблица.Колонки.Добавить("СчетРасчетов",      Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	Таблица.Колонки.Добавить("СчетКорректирующий", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	Таблица.Колонки.Добавить("ТекстРасшифровки", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Таблица.Колонки.Добавить("Значение",         ОбщегоНазначения.ОписаниеТипаЧисло(0));
	Таблица.Колонки.Добавить("Тип",              ОбщегоНазначения.ОписаниеТипаСтрока(50));

	Возврат Таблица;
	
КонецФункции

Процедура ОпределитьТипЗадолженности(Составляющая, СтрокаТаблицы)
	
	Если СтрокаТаблицы.ЭтоСчетРБП Тогда
		Составляющая.Тип = "РБП";
	ИначеЕсли СтрокаТаблицы.ЭтоСчетНМА Тогда
		Составляющая.Тип = "НМА";
	ИначеЕсли СтрокаТаблицы.ЭтоСчетАренды Тогда
		Составляющая.Тип = "Аренда";
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

Функция ПараметрыАлгоритмовБаланса2025(ПараметрыЗаполнения, ОбщиеИтогиПоСчетам)
	
	ПараметрыАлгоритмов = Новый Структура;
	ПараметрыАлгоритмов.Вставить("ЭтоБалансНекоммерческойОрганизации",
		ПараметрыЗаполнения.ЭтоБалансНекоммерческойОрганизации);
	ПараметрыАлгоритмов.Вставить("УчетНа70ВедетсяСводно", ПараметрыЗаполнения.УчетНа70ВедетсяСводно);
	ПараметрыАлгоритмов.Вставить("РазделятьАвансыПоВидамАктивов", ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов);
	ПараметрыАлгоритмов.Вставить("ПрименятьС2025", Год(ПривестиКДате(ПараметрыЗаполнения.КонецПериодаОтчета)) >= 2025);
	ПараметрыАлгоритмов.Вставить("НастройкаВключенаКлассифицироватьАктивыОбязательства", ПараметрыЗаполнения.НастройкаВключенаКлассифицироватьАктивыОбязательства);
	ПараметрыАлгоритмов.Вставить("КлассифицироватьАктивыОбязательстваПоСрокам",      ПараметрыЗаполнения.КлассифицироватьАктивыОбязательстваПоСрокам);
	Если ПараметрыЗаполнения.КлассифицироватьАктивыОбязательстваПоСрокам Тогда
		ПараметрыАлгоритмов.Вставить("ДебиторскаяЗадолженность",  ОбщиеИтогиПоСчетам.ДанныеЗаполненияДебиторскаяЗадолженность);
		ПараметрыАлгоритмов.Вставить("КредиторскаяЗадолженность", ОбщиеИтогиПоСчетам.ДанныеЗаполненияКредиторскаяЗадолженность);
		ПараметрыАлгоритмов.Вставить("РасчетыПоАренде",           ОбщиеИтогиПоСчетам.ДанныеЗаполненияРасчетыПоАренде);
		ПараметрыАлгоритмов.Вставить("ЗаемныеСредства",           ОбщиеИтогиПоСчетам.ДанныеЗаполненияЗаемныеСредства);
	КонецЕсли;
	
	Возврат ПараметрыАлгоритмов;
	
КонецФункции

Функция АлгоритмыБО2025Кв1_Баланс(ПараметрыАлгоритмов)
	
	Алгоритмы = Новый Массив;
	
	ЗаполнитьАлгоритмыБО2025Кв1_Баланс_Раздел1(Алгоритмы, ПараметрыАлгоритмов);
	ЗаполнитьАлгоритмыБО2025Кв1_Баланс_Раздел2(Алгоритмы, ПараметрыАлгоритмов);
	Если ПараметрыАлгоритмов.ЭтоБалансНекоммерческойОрганизации Тогда
		ЗаполнитьАлгоритмыБО2025Кв1_Баланс_Раздел3_НКО(Алгоритмы, ПараметрыАлгоритмов);
	Иначе
		ЗаполнитьАлгоритмыБО2025Кв1_Баланс_Раздел3(Алгоритмы, ПараметрыАлгоритмов);
	КонецЕсли;
	ЗаполнитьАлгоритмыБО2025Кв1_Баланс_Раздел4(Алгоритмы, ПараметрыАлгоритмов);
	ЗаполнитьАлгоритмыБО2025Кв1_Баланс_Раздел5(Алгоритмы, ПараметрыАлгоритмов);
	
	Возврат Алгоритмы;
	
КонецФункции

Процедура ЗаполнитьАлгоритмыБО2025Кв1_Баланс_Раздел1(Алгоритмы, ПараметрыЗаполнения)
	
	#Область Строка1110
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтрокиСДопСтроками(Алгоритмы, "1110", 11101,
		"Нематериальные активы");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 04"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 04.09")); // отражено в 1215
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК 05"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.05"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.08"));
	
	Если ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов Тогда
		ВидАктиваАвансы = Перечисления.ВидыАктивовДляАвансов.НематериальныеАктивы;
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.02", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.02", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.02", ВидАктиваАвансы));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.22", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.22", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.22", ВидАктиваАвансы));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.32", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.32", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.32", ВидАктиваАвансы));
		
	КонецЕсли;
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11101",
		"Нематериальные активы в организации");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 04"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКД 04.09")); // отражено в 1215
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК 05"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11102",
		"Приобретение нематериальных активов");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.05"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11103",
		"Выполнение научно-исследовательских, опытно-конструкторских и технологических работ");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.08"));
	
	Если ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов Тогда
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11104",
			"Авансы, выданные для приобретения НМА");
		ВидАктиваАвансы = Перечисления.ВидыАктивовДляАвансов.НематериальныеАктивы;
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.02", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.02", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.02", ВидАктиваАвансы));
		
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.22", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.22", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.22", ВидАктиваАвансы));
		
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.32", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.32", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.32", ВидАктиваАвансы));
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Строка1130
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1130",
		"Нематериальные поисковые активы");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.11"));
	
	#КонецОбласти
	
	#Область Строка1140
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1140",
		"Материальные поисковые активы");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.12"));
	
	#КонецОбласти
	
	#Область Строка1150
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтрокиСДопСтроками(Алгоритмы, "1150", 11501,
		"Основные средства");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 01"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 01.09")); // отражено в 1215
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК 02"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 02.02")); // отражено в 1160
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 07"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.03"));
	
	ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.ОсновныеСредства;
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 97", ВидАктиваРБП));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.2", ВидАктиваРБП));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.9", ВидАктиваРБП));
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.04.5"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 23.05"));
	
	Если ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов Тогда
		ВидАктиваАвансы = Перечисления.ВидыАктивовДляАвансов.ОсновныеСредства;
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.02", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.02", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.02", ВидАктиваАвансы));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.22", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.22", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.22", ВидАктиваАвансы));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.32", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.32", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.32", ВидАктиваАвансы));
		
	КонецЕсли;
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.01"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.02"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.04.1"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.04.2"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11501",
		"Основные средства, пригодные к использованию");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 01.01"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 01.08"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 01.11"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 01.К"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК 02.01"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК 02.04"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК 02.11"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11502",
		"Оборудование к установке");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 07"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11503",
		"Незавершенное строительство");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.03"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11504",
		"Расходы будущих периодов");
	ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.ОсновныеСредства;
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 97", ВидАктиваРБП));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.2", ВидАктиваРБП));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.9", ВидАктиваРБП));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11505",
		"Права пользования активами");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 01.03"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК 02.03"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11505",
		"Капитализированная стоимость ремонта основных средств");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 01.05"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК 02.05"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11507",
		"Незавершенные ремонты основных средств");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.04.5"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 23.05"));
	
	Если ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов Тогда
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11508",
			"Авансы, выданные для приобретения и сооружения основных средств");
		
		ВидАктиваАвансы = Перечисления.ВидыАктивовДляАвансов.ОсновныеСредства;
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.02", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.02", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.02", ВидАктиваАвансы));
		
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.22", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.22", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.22", ВидАктиваАвансы));
		
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.32", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.32", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.32", ВидАктиваАвансы));
		
	КонецЕсли;
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11509",
		"Иные незавершенные капитальные вложения");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.01"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.02"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.04.1"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.04.2"));
	
	#КонецОбласти
	
	#Область Строка1160
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтрокиСДопСтроками(Алгоритмы, "1160", 11601,
		"Инвестиционная недвижимость");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 03"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 03.09")); // Отражено в 1215
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК 02.02"));
	
	Если ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов Тогда
		ВидАктиваАвансы = Перечисления.ВидыАктивовДляАвансов.ИнвестиционнаяНедвижимость;
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.02", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.02", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.02", ВидАктиваАвансы));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.22", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.22", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.22", ВидАктиваАвансы));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.32", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.32", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.32", ВидАктиваАвансы));
		
	КонецЕсли;
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11601",
		"Инвестиционная недвижимость");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 03"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКД 03.09")); // Отражено в 1215
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК 02.02"));
	
	Если ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов Тогда
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11602",
			"Авансы, выданные для приобретения инвестиционной недвижимости");
			
		ВидАктиваАвансы = Перечисления.ВидыАктивовДляАвансов.ИнвестиционнаяНедвижимость;
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.02", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.02", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.02", ВидАктиваАвансы));
		
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.22", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.22", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.22", ВидАктиваАвансы));
		
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.32", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.32", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.32", ВидАктиваАвансы));
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Строка1170
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтрокиСДопСтроками(Алгоритмы, "1170", 11701,
		"Финансовые вложения");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 58"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 58.05")); // Отражено в 1240
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК 59"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 59 \ 58.05")); // Отражено в 1240
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11701",
		"Паи и акции");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 58.01"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК 59 \ 58.01"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11702",
		"Долговые ценные бумаги");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 58.02"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК 59 \ 58.02"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11703",
		"Предоставленные займы");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 58.03"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК 59 \ 58.03"));
	
	#КонецОбласти
	
	#Область Строка1180
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1180",
		"Отложенные налоговые активы");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 09"));
	
	#КонецОбласти
	
	#Область Строка1190
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтрокиСДопСтроками(Алгоритмы, "1190", 11901,
		"Прочие внеоборотные активы");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.06"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.07"));
	
	ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.ПрочиеВнеоборотныеАктивы;
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 97", ВидАктиваРБП));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.2", ВидАктиваРБП));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.9", ВидАктиваРБП));
	
	Если ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов Тогда
		ВидАктиваАвансы = Перечисления.ВидыАктивовДляАвансов.ПрочиеВнеоборотные;
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.02", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.02", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.02", ВидАктиваАвансы));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.22", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.22", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.22", ВидАктиваАвансы));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.32", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.32", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.32", ВидАктиваАвансы));
		
	КонецЕсли;
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11901",
		"Биологические активы");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.06"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 08.07"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11903",
		"Расходы будущих периодов");
	ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.ПрочиеВнеоборотныеАктивы;
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 97", ВидАктиваРБП));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.2", ВидАктиваРБП));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.9", ВидАктиваРБП));
	
	Если ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов Тогда
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11904",
			"Авансы на приобретение прочих внеоборотных активов");
		
		ВидАктиваАвансы = Перечисления.ВидыАктивовДляАвансов.ПрочиеВнеоборотные;
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.02", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.02", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.02", ВидАктиваАвансы));
		
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.22", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.22", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.22", ВидАктиваАвансы));
		
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.32", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.32", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.32", ВидАктиваАвансы));
		
	КонецЕсли;
	
	Если ПараметрыЗаполнения.НастройкаВключенаКлассифицироватьАктивыОбязательства Тогда
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "11905",
			"Дебиторская задолженность");
		
		Если ПараметрыЗаполнения.КлассифицироватьАктивыОбязательстваПоСрокам И ЗначениеЗаполнено(ПараметрыЗаполнения.ДебиторскаяЗадолженность.СоставляющиеДолгосрочная) Тогда
			СоставляющиеДолгосрочная = ПараметрыЗаполнения.ДебиторскаяЗадолженность.СоставляющиеДолгосрочная;
			Для Каждого СтрокаТаблицы Из СоставляющиеДолгосрочная Цикл
				ДопПараметры = НовыйДополнительныеПараметрыЗадолженности();
				ЗаполнитьЗначенияСвойств(ДопПараметры, СтрокаТаблицы);
				АлгоритмСтроки.Составляющие.Добавить(Составляющая(СтрокаТаблицы.Описание, ДопПараметры));
			КонецЦикла;
			
			Для Каждого СтрокаТаблицы Из СоставляющиеДолгосрочная Цикл
				ДопПараметры = НовыйДополнительныеПараметрыЗадолженности();
				ЗаполнитьЗначенияСвойств(ДопПараметры, СтрокаТаблицы);
				АлгоритмДопСтроки.Составляющие.Добавить(Составляющая(СтрокаТаблицы.Описание, ДопПараметры));
			КонецЦикла;
		Иначе
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("ПустаяРасшифровка", Истина);
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ Задолженность_ДД", ДопПараметры));
		КонецЕсли;
	КонецЕсли;
	
	#КонецОбласти
	
КонецПроцедуры

Процедура ЗаполнитьАлгоритмыБО2025Кв1_Баланс_Раздел2(Алгоритмы, ПараметрыЗаполнения)
	
	УчетНа70ВедетсяСводно = ПараметрыЗаполнения.УчетНа70ВедетсяСводно;
	ПрименятьС2025 = ПараметрыЗаполнения.ПрименятьС2025;
	
	#Область Строка1210
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтрокиСДопСтроками(Алгоритмы, "1210", 12101,
		"Запасы");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 10"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 15"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 16"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК 16"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК 14"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 43"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 41"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК 42"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 44"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 45"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 28"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 20"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 21"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 23.01"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 29"));
	
	ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.Запасы;
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 97", ВидАктиваРБП));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.2", ВидАктиваРБП));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.9", ВидАктиваРБП));
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 11"));
	
	Если ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов Тогда
		ВидАктиваАвансы = Перечисления.ВидыАктивовДляАвансов.Запасы;
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.02", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.02", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.02", ВидАктиваАвансы));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.22", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.22", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.22", ВидАктиваАвансы));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.32", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.32", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.32", ВидАктиваАвансы));
		
	КонецЕсли;
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12101",
		"Сырье и материалы");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 10"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 15.01"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 16.01"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК 16.01"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК 14.01"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12102",
		"Готовая продукция");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 43"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК 14.03"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12103",
		"Товары");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 41"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК 14.02"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 15.02"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК 42"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 16.02"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК 16.02"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 44"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12104",
		"Товары отгруженные");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 45"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12105",
		"Незавершенное производство");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 28"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 20"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК 14.04"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 21"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 23.01"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 29"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12106",
		"Расходы будущих периодов");
	ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.Запасы;
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 97", ВидАктиваРБП));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.2", ВидАктиваРБП));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.9", ВидАктиваРБП));
	
	Если ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов Тогда
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12107",
			"Авансы, выданные на приобретение запасов");
			
		ВидАктиваАвансы = Перечисления.ВидыАктивовДляАвансов.Запасы;
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.02", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.02", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.02", ВидАктиваАвансы));
		
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.22", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.22", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.22", ВидАктиваАвансы));
		
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.32", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.32", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.32", ВидАктиваАвансы));
		
	КонецЕсли;
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12108",
		"Животные на выращивании и откорме");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 11"));
	
	#КонецОбласти
	
	#Область Строка1215
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1215",
		"Долгосрочные активы к продаже");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 01.09"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 03.09"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 04.09"));
	
	#КонецОбласти
	
	#Область Строка1220
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтрокиСДопСтроками(Алгоритмы, "1220", 12201,
		"Налог на добавленную стоимость по приобретенным ценностям");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 19"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 19.06"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.НА"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12201",
		"НДС по приобретенным ОС");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 19.01"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12202",
		"НДС по приобретенным НМА");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 19.02"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12203",
		"НДС по приобретенным МПЗ");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 19.03"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12204",
		"НДС по приобретенным услугам");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 19.04"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12205",
		"НДС, уплаченный при ввозе товаров на территорию РФ");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 19.05"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12206",
		"НДС по товарам, реализованным по ставке 0% (экспорт)");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 19.07"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12207",
		"НДС при строительстве ОС");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 19.08"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12208",
		"НДС по уменьшению стоимости реализации");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 19.09"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12209",
		"НДС, уплачиваемый при импорте из Таможенного союза");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 19.10"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12210",
		"НДС, уплачиваемый при исполнении обязанностей налогового агента");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.НА"));
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1220",
		"НДС, начисленный по отгрузке");
	АлгоритмСтроки.Вписываемый = Истина;
	АлгоритмСтроки.ГрафаНаименования = "02";
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 76.ОТ"));
	
	#КонецОбласти
	
	#Область Строка1230
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтрокиСДопСтроками(Алгоритмы, "1230", 12301,
		"Дебиторская задолженность");
	
	Если ПараметрыЗаполнения.КлассифицироватьАктивыОбязательстваПоСрокам Тогда
		СоставляющиеКраткосрочная = ПараметрыЗаполнения.ДебиторскаяЗадолженность.СоставляющиеКраткосрочная;
		Для Каждого СтрокаТаблицы Из СоставляющиеКраткосрочная Цикл
			ДопПараметры = НовыйДополнительныеПараметрыЗадолженности();
			ЗаполнитьЗначенияСвойств(ДопПараметры, СтрокаТаблицы);
			АлгоритмСтроки.Составляющие.Добавить(Составляющая(СтрокаТаблицы.Описание, ДопПараметры));
		КонецЦикла;
		
		Для Каждого Группа Из ПараметрыЗаполнения.ДебиторскаяЗадолженность.ГруппыКраткосрочная Цикл
			АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, Группа.Код,Группа.Наименование);
			СтрокиСоставляющих = СоставляющиеКраткосрочная.НайтиСтроки(Новый Структура("КодГруппы", Группа.Код));
			Для Каждого СтрокаТаблицы Из СтрокиСоставляющих Цикл
				ДопПараметры = НовыйДополнительныеПараметрыЗадолженности();
				ЗаполнитьЗначенияСвойств(ДопПараметры, СтрокаТаблицы);
				АлгоритмДопСтроки.Составляющие.Добавить(Составляющая(СтрокаТаблицы.Описание, ДопПараметры));
			КонецЦикла;
		КонецЦикла;

	Иначе
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 62.01"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 62.03"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 62.21"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 62.31"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 62.Р"));
		
		Если ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов Тогда
			// Пустая ссылка используется для извлечения результатов разделения данных из соответствия.
			ВидАктиваАвансы = Перечисления.ВидыАктивовДляАвансов.ПустаяСсылка();
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_АвансыДебЗад 60.02", ВидАктиваАвансы));
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_АвансыДебЗад 63, 60.02", ВидАктиваАвансы));
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_АвансыДебЗад 76.ВА, 60.02", ВидАктиваАвансы));
			
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_АвансыДебЗад 60.22", ВидАктиваАвансы));
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_АвансыДебЗад 63, 60.22", ВидАктиваАвансы));
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_АвансыДебЗад 76.ВА, 60.22", ВидАктиваАвансы));
			
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_АвансыДебЗад 60.32", ВидАктиваАвансы));
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_АвансыДебЗад 63, 60.32", ВидАктиваАвансы));
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_АвансыДебЗад 76.ВА, 60.32", ВидАктиваАвансы));
			
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_СВычетами 63"));
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_СВычетами 76.ВА"));
			
		Иначе
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 60.02"));
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 60.22"));
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 60.32"));
			
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК 63"));
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК 76.ВА"));
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СК_РасчетыПоАренде НДСсПлатежей"));
		КонецЕсли;
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.01"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.02"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.03"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.04.1"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.06"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.07"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.08"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.09"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 68.10"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.11"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.12"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.13"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.14"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.15"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.16"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.17"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.21"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.34"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.52"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.90"));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.01"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.02.1"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.02.2"));
		Если ПрименятьС2025 Тогда
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.02.3"));
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.02.4"));
		Иначе
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.02.3"));
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.02.4"));
		КонецЕсли;
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.02.5"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.02.6"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.02.7"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.03.1"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.03.2"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.04"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.05.1"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.05.2"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.06.1"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.06.2"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.06.3"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.06.4"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.06.5"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.06.6"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.09"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.11"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.12"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.13"));
		
		Если УчетНа70ВедетсяСводно Тогда
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 70"));
		Иначе
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_Работники 70"));
		КонецЕсли;
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_Работники 71.01"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_Работники 71.21"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 73.01"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 73.02"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_Работники 73.03"));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 75.01"));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.01.1"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 76.02"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.03"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.05"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.06"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.09"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_Работники 76.10"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 76.13"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 76.14"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_Контрагенты 76.17"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 76.18"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.21"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 76.22"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.25"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.26"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.29"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 76.32"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.35"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.36"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.39"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_Контрагенты 76.49"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.К"));
		
		ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.ДебиторскаяЗадолженность;
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 97", ВидАктиваРБП));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.2", ВидАктиваРБП));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.9", ВидАктиваРБП));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 46"));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СК_РасчетыПоАренде Авансы"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12301",
			"Расчеты с покупателями и заказчиками");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 62.01"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 62.03"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 62.21"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 62.31"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 62.Р"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_СВычетами 63"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12302",
			"Расчеты с поставщиками и подрядчиками");
		ВидАктиваАвансы = Перечисления.ВидыАктивовДляАвансов.ПустаяСсылка();
		Если ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов Тогда
			// Пустая ссылка используется для извлечения результатов разделения данных из соответствия.
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_АвансыДебЗад 60.02", ВидАктиваАвансы));
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_АвансыДебЗад 63, 60.02", ВидАктиваАвансы));
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_АвансыДебЗад 76.ВА, 60.02", ВидАктиваАвансы));
			
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_АвансыДебЗад 60.22", ВидАктиваАвансы));
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_АвансыДебЗад 63, 60.22", ВидАктиваАвансы));
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_АвансыДебЗад 76.ВА, 60.22", ВидАктиваАвансы));
			
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_АвансыДебЗад 60.32", ВидАктиваАвансы));
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_АвансыДебЗад 63, 60.32", ВидАктиваАвансы));
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_АвансыДебЗад 76.ВА, 60.32", ВидАктиваАвансы));
			
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_СВычетами 76.ВА"));
			
		Иначе
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 60.02"));
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_АвансыДебЗад 63, 60.02", ВидАктиваАвансы));
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 60.22"));
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_АвансыДебЗад 63, 60.22", ВидАктиваАвансы));
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 60.32"));
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_АвансыДебЗад 63, 60.32", ВидАктиваАвансы));
			
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК 76.ВА"));
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СК_РасчетыПоАренде НДСсПлатежей"));
		КонецЕсли;
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12303",
			"Расчеты по налогам и сборам");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.01"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.03"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.04.1"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.06"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.07"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.08"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.09"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 68.10"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.11"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.12"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.13"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.14"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.15"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.16"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.17"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.21"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.34"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.52"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12304",
			"Расчеты по НДС, не отраженные на ЕНС");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.02"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12305",
			"Сальдо по ЕНС");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.90"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12306",
			"Расчеты по социальному страхованию и обеспечению");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.01"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.02.1"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.02.2"));
		Если ПрименятьС2025 Тогда
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.02.3"));
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.02.4"));
		Иначе
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.02.3"));
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.02.4"));
		КонецЕсли;
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.02.5"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.02.6"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.02.7"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.03.1"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.03.2"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.04"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.05.1"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.05.2"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.06.1"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.06.2"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.06.3"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.06.4"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.06.5"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.06.6"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.09"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.11"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.12"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 69.13"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12307",
			"Расчеты с персоналом по оплате труда");
		Если УчетНа70ВедетсяСводно Тогда
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 70"));
		Иначе
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_Работники 70"));
		КонецЕсли;
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12308",
			"Расчеты с подотчетными лицами");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_Работники 71.01"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_Работники 71.21"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12309",
			"Расчеты с персоналом по прочим операциям");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 73.01"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 73.02"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_Работники 73.03"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12310",
			"Расчеты по вкладам в уставный (складочный) капитал");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 75.01"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12311",
			"Расчеты с разными дебиторами и кредиторами");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.01.1"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 76.02"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.03"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.05"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.06"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.09"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_Работники 76.10"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 76.14"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_Контрагенты 76.17"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 76.18"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.21"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 76.22"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.25"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.26"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.29"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 76.32"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.35"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.36"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.39"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_Контрагенты 76.49"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.К"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12312",
			"Расходы будущих периодов");
		ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.ДебиторскаяЗадолженность;
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 97", ВидАктиваРБП));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.2", ВидАктиваРБП));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.9", ВидАктиваРБП));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12313",
			"Выполненные этапы по незавершенным работам");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 46"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12314",
			"Расчеты с факторинговыми компаниями");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 76.13"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12315",
			"Авансы по аренде (лизингу)");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СК_РасчетыПоАренде Авансы"));
	
	КонецЕсли;
	#КонецОбласти
	
	#Область Строка1240
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтрокиСДопСтроками(Алгоритмы, "1240", 12401,
		"Финансовые вложения (за исключением денежных эквивалентов)");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 55.03"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 55.23"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 58.05"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК 59 \ 58.05"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12401",
		"Депозитные счета");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 55.03"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12402",
		"Депозитные счета ( в валюте)");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 55.23"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12403",
		"Приобретенные права в рамках оказания финансовых услуг");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 58.05"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК 59 \ 58.05"));
	
	#КонецОбласти
	
	#Область Строка1250
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтрокиСДопСтроками(Алгоритмы, "1250", 12501,
		"Денежные средства и денежные эквиваленты");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 50"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 50.03"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 50.23"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 51"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 52"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 53"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 55.01"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 55.02"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 55.04"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 55.21"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 55.24"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 57"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12501",
		"Касса");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 50"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКД 50.03"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКД 50.23"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12502",
		"Расчетные счета");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 51"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12503",
		"Валютные счета");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 52"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12504",
		"Счет цифрового рубля");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 53"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12505",
		"Аккредитивы");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 55.01"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12506",
		"Аккредитивы (в валюте)");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 55.21"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12507",
		"Прочие специальные счета");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 55.02"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 55.04"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 55.24"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12508",
		"Переводы в пути");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 57"));
	
	#КонецОбласти
	
	#Область Строка1260
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтрокиСДопСтроками(Алгоритмы, "1260", 12601,
		"Прочие оборотные активы");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 19.06"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.22"));
	
	ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.ПрочиеОборотныеАктивы;
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 97", ВидАктиваРБП));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.2", ВидАктиваРБП));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.9", ВидАктиваРБП));
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 94"));
	
	Если ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов Тогда
		ВидАктиваАвансы = Перечисления.ВидыАктивовДляАвансов.ПрочиеОборотные;
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.02", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.02", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.02", ВидАктиваАвансы));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.22", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.22", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.22", ВидАктиваАвансы));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.32", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.32", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.32", ВидАктиваАвансы));
		
	КонецЕсли;
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 50.03"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 50.23"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12601",
		"Акцизы по оплаченным ценностям");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 19.06"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12602",
		"НДС по экспорту (возмещение)");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.22"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12603",
		"Расходы будущих периодов");
	ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.ПрочиеОборотныеАктивы;
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 97", ВидАктиваРБП));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.2", ВидАктиваРБП));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.9", ВидАктиваРБП));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12604",
		"Недостачи и потери от порчи ценностей");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 94"));
	
	Если ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов Тогда
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12605",
			"Прочие выданные авансы");
		
		ВидАктиваАвансы = Перечисления.ВидыАктивовДляАвансов.ПрочиеОборотные;
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.02", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.02", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.02", ВидАктиваАвансы));
		
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.22", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.22", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.22", ВидАктиваАвансы));
		
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.32", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.32", ВидАктиваАвансы));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.32", ВидАктиваАвансы));
		
	КонецЕсли;
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "12606",
		"Денежные документы");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 50.03"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКД 50.23"));
	
	#КонецОбласти
	
КонецПроцедуры

Процедура ЗаполнитьАлгоритмыБО2025Кв1_Баланс_Раздел3(Алгоритмы, ПараметрыЗаполнения)
	
	#Область Строка1300
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1300", "Капитал"); // Для упрощенной отчетности
	
	#КонецОбласти

	#Область Строка1310
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1310",
		"Уставный капитал");
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 80"));
	
	#КонецОбласти
	
	#Область Строка1320
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1320", 
		"Собственные акции, принадлежащие обществу, задолженность акционеров по оплате акций");
	АлгоритмСтроки.Вычитаемый = Истина;
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 81"));
	
	#КонецОбласти
	
	#Область Строка1340
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтрокиСДопСтроками(Алгоритмы, "1340", 13401,
		"Накопленная дооценка внеоборотных активов");
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 83.01"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "13401",
		"Переоценка основных средств");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 83.01.1"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "13402",
		"Переоценка НМА");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 83.01.2"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "13403",
		"Переоценка прочих внеоборотных активов");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 83.01.3"));
	
	#КонецОбласти
	
	#Область Строка1350
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1350",
		"Добавочный капитал (без накопленной дооценки)");
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 83"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК 83.01"));
	
	#КонецОбласти
	
	#Область Строка1360
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтрокиСДопСтроками(Алгоритмы, "1360", 13601,
		"Резервный капитал");
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 82"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "13601",
		"Резервы, образованные в соответствии с законодательством");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 82.01"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "13602",
		"Резервы, образованные в соответствии с учредительными документами");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 82.02"));
	
	#КонецОбласти
	
	#Область Строка1370
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1370",
		"Нераспределенная прибыль (непокрытый убыток)");
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 84"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 84"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 99"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 99"));
	
	#КонецОбласти
	
КонецПроцедуры

Процедура ЗаполнитьАлгоритмыБО2025Кв1_Баланс_Раздел3_НКО(Алгоритмы, ПараметрыЗаполнения)
	
	#Область Строка1310
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1310",
		"Паевой фонд");
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 80"));
	
	#КонецОбласти
	
	#Область Строка1330
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1330",
		"Целевые средства");
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 86"));
	
	#КонецОбласти
	
	#Область Строка1360
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1360",
		"Фонд недвижимого и особо ценного движимого имущества");
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 83"));
	
	#КонецОбласти
	
	#Область Строка1370
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1370",
		"Резервный и иные целевые фонды");
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 82"));
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1370",
		"Нераспределенная прибыль (непокрытый убыток)");
	АлгоритмСтроки.Вписываемый = Истина;
	АлгоритмСтроки.ГрафаНаименования = "02";
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 84"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 84"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 99"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 99"));
	
	#КонецОбласти
	
КонецПроцедуры

Процедура ЗаполнитьАлгоритмыБО2025Кв1_Баланс_Раздел4(Алгоритмы, ПараметрыЗаполнения)
	
	#Область Строка1410
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтрокиСДопСтроками(Алгоритмы, "1410", 14101,
		"Заемные средства");
	
	Если ПараметрыЗаполнения.КлассифицироватьАктивыОбязательстваПоСрокам Тогда
		
		СоставляющиеДолгосрочная = ПараметрыЗаполнения.ЗаемныеСредства.СоставляющиеДолгосрочная;
		
		Для Каждого СтрокаТаблицы Из СоставляющиеДолгосрочная Цикл
			ДопПараметры = НовыйДополнительныеПараметрыЗадолженности();
			ЗаполнитьЗначенияСвойств(ДопПараметры, СтрокаТаблицы);
			АлгоритмСтроки.Составляющие.Добавить(Составляющая(СтрокаТаблицы.Описание, ДопПараметры));
		КонецЦикла;
		
		Для Каждого Группа Из ПараметрыЗаполнения.ЗаемныеСредства.ГруппыДолгосрочная Цикл
			АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, Группа.Код,Группа.Наименование);
			СтрокиСоставляющих = СоставляющиеДолгосрочная.НайтиСтроки(Новый Структура("КодГруппы", Группа.Код));
			Для Каждого СтрокаТаблицы Из СтрокиСоставляющих Цикл
				ДопПараметры = НовыйДополнительныеПараметрыЗадолженности();
				ЗаполнитьЗначенияСвойств(ДопПараметры, СтрокаТаблицы);
				АлгоритмДопСтроки.Составляющие.Добавить(Составляющая(СтрокаТаблицы.Описание, ДопПараметры));
			КонецЦикла;
		КонецЦикла;

	Иначе
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.01"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.03"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.05"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.21"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.23"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.25"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "14101",
			"Долгосрочные кредиты");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.01"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "14102",
			"Долгосрочные займы");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.03"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.05"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "14103",
			"Долгосрочные кредиты (в валюте)");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.21"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "14104",
			"Долгосрочные займы (в валюте)");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.23"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.25"));
	КонецЕсли;
	#КонецОбласти
	
	#Область Строка1420
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1420",
		"Отложенные налоговые обязательства");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 77"));
	
	#КонецОбласти
	
	#Область Строка1430
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1430",
		"Оценочные обязательства");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 96.09"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 96.09"));
	
	#КонецОбласти
	
	#Область Строка1450
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтрокиСДопСтроками(Алгоритмы, "1450", 14501,
		"Прочие долгосрочные обязательства");
	
	ИспользуетсяАлгоритмКлассификации = ПараметрыЗаполнения.КлассифицироватьАктивыОбязательстваПоСрокам
				И ПараметрыЗаполнения.Свойство("РасчетыПоАренде")
				И ЗначениеЗаполнено(ПараметрыЗаполнения.РасчетыПоАренде.СоставляющиеДолгосрочная);

	Если ИспользуетсяАлгоритмКлассификации Тогда
		СоставляющиеДолгосрочная = ПараметрыЗаполнения.РасчетыПоАренде.СоставляющиеДолгосрочная;
		Для Каждого СтрокаТаблицы Из СоставляющиеДолгосрочная Цикл
			ДопПараметры = НовыйДополнительныеПараметрыЗадолженности();
			ЗаполнитьЗначенияСвойств(ДопПараметры, СтрокаТаблицы);
			АлгоритмСтроки.Составляющие.Добавить(Составляющая(СтрокаТаблицы.Описание, ДопПараметры));
		КонецЦикла;
	Иначе
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СК_РасчетыПоАренде Долгосрочное"));
	КонецЕсли;
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 98.02"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 98.03"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 98.04"));
	
	Если ИспользуетсяАлгоритмКлассификации Тогда
		СоставляющиеДолгосрочная = ПараметрыЗаполнения.РасчетыПоАренде.СоставляющиеДолгосрочная;
		Для Каждого СтрокаТаблицы Из СоставляющиеДолгосрочная Цикл
			АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "14501",
				"Долгосрочные обязательства по аренде (лизингу)");
			ДопПараметры = НовыйДополнительныеПараметрыЗадолженности();
			ЗаполнитьЗначенияСвойств(ДопПараметры, СтрокаТаблицы);
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая(СтрокаТаблицы.Описание, ДопПараметры));
		КонецЦикла;
	Иначе
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "14501",
			"Долгосрочные обязательства по аренде (лизингу)");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СК_РасчетыПоАренде Долгосрочное"));
	КонецЕсли;
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "14502",
		"Безвозмездные поступления");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 98.02"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "14503",
		"Расчеты по возмещению материального ущерба");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 98.03"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 98.04"));

	Если ПараметрыЗаполнения.НастройкаВключенаКлассифицироватьАктивыОбязательства Тогда
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "14505",
			"Кредиторская задолженность");
		
		Если ПараметрыЗаполнения.КлассифицироватьАктивыОбязательстваПоСрокам И ЗначениеЗаполнено(ПараметрыЗаполнения.КредиторскаяЗадолженность.СоставляющиеДолгосрочная) Тогда
			СоставляющиеДолгосрочная = ПараметрыЗаполнения.КредиторскаяЗадолженность.СоставляющиеДолгосрочная;
			Для Каждого СтрокаТаблицы Из СоставляющиеДолгосрочная Цикл
				ДопПараметры = НовыйДополнительныеПараметрыЗадолженности();
				ЗаполнитьЗначенияСвойств(ДопПараметры, СтрокаТаблицы);
				АлгоритмСтроки.Составляющие.Добавить(Составляющая(СтрокаТаблицы.Описание, ДопПараметры));
			КонецЦикла;
			
			Для Каждого СтрокаТаблицы Из СоставляющиеДолгосрочная Цикл
				ДопПараметры = НовыйДополнительныеПараметрыЗадолженности();
				ЗаполнитьЗначенияСвойств(ДопПараметры, СтрокаТаблицы);
				АлгоритмДопСтроки.Составляющие.Добавить(Составляющая(СтрокаТаблицы.Описание, ДопПараметры));
			КонецЦикла;
		Иначе
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("ПустаяРасшифровка", Истина);
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ Задолженность_ДК", ДопПараметры));
		КонецЕсли;
	КонецЕсли;
	
	#КонецОбласти
	
КонецПроцедуры

Процедура ЗаполнитьАлгоритмыБО2025Кв1_Баланс_Раздел5(Алгоритмы, ПараметрыЗаполнения)
	
	УчетНа70ВедетсяСводно = ПараметрыЗаполнения.УчетНа70ВедетсяСводно;
	ЭтоБалансНекоммерческойОрганизации = ПараметрыЗаполнения.ЭтоБалансНекоммерческойОрганизации;
	ПрименятьС2025 = ПараметрыЗаполнения.ПрименятьС2025;
	
	#Область Строка1510
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтрокиСДопСтроками(Алгоритмы, "1510", 15101,
		"Заемные средства");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 66"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.02"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.04"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.06"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.22"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.24"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.26"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "15101",
		"Краткосрочные кредиты");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 66.01"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "15102",
		"Краткосрочные займы");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 66.03"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 66.05"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "15103",
		"Краткосрочные кредиты (в валюте)");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 66.21"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "15104",
		"Краткосрочные займы (в валюте)");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 66.23"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 66.25"));
	
	АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "15105",
		"Проценты по займам и кредитам");
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 66.02"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 66.04"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 66.06"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 66.22"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 66.24"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 66.26"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.02"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.04"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.06"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.22"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.24"));
	АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.26"));
	
	Если ПараметрыЗаполнения.НастройкаВключенаКлассифицироватьАктивыОбязательства Тогда
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "15106",
			"Краткосрочная часть долгосрочных заемных средств");
		
		Если ПараметрыЗаполнения.КлассифицироватьАктивыОбязательстваПоСрокам И ЗначениеЗаполнено(ПараметрыЗаполнения.ЗаемныеСредства.СоставляющиеКраткосрочная) Тогда
			СоставляющиеКраткосрочная = ПараметрыЗаполнения.ЗаемныеСредства.СоставляющиеКраткосрочная;
			Для Каждого СтрокаТаблицы Из СоставляющиеКраткосрочная Цикл
				ДопПараметры = НовыйДополнительныеПараметрыЗадолженности();
				ЗаполнитьЗначенияСвойств(ДопПараметры, СтрокаТаблицы);
				АлгоритмСтроки.Составляющие.Добавить(Составляющая(СтрокаТаблицы.Описание, ДопПараметры));
			КонецЦикла;
			
			Для Каждого СтрокаТаблицы Из СоставляющиеКраткосрочная Цикл
				ДопПараметры = НовыйДополнительныеПараметрыЗадолженности();
				ЗаполнитьЗначенияСвойств(ДопПараметры, СтрокаТаблицы);
				АлгоритмДопСтроки.Составляющие.Добавить(Составляющая(СтрокаТаблицы.Описание, ДопПараметры));
			КонецЦикла;
		Иначе
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("ПустаяРасшифровка", Истина);
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ Задолженность_КК", ДопПараметры));
		КонецЕсли;
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Строка1520
	
	Если ПараметрыЗаполнения.КлассифицироватьАктивыОбязательстваПоСрокам Тогда
		АлгоритмСтроки = ДобавитьНовыйАлгоритмСтрокиСДопСтроками(Алгоритмы, "1520", 15201,
			"Кредиторская задолженность");
		
		СоставляющиеКраткосрочная = ПараметрыЗаполнения.КредиторскаяЗадолженность.СоставляющиеКраткосрочная;
		Для Каждого СтрокаТаблицы Из СоставляющиеКраткосрочная Цикл
			ДопПараметры = НовыйДополнительныеПараметрыЗадолженности();
			ЗаполнитьЗначенияСвойств(ДопПараметры, СтрокаТаблицы);
			АлгоритмСтроки.Составляющие.Добавить(Составляющая(СтрокаТаблицы.Описание, ДопПараметры));
		КонецЦикла;
		
		Для Каждого Группа Из ПараметрыЗаполнения.КредиторскаяЗадолженность.ГруппыКраткосрочная Цикл
			АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, Группа.Код, Группа.Наименование);
			СтрокиСоставляющих = СоставляющиеКраткосрочная.НайтиСтроки(Новый Структура("КодГруппы", Группа.Код));
			Для Каждого СтрокаТаблицы Из СтрокиСоставляющих Цикл
				ДопПараметры = НовыйДополнительныеПараметрыЗадолженности();
				ЗаполнитьЗначенияСвойств(ДопПараметры, СтрокаТаблицы);
				АлгоритмДопСтроки.Составляющие.Добавить(Составляющая(СтрокаТаблицы.Описание, ДопПараметры));
			КонецЦикла;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ПараметрыЗаполнения.РасчетыПоАренде.СоставляющиеКраткосрочная) Тогда
			СоставляющиеКраткосрочная = ПараметрыЗаполнения.РасчетыПоАренде.СоставляющиеКраткосрочная;
			АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1520",
				"Обязательство по аренде");
			АлгоритмСтроки.Вписываемый = Истина;
			АлгоритмСтроки.ГрафаНаименования = "02";
			Для Каждого СтрокаТаблицы Из СоставляющиеКраткосрочная Цикл
				ДопПараметры = НовыйДополнительныеПараметрыЗадолженности();
				ЗаполнитьЗначенияСвойств(ДопПараметры, СтрокаТаблицы);
				АлгоритмСтроки.Составляющие.Добавить(Составляющая(СтрокаТаблицы.Описание, ДопПараметры));
			КонецЦикла;
		Иначе
			АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1520",
				"Обязательство по аренде");
			АлгоритмСтроки.Вписываемый = Истина;
			АлгоритмСтроки.ГрафаНаименования = "02";
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СК_РасчетыПоАренде Краткосрочное"));
		КонецЕсли;
		
	Иначе
	
		АлгоритмСтроки = ДобавитьНовыйАлгоритмСтрокиСДопСтроками(Алгоритмы, "1520", 15201,
			"Кредиторская задолженность");
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 60.01"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 60.03"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 60.21"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 60.31"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 76.08"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 76.28"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 76.38"));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 62.02"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 62.22"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 62.32"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 62.ОТ"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 76.АВ"));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.01"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.02"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.03"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.04.1"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.06"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.07"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.08"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.09"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 68.10"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.11"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.12"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.13"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.14"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.15"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.16"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.17"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.21"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.32"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.34"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.42"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.52"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.90"));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.01"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.02.1"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.02.2"));
		Если ПрименятьС2025 Тогда
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.02.3"));
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.02.4"));
		Иначе
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.02.3"));
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.02.4"));
		КонецЕсли;
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.02.5"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.02.6"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.02.7"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.03.1"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.03.2"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.04"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.05.1"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.05.2"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.06.1"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.06.2"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.06.3"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.06.4"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.06.5"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.06.6"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.09"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.11"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.12"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.13"));
		
		Если УчетНа70ВедетсяСводно Тогда
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 70"));
		Иначе
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_Работники 70"));
		КонецЕсли;
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_Работники 71.01"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_Работники 71.21"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_Работники 73.03"));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 75.02"));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.01.1"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.03"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 76.04"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.05"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.06"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.09"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_Работники 76.10"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 76.15"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 76.16"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_Контрагенты 76.17"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.21"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.25"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.26"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.29"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.35"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.36"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.39"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 76.41"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 76.41"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_Контрагенты 76.49"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.К"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 76.Н"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.НА"));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 98.01"));
		
		Если НЕ ЭтоБалансНекоммерческойОрганизации Тогда
			АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 86"));
		КонецЕсли;
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "15201",
			"Расчеты с поставщиками и подрядчиками");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 60.01"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 60.03"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 60.21"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 60.31"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКД 76.08"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКД 76.28"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКД 76.38"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "15202",
			"Расчеты с покупателями и заказчиками");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 62.02"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 62.22"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 62.32"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 62.ОТ"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКД 76.АВ"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "15203",
			"Расчеты по налогам и сборам");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.01"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.03"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.04.1"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.06"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.07"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.08"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.09"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 68.10"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.11"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.12"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.13"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.14"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.15"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.16"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.17"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.21"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.32"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.34"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.42"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.52"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "15204",
			"Расчеты по НДС, не отраженные на ЕНС");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.02"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.НА"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "15205",
			"Сальдо по ЕНС");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.90"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "15206",
			"Расчеты по социальному страхованию и обеспечению");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.01"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.02.1"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.02.2"));
		Если ПрименятьС2025 Тогда
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.02.3"));
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.02.4"));
		Иначе
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.02.3"));
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.02.4"));
		КонецЕсли;
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.02.5"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.02.6"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.02.7"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.03.1"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.03.2"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.04"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.05.1"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.05.2"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.06.1"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.06.2"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.06.3"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.06.4"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.06.5"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.06.6"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.09"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.11"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.12"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 69.13"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "15207",
			"Расчеты с персоналом по оплате труда");
		Если УчетНа70ВедетсяСводно Тогда
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 70"));
		Иначе
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_Работники 70"));
		КонецЕсли;
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "15208",
			"Расчеты с подотчетными лицами");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_Работники 71.01"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_Работники 71.21"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "15209",
			"Расчеты с персоналом по прочим операциям");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_Работники 73.03"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "15210",
			"Задолженность участникам (учредителям) по выплате доходов");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 75.02"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "15211",
			"Расчеты с разными дебиторами и кредиторами");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.01.1"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.03"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 76.04"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.05"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.06"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.09"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_Работники 76.10"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 76.15"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 76.16"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_Контрагенты 76.17"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.21"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.25"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.26"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.29"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.35"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.36"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.39"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 76.41"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("- СКД 76.41"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_Контрагенты 76.49"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.К"));
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 76.Н"));
		
		АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "15212",
			"Доходы, полученные в счет будущих периодов");
		АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 98.01"));
		
		Если НЕ ЭтоБалансНекоммерческойОрганизации Тогда
			АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(АлгоритмСтроки.ДопСтроки, "15213",
				"Целевое финансирование");
			АлгоритмДопСтроки.Составляющие.Добавить(Составляющая("+ СКК 86"));
		КонецЕсли;

		АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1520",
			"Обязательство по аренде");
		АлгоритмСтроки.Вписываемый = Истина;
		АлгоритмСтроки.ГрафаНаименования = "02";
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 76.07", "НастройкиОтчетаКонтрагентыДоговоры"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 76.27", "НастройкиОтчетаКонтрагентыДоговоры"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 76.37", "НастройкиОтчетаКонтрагентыДоговоры"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 76.07", "НастройкиОтчетаКонтрагентыДоговоры"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 76.27", "НастройкиОтчетаКонтрагентыДоговоры"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 76.37", "НастройкиОтчетаКонтрагентыДоговоры"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СК_РасчетыПоАренде НДСсПлатежей"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СК_РасчетыПоАренде Авансы"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СК_РасчетыПоАренде Долгосрочное"));
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Строка1540
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1540",
		"Оценочные обязательства");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 96.01"));
	
	#КонецОбласти
	
	#Область Строка1550
	
	АлгоритмСтроки = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1550",	"Другие краткосрочные обязательства"); // Для упрощенной отчетности
	
	#КонецОбласти
	
КонецПроцедуры

Процедура ЗаполнитьОтчетБухОтчетностьФормаОтчета2025Кв1_БалансПоГрафеПоАлгоритмам(ПараметрыЗаполнения, ЗначенияПоказателейПоВсемОрганизациям)
	
	Графа = ПараметрыЗаполнения.Графа;
	ЗаголовокГрафы = ПараметрыЗаполнения.ЗаголовокГрафы;
	
	Контейнер = ПараметрыЗаполнения.Контейнер;
	КонтейнерРаздела = Контейнер.Строки.Найти("Баланс", "Идентификатор");
	
	ПроцессорПоказателя = ПараметрыЗаполнения.ПроцессорПоказателя;
	Алгоритмы = ПараметрыЗаполнения.Алгоритмы;

	Если ПараметрыЗаполнения.ЭтоУпрощеннаяОтчетность Тогда
		ЗначенияПоказателей = УпроститьБаланс(Алгоритмы, ЗначенияПоказателейПоВсемОрганизациям, ПараметрыЗаполнения);
		ЗначенияПоказателейПоВсемОрганизациям = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЗначенияПоказателей);
	КонецЕсли;
	
	Для Каждого ЗначенияПоказателей Из ЗначенияПоказателейПоВсемОрганизациям Цикл
		Для Каждого АлгоритмСтроки Из Алгоритмы Цикл
			
			НомерСтроки = АлгоритмСтроки.Номер;
			
			Если Не НачатьУстановкуЗначенияПоказателя(ПроцессорПоказателя, ЗначенияПоказателей, АлгоритмСтроки) Тогда
				Продолжить;
			КонецЕсли;
			
			ИнициализироватьКодПоказателя(ПроцессорПоказателя, НомерСтроки, Графа, АлгоритмСтроки.Вписываемый);
			
			НаименованиеСтроки = АлгоритмСтроки.Наименование;
			Если ЗначениеЗаполнено(ПроцессорПоказателя.Показатель.НаименованиеПоказателя) Тогда
				НаименованиеСтроки = ПроцессорПоказателя.Показатель.НаименованиеПоказателя;
			КонецЕсли;
			
			ПроцессорПоказателя.Показатель.НаименованиеПоказателя = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
				НомерСтроки, НаименованиеСтроки, ЗаголовокГрафы);
			УстановитьНаименованиеПоказателяРасшифровки(ПроцессорПоказателя.Показатель);
			УстановитьЗначениеПоказателяПоПроцессору(КонтейнерРаздела, ПроцессорПоказателя, АлгоритмСтроки);
			Если АлгоритмСтроки.Вписываемый Тогда
				УстановитьНаименованиеВписываемогоПоказателя(КонтейнерРаздела, АлгоритмСтроки);
			КонецЕсли;
			
			Если АлгоритмСтроки.Свойство("ДопСтроки") Тогда
				
				НомерСтроки = АлгоритмСтроки.Номер;
				ПроцессорПоказателя.Показатель.КодПоказателя = "П100010" + НомерСтроки + Графа;
				
				ИдМСЧ = "П100010" + НомерСтроки;
				
				ОбъявлениеМСЧ = МногострочнаяЧастьРаздела(КонтейнерРаздела, ИдМСЧ);
				
				Если ОбъявлениеМСЧ = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				АктивныеДопСтроки = Новый Массив;
				Для ИндексСтроки = 0 По АлгоритмСтроки.ДопСтроки.ВГраница() Цикл
					ДопСтрокаАлгоритма = АлгоритмСтроки.ДопСтроки[ИндексСтроки];
					
					Если Не НачатьУстановкуЗначенияПоказателя(ПроцессорПоказателя, ЗначенияПоказателей, ДопСтрокаАлгоритма, ИндексСтроки) Тогда
						Продолжить;
					КонецЕсли;
					
					АктивныеДопСтроки.Добавить(ИндексСтроки);
					
				КонецЦикла;
					
				СтрокиМСЧ = СтрокиМногострочнойЧасти(ОбъявлениеМСЧ);
				ШаблонСтрокиМСЧ = СтрокиМСЧ[0]; 
				
				Для Инд = 1 По АктивныеДопСтроки.Количество() - СтрокиМСЧ.Количество() Цикл
					СкопироватьВеткуДерева(ШаблонСтрокиМСЧ);
				КонецЦикла;
				
				СтрокиМСЧ = СтрокиМногострочнойЧасти(ОбъявлениеМСЧ); // актуальный набор строк многострочной части
				
				Для ИндексСтроки = 0 По АктивныеДопСтроки.ВГраница() Цикл
					
					ПостоянныйИдентификаторДопСтроки = АктивныеДопСтроки[ИндексСтроки]; 
					
					ДопСтрокаАлгоритма = АлгоритмСтроки.ДопСтроки[ПостоянныйИдентификаторДопСтроки];
					СтрокаМСЧ = СтрокиМСЧ[ИндексСтроки];

					Если Не НачатьУстановкуЗначенияПоказателя(ПроцессорПоказателя, ЗначенияПоказателей, ДопСтрокаАлгоритма, ПостоянныйИдентификаторДопСтроки) Тогда
						Продолжить;
					КонецЕсли;
					
					НаименованиеСтроки = ДопСтрокаАлгоритма.Наименование;
					ПроцессорПоказателя.Показатель.НаименованиеПоказателя = НаименованиеСтроки;
					
					УстановитьНаименованиеПоказателяРасшифровки(ПроцессорПоказателя.Показатель);
					УстановитьЗначениеПоказателяПоПроцессору(СтрокаМСЧ, ПроцессорПоказателя, АлгоритмСтроки);
					
					// Установка наименования строки "в том числе".
					ИмяПоказателя = "П100010" + НомерСтроки + "02";
					
					ПараметрыПоискаПоказателя = Новый Структура("Тип, Идентификатор", "Показатель", ИмяПоказателя);
					СтрокиПоказателей = СтрокаМСЧ.Строки.НайтиСтроки(ПараметрыПоискаПоказателя);
					СтрокаПоказателя = СтрокиПоказателей[0];
					СтрокаПоказателя.Данные = НаименованиеСтроки;
					
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция РассчитатьПоказателиБаланс(ПроцессорПоказателя, Алгоритмы)

	ЗначенияПоказателей = НовыйЗначенияПоказателей();
	
	Для Каждого АлгоритмСтроки Из Алгоритмы Цикл
		
		ИнициализироватьПоказатель(ПроцессорПоказателя);

		РассчитатьПоказательБаланс(ЗначенияПоказателей, ПроцессорПоказателя, АлгоритмСтроки);
		
		Если АлгоритмСтроки.Свойство("ДопСтроки") Тогда
			
			Для ИндексСтроки = 0 По АлгоритмСтроки.ДопСтроки.ВГраница() Цикл
				ДопСтрокаАлгоритма = АлгоритмСтроки.ДопСтроки[ИндексСтроки];
				
				ПроцессорПоказателя.Показатель.ЗначениеПоказателя = 0;
				ПроцессорПоказателя.Показатель.Расшифровка = Новый Массив;
				
				РассчитатьПоказательБаланс(ЗначенияПоказателей, ПроцессорПоказателя, ДопСтрокаАлгоритма, ИндексСтроки);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЗначенияПоказателей;
	
КонецФункции

Процедура РассчитатьПоказательБаланс(ЗначенияПоказателей, ПроцессорПоказателя, АлгоритмСтроки, ИндексСтроки = Неопределено)
	
	Для Каждого Составляющая Из АлгоритмСтроки.Составляющие Цикл
		ОписаниеСоставлящей = Составляющая[0];
		ДопПараметры = Составляющая[1];
		УчестьСоставляющую(ПроцессорПоказателя, ОписаниеСоставлящей, ДопПараметры);
	КонецЦикла;

	ЗначениеПоказателя = ЗначенияПоказателей.Добавить();
	ЗначениеПоказателя.Организация = ПроцессорПоказателя.Организация;
	ЗаполнитьЗначенияСвойств(ЗначениеПоказателя, ПроцессорПоказателя.Показатель);
	Если ИндексСтроки = Неопределено Тогда
		// ФСБУ 4 предусматривает коды только для показателей верхнего уровня (групп показателей)
		ЗначениеПоказателя.КодПоказателя = АлгоритмСтроки.Номер;
	КонецЕсли;  
	ЗначениеПоказателя.Идентификатор = ИдентификаторЗначенияПоказателя(
		АлгоритмСтроки.Номер,
		АлгоритмСтроки.Вписываемый,
		АлгоритмСтроки.Наименование,
		ИндексСтроки);
	ЗначениеПоказателя.Наименование  = АлгоритмСтроки.Наименование;
	
КонецПроцедуры

Функция НачатьУстановкуЗначенияПоказателя(ПроцессорПоказателя, ЗначенияПоказателей, АлгоритмСтроки, ИндексСтроки = Неопределено)
	
	Идентификатор = ИдентификаторЗначенияПоказателя(
		АлгоритмСтроки.Номер,
		АлгоритмСтроки.Вписываемый,
		АлгоритмСтроки.Наименование,
		ИндексСтроки);
	ЗначенияПоказателя = ЗначенияПоказателей.Найти(Идентификатор, "Идентификатор");
	Если ЗначенияПоказателя = Неопределено Тогда
		ПроцессорПоказателя.Показатель.ЗначениеПоказателя = 0;
		ПроцессорПоказателя.Показатель.Расшифровка = Новый Массив;
		Возврат Ложь;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ПроцессорПоказателя.Показатель, ЗначенияПоказателя, "ЗначениеПоказателя, НаименованиеПоказателя, Расшифровка");
	
	Возврат Истина;
	
КонецФункции

Процедура УстановитьНаименованиеПоказателяРасшифровки(Показатель)
	
	Если Не ЗначениеЗаполнено(Показатель.Расшифровка) Тогда
		Возврат;
	КонецЕсли;
	
	Показатель.Расшифровка[0].НаименованиеПоказателя = Показатель.НаименованиеПоказателя;
	Для ИндексРасшифровки = 1 По Показатель.Расшифровка.ВГраница() Цикл
		Показатель.Расшифровка[ИндексРасшифровки].НаименованиеПоказателя = "";
	КонецЦикла; 
	
КонецПроцедуры

Функция ИдентификаторЗначенияПоказателя(НомерСтроки, Вписываемый = Ложь, НаименованиеВписываемогоПоказателя = "", ИндексСтроки = Неопределено)

	ЭлементыИдентификатора = Новый Массив;
	ЭлементыИдентификатора.Добавить(НомерСтроки);
	Если Вписываемый Тогда
		ЭлементыИдентификатора.Добавить(НаименованиеВписываемогоПоказателя);
	КонецЕсли;
	Если ИндексСтроки <> Неопределено Тогда
		ЭлементыИдентификатора.Добавить(ИндексСтроки);
	КонецЕсли;
	
	Возврат СтрСоединить(ЭлементыИдентификатора, "_");
	
КонецФункции

Функция УпроститьБаланс(Алгоритмы, ЗначенияПоказателейПоВсемОрганизациям, ПараметрыЗаполнения)
	
	// См. также ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.НастроитьЗаполняемыеПоказателиУпрощенногоОтчета (и всю область УпрощеннаяОтчетность)
	
	ПоказателиУпрощеннойОтчетности = ПараметрыЗаполнения.ПоказателиУпрощеннойОтчетности;
	
	ЗначенияПоказателей = НовыйЗначенияПоказателей();
	ЗначенияПоказателей.Индексы.Добавить("КодПоказателя, Идентификатор, Наименование");
	
	Отбор = Новый Структура("КодПоказателя, Идентификатор, Наименование");
	Для Каждого ЗначениеПоказателейПоОрганизации Из ЗначенияПоказателейПоВсемОрганизациям Цикл
		Для Каждого ЗначениеПоказателя Из ЗначениеПоказателейПоОрганизации Цикл
			ЗаполнитьЗначенияСвойств(Отбор, ЗначениеПоказателя);
			НайденныеСтроки = ЗначенияПоказателей.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 0 Тогда
				ЗаполнитьЗначенияСвойств(ЗначенияПоказателей.Добавить(), ЗначениеПоказателя);
				Продолжить;
			КонецЕсли;
			НайденнаяСтрока = НайденныеСтроки[0];
			НайденнаяСтрока.ЗначениеПоказателя = НайденнаяСтрока.ЗначениеПоказателя + ЗначениеПоказателя.ЗначениеПоказателя;
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НайденнаяСтрока.Расшифровка, ЗначениеПоказателя.Расшифровка)
		КонецЦикла
	КонецЦикла;
	
	ВычитаемыеАлгоритмы = ВычитаемыеАлгоритмы(Алгоритмы);
	
	// Удалим все значения детализирующих показателей.
	КоличествоСтрок = ЗначенияПоказателей.Количество();
	Для НомерСКонца = 1 По КоличествоСтрок Цикл
		ИндексЗначения = КоличествоСтрок - НомерСКонца;
		ЗначениеПоказателя = ЗначенияПоказателей[ИндексЗначения];
		Если Не ЗначениеЗаполнено(ЗначениеПоказателя.КодПоказателя) Тогда
			ЗначенияПоказателей.Удалить(ЗначениеПоказателя);
		КонецЕсли;
	КонецЦикла;
	
	// Составим индекс оставшихся значений
	ИндексЗначенияПоказателей = Новый Соответствие; // Ключ - код строки, Значение - Массив из элементов ЗначенияПоказателей
	Для Каждого ЗначениеПоказателя Из ЗначенияПоказателей Цикл
		ОбщегоНазначенияБПКлиентСервер.ДополнитьРазделенныйМассив(ИндексЗначенияПоказателей, ЗначениеПоказателя.КодПоказателя, ЗначениеПоказателя);
	КонецЦикла;
	
	// Составим индекс алгоритмов
	ИндексАлгоритмов = Новый Соответствие; // Ключ - номер показателя; Значение - массив записей из Алгоритмы
	Для Каждого Алгоритм Из Алгоритмы Цикл
		ОбщегоНазначенияБПКлиентСервер.ДополнитьРазделенныйМассив(ИндексАлгоритмов, Алгоритм.Номер, Алгоритм);
	КонецЦикла;
	
	ИндексЗначенияПоказателейПоИдентификаторам = Неопределено; // Соответствие (Ключ - идентификатор, Значение - Массив из элементов ЗначенияПоказателей), инцииализируется при первом обращении
	
	// Обобщим показатели
	СхемаСокращения = ЗаполнениеБухгалтерскойОтчетностиУпрощенная.СхемаСокращенияУпрощеннойОтчетности("Баланс", ПараметрыЗаполнения.ЭтоБалансНекоммерческойОрганизации);
	
	НомерРаскрывающегоПоказателя = 99900; // выдаем из диапазона, заведомо не пересекающегося с кодами показателей, установленными Минфином
	
	КодыСтрокНесущественныхПоказателей = БухгалтерскаяОтчетностьБРО.КодыСтрокНесущественныхПоказателей();
	
	Для Каждого СхемаГруппыПоказателей Из СхемаСокращения Цикл
		
		КодОбобщенногоПоказателя = СхемаГруппыПоказателей.Значение[СхемаГруппыПоказателей.Значение.ВГраница()];
		
		АлгоритмыОбобщенногоПоказателя = ИндексАлгоритмов[КодОбобщенногоПоказателя];
		Если Не ЗначениеЗаполнено(АлгоритмыОбобщенногоПоказателя) Тогда
			АлгоритмОбобщенногоПоказателя = ДобавитьНовыйАлгоритмСтроки(Алгоритмы, КодОбобщенногоПоказателя, СхемаГруппыПоказателей.Представление);
			ОбщегоНазначенияБПКлиентСервер.ДополнитьРазделенныйМассив(ИндексАлгоритмов, КодОбобщенногоПоказателя, АлгоритмОбобщенногоПоказателя);
			АлгоритмыОбобщенногоПоказателя = ИндексАлгоритмов[КодОбобщенногоПоказателя];
		КонецЕсли;
		
		АлгоритмОбобщенногоПоказателя = АлгоритмыОбобщенногоПоказателя[0];
		АлгоритмОбобщенногоПоказателя.Наименование = СхемаГруппыПоказателей.Представление;
		
		Если Не АлгоритмОбобщенногоПоказателя.Свойство("ДопСтроки") Тогда
			ЗаполнениеБухгалтерскойОтчетностиОсновная.ДополнитьАлгоритмСтрокиДопСтроками(АлгоритмОбобщенногоПоказателя, НомерРаскрывающегоПоказателя);
		КонецЕсли;
		
		ЗначенияПоКодуОбобщенногоПоказателя = ИндексЗначенияПоказателей[КодОбобщенногоПоказателя];
		Если Не ЗначениеЗаполнено(ЗначенияПоКодуОбобщенногоПоказателя) Тогда
			
			ЗначенияОбобщенногоПоказателя = ЗначенияПоказателей.Добавить();
			ЗначенияОбобщенногоПоказателя.КодПоказателя = КодОбобщенногоПоказателя;
			ЗначенияОбобщенногоПоказателя.Идентификатор = ИдентификаторЗначенияПоказателя(
				АлгоритмОбобщенногоПоказателя.Номер,
				АлгоритмОбобщенногоПоказателя.Вписываемый,
				АлгоритмОбобщенногоПоказателя.Наименование);
			ЗначенияОбобщенногоПоказателя.Наименование           = АлгоритмОбобщенногоПоказателя.Наименование;
			ЗначенияОбобщенногоПоказателя.НаименованиеПоказателя = АлгоритмОбобщенногоПоказателя.Наименование;
			
			ОбщегоНазначенияБПКлиентСервер.ДополнитьРазделенныйМассив(ИндексЗначенияПоказателей, КодОбобщенногоПоказателя, ЗначенияОбобщенногоПоказателя);
			ЗначенияПоКодуОбобщенногоПоказателя = ИндексЗначенияПоказателей[КодОбобщенногоПоказателя];
			
		КонецЕсли;
		ЗначенияОбобщенногоПоказателя = ЗначенияПоКодуОбобщенногоПоказателя[0];
		
		ОбобщаемыеЗначения = Новый Массив;
		Для Каждого КодПоказателя Из СхемаГруппыПоказателей.Значение Цикл
			ЗначенияПоказателейПоКоду = ИндексЗначенияПоказателей[КодПоказателя];
			Если ЗначенияПоказателейПоКоду = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОбобщаемыеЗначения, ЗначенияПоказателейПоКоду);
		КонецЦикла;
		
		Если ОбобщаемыеЗначения.Количество() < 2 Тогда
			// Нечего обобщать
			Продолжить;
		КонецЕсли;
		
		// Рассчитаем значение обобщенного показателя, суммировав все, входящие в его состав
		ЗначениеОбобщенногоПоказателя = 0;
		Для Каждого ЗначениеПоказателя Из ОбобщаемыеЗначения Цикл
			СуммируемоеЗначение = ЗначениеПоказателя.ЗначениеПоказателя;
			Если ВычитаемыеАлгоритмы[ЗначениеПоказателя.Идентификатор] = Истина Тогда
				СуммируемоеЗначение = - СуммируемоеЗначение;
			КонецЕсли;
			ЗначениеОбобщенногоПоказателя = ЗначениеОбобщенногоПоказателя + СуммируемоеЗначение;
		КонецЦикла;
		
		// Выберем из сокращаемых показателей наибольший (раскрывающий)
		// Такой выбор делаем только один раз: для отчетного периода, или наиболее позднего, в котором есть значение обобщенного
		ЗначениеЗаполненияИсточник = Неопределено; // т.е. значение заполнения выбранной для раскрытия сокращаемой группы
		ЗначениеРаскрывающегоПоказателя = 0;
		
		КодСтрокиРаскрывающегоПоказателя = ПоказателиУпрощеннойОтчетности[КодОбобщенногоПоказателя];
		Если КодСтрокиРаскрывающегоПоказателя <> Неопределено Тогда
			
			Если ИндексЗначенияПоказателейПоИдентификаторам = Неопределено Тогда
				ИндексЗначенияПоказателейПоИдентификаторам = Новый Соответствие;
				Для Каждого ЗначениеПоказателя Из ЗначенияПоказателей Цикл
					ОбщегоНазначенияБПКлиентСервер.ДополнитьРазделенныйМассив(
						ИндексЗначенияПоказателейПоИдентификаторам,
						ЗначениеПоказателя.Идентификатор,
						ЗначениеПоказателя);
				КонецЦикла;
			КонецЕсли;
			
			ГруппаПоказателей = ИндексЗначенияПоказателейПоИдентификаторам[КодСтрокиРаскрывающегоПоказателя];
			Если ЗначениеЗаполнено(ГруппаПоказателей) Тогда
				ЗначениеЗаполненияИсточник = ГруппаПоказателей[0];
				ЗначениеРаскрывающегоПоказателя = ЗначениеЗаполненияИсточник.ЗначениеПоказателя;
			КонецЕсли;
			
		Иначе
			
			ЗнакОбобщенногоПоказателя = ОбщегоНазначенияБПКлиентСервер.ЗнакЧисла(ЗначениеОбобщенногоПоказателя);
			
			Если ЗнакОбобщенногоПоказателя <> 0 Тогда
				
				Для Каждого ЗначенияРаскрывающегоПоказателя Из ОбобщаемыеЗначения Цикл
					ЗнакРаскрывающегоПоказателя = ОбщегоНазначенияБПКлиентСервер.ЗнакЧисла(ЗначенияРаскрывающегоПоказателя.ЗначениеПоказателя); 
					Если ЗнакРаскрывающегоПоказателя <> ЗнакОбобщенногоПоказателя Тогда
						Продолжить;
					КонецЕсли;
					Если (ЗнакОбобщенногоПоказателя > 0 И ЗначенияРаскрывающегоПоказателя.ЗначениеПоказателя > ЗначениеРаскрывающегоПоказателя)
						Или (ЗнакОбобщенногоПоказателя < 0 И ЗначенияРаскрывающегоПоказателя.ЗначениеПоказателя < ЗначениеРаскрывающегоПоказателя) Тогда
						ЗначениеЗаполненияИсточник = ЗначенияРаскрывающегоПоказателя;
						ЗначениеРаскрывающегоПоказателя = ЗначенияРаскрывающегоПоказателя.ЗначениеПоказателя;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
			Если ЗначениеЗаполненияИсточник <> Неопределено Тогда
				ПоказателиУпрощеннойОтчетности.Вставить(КодОбобщенногоПоказателя, ЗначениеЗаполненияИсточник.Идентификатор);
			КонецЕсли;
			
		КонецЕсли;
		
		// Если он не совпадает по наименованию с обобщенным, добавим раскрывающий показатель для вывода
		Если ЗначениеЗаполненияИсточник <> Неопределено 
			И (КодыСтрокНесущественныхПоказателей[ЗначениеЗаполненияИсточник.КодПоказателя] = Истина
			Или ЗначениеЗаполненияИсточник.Наименование = СхемаГруппыПоказателей.Представление) Тогда
			// Вывод такого показателя не несет информации
			ЗначениеЗаполненияИсточник = Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполненияИсточник <> Неопределено Тогда
			
			НомерРаскрывающегоПоказателя = НомерРаскрывающегоПоказателя + 1;
			КодДопСтроки = XMLСтрока(НомерРаскрывающегоПоказателя);
			
			АлгоритмДопСтроки = ДобавитьНовыйАлгоритмСтроки(
				АлгоритмОбобщенногоПоказателя.ДопСтроки,
				КодДопСтроки,
				ЗначениеЗаполненияИсточник.Наименование);
				
			ИндексДопСтроки = АлгоритмОбобщенногоПоказателя.ДопСтроки.ВГраница();
			
			ЗначениеПоказателя = ЗначенияПоказателей.Добавить();
			ЗначениеПоказателя.ЗначениеПоказателя = ЗначениеРаскрывающегоПоказателя;
			ЗначениеПоказателя.Идентификатор = ИдентификаторЗначенияПоказателя(
				АлгоритмДопСтроки.Номер,
				АлгоритмДопСтроки.Вписываемый,
				АлгоритмДопСтроки.Наименование,
				ИндексДопСтроки);
			ЗначениеПоказателя.Наименование = АлгоритмДопСтроки.Наименование;
			
			ДополнитьРасшифровку(ЗначениеПоказателя, ЗначениеЗаполненияИсточник, ВычитаемыеАлгоритмы, Истина);
			
		КонецЕсли;
		
		// Перенесем в обобщенный показатель сведения о сокращаемых показателях
		ЗначенияОбобщенногоПоказателя.ЗначениеПоказателя = ЗначениеОбобщенногоПоказателя;
		Для Каждого ЗначенияСокращаемогоПоказателя Из ОбобщаемыеЗначения Цикл
			Если ЗначенияСокращаемогоПоказателя = ЗначенияОбобщенногоПоказателя Тогда
				Продолжить;
			КонецЕсли;
			ДополнитьРасшифровку(ЗначенияОбобщенногоПоказателя, ЗначенияСокращаемогоПоказателя, ВычитаемыеАлгоритмы);
			ЗначенияПоказателей.Удалить(ЗначенияСокращаемогоПоказателя);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ЗначенияПоказателей;
	
КонецФункции

Процедура ДополнитьРасшифровку(Приемник, Источник, ВычитаемыеАлгоритмы, ОтвязатьПервуюСтроку = Ложь)
	
	// Недостаточно скопировать ссылки на расшифровку, так как
	// а. первая строка расшифровки хранит заголовок, который устанавливается позже, при заполнении контейнера
	// б. для удобства разработчика расшифровки хранятся с потерей знака (см. ВычитаемыеАлгоритмы),
	//    соответственно расшифровки разных показателей при суммировании могут требовать уточнения знака
	
	Если ВычитаемыеАлгоритмы[Источник.Идентификатор] = Истина Тогда
		Для Каждого ЭлементРасшифровкиИсточник Из Источник.Расшифровка Цикл
			ЭлементРасшифровкиПриемник = ОбщегоНазначения.СкопироватьРекурсивно(ЭлементРасшифровкиИсточник);
			ЭлементРасшифровкиПриемник.Сумма = - ЭлементРасшифровкиПриемник.Сумма;
			Если ЭлементРасшифровкиПриемник.ЗнакОперации = "+" Тогда
				ЭлементРасшифровкиПриемник.ЗнакОперации = "-";
			ИначеЕсли ЭлементРасшифровкиПриемник.ЗнакОперации = "-" Тогда
				ЭлементРасшифровкиПриемник.ЗнакОперации = "+";
			КонецЕсли;
			Приемник.Расшифровка.Добавить(ЭлементРасшифровкиПриемник);
		КонецЦикла;
	Иначе
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Приемник.Расшифровка, Источник.Расшифровка);
		Если ОтвязатьПервуюСтроку И ЗначениеЗаполнено(Приемник.Расшифровка) Тогда
			Приемник.Расшифровка[0] = ОбщегоНазначения.СкопироватьРекурсивно(Приемник.Расшифровка[0]);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция ВычитаемыеАлгоритмы(Алгоритмы)
	
	// Для удобства разработчика значения, уменьшающие валюту баланса, могут храниться
	// положительными числами (другими словами - с инвертированным знаком).
	// Таким образом, только по значению нельзя определить, уменьшает оно валюту баланса или нет -
	// нужно обращаться к свойствам соответствующего алгоритма.
	
	ВычитаемыеАлгоритмы = Новый Соответствие; // Ключ - идентификатор алгоритма, Значение - Истина
	
	Для Каждого Алгоритм Из Алгоритмы Цикл
		
		ДобавитьВычитаемыйАлгоритм(ВычитаемыеАлгоритмы, Алгоритм);
		
		Если Алгоритм.Свойство("ДопСтроки") Тогда
			Для Каждого ВложенныйАлгоритм Из Алгоритм.ДопСтроки Цикл
				ДобавитьВычитаемыйАлгоритм(ВычитаемыеАлгоритмы, ВложенныйАлгоритм);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВычитаемыеАлгоритмы;
	
КонецФункции

Процедура ДобавитьВычитаемыйАлгоритм(ВычитаемыеАлгоритмы, Алгоритм);
	
	Если Не Алгоритм.Вычитаемый Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторАлгоритма = ИдентификаторЗначенияПоказателя(
		Алгоритм.Номер,
		Алгоритм.Вписываемый,
		Алгоритм.Наименование);
		
	ВычитаемыеАлгоритмы.Вставить(ИдентификаторАлгоритма, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьОтчетБухОтчетностьФормаОтчета2025Кв1_ОИК(ПараметрыЗаполнения)
	
	ИмяРаздела = "ОИК";
	
	Контейнер = ПараметрыЗаполнения.Контейнер;
	КонтейнерРаздела = Контейнер.Строки.Найти(ИмяРаздела, "Идентификатор");
	
	Организация = ПараметрыЗаполнения.Организация;
	
	// Даты отчетного периода.
	НачалоОтчетногоПериода = ПараметрыЗаполнения.НачалоОтчетногоПериода;
	КонецОтчетногоПериода = ПараметрыЗаполнения.КонецОтчетногоПериода;
	КонецОтчетногоГода = КонецГода(КонецОтчетногоПериода);
	
	// Даты сравнительного периода.
	КонецГодаСравнительногоПериода = ДобавитьМесяц(КонецОтчетногоГода, -12);
	КонецСравнительногоПериода = ДобавитьМесяц(КонецОтчетногоПериода, -12);
	НачалоСравнительногоПериода = НачалоГода(КонецСравнительногоПериода);
	
	// Даты года, предшествующего сравнительному.
	КонецГода_2 = ДобавитьМесяц(КонецОтчетногоГода, -24);
	
	СчетаСРеквизитами = ПараметрыЗаполнения.СчетаСРеквизитами;
	
	ПараметрыРасшифровки = Новый Структура;
	ПараметрыРасшифровки.Вставить("ИмяРаздела", ИмяРаздела);
	ПараметрыРасшифровки.Вставить("КонтейнерРаздела", КонтейнерРаздела);
	ПараметрыРасшифровки.Вставить("Организация", Организация);
	
	ПараметрыОтчетовРасшифровки = Новый Структура;
	ПараметрыОтчетовРасшифровки.Вставить("Организация", Организация);
	ПараметрыОтчетовРасшифровки.Вставить("НачалоПериода", '0001-01-01');
	ПараметрыОтчетовРасшифровки.Вставить("КонецПериода", '0001-01-01');
	
	ОписаниеОборотныхСтрок = Новый Структура;
	ОписаниеОборотныхСтрок.Вставить("Строка3х11", Новый Структура("Номер, Код, Наименование", "", "",
		"Чистая прибыль (убыток)"));
	ОписаниеОборотныхСтрок.Вставить("Строка3х12", Новый Структура("Номер, Код, Наименование", "", "",
		"Переоценка внеоборотных активов"));
	ОписаниеОборотныхСтрок.Вставить("Строка3х27", Новый Структура("Номер, Код, Наименование", "", "",
		"Дивиденды"));
	ОписаниеОборотныхСтрок.Вставить("Строка3х30", Новый Структура("Номер, Код, Наименование", "", "",
		"Иные изменения за счет операций с собственниками (за исключением дивидендов) - всего"));
	ОписаниеОборотныхСтрок.Вставить("Строка3х40", Новый Структура("Номер, Код, Наименование", "", "",
		"Иные изменения - всего"));
	
	#Область РасчетБухгалтерскихИтогов
	
	НастройкиПолученияБухитогов = Новый Структура;
	НастройкиПолученияБухитогов.Вставить("Организация", Организация);
	НастройкиПолученияБухитогов.Вставить("НачалоПериода", '0001-01-01');
	НастройкиПолученияБухитогов.Вставить("КонецПериода", '0001-01-01');
	
	НастройкиПолученияБухитогов.НачалоПериода = НачалоОтчетногоПериода;
	НастройкиПолученияБухитогов.КонецПериода =  КонецОтчетногоПериода;
	СиО_ОтчетныйПериод =
		ЗаполнениеБухгалтерскойОтчетностиИтоги.СальдоИОборотыПоСчетам(НастройкиПолученияБухитогов);
	ОБ_ОтчетныйПериод =
		ЗаполнениеБухгалтерскойОтчетностиИтоги.ОборотыМеждуСчетами(НастройкиПолученияБухитогов);
	
	НастройкиПолученияБухитогов.НачалоПериода = НачалоСравнительногоПериода;
	НастройкиПолученияБухитогов.КонецПериода =  КонецГодаСравнительногоПериода;
	СиО_Год_1 = ЗаполнениеБухгалтерскойОтчетностиИтоги.СальдоИОборотыПоСчетам(НастройкиПолученияБухитогов);
	
	НастройкиПолученияБухитогов.НачалоПериода = НачалоСравнительногоПериода;
	НастройкиПолученияБухитогов.КонецПериода =  КонецСравнительногоПериода;
	СиО_СравнительныйПериод =
		ЗаполнениеБухгалтерскойОтчетностиИтоги.СальдоИОборотыПоСчетам(НастройкиПолученияБухитогов);
	ОБ_СравнительныйПериод =
		ЗаполнениеБухгалтерскойОтчетностиИтоги.ОборотыМеждуСчетами(НастройкиПолученияБухитогов);
	
	НастройкиПолученияБухитогов.НачалоПериода = НачалоГода(КонецГода_2);
	НастройкиПолученияБухитогов.КонецПериода =  КонецГода_2;
	СальдоИОборотыПоСчетам_2 =
		ЗаполнениеБухгалтерскойОтчетностиИтоги.СальдоИОборотыПоСчетам(НастройкиПолученияБухитогов);
	
	#КонецОбласти
	
	ЗаголовкиГраф = Новый Соответствие;
	ЗаголовкиГраф.Вставить("04", "Уставный капитал");
	ЗаголовкиГраф.Вставить("05", "Собственные акции, принадлежащие обществу, задолженность акционеров по оплате акций");
	ЗаголовкиГраф.Вставить("06", "Накопленная дооценка внеоборотных активов");
	ЗаголовкиГраф.Вставить("07", "Добавочный капитал (без накопленной дооценки)");
	ЗаголовкиГраф.Вставить("08", "Резервный капитал");
	ЗаголовкиГраф.Вставить("09", "Нераспределенная прибыль (непокрытый убыток)");
	ЗаголовкиГраф.Вставить("10", "Резервный капитал");
	
	ПараметрыЗаполненияСтрок = Новый Структура;
	// Общие параметры для всего отчета.
	ПараметрыЗаполненияСтрок.Вставить("КонтейнерРаздела",КонтейнерРаздела);
	ПараметрыЗаполненияСтрок.Вставить("СчетаСРеквизитами", СчетаСРеквизитами);
	ПараметрыЗаполненияСтрок.Вставить("ЗаголовкиГраф", ЗаголовкиГраф);
	// Параметры для строк, заполняются в процессе заполнения.
	ПараметрыЗаполненияСтрок.Вставить("НомерСтроки", "");
	ПараметрыЗаполненияСтрок.Вставить("НаименованиеСтроки", "");
	ПараметрыЗаполненияСтрок.Вставить("СиО", Новый ТаблицаЗначений);
	ПараметрыЗаполненияСтрок.Вставить("ОБ", Новый ТаблицаЗначений);
	// Параметры заполнения для строк, меняются через ссылочные объекты.
	ПараметрыЗаполненияСтрок.Вставить("ПараметрыРасшифровки", ПараметрыРасшифровки);
	ПараметрыЗаполненияСтрок.Вставить("ПараметрыОтчетовРасшифровки", ПараметрыОтчетовРасшифровки);
	ПараметрыЗаполненияСтрок.Вставить("ОписаниеОборотныхСтрок", ОписаниеОборотныхСтрок);
	
	ПараметрыЗаполненияСтрок.СиО = СальдоИОборотыПоСчетам_2;
	ПараметрыОтчетовРасшифровки.НачалоПериода = НачалоГода(КонецГода_2);
	ПараметрыОтчетовРасшифровки.КонецПериода = КонецГода_2;
	
	ПараметрыЗаполненияСтрок.НомерСтроки = "3100";
	ПараметрыЗаполненияСтрок.НаименованиеСтроки = "На " + Формат(КонецГода_2, "ДЛФ=DD");
	ЗаполнитьОтчетБухОтчетностьФормаОтчета2025Кв1_ОИК_Итоговые(ПараметрыЗаполненияСтрок);
	
	ПараметрыЗаполненияСтрок.СиО = СиО_СравнительныйПериод;
	ПараметрыЗаполненияСтрок.ОБ = ОБ_СравнительныйПериод;
	ПараметрыОтчетовРасшифровки.НачалоПериода = НачалоСравнительногоПериода;
	ПараметрыОтчетовРасшифровки.КонецПериода =  КонецСравнительногоПериода;
	
	ОписаниеОборотныхСтрок.Строка3х11.Номер = "3211";
	ОписаниеОборотныхСтрок.Строка3х12.Номер = "3212";
	ОписаниеОборотныхСтрок.Строка3х27.Номер = "3227";
	ОписаниеОборотныхСтрок.Строка3х30.Номер = "3230";
	ОписаниеОборотныхСтрок.Строка3х40.Номер = "3240";
	ЗаполнитьОтчетБухОтчетностьФормаОтчета2025Кв1_ОИК_Оборотные(ПараметрыЗаполненияСтрок);
	
	ПараметрыЗаполненияСтрок.НомерСтроки = "3250";
	ПараметрыЗаполненияСтрок.НаименованиеСтроки = "На " + Формат(КонецСравнительногоПериода, "ДЛФ=DD");
	ЗаполнитьОтчетБухОтчетностьФормаОтчета2025Кв1_ОИК_Итоговые(ПараметрыЗаполненияСтрок);
	
	ПараметрыЗаполненияСтрок.СиО = СиО_Год_1;
	ПараметрыОтчетовРасшифровки.НачалоПериода = НачалоСравнительногоПериода;
	ПараметрыОтчетовРасшифровки.КонецПериода =  КонецГодаСравнительногоПериода;
	
	ПараметрыЗаполненияСтрок.НомерСтроки = "3200";
	ПараметрыЗаполненияСтрок.НаименованиеСтроки = "На " + Формат(КонецГодаСравнительногоПериода, "ДЛФ=DD");
	ЗаполнитьОтчетБухОтчетностьФормаОтчета2025Кв1_ОИК_Итоговые(ПараметрыЗаполненияСтрок);
	
	ПараметрыЗаполненияСтрок.СиО = СиО_ОтчетныйПериод;
	ПараметрыЗаполненияСтрок.ОБ = ОБ_ОтчетныйПериод;
	ПараметрыОтчетовРасшифровки.НачалоПериода = НачалоОтчетногоПериода;
	ПараметрыОтчетовРасшифровки.КонецПериода =  КонецОтчетногоПериода;
	
	ОписаниеОборотныхСтрок.Строка3х11.Номер = "3311";
	ОписаниеОборотныхСтрок.Строка3х12.Номер = "3312";
	ОписаниеОборотныхСтрок.Строка3х27.Номер = "3327";
	ОписаниеОборотныхСтрок.Строка3х30.Номер = "3330";
	ОписаниеОборотныхСтрок.Строка3х40.Номер = "3340";
	ЗаполнитьОтчетБухОтчетностьФормаОтчета2025Кв1_ОИК_Оборотные(ПараметрыЗаполненияСтрок);
	
	ПараметрыЗаполненияСтрок.НомерСтроки = "3300";
	ПараметрыЗаполненияСтрок.НаименованиеСтроки = "На " + Формат(КонецОтчетногоПериода, "ДЛФ=DD");
	ЗаполнитьОтчетБухОтчетностьФормаОтчета2025Кв1_ОИК_Итоговые(ПараметрыЗаполненияСтрок);
	
КонецПроцедуры

Процедура ЗаполнитьОтчетБухОтчетностьФормаОтчета2025Кв1_ОИК_Итоговые(ПараметрыЗаполнения)
	
	КонтейнерРаздела = ПараметрыЗаполнения.КонтейнерРаздела;
	СчетаСРеквизитами = ПараметрыЗаполнения.СчетаСРеквизитами;
	ЗаголовкиГраф = ПараметрыЗаполнения.ЗаголовкиГраф;
	
	НомерСтроки = ПараметрыЗаполнения.НомерСтроки;
	НаименованиеСтроки = ПараметрыЗаполнения.НаименованиеСтроки;
	СальдоИОборотыПоСчетам = ПараметрыЗаполнения.СиО;
	ПараметрыРасшифровки = ПараметрыЗаполнения.ПараметрыРасшифровки;
	ПараметрыОтчетовРасшифровки = ПараметрыЗаполнения.ПараметрыОтчетовРасшифровки;
	
	СКК_80 = СКК("80", СальдоИОборотыПоСчетам);
	СКД_80 = СКД("80", СальдоИОборотыПоСчетам);
	СКК_81 = СКК("81", СальдоИОборотыПоСчетам);
	СКД_81 = СКД("81", СальдоИОборотыПоСчетам);
	СКК_82 = СКК("82", СальдоИОборотыПоСчетам);
	СКД_82 = СКД("82", СальдоИОборотыПоСчетам);
	СКК_83 = СКК("83", СальдоИОборотыПоСчетам);
	СКД_83 = СКД("83", СальдоИОборотыПоСчетам);
	СКК_83_01 = СКК("83.01", СальдоИОборотыПоСчетам);
	СКД_83_01 = СКД("83.01", СальдоИОборотыПоСчетам);
	СКК_84 = СКК("84", СальдоИОборотыПоСчетам);
	СКД_84 = СКД("84", СальдоИОборотыПоСчетам);
	СКК_99 = СКК("99", СальдоИОборотыПоСчетам);
	СКД_99 = СКД("99", СальдоИОборотыПоСчетам);
	
	Графа = "04";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	ЗначениеПоказателя = СКК_80 - СКД_80;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, ЗначениеПоказателя);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!СКК " + СчетСРеквизитами("80", СчетаСРеквизитами).Код,
		СКК_80, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("80")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!СКД " + СчетСРеквизитами("80", СчетаСРеквизитами).Код,
		-СКД_80, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("80")));
	
	Графа = "05";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	ЗначениеПоказателя = СКК_81 - СКД_81;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, ЗначениеПоказателя);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!СКК " + СчетСРеквизитами("81", СчетаСРеквизитами).Код,
		СКК_81, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("81")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!СКД " + СчетСРеквизитами("81", СчетаСРеквизитами).Код,
		-СКД_81, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("81")));
	
	Графа = "06";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	ЗначениеПоказателя = СКК_83_01 - СКД_83_01;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, ЗначениеПоказателя);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!СКК " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		СКК_83_01, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("83.01")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!СКД " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		-СКД_83_01, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("83.01")));
	
	Графа = "07";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	ЗначениеПоказателя = СКК_83 - СКК_83_01
	                     - СКД_83 + СКД_83_01;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, ЗначениеПоказателя);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!СКК " + СчетСРеквизитами("83", СчетаСРеквизитами).Код,
		СКК_83, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("83")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!СКК " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		-СКК_83_01, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("83.01")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!СКД " + СчетСРеквизитами("83", СчетаСРеквизитами).Код,
		-СКД_83, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("83")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!СКД " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		СКД_83_01, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("83.01")));
	
	Графа = "08";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	ЗначениеПоказателя = СКК_82 - СКД_82;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, ЗначениеПоказателя);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!СКК " + СчетСРеквизитами("82", СчетаСРеквизитами).Код,
		СКК_82, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("82")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!СКД " + СчетСРеквизитами("82", СчетаСРеквизитами).Код,
		-СКД_82, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("82")));
	
	Графа = "09";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	ЗначениеПоказателя = СКК_84 - СКД_84 + СКК_99 - СКД_99;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, ЗначениеПоказателя);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!СКК " + СчетСРеквизитами("84", СчетаСРеквизитами).Код,
		СКК_84, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("84")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!СКД " + СчетСРеквизитами("84", СчетаСРеквизитами).Код,
		-СКД_84, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("84")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!СКК " + СчетСРеквизитами("99", СчетаСРеквизитами).Код,
		СКК_99, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("99")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!СКД " + СчетСРеквизитами("99", СчетаСРеквизитами).Код,
		-СКД_99, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("99")));
	
КонецПроцедуры

Процедура ЗаполнитьОтчетБухОтчетностьФормаОтчета2025Кв1_ОИК_Оборотные(ПараметрыЗаполнения)
	
	КонтейнерРаздела = ПараметрыЗаполнения.КонтейнерРаздела;
	СчетаСРеквизитами = ПараметрыЗаполнения.СчетаСРеквизитами;
	ЗаголовкиГраф = ПараметрыЗаполнения.ЗаголовкиГраф;
	
	СальдоИОборотыПоСчетам = ПараметрыЗаполнения.СиО;
	ОборотыМеждуСчетами = ПараметрыЗаполнения.ОБ;
	ПараметрыРасшифровки = ПараметрыЗаполнения.ПараметрыРасшифровки;
	ПараметрыОтчетовРасшифровки = ПараметрыЗаполнения.ПараметрыОтчетовРасшифровки;
	
	ОписаниеОборотныхСтрок = ПараметрыЗаполнения.ОписаниеОборотныхСтрок;
	
	БезРасшифровки = Новый Структура("Организация", ПараметрыОтчетовРасшифровки.Организация);
	
	#Область РасчетБухгалтерскихВеличин
	
	ОБ_99__80 = ОБ("99", "80", ОборотыМеждуСчетами);
	ОБ_80__99 = ОБ("80", "99", ОборотыМеждуСчетами);
	ОБ_99__81 = ОБ("99", "81", ОборотыМеждуСчетами);
	ОБ_81__99 = ОБ("81", "99", ОборотыМеждуСчетами);
	ОБ_99__82 = ОБ("99", "82", ОборотыМеждуСчетами);
	ОБ_82__99 = ОБ("82", "99", ОборотыМеждуСчетами);
	ОБ_99__83 = ОБ("99", "83", ОборотыМеждуСчетами);
	ОБ_83__99 = ОБ("83", "99", ОборотыМеждуСчетами);
	ОБ_99__83_01 = ОБ("99", "83.01", ОборотыМеждуСчетами);
	ОБ_83_01__99 = ОБ("83.01", "99", ОборотыМеждуСчетами);
	ОБ_99__84 = ОБ("99", "84", ОборотыМеждуСчетами);
	ОБ_84__99 = ОБ("84", "99", ОборотыМеждуСчетами);
	СКК_99 = СКК("99", СальдоИОборотыПоСчетам);
	СКД_99 = СКД("99", СальдоИОборотыПоСчетам);
	
	ОБ_01__83_01 = ОБ("01", "83.01", ОборотыМеждуСчетами);
	ОБ_83_01__01 = ОБ("83.01", "01", ОборотыМеждуСчетами);
	ОБ_02__83_01 = ОБ("02", "83.01", ОборотыМеждуСчетами);
	ОБ_83_01__02 = ОБ("83.01", "02", ОборотыМеждуСчетами);
	ОБ_03__83_01 = ОБ("03", "83.01", ОборотыМеждуСчетами);
	ОБ_83_01__03 = ОБ("83.01", "03", ОборотыМеждуСчетами);
	ОБ_04__83_01 = ОБ("04", "83.01", ОборотыМеждуСчетами);
	ОБ_83_01__04 = ОБ("83.01", "04", ОборотыМеждуСчетами);
	ОБ_05__83_01 = ОБ("05", "83.01", ОборотыМеждуСчетами);
	ОБ_83_01__05 = ОБ("83.01", "05", ОборотыМеждуСчетами);
	ОБ_07__83_01 = ОБ("07", "83.01", ОборотыМеждуСчетами);
	ОБ_83_01__07 = ОБ("83.01", "07", ОборотыМеждуСчетами);
	ОБ_08__83_01 = ОБ("08", "83.01", ОборотыМеждуСчетами);
	ОБ_83_01__08 = ОБ("83.01", "08", ОборотыМеждуСчетами);
	
	ОБ_75_02__80 = ОБ("75.02", "80", ОборотыМеждуСчетами);
	ОБ_80__75_02 = ОБ("80", "75.02", ОборотыМеждуСчетами);
	ОБ_75_02__81 = ОБ("75.02", "81", ОборотыМеждуСчетами);
	ОБ_81__75_02 = ОБ("81", "75.02", ОборотыМеждуСчетами);
	ОБ_75_02__83 = ОБ("75.02", "83", ОборотыМеждуСчетами);
	ОБ_83__75_02 = ОБ("83", "75.02", ОборотыМеждуСчетами);
	ОБ_75_02__83_01 = ОБ("75.02", "83.01", ОборотыМеждуСчетами);
	ОБ_83_01__75_02 = ОБ("83.01", "75.02", ОборотыМеждуСчетами);
	ОБ_75_02__84 = ОБ("75.02", "84", ОборотыМеждуСчетами);
	ОБ_84__75_02 = ОБ("84", "75.02", ОборотыМеждуСчетами);
	
	ОБ_75__80 = ОБ("75", "80", ОборотыМеждуСчетами);
	ОБ_80__75 = ОБ("80", "75", ОборотыМеждуСчетами);
	ОБ_75__81 = ОБ("75", "81", ОборотыМеждуСчетами);
	ОБ_81__75 = ОБ("81", "75", ОборотыМеждуСчетами);
	ОБ_75__82 = ОБ("75", "82", ОборотыМеждуСчетами);
	ОБ_82__75 = ОБ("82", "75", ОборотыМеждуСчетами);
	ОБ_75_02__82 = ОБ("75.02", "82", ОборотыМеждуСчетами);
	ОБ_82__75_02 = ОБ("82", "75.02", ОборотыМеждуСчетами);
	ОБ_75__83 = ОБ("75", "83", ОборотыМеждуСчетами);
	ОБ_83__75 = ОБ("83", "75", ОборотыМеждуСчетами);
	ОБ_75__83_01 = ОБ("75", "83.01", ОборотыМеждуСчетами);
	ОБ_83_01__75 = ОБ("83.01", "75", ОборотыМеждуСчетами);
	ОБ_75__84 = ОБ("75", "84", ОборотыМеждуСчетами);
	ОБ_84__75 = ОБ("84", "75", ОборотыМеждуСчетами);
	
	КО_80 = КО("80", СальдоИОборотыПоСчетам);
	КО_81 = КО("81", СальдоИОборотыПоСчетам);
	КО_82 = КО("82", СальдоИОборотыПоСчетам);
	КО_83 = КО("83", СальдоИОборотыПоСчетам);
	КО_83_01 = КО("83.01", СальдоИОборотыПоСчетам);
	КО_84 = КО("84", СальдоИОборотыПоСчетам);
	
	ДО_80 = ДО("80", СальдоИОборотыПоСчетам);
	ДО_81 = ДО("81", СальдоИОборотыПоСчетам);
	ДО_82 = ДО("82", СальдоИОборотыПоСчетам);
	ДО_83 = ДО("83", СальдоИОборотыПоСчетам);
	ДО_83_01 = ДО("83.01", СальдоИОборотыПоСчетам);
	ДО_84 = ДО("84", СальдоИОборотыПоСчетам);
	
	#КонецОбласти
	
	#Область Строка3х11
	
	НомерСтроки = ОписаниеОборотныхСтрок.Строка3х11.Номер;
	НаименованиеСтроки = ОписаниеОборотныхСтрок.Строка3х11.Наименование;
	
	Графа = "04";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х11_Гр04 = ОБ_99__80 - ОБ_80__99;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х11_Гр04);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("99", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("80", СчетаСРеквизитами).Код,
		ОБ_99__80, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("99"), Счет("80")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("80", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("99", СчетаСРеквизитами).Код,
		-ОБ_80__99, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("80"), Счет("99")));
	
	Графа = "05";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х11_Гр05 = ОБ_99__81 - ОБ_81__99;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х11_Гр05);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("99", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("81", СчетаСРеквизитами).Код,
		ОБ_99__81, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("99"), Счет("81")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("81", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("99", СчетаСРеквизитами).Код,
		-ОБ_81__99, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("81"), Счет("99")));
	
	Графа = "06";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х11_Гр06 = ОБ_99__83_01 - ОБ_83_01__99;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х11_Гр06);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("99", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		ОБ_99__83_01, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("99"), Счет("83.01")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("99", СчетаСРеквизитами).Код,
		-ОБ_83_01__99, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("83.01"), Счет("99")));
	
	Графа = "07";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х11_Гр07 = ОБ_99__83 - ОБ_99__83_01 - ОБ_83__99 + ОБ_83_01__99;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х11_Гр07);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("99", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("83", СчетаСРеквизитами).Код,
		ОБ_99__83, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("99"), Счет("83")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("99", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		-ОБ_99__83_01, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("99"), Счет("83.01")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("83", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("99", СчетаСРеквизитами).Код,
		-ОБ_83__99, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("83"), Счет("99")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("99", СчетаСРеквизитами).Код,
		ОБ_83_01__99, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("83.01"), Счет("99")));
	
	Графа = "08";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х11_Гр08 = ОБ_99__82 - ОБ_82__99;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х11_Гр08);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("99", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("82", СчетаСРеквизитами).Код,
		ОБ_99__82, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("99"), Счет("82")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("82", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("99", СчетаСРеквизитами).Код,
		-ОБ_82__99, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("82"), Счет("99")));
	
	Графа = "09";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х11_Гр09 = ОБ_99__84 - ОБ_84__99 + СКК_99 - СКД_99;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х11_Гр09);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("99", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("84", СчетаСРеквизитами).Код,
		ОБ_99__84, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("99"), Счет("84")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("84", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("99", СчетаСРеквизитами).Код,
		-ОБ_84__99, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("84"), Счет("99")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!СКК " + СчетСРеквизитами("99", СчетаСРеквизитами).Код,
		СКК_99, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("99")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!СКД " + СчетСРеквизитами("99", СчетаСРеквизитами).Код,
		-СКД_99, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("99")));
	
	#КонецОбласти
	
	#Область Строка3х12
	
	НомерСтроки = ОписаниеОборотныхСтрок.Строка3х12.Номер;
	НаименованиеСтроки = ОписаниеОборотныхСтрок.Строка3х12.Наименование;
	
	Графа = "06";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х12_Гр06 = ОБ_01__83_01 - ОБ_83_01__01
	                  + ОБ_02__83_01 - ОБ_83_01__02
	                  + ОБ_03__83_01 - ОБ_83_01__03
	                  + ОБ_04__83_01 - ОБ_83_01__04
	                  + ОБ_05__83_01 - ОБ_83_01__05
	                  + ОБ_07__83_01 - ОБ_83_01__07
	                  + ОБ_08__83_01 - ОБ_83_01__08;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х12_Гр06);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("01", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		ОБ_01__83_01, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("01"), Счет("83.01")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("01", СчетаСРеквизитами).Код,
		-ОБ_83_01__01, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("83.01"), Счет("01")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("02", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		ОБ_02__83_01, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("02"), Счет("83.01")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("02", СчетаСРеквизитами).Код,
		-ОБ_83_01__02, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("83.01"), Счет("02")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("03", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		ОБ_03__83_01, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("03"), Счет("83.01")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("03", СчетаСРеквизитами).Код,
		-ОБ_83_01__03, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("83.01"), Счет("03")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("04", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		ОБ_04__83_01, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("04"), Счет("83.01")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("04", СчетаСРеквизитами).Код,
		-ОБ_83_01__04, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("83.01"), Счет("04")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("05", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		ОБ_05__83_01, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("05"), Счет("83.01")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("05", СчетаСРеквизитами).Код,
		-ОБ_83_01__05, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("83.01"), Счет("05")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("07", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		ОБ_07__83_01, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("07"), Счет("83.01")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("07", СчетаСРеквизитами).Код,
		-ОБ_83_01__07, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("83.01"), Счет("07")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("08", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		ОБ_08__83_01, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("08"), Счет("83.01")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("08", СчетаСРеквизитами).Код,
		-ОБ_83_01__08, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("83.01"), Счет("08")));
	
	#КонецОбласти
	
	#Область Строка3х27
	
	НомерСтроки = ОписаниеОборотныхСтрок.Строка3х27.Номер;
	НаименованиеСтроки = ОписаниеОборотныхСтрок.Строка3х27.Наименование;
	
	Графа = "04";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х27_Гр04 = ОБ_75_02__80 - ОБ_80__75_02;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х27_Гр04);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("80", СчетаСРеквизитами).Код,
		ОБ_75_02__80, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("75.02"), Счет("80")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("80", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код,
		-ОБ_80__75_02, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("80"), Счет("75.02")));
	
	Графа = "05";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х27_Гр05 = ОБ_75_02__81 - ОБ_81__75_02;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х27_Гр05);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("81", СчетаСРеквизитами).Код,
		ОБ_75_02__81, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("75.02"), Счет("81")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("81", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код,
		-ОБ_81__75_02, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("81"), Счет("75.02")));
	
	Графа = "06";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х27_Гр06 = ОБ_75_02__83_01 - ОБ_83_01__75_02;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х27_Гр06);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		ОБ_75_02__83_01, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("75.02"), Счет("83.01")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код,
		-ОБ_83_01__75_02, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("83.01"), Счет("75.02")));
	
	Графа = "07";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х27_Гр07 = ОБ_75_02__83 - ОБ_75_02__83_01 - ОБ_83__75_02 + ОБ_83_01__75_02;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х27_Гр07);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("83", СчетаСРеквизитами).Код,
		ОБ_75_02__83, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("75.02"), Счет("83")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		-ОБ_75_02__83_01, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("75.02"), Счет("83.01")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("83", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код,
		-ОБ_83__75_02, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("83"), Счет("75.02")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код,
		ОБ_83_01__75_02, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("83.01"), Счет("75.02")));
	
	Графа = "09";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х27_Гр09 = ОБ_75_02__84 - ОБ_84__75_02;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х27_Гр09);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("84", СчетаСРеквизитами).Код,
		ОБ_75_02__84, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("75.02"), Счет("84")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("84", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код,
		-ОБ_84__75_02, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("84"), Счет("75.02")));
	
	#КонецОбласти
	
	#Область Строка3х30
	
	НомерСтроки = ОписаниеОборотныхСтрок.Строка3х30.Номер;
	КодСтроки = ОписаниеОборотныхСтрок.Строка3х30.Код;
	НаименованиеСтроки = ОписаниеОборотныхСтрок.Строка3х30.Наименование;
	
	Графа = "04";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х30_Гр04 = ОБ_75__80 - ОБ_75_02__80 - ОБ_80__75 + ОБ_80__75_02;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х30_Гр04);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("75", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("80", СчетаСРеквизитами).Код,
		ОБ_75__80, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("75"), Счет("80")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("80", СчетаСРеквизитами).Код,
		-ОБ_75_02__80, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("75.02"), Счет("80")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("80", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("75", СчетаСРеквизитами).Код,
		-ОБ_80__75, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("80"), Счет("75")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("80", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код,
		ОБ_80__75_02, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("80"), Счет("75.02")));
	
	Графа = "05";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х30_Гр05 = ОБ_75__81 - ОБ_75_02__81 - ОБ_81__75 + ОБ_81__75_02;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х30_Гр05);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("75", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("81", СчетаСРеквизитами).Код,
		ОБ_75__81, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("75"), Счет("81")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("81", СчетаСРеквизитами).Код,
		-ОБ_75_02__81, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("75.02"), Счет("81")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("81", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("75", СчетаСРеквизитами).Код,
		-ОБ_81__75, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("81"), Счет("75")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("81", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код,
		ОБ_81__75_02, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("81"), Счет("75.02")));
	
	Графа = "06";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х30_Гр06 = ОБ_75__83_01- ОБ_75_02__83_01 - ОБ_83_01__75  + ОБ_83_01__75_02;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х30_Гр06);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("75", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		ОБ_75__83_01, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("75"), Счет("83.01")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		-ОБ_75_02__83_01, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("75.02"), Счет("83.01")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("75", СчетаСРеквизитами).Код,
		-ОБ_83_01__75, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("83.01"), Счет("75")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код,
		ОБ_83_01__75_02, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("83.01"), Счет("75.02")));
	
	Графа = "07";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	ОБ_75_02__83_01_Исключение = ОБ_75_02__83 + ОБ_75__83_01 - ОБ_75_02__83_01;
	ОБ_83_01__75_02_Исключение = ОБ_83_01__75 + ОБ_83__75_02 - ОБ_83_01__75_02;
	
	Строка3х30_Гр07 = ОБ_75__83 - ОБ_75_02__83_01_Исключение
	                  - ОБ_83__75 + ОБ_83_01__75_02_Исключение;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х30_Гр07);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("75", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("83", СчетаСРеквизитами).Код,
		ОБ_75__83, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("75"), Счет("83")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "Исключение оборотов по дебету счета " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код + " и кредиту счета " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		-ОБ_75_02__83_01_Исключение, БезРасшифровки);
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("83", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("75", СчетаСРеквизитами).Код,
		-ОБ_83__75, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("83"), Счет("75")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "Исключение оборотов по дебету счета " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код + " и кредиту счета " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код,
		ОБ_83_01__75_02_Исключение, БезРасшифровки);
	
	Графа = "08";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х30_Гр08 = ОБ_75__82 - ОБ_75_02__82 - ОБ_82__75 + ОБ_82__75_02;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х30_Гр08);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("75", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("82", СчетаСРеквизитами).Код,
		ОБ_75__82, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("75"), Счет("82")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("82", СчетаСРеквизитами).Код,
		-ОБ_75_02__82, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("75.02"), Счет("82")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("82", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("75", СчетаСРеквизитами).Код,
		-ОБ_82__75, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("82"), Счет("75")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("82", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код,
		ОБ_82__75_02, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("82"), Счет("75.02")));
	
	Графа = "09";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х30_Гр09 = ОБ_75__84 - ОБ_75_02__84 - ОБ_84__75 + ОБ_84__75_02;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х30_Гр09);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("75", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("84", СчетаСРеквизитами).Код,
		ОБ_75__84, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("75"), Счет("84")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("84", СчетаСРеквизитами).Код,
		-ОБ_75_02__84, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("75.02"), Счет("84")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ОБ " + СчетСРеквизитами("84", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("75", СчетаСРеквизитами).Код,
		-ОБ_84__75, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("84"), Счет("75")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ОБ " + СчетСРеквизитами("84", СчетаСРеквизитами).Код + " " + СчетСРеквизитами("75.02", СчетаСРеквизитами).Код,
		ОБ_84__75_02, НастройкиАнализаСчета(ПараметрыОтчетовРасшифровки, Счет("84"), Счет("75.02")));
	
	#КонецОбласти
	
	#Область Строка3х40
	
	НомерСтроки = ОписаниеОборотныхСтрок.Строка3х40.Номер;
	НаименованиеСтроки = ОписаниеОборотныхСтрок.Строка3х40.Наименование;
	
	Графа = "04";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х40_Гр04 = КО_80 - ДО_80 - Строка3х11_Гр04 - Строка3х27_Гр04 - Строка3х30_Гр04;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х40_Гр04);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!КО " + СчетСРеквизитами("80", СчетаСРеквизитами).Код,
		КО_80, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("80")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ДО " + СчетСРеквизитами("80", СчетаСРеквизитами).Код,
		-ДО_80, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("80")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", СтрШаблон("Значение показателя ""%2"" (%1) - в этой же графе",
		ОписаниеОборотныхСтрок.Строка3х11.Номер, ОписаниеОборотныхСтрок.Строка3х11.Наименование),
		-Строка3х11_Гр04, БезРасшифровки);
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", СтрШаблон("Значение показателя ""%2"" (%1) - в этой же графе",
		ОписаниеОборотныхСтрок.Строка3х27.Номер, ОписаниеОборотныхСтрок.Строка3х27.Наименование),
		-Строка3х27_Гр04, БезРасшифровки);
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", СтрШаблон("Значение показателя ""%2"" (%1) - в этой же графе",
		ОписаниеОборотныхСтрок.Строка3х30.Номер, ОписаниеОборотныхСтрок.Строка3х30.Наименование),
		-Строка3х30_Гр04, БезРасшифровки);
	
	Графа = "05";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х40_Гр05 = КО_81 - ДО_81 - Строка3х11_Гр05 - Строка3х27_Гр05 - Строка3х30_Гр05;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х40_Гр05);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!КО " + СчетСРеквизитами("81", СчетаСРеквизитами).Код,
		КО_81, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("81")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ДО " + СчетСРеквизитами("81", СчетаСРеквизитами).Код,
		-ДО_81, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("81")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", СтрШаблон("Значение показателя ""%2"" (%1) - в этой же графе",
		ОписаниеОборотныхСтрок.Строка3х11.Номер, ОписаниеОборотныхСтрок.Строка3х11.Наименование),
		-Строка3х11_Гр05, БезРасшифровки);
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", СтрШаблон("Значение показателя ""%2"" (%1) - в этой же графе",
		ОписаниеОборотныхСтрок.Строка3х27.Номер, ОписаниеОборотныхСтрок.Строка3х27.Наименование),
		-Строка3х27_Гр05, БезРасшифровки);
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", СтрШаблон("Значение показателя ""%2"" (%1) - в этой же графе",
		ОписаниеОборотныхСтрок.Строка3х30.Номер, ОписаниеОборотныхСтрок.Строка3х30.Наименование),
		-Строка3х30_Гр05, БезРасшифровки);
	
	Графа = "06";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х40_Гр06 = КО_83_01 - ДО_83_01 - Строка3х11_Гр06 - Строка3х12_Гр06 - Строка3х27_Гр06 - Строка3х30_Гр06;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х40_Гр06);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!КО " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		КО_83_01, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("83.01")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ДО " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		-ДО_83_01, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("83.01")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", СтрШаблон("Значение показателя ""%2"" (%1) - в этой же графе",
		ОписаниеОборотныхСтрок.Строка3х11.Номер, ОписаниеОборотныхСтрок.Строка3х11.Наименование),
		-Строка3х11_Гр06, БезРасшифровки);
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", СтрШаблон("Значение показателя ""%2"" (%1) - в этой же графе",
		ОписаниеОборотныхСтрок.Строка3х12.Номер, ОписаниеОборотныхСтрок.Строка3х12.Наименование),
		-Строка3х12_Гр06, БезРасшифровки);
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", СтрШаблон("Значение показателя ""%2"" (%1) - в этой же графе",
		ОписаниеОборотныхСтрок.Строка3х27.Номер, ОписаниеОборотныхСтрок.Строка3х27.Наименование),
		-Строка3х27_Гр06, БезРасшифровки);
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", СтрШаблон("Значение показателя ""%2"" (%1) - в этой же графе",
		ОписаниеОборотныхСтрок.Строка3х30.Номер, ОписаниеОборотныхСтрок.Строка3х30.Наименование),
		-Строка3х30_Гр06, БезРасшифровки);
	
	Графа = "07";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х40_Гр07 = КО_83 - ДО_83 - КО_83_01 + ДО_83_01
	                  - Строка3х11_Гр07 - Строка3х27_Гр07 - Строка3х30_Гр07;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х40_Гр07);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!КО " + СчетСРеквизитами("83", СчетаСРеквизитами).Код,
		КО_83, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("83")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ДО " + СчетСРеквизитами("83", СчетаСРеквизитами).Код,
		-ДО_83, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("83")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!КО " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		-КО_83_01, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("83.01")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!ДО " + СчетСРеквизитами("83.01", СчетаСРеквизитами).Код,
		ДО_83_01, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("83.01")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", СтрШаблон("Значение показателя ""%2"" (%1) - в этой же графе",
		ОписаниеОборотныхСтрок.Строка3х11.Номер, ОписаниеОборотныхСтрок.Строка3х11.Наименование),
		-Строка3х11_Гр07, БезРасшифровки);
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", СтрШаблон("Значение показателя ""%2"" (%1) - в этой же графе",
		ОписаниеОборотныхСтрок.Строка3х27.Номер, ОписаниеОборотныхСтрок.Строка3х27.Наименование),
		-Строка3х27_Гр07, БезРасшифровки);
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", СтрШаблон("Значение показателя ""%2"" (%1) - в этой же графе",
		ОписаниеОборотныхСтрок.Строка3х30.Номер, ОписаниеОборотныхСтрок.Строка3х30.Наименование),
		-Строка3х30_Гр07, БезРасшифровки);
	
	Графа = "08";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х40_Гр08 = КО_82 - ДО_82 - Строка3х11_Гр08 - Строка3х30_Гр08;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х40_Гр08);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!КО " + СчетСРеквизитами("82", СчетаСРеквизитами).Код,
		КО_82, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("82")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ДО " + СчетСРеквизитами("82", СчетаСРеквизитами).Код,
		-ДО_82, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("82")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", СтрШаблон("Значение показателя ""%2"" (%1) - в этой же графе",
		ОписаниеОборотныхСтрок.Строка3х11.Номер, ОписаниеОборотныхСтрок.Строка3х11.Наименование),
		-Строка3х11_Гр08, БезРасшифровки);
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", СтрШаблон("Значение показателя ""%2"" (%1) - в этой же графе",
		ОписаниеОборотныхСтрок.Строка3х30.Номер, ОписаниеОборотныхСтрок.Строка3х30.Наименование),
		-Строка3х30_Гр08, БезРасшифровки);
	
	Графа = "09";
	ИмяПоказателя = "П000010" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = СтрШаблон("Строка %1 ""%2"", графа ""%3""",
		НомерСтроки, НаименованиеСтроки, ЗаголовкиГраф[Графа]);
	
	Строка3х40_Гр09 = КО_84 - ДО_84 + СКК_99 - СКД_99
	                  - Строка3х11_Гр09 - Строка3х27_Гр09 - Строка3х30_Гр09;
	
	УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, Строка3х40_Гр09);
	
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!КО " + СчетСРеквизитами("84", СчетаСРеквизитами).Код,
		КО_84, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("84")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!ДО " + СчетСРеквизитами("84", СчетаСРеквизитами).Код,
		-ДО_84, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("84")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"+", "!СКК " + СчетСРеквизитами("99", СчетаСРеквизитами).Код,
		СКК_99, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("99")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", "!СКД " + СчетСРеквизитами("99", СчетаСРеквизитами).Код,
		-СКД_99, НастройкиОСВПоСчету(ПараметрыОтчетовРасшифровки, Счет("99")));
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", СтрШаблон("Значение показателя ""%2"" (%1) - в этой же графе",
		ОписаниеОборотныхСтрок.Строка3х11.Номер, ОписаниеОборотныхСтрок.Строка3х11.Наименование),
		-Строка3х11_Гр09, БезРасшифровки);
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", СтрШаблон("Значение показателя ""%2"" (%1) - в этой же графе",
		ОписаниеОборотныхСтрок.Строка3х27.Номер, ОписаниеОборотныхСтрок.Строка3х27.Наименование),
		-Строка3х27_Гр09, БезРасшифровки);
	ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, ЗаголовокРасшифровки,
		"-", СтрШаблон("Значение показателя ""%2"" (%1) - в этой же графе",
		ОписаниеОборотныхСтрок.Строка3х30.Номер, ОписаниеОборотныхСтрок.Строка3х30.Наименование),
		-Строка3х30_Гр09, БезРасшифровки);
	
	#КонецОбласти
	
КонецПроцедуры

Функция НовыеПараметрыЗаполненияОИК()
	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("Контейнер", Новый ДеревоЗначений);
	
	ПараметрыЗаполнения.Вставить("НачалоОтчетногоПериода", '0001-01-01');
	ПараметрыЗаполнения.Вставить("КонецОтчетногоПериода", '0001-01-01');
	
	СчетаСРеквизитами = Новый ТаблицаЗначений;
	СчетаСРеквизитами.Колонки.Добавить("УсловныйКод", Новый ОписаниеТипов("Строка"));
	СчетаСРеквизитами.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	СчетаСРеквизитами.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка"));
	СчетаСРеквизитами.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	ПараметрыЗаполнения.Вставить("СчетаСРеквизитами", СчетаСРеквизитами);
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

Функция Составляющая(ОписаниеСоставляющей, ДопПараметры = Неопределено)
	
	Составляющая = Новый Массив(2);
	Составляющая[0] = ОписаниеСоставляющей;
	Составляющая[1] = ДопПараметры;
	
	Возврат Составляющая;
	
КонецФункции

Функция ПараметрыСчетов_Баланс2025Кв1()
	
	ПараметрыСчетов = Новый Соответствие;
	
	ПараметрыСчета = Новый Структура;
	ПараметрыСчета.Вставить("ШаблонОписания", "/по договорам с признаком отражения в балансе ""%2""/");
	ПараметрыСчета.Вставить("ОтборПоАналитике", "Субконто2.ВидАктива");
	
	ПараметрыСчетов.Вставить("60.02", ПараметрыСчета);
	ПараметрыСчетов.Вставить("60.22", ПараметрыСчета);
	ПараметрыСчетов.Вставить("60.32", ПараметрыСчета);
	
	ПараметрыСчета = Новый Структура;
	ПараметрыСчета.Вставить("ШаблонОписания", "/по договорам с признаком отражения в балансе ""%2""/");
	
	ПараметрыСчетов.Вставить("76.ВА", ПараметрыСчета);
	
	ПараметрыСчета = Новый Структура;
	ПараметрыСчета.Вставить("ШаблонОписания", "по расходам будущих периодов с видом актива в балансе ""%2""");
	ПараметрыСчета.Вставить("ОтборПоАналитике", "Субконто1.ВидАктива");
	
	ПараметрыСчетов.Вставить("97", ПараметрыСчета);
	
	ПараметрыСчета = Новый Структура;
	ПараметрыСчета.Вставить("ШаблонОписания", "по расходам будущих периодов с видом актива в балансе ""%2""");
	ПараметрыСчета.Вставить("ОтборПоАналитике", "Субконто2.ВидАктива");
	
	ПараметрыСчетов.Вставить("76.01.2", ПараметрыСчета);
	ПараметрыСчетов.Вставить("76.01.9", ПараметрыСчета);
	
	Возврат ПараметрыСчетов;
	
КонецФункции

Функция ТекстыРасшифровкиПоказателейАренды(ПараметрыЗаполнения)
	
	Разделитель = ", ";
	СчетаСРеквизитами = ПараметрыЗаполнения.СчетаСРеквизитами;
	
	Счет_76_ВА = СчетСРеквизитами("76.ВА", СчетаСРеквизитами).Код;
	
	// Счета, используемые при расчете обязательства по аренде (лизингу)
	СчетаАренды = Новый Массив;
	СчетаАренды.Добавить(СчетСРеквизитами("76.07", СчетаСРеквизитами).Код);
	Если ПараметрыЗаполнения.ИспользуетсяВалютныйУчет Тогда
		СчетаАренды.Добавить(СчетСРеквизитами("76.27", СчетаСРеквизитами).Код);
		СчетаАренды.Добавить(СчетСРеквизитами("76.37", СчетаСРеквизитами).Код);
	КонецЕсли;
	СчетаАренды.Добавить(Счет_76_ВА);
	
	СчетаАрендыСтрокой = ОбщегоНазначенияБПКлиентСервер.ПредставлениеСписка(СчетаАренды, Разделитель);
	
	// Текст расшифровки показателя счета 76.ВА по договорам аренды (лизинга)
	ШаблонНДС = НСтр("ru = 'Сальдо на конец периода по кредиту счета %1 по договорам аренды (лизинга)'");
	Если ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов Тогда
		ШаблонНДС = НСтр("ru = 'Сальдо на конец периода по кредиту счета %1 по договорам аренды (лизинга), с признаком отражения в балансе не отнесенным к ""Основным средствам"", ""Инвестиционной недвижимости"", ""Нематериальным активам"", ""Прочим внеоборотным активам"", ""Запасам"" или ""Прочим оборотным активам""'");
	КонецЕсли;
	ТекстНДС = СтрШаблон(ШаблонНДС, Счет_76_ВА);
	
	Тексты = Новый Соответствие;
	Тексты.Вставить("СК_РасчетыПоАрендеНДСсПлатежей",
					ТекстНДС);
	Тексты.Вставить("СК_РасчетыПоАрендеАвансы", 
					СтрШаблон(НСтр("ru = 'Авансы по аренде (лизингу) - по данным счетов %1'"), СчетаАрендыСтрокой));
	Тексты.Вставить("СК_РасчетыПоАрендеДолгосрочное", 
					СтрШаблон(НСтр("ru = 'Долгосрочная часть обязательства по аренде (лизингу) - по данным счетов %1'"), СчетаАрендыСтрокой));
	Тексты.Вставить("СК_РасчетыПоАрендеКраткосрочное", 
					СтрШаблон(НСтр("ru = 'Краткосрочная часть обязательства по аренде (лизингу) - по данным счетов %1'"), СчетаАрендыСтрокой));
	
	Возврат Тексты;

КонецФункции

Функция БухгалтерскиеИтоги_Баланс2025Кв1(Организация, КонецПериодаОтчета, ИтогиПоСчетам, КлассифицироватьАктивыОбязательстваПоСрокам = Ложь)
	
	СальдоИОборотыПоСчетам = ИтогиПоСчетам.СальдоИОборотыПоСчетам;
	АвансыПоВидамАктивов   = ИтогиПоСчетам.АвансыПоВидамАктивов;
	
	РассчитанныеЗначения = Новый Соответствие;
	
	РассчитанныеЗначения.Вставить("СальдоИОборотыПоСчетам", ИтогиПоСчетам.СальдоИОборотыПоСчетам);
	РассчитанныеЗначения.Вставить("СиО_КонтрагентыДоговоры", ИтогиПоСчетам.СиО_КонтрагентыДоговоры);
	РассчитанныеЗначения.Вставить("СиО_Контрагенты", ИтогиПоСчетам.СиО_Контрагенты);
	РассчитанныеЗначения.Вставить("СиО_ВидыПлатежейУровниБюджетов", ИтогиПоСчетам.СиО_ВидыПлатежейУровниБюджетов);
	РассчитанныеЗначения.Вставить("СиО_ВидыПлатежей", ИтогиПоСчетам.СиО_ВидыПлатежей);
	РассчитанныеЗначения.Вставить("СиО_Работники", ИтогиПоСчетам.СиО_Работники);
	РассчитанныеЗначения.Вставить("СиО_Резервы", ИтогиПоСчетам.СиО_Резервы);
	
	РазделенноеСальдоСчета_02_01 = ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_02_01(КонецПериодаОтчета, Организация);
	РассчитанныеЗначения.Вставить("СКК_02_01__01_01", РазделенноеСальдоСчета_02_01.СКК_02_01__01_01); // Амортизация ОС, учитываемых на счете 01.01
	РассчитанныеЗначения.Вставить("СКК_02_01__01_08", РазделенноеСальдоСчета_02_01.СКК_02_01__01_08); // Амортизация ОС, учитываемых на счете 01.08
	
	РазделенноеСальдоСчета_02_02 = ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_02_02(КонецПериодаОтчета, Организация);
	РассчитанныеЗначения.Вставить("СКК_02_02__03_01", РазделенноеСальдоСчета_02_02.СКК_02_02__03_01); // Амортизация ОС, учитываемых на счете 03.01
	РассчитанныеЗначения.Вставить("СКК_02_02__03_02", РазделенноеСальдоСчета_02_02.СКК_02_02__03_02); // Амортизация ОС, учитываемых на счете 03.02
	РассчитанныеЗначения.Вставить("СКК_02_02__03_03", РазделенноеСальдоСчета_02_02.СКК_02_02__03_03); // Амортизация ОС, учитываемых на счете 03.03
	РассчитанныеЗначения.Вставить("СКК_02_02__03_04", РазделенноеСальдоСчета_02_02.СКК_02_02__03_04); // Амортизация ОС, учитываемых на счете 03.04
	
	РазделенноеСальдоСчета_02_04 = ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_02_04(КонецПериодаОтчета, Организация);
	РассчитанныеЗначения.Вставить("СКК_02_04__01_01", РазделенноеСальдоСчета_02_04.СКК_02_04__01_01); // По ОС, учитываемым на счете 01.01
	РассчитанныеЗначения.Вставить("СКК_02_04__01_08", РазделенноеСальдоСчета_02_04.СКК_02_04__01_08); // По ОС, учитываемым на счете 01.08
	
	РазделенноеСальдоСчета_59 = РазделенноеСальдоСчета_59(КонецПериодаОтчета, Организация);
	Для Каждого СтрокаСальдо Из РазделенноеСальдоСчета_59 Цикл
		РассчитанныеЗначения.Вставить("СКК_59__" + СтрокаСальдо.ВспомогательныйКод, СтрокаСальдо.Резерв);
	КонецЦикла;
	
	СК_РасчетыПоАренде = ЗаполнениеБухгалтерскойОтчетностиИтоги.НовыйРасчетыПоАренде();
	Если Не КлассифицироватьАктивыОбязательстваПоСрокам Тогда
		ЗаполнениеБухгалтерскойОтчетностиИтоги.РассчитатьПоказателиСчетовУчетаРасчетыПоАренде(СК_РасчетыПоАренде, КонецПериодаОтчета, Организация);
	КонецЕсли;
	РассчитанныеЗначения.Вставить("СК_РасчетыПоАренде", СК_РасчетыПоАренде);
	
	СКД_ПоВидуАктива_60_02        = Новый Соответствие();
	СКК_ПоВидуАктива_63__60_02    = Новый Соответствие();
	СКК_ПоВидуАктива_76_ВА__60_02 = Новый Соответствие();
	
	СКД_ПоВидуАктива_60_22        = Новый Соответствие();
	СКК_ПоВидуАктива_63__60_22    = Новый Соответствие();
	СКК_ПоВидуАктива_76_ВА__60_22 = Новый Соответствие();
	
	СКД_ПоВидуАктива_60_32        = Новый Соответствие();
	СКК_ПоВидуАктива_63__60_32    = Новый Соответствие();
	СКК_ПоВидуАктива_76_ВА__60_32 = Новый Соответствие();
	
	// Сальдо резервов по сомнительным долгам для отражения в паре с счетом 62.
	// Формируется путем вычета всех сомнительных долгов по контрагентам и договорам на субсчетах счета 60.
	СКК_СВычетами_63 = СКК("63", СальдоИОборотыПоСчетам);
	
	СКК_СВычетами_76_ВА = СКК("76.ВА", СальдоИОборотыПоСчетам);

	// НДС с авансовых арендных платежей учитывается при расчете авансов и обязательств по аренде.
	// Поэтому общий остаток по счету 76.ВА уменьшается на соответствующую сумму.
	СКК_СВычетами_76_ВА = СКК_СВычетами_76_ВА - СК_РасчетыПоАренде.НДСсПлатежей;

	Для Каждого СтрокаЗначений Из АвансыПоВидамАктивов.СтруктураСКД_60_02 Цикл
		СКД_ПоВидуАктива_60_02.Вставить(СтрокаЗначений.ВидАктива, СтрокаЗначений.СуммаКонечныйОстатокДт);
		СКК_ПоВидуАктива_63__60_02.Вставить(СтрокаЗначений.ВидАктива, СтрокаЗначений.СуммаОстатокКтРезервы);
		СКК_ПоВидуАктива_76_ВА__60_02.Вставить(СтрокаЗначений.ВидАктива, СтрокаЗначений.СуммаОстатокКтНДСАвансов);
		СКК_СВычетами_63 = СКК_СВычетами_63 - СтрокаЗначений.СуммаОстатокКтРезервы;
		СКК_СВычетами_76_ВА = СКК_СВычетами_76_ВА - СтрокаЗначений.СуммаОстатокКтНДСАвансов;
	КонецЦикла;
	
	Для Каждого СтрокаЗначений Из АвансыПоВидамАктивов.СтруктураСКД_60_22 Цикл
		СКД_ПоВидуАктива_60_22.Вставить(СтрокаЗначений.ВидАктива, СтрокаЗначений.СуммаКонечныйОстатокДт);
		СКК_ПоВидуАктива_63__60_22.Вставить(СтрокаЗначений.ВидАктива, СтрокаЗначений.СуммаОстатокКтРезервы);
		СКК_ПоВидуАктива_76_ВА__60_22.Вставить(СтрокаЗначений.ВидАктива, СтрокаЗначений.СуммаОстатокКтНДСАвансов);
		СКК_СВычетами_63 = СКК_СВычетами_63 - СтрокаЗначений.СуммаОстатокКтРезервы;
		СКК_СВычетами_76_ВА = СКК_СВычетами_76_ВА - СтрокаЗначений.СуммаОстатокКтНДСАвансов;
	КонецЦикла;
	
	Для Каждого СтрокаЗначений Из АвансыПоВидамАктивов.СтруктураСКД_60_32 Цикл
		СКД_ПоВидуАктива_60_32.Вставить(СтрокаЗначений.ВидАктива, СтрокаЗначений.СуммаКонечныйОстатокДт);
		СКК_ПоВидуАктива_63__60_32.Вставить(СтрокаЗначений.ВидАктива, СтрокаЗначений.СуммаОстатокКтРезервы);
		СКК_ПоВидуАктива_76_ВА__60_32.Вставить(СтрокаЗначений.ВидАктива, СтрокаЗначений.СуммаОстатокКтНДСАвансов);
		СКК_СВычетами_63 = СКК_СВычетами_63 - СтрокаЗначений.СуммаОстатокКтРезервы;
		СКК_СВычетами_76_ВА = СКК_СВычетами_76_ВА - СтрокаЗначений.СуммаОстатокКтНДСАвансов;
	КонецЦикла;
	
	РассчитанныеЗначения.Вставить("СКД_ПоВидуАктива_60_02",        СКД_ПоВидуАктива_60_02);
	РассчитанныеЗначения.Вставить("СКК_ПоВидуАктива_63__60_02",    СКК_ПоВидуАктива_63__60_02);
	РассчитанныеЗначения.Вставить("СКК_ПоВидуАктива_76_ВА__60_02", СКК_ПоВидуАктива_76_ВА__60_02);
	
	РассчитанныеЗначения.Вставить("СКД_ПоВидуАктива_60_22",        СКД_ПоВидуАктива_60_22);
	РассчитанныеЗначения.Вставить("СКК_ПоВидуАктива_63__60_22",    СКК_ПоВидуАктива_63__60_22);
	РассчитанныеЗначения.Вставить("СКК_ПоВидуАктива_76_ВА__60_22", СКК_ПоВидуАктива_76_ВА__60_22);
	
	РассчитанныеЗначения.Вставить("СКД_ПоВидуАктива_60_32",        СКД_ПоВидуАктива_60_32);
	РассчитанныеЗначения.Вставить("СКК_ПоВидуАктива_63__60_32",    СКК_ПоВидуАктива_63__60_32);
	РассчитанныеЗначения.Вставить("СКК_ПоВидуАктива_76_ВА__60_32", СКК_ПоВидуАктива_76_ВА__60_32);
	
	РассчитанныеЗначения.Вставить("СКК_СВычетами_63", СКК_СВычетами_63);
	РассчитанныеЗначения.Вставить("СКК_СВычетами_76_ВА", СКК_СВычетами_76_ВА);
	
	РассчитанныеЗначения.Вставить("СКД_ПоВидуАктива_97",
		ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_97(КонецПериодаОтчета, Организация));
	РассчитанныеЗначения.Вставить("СКД_ПоВидуАктива_76_01_2",
		ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_76(Счет("76.01.2"), КонецПериодаОтчета, Организация));
	РассчитанныеЗначения.Вставить("СКД_ПоВидуАктива_76_01_9",
		ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_76(Счет("76.01.9"), КонецПериодаОтчета, Организация));
	
	Возврат РассчитанныеЗначения;
	
КонецФункции

Процедура УстановитьЗначениеОсновногоПоказателя(КонтейнерРаздела, ИмяПоказателя, ЗначениеПоказателя)
	
	СтрокаПоказателя = ОсновнойПоказательРаздела(КонтейнерРаздела, ИмяПоказателя);
	СтрокаПоказателя.Данные = СтрокаПоказателя.Данные + ЗначениеПоказателя;
	
КонецПроцедуры

Процедура ДобавитьРасшифровкуОсновногоПоказателя(ПараметрыРасшифровки, ИмяПоказателя, НаименованиеПоказателя,
	ЗнакОперации, НаименованиеСлагаемого, Сумма, ДополнительныеПараметры)
	
	ИмяРаздела       = ПараметрыРасшифровки.ИмяРаздела;
	КонтейнерРаздела = ПараметрыРасшифровки.КонтейнерРаздела;
	Организация      = ПараметрыРасшифровки.Организация;
	
	ПараметрыСтрокиРасшифровки = Новый Структура;
	ПараметрыСтрокиРасшифровки.Вставить("НаименованиеПоказателя", НаименованиеПоказателя);
	ПараметрыСтрокиРасшифровки.Вставить("ЗнакОперации", ЗнакОперации);
	ПараметрыСтрокиРасшифровки.Вставить("НаименованиеСлагаемого", НаименованиеСлагаемого);
	ПараметрыСтрокиРасшифровки.Вставить("Сумма", Сумма);
	ПараметрыСтрокиРасшифровки.Вставить("ИмяРаздела", ИмяРаздела);
	ПараметрыСтрокиРасшифровки.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	ПараметрыСтрокиРасшифровки.Вставить("Организация", Организация);
	
	СтрокаПоказателя = ОсновнойПоказательРаздела(КонтейнерРаздела, ИмяПоказателя);
	
	СтрокаРасшифровки = СтрокаПоказателя.Строки.Добавить();
	СтрокаРасшифровки.Тип = "Расшифровка";
	СтрокаРасшифровки.Идентификатор = "";
	СтрокаРасшифровки.Данные = ПараметрыСтрокиРасшифровки;
	
Конецпроцедуры

Функция ОсновнойПоказательРаздела(КонтейнерРаздела, ИмяПоказателя)
	
	ПараметрыПоискаПоказателя = Новый Структура("Тип, Идентификатор", "Показатель", ИмяПоказателя);
	СтрокиПоказателей = КонтейнерРаздела.Строки.НайтиСтроки(ПараметрыПоискаПоказателя);
	Возврат СтрокиПоказателей[0];
	
КонецФункции

#Область ПроцессорПоказателя
// Назначение процессора - устранить избыточность кода.
// Задачи процессора:
//   - изменение значения показателя;
//   - формирование записи в расшифровке;
//   - присваивание итогового значения.

// Конструктор процессора показателя.
//
// Возвращаемое значение:
//   Структура:
//     * СчетаСРеквизитами - ТаблицаЗначений
//     * ПараметрыСчетов - Соответствие из Произвольный
//     * ТекстыРасшифровки - Соответствие из Произвольный
//     * РассчитанныеЗначения - Соответствие из Произвольный
//     * ИмяРаздела - Строка
//     * Организация - СправочникСсылка.Организации
//     * НачалоПериода - Дата
//                     - МоментВремениСУточнениемПериода
//     * КонецПериода - Дата
//                    - МоментВремениСУточнениемПериода
//     * Показатель - Структура:
//         ** КодПоказателя - Строка
//         ** НаименованиеПоказателя - Строка
//         ** ЗначениеПоказателя - Число
//         ** Расшифровка - Массив из Структура
//
Функция НовыйПроцессорПоказателя() Экспорт
	
	ПроцессорПоказателя = Новый Структура;
	
	// Общие параметры.
	ПроцессорПоказателя.Вставить("СчетаСРеквизитами", Новый ТаблицаЗначений);
	ПроцессорПоказателя.Вставить("ПараметрыСчетов", Новый Соответствие);
	ПроцессорПоказателя.Вставить("ТекстыРасшифровки", Новый Соответствие);
	ПроцессорПоказателя.Вставить("РассчитанныеЗначения", Новый Соответствие);
	ПроцессорПоказателя.Вставить("ИмяРаздела", "");
	ПроцессорПоказателя.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	ПроцессорПоказателя.Вставить("НачалоПериода", '0001-01-01');
	ПроцессорПоказателя.Вставить("КонецПериода", '0001-01-01');
	
	// Параметры показателя.
	Показатель = Новый Структура;
	ПроцессорПоказателя.Вставить("Показатель", Показатель);
	
	Показатель.Вставить("КодПоказателя", "");
	Показатель.Вставить("НаименованиеПоказателя", "");
	Показатель.Вставить("ЗначениеПоказателя", 0);
	Показатель.Вставить("Расшифровка", Новый Массив);
	
	Возврат ПроцессорПоказателя;
	
КонецФункции

// Возвращает неинициализированные параметры для вывода расшифровки при отражении составляющей по значению.
// 
// Возвращаемое значение:
//   Структура:
//     * ТокенЗнака - Строка - принимает значение "+" или "-"
//     * ОписаниеРасшифровки - Строка
//     * НастройкаОтчетаРасшифровки - Произвольный
//
Функция НовыеПараметрыРасшифровки() Экспорт
	
	ПараметрыРасшифровки = Новый Структура;
	
	ПараметрыРасшифровки.Вставить("ТокенЗнака", "");
	ПараметрыРасшифровки.Вставить("ОписаниеРасшифровки", "");
	ПараметрыРасшифровки.Вставить("НастройкаОтчетаРасшифровки");
	
	Возврат ПараметрыРасшифровки;
	
КонецФункции

// Вносит изменения в итоговое значение показателя и формирует запись в расшифровке алгоритма по описанию алгоритма
// (оба - в ПроцессорПоказателя.Показатель).
//
// Параметры:
//   ПроцессорПоказателя - Структура - описание параметра см. НовыйПроцессорПоказателя.
//   ОписаниеСоставляющей - Строка - символьное выражение, описывающее порядок отражения составляющей в итоговом показателе.
//   ДопПараметры - Произвольный - допольнительные параметры, требующиеся для отражения составляющей.
//
Процедура УчестьСоставляющую(ПроцессорПоказателя, ОписаниеСоставляющей, ДопПараметры = Неопределено) Экспорт
	
	СчетаСРеквизитами = ПроцессорПоказателя.СчетаСРеквизитами;
	
	СальдоИОборотыПоСчетам = ПроцессорПоказателя.РассчитанныеЗначения["СальдоИОборотыПоСчетам"];
	ОборотыМеждуСчетами    = ПроцессорПоказателя.РассчитанныеЗначения["ОборотыМеждуСчетами"];
	
	СиО_КонтрагентыДоговоры        = ПроцессорПоказателя.РассчитанныеЗначения["СиО_КонтрагентыДоговоры"];
	СиО_Контрагенты                = ПроцессорПоказателя.РассчитанныеЗначения["СиО_Контрагенты"];
	СиО_ВидыПлатежейУровниБюджетов = ПроцессорПоказателя.РассчитанныеЗначения["СиО_ВидыПлатежейУровниБюджетов"];
	СиО_ВидыПлатежей               = ПроцессорПоказателя.РассчитанныеЗначения["СиО_ВидыПлатежей"];
	СиО_Работники                  = ПроцессорПоказателя.РассчитанныеЗначения["СиО_Работники"];
	СиО_Резервы                    = ПроцессорПоказателя.РассчитанныеЗначения["СиО_Резервы"];
	СК_РасчетыПоАренде             = ПроцессорПоказателя.РассчитанныеЗначения["СК_РасчетыПоАренде"];
	
	ТекстыРасшифровки = ПроцессорПоказателя.ТекстыРасшифровки;
	
	ПараметрыРасшифровки = Новый Структура;
	ПараметрыРасшифровки.Вставить("Организация",   ПроцессорПоказателя.Организация);
	ПараметрыРасшифровки.Вставить("НачалоПериода", ПроцессорПоказателя.НачалоПериода);
	ПараметрыРасшифровки.Вставить("КонецПериода",  ПроцессорПоказателя.КонецПериода);
	
	БезРасшифровки = Новый Структура("Организация", ПроцессорПоказателя.Организация);
	
	Составляющая = СтрЗаменить(ОписаниеСоставляющей, " ", "");
	ТокенЗнака = Лев(Составляющая, 1);
	Множитель = 1;
	Если ТокенЗнака = "-" Тогда
		Множитель = -1;
	КонецЕсли;
	Составляющая = Сред(Составляющая, 2);
	
	Если СтрНачинаетсяС(Составляющая, "ККЗ_РасчетыПоАренде")
		Или СтрНачинаетсяС(Составляющая, "ДКЗ_РасчетыПоАренде") Тогда
		
		Счет = ДопПараметры.СчетРасчетов;
		ЗначениеСоставляющей = ДопПараметры.Значение;
		
		ШаблонРасшифровкиПоказателя = ДопПараметры.ТекстРасшифровки;
	
		НастройкаОтчетаРасшифровки = НастройкиРасшифровкиПоказателейБалансаПоАренде(ПараметрыРасшифровки);

	ИначеЕсли СтрНачинаетсяС(Составляющая, "Задолженность_КД")
		Или СтрНачинаетсяС(Составляющая, "Задолженность_ДД")
		Или СтрНачинаетсяС(Составляющая, "Задолженность_КК")
		Или СтрНачинаетсяС(Составляющая, "Задолженность_ДК") Тогда
		
		Если ДопПараметры.Свойство("ПустаяРасшифровка") И ДопПараметры.ПустаяРасшифровка Тогда
			ЗначениеСоставляющей = 0;
			НастройкаОтчетаРасшифровки = Неопределено;
		Иначе
			Счет = ДопПараметры.СчетРасчетов;
			ЗначениеСоставляющей = ДопПараметры.Значение;
			
			ШаблонРасшифровкиПоказателя = ДопПараметры.ТекстРасшифровки;
			
			Если ДопПараметры.Тип = "РБП" Или ДопПараметры.Тип = "НМА" Тогда
				Отборы = Новый Соответствие;
				Равно = Новый Структура("ВидСравненияКомпоновкиДанных, Значение",
					ВидСравненияКомпоновкиДанных.Равно,
					Счет);
				Отборы.Вставить("Счет", Равно);

				ИмяОтчета = "Отчет.СправкаРасчетКлассификацияПоСрокамРасходовБудущихПериодов.ФормаОбъекта";
				НастройкаОтчетаРасшифровки = ЗаполнениеБухгалтерскойОтчетности.НастройкиРасшифровкиСправкиРасчетаКлассификацииЗадолженности(ПараметрыРасшифровки, ИмяОтчета, Отборы);
			ИначеЕсли ДопПараметры.Тип = "Аренда" Тогда
				НастройкаОтчетаРасшифровки = НастройкиРасшифровкиПоказателейБалансаПоАренде(ПараметрыРасшифровки);
			// Для остаточных величин не выводим отчет расшифровки.
			// При отборе по счетам остаточные резервы рассчитываются неверно.
			ИначеЕсли ДопПараметры.Тип = "ОстаточныйРезерв" Или ДопПараметры.Тип = "ОстаточныйНДСАвансов" Или ДопПараметры.Тип = "ОстаточныйПроценты" Тогда
				НастройкаОтчетаРасшифровки = Неопределено;
			Иначе
				Отборы = Новый Соответствие;
				Равно = Новый Структура("ВидСравненияКомпоновкиДанных, Значение",
					ВидСравненияКомпоновкиДанных.Равно,
					Счет);
				Отборы.Вставить("СчетРасчетов", Равно);
				ИмяОтчета = "Отчет.СправкаРасчетКлассификацияПоСрокамЗадолженности.ФормаОбъекта";
				НастройкаОтчетаРасшифровки = ЗаполнениеБухгалтерскойОтчетности.НастройкиРасшифровкиСправкиРасчетаКлассификацииЗадолженности(ПараметрыРасшифровки, ИмяОтчета, Отборы);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СКД_АвансыДебЗад") Тогда
		ТокенОстатка = "СКД_ПоВидуАктива"; // сведения подготовлены в единой таблице с заполненными видами актива
		ТокенСчета = Сред(Составляющая, 17);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ИмяЗначения = ТокенОстатка + "_" + СтрЗаменить(ТокенСчета, ".", "_");
		ЗначениеСоставляющей = ПроцессорПоказателя.РассчитанныеЗначения[ИмяЗначения][ДопПараметры];
		
		ШаблонРасшифровкиПоказателя = СтрШаблон("Сальдо на конец периода по дебету счета %1 по договорам, с признаком отражения в балансе не отнесенным к ""Основным средствам"", ""Инвестиционной недвижимости"", ""Нематериальным активам"", ""Прочим внеоборотным активам"", ""Запасам"" или ""Прочим оборотным активам""",
			Счет.Код);
			
		ВсеВидыАктивовАвансов = Новый СписокЗначений;
		Для Инд = 1 По Перечисления.ВидыАктивовДляАвансов.Количество() Цикл
			ВсеВидыАктивовАвансов.Добавить(Перечисления.ВидыАктивовДляАвансов[Инд - 1]);
		КонецЦикла;
		
		ОтборПоАналитике = Новый Соответствие;
		НеВСписке = Новый Структура("ВидСравненияКомпоновкиДанных, Значение",
			ВидСравненияКомпоновкиДанных.НеВСписке, ВсеВидыАктивовАвансов);
		ОтборПоАналитике.Вставить("Субконто2.ВидАктива", НеВСписке);
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчету(ПараметрыРасшифровки, Счет.Ссылка, ОтборПоАналитике);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СКК_АвансыДебЗад") Тогда
		ТокенОстатка = "СКК_ПоВидуАктива"; // сведения подготовлены в единой таблице с заполненными видами актива
		Счета = Список(Сред(Составляющая, 17));
		
		ИмяЗначения = ТокенОстатка + "_" + СтрЗаменить(Счета[0], ".", "_")
		            + "__" + СтрЗаменить(Счета[1], ".", "_");
		ЗначениеСоставляющей = ПроцессорПоказателя.РассчитанныеЗначения[ИмяЗначения][ДопПараметры];
		ШаблонРасшифровкиПоказателя = СтрШаблон("Сальдо на конец периода по кредиту счета %1 по объектам, учитываемым на счете %2",
			СчетСРеквизитами(Счета[0], СчетаСРеквизитами).Код,
			СчетСРеквизитами(Счета[1], СчетаСРеквизитами).Код);
		НастройкаОтчетаРасшифровки = БезРасшифровки;
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СНД_ПоВидуАктива") Тогда
		ТокенОстатка = "СНД_ПоВидуАктива";
		ТокенСчета = Сред(Составляющая, 17);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ПараметрыСчета = ПроцессорПоказателя.ПараметрыСчетов[ТокенСчета];
		ИмяЗначения = ТокенОстатка + "_" + СтрЗаменить(ТокенСчета, ".", "_");
		ЗначениеСоставляющей = ПроцессорПоказателя.РассчитанныеЗначения[ИмяЗначения][ДопПараметры];
		
		Если ПараметрыСчета.Свойство("ШаблонОписания") Тогда
			ТекстШаблона = "Сальдо на начало периода по дебету счета %1 " + ПараметрыСчета.ШаблонОписания;
		Иначе
			ТекстШаблона = "Сальдо на начало периода по дебету счета %1 /объекты со значением реквизита ""Вид актива"" - ""%2""/";
		КонецЕсли;
		ШаблонРасшифровкиПоказателя = СтрШаблон(ТекстШаблона, Счет.Код, Строка(ДопПараметры));
		
		Если ПараметрыСчета.Свойство("ОтборПоАналитике") Тогда
			ОтборПоАналитике = Новый Соответствие;
			ОтборПоАналитике.Вставить(ПараметрыСчета.ОтборПоАналитике, ДопПараметры);
			НастройкаОтчетаРасшифровки = НастройкиОСВПоСчету(ПараметрыРасшифровки, Счет.Ссылка, ОтборПоАналитике);
		Иначе
			НастройкаОтчетаРасшифровки = БезРасшифровки;
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "ДО_ПоВидуАктива") Тогда
		ТокенОстатка = "ДО_ПоВидуАктива";
		ТокенСчета = Сред(Составляющая, 16);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ПараметрыСчета = ПроцессорПоказателя.ПараметрыСчетов[ТокенСчета];
		ИмяЗначения = ТокенОстатка + "_" + СтрЗаменить(ТокенСчета, ".", "_");
		ЗначениеСоставляющей = ПроцессорПоказателя.РассчитанныеЗначения[ИмяЗначения][ДопПараметры];
		
		Если ПараметрыСчета.Свойство("ШаблонОписания") Тогда
			ТекстШаблона = "Оборот по дебету счета %1 " + ПараметрыСчета.ШаблонОписания;
		Иначе
			ТекстШаблона = "Оборот по дебету счета %1 /объекты со значением реквизита ""Вид актива"" - ""%2""/";
		КонецЕсли;
		ШаблонРасшифровкиПоказателя = СтрШаблон(ТекстШаблона, Счет.Код, Строка(ДопПараметры));
		
		Если ПараметрыСчета.Свойство("ОтборПоАналитике") Тогда
			ОтборПоАналитике = Новый Соответствие;
			ОтборПоАналитике.Вставить(ПараметрыСчета.ОтборПоАналитике, ДопПараметры);
			НастройкаОтчетаРасшифровки = НастройкиОСВПоСчету(ПараметрыРасшифровки, Счет.Ссылка, ОтборПоАналитике);
		Иначе
			НастройкаОтчетаРасшифровки = БезРасшифровки;
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "КО_ПоВидуАктива") Тогда
		ТокенОстатка = "КО_ПоВидуАктива";
		ТокенСчета = Сред(Составляющая, 16);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ПараметрыСчета = ПроцессорПоказателя.ПараметрыСчетов[ТокенСчета];
		ИмяЗначения = ТокенОстатка + "_" + СтрЗаменить(ТокенСчета, ".", "_");
		ЗначениеСоставляющей = ПроцессорПоказателя.РассчитанныеЗначения[ИмяЗначения][ДопПараметры];
		
		Если ПараметрыСчета.Свойство("ШаблонОписания") Тогда
			ТекстШаблона = "Оборот по кредиту счета %1 " + ПараметрыСчета.ШаблонОписания;
		Иначе
			ТекстШаблона = "Оборот по кредиту счета %1 /объекты со значением реквизита ""Вид актива"" - ""%2""/";
		КонецЕсли;
		ШаблонРасшифровкиПоказателя = СтрШаблон(ТекстШаблона, Счет.Код, Строка(ДопПараметры));
		
		Если ПараметрыСчета.Свойство("ОтборПоАналитике") Тогда
			ОтборПоАналитике = Новый Соответствие;
			ОтборПоАналитике.Вставить(ПараметрыСчета.ОтборПоАналитике, ДопПараметры);
			НастройкаОтчетаРасшифровки = НастройкиОСВПоСчету(ПараметрыРасшифровки, Счет.Ссылка, ОтборПоАналитике);
		Иначе
			НастройкаОтчетаРасшифровки = БезРасшифровки;
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СКД_ПоВидуАктива") Тогда
		ТокенОстатка = "СКД_ПоВидуАктива";
		ТокенСчета = Сред(Составляющая, 17);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ПараметрыСчета = ПроцессорПоказателя.ПараметрыСчетов[ТокенСчета];
		ИмяЗначения = ТокенОстатка + "_" + СтрЗаменить(ТокенСчета, ".", "_");
		ЗначениеСоставляющей = ПроцессорПоказателя.РассчитанныеЗначения[ИмяЗначения][ДопПараметры];
		
		Если ПараметрыСчета.Свойство("ШаблонОписания") Тогда
			ТекстШаблона = "Сальдо на конец периода по дебету счета %1 " + ПараметрыСчета.ШаблонОписания;
		Иначе
			ТекстШаблона = "Сальдо на конец периода по дебету счета %1 /объекты со значением реквизита ""Вид актива"" - ""%2""/";
		КонецЕсли;
		ШаблонРасшифровкиПоказателя = СтрШаблон(ТекстШаблона, Счет.Код, Строка(ДопПараметры));
		
		Если ПараметрыСчета.Свойство("ОтборПоАналитике") Тогда
			ОтборПоАналитике = Новый Соответствие;
			ОтборПоАналитике.Вставить(ПараметрыСчета.ОтборПоАналитике, ДопПараметры);
			НастройкаОтчетаРасшифровки = НастройкиОСВПоСчету(ПараметрыРасшифровки, Счет.Ссылка, ОтборПоАналитике);
		Иначе
			НастройкаОтчетаРасшифровки = БезРасшифровки;
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СКК_ПоВидуАктива") Тогда
		ТокенОстатка = "СКК_ПоВидуАктива";
		Счета = Список(Сред(Составляющая, 17));
		
		Если Счета.Количество() = 1 Тогда
			// Простое разделение по аналитике внутри счета.
			ТокенСчета = Счета[0];
			Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
			ПараметрыСчета = ПроцессорПоказателя.ПараметрыСчетов[ТокенСчета];
			ИмяЗначения = ТокенОстатка + "_" + СтрЗаменить(ТокенСчета, ".", "_");
			ЗначениеСоставляющей = ПроцессорПоказателя.РассчитанныеЗначения[ИмяЗначения][ДопПараметры];
			
			Если ПараметрыСчета.Свойство("ШаблонОписания") Тогда
				ТекстШаблона = "Сальдо на конец периода по кредиту счета %1 " + ПараметрыСчета.ШаблонОписания;
			Иначе
				ТекстШаблона = "Сальдо на конец периода по кредиту счета %1 /объекты со значением реквизита ""Вид актива"" - ""%2""/";
			КонецЕсли;
			ШаблонРасшифровкиПоказателя = СтрШаблон(ТекстШаблона, Счет.Код, Строка(ДопПараметры));
			
			Если ПараметрыСчета.Свойство("ОтборПоАналитике") Тогда
				ОтборПоАналитике = Новый Соответствие;
				ОтборПоАналитике.Вставить(ПараметрыСчета.ОтборПоАналитике, ДопПараметры);
				НастройкаОтчетаРасшифровки = НастройкиОСВПоСчету(ПараметрыРасшифровки, Счет.Ссылка, ОтборПоАналитике);
			Иначе
				НастройкаОтчетаРасшифровки = БезРасшифровки;
			КонецЕсли;
			
		Иначе
			// Разделение по аналитике в связке с внешними счетами.
			ИмяЗначения = ТокенОстатка + "_" + СтрЗаменить(Счета[0], ".", "_")
			            + "__" + СтрЗаменить(Счета[1], ".", "_");
			ЗначениеСоставляющей = ПроцессорПоказателя.РассчитанныеЗначения[ИмяЗначения][ДопПараметры];
			ШаблонРасшифровкиПоказателя = СтрШаблон("Сальдо на конец периода по кредиту счета %1 по объектам, учитываемым на счете %2",
				СчетСРеквизитами(Счета[0], СчетаСРеквизитами).Код,
				СчетСРеквизитами(Счета[1], СчетаСРеквизитами).Код);
			НастройкаОтчетаРасшифровки = БезРасшифровки;
			
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СКК_СВычетами") Тогда
		ТокенОстатка = "СКК_СВычетами";
		ТокенСчета = Сред(Составляющая, 14);
		ИмяЗначения = ТокенОстатка + "_" + СтрЗаменить(ТокенСчета, ".", "_");
		ЗначениеСоставляющей = ПроцессорПоказателя.РассчитанныеЗначения[ИмяЗначения];
		ШаблонРасшифровкиПоказателя = СтрШаблон("Сальдо на конец периода по кредиту счета %1 уменьшенное на величины, выделенные по объектам учета",
			СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами).Код);
		НастройкаОтчетаРасшифровки = БезРасшифровки;
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СКДР_КонтрагентыДоговоры") Тогда
		ТокенСчета = Сред(Составляющая, 25);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = СКДР(Счет.Ссылка, СиО_КонтрагентыДоговоры);
		ШаблонРасшифровкиПоказателя = СтрШаблон("Сальдо на конец периода по дебету счета %1, развернутое по субконто ""Контрагенты"", ""Договоры""",
			Счет.Код);
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СККР_КонтрагентыДоговоры") Тогда
		ТокенСчета = Сред(Составляющая, 25);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = СККР(Счет.Ссылка, СиО_КонтрагентыДоговоры);
		ШаблонРасшифровкиПоказателя = СтрШаблон("Сальдо на конец периода по кредиту счета %1, развернутое по субконто ""Контрагенты"", ""Договоры""",
			Счет.Код);
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СКДП_КонтрагентыДоговоры") Тогда
		// Дебетовое сальдо на активных счетах, при развертке счета по субконто.
		ТокенСчета = Сред(Составляющая, 25);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = СКДР(Счет.Ссылка, СиО_КонтрагентыДоговоры);
		ШаблонРасшифровкиПоказателя = СтрШаблон("Положительное сальдо на конец периода по дебету счета %1 по субконто ""Контрагенты"", ""Договоры""",
			Счет.Код);
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчетуКонтрагентыДоговорыСКДПоложительное(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СККП_КонтрагентыДоговоры") Тогда
		// Кредитовое сальдо на пассивных счетах, при развертке счета по субконто.
		ТокенСчета = Сред(Составляющая, 25);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = СККР(Счет.Ссылка, СиО_КонтрагентыДоговоры);
		ШаблонРасшифровкиПоказателя = СтрШаблон("Положительное сальдо на конец периода по кредиту счета %1 по субконто ""Контрагенты"", ""Договоры""",
			Счет.Код);
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчетуКонтрагентыДоговорыСККПоложительное(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СКДО_КонтрагентыДоговоры") Тогда
		// Кредитовое сальдо на активных счетах, при развертке счета по субконто.
		ТокенСчета = Сред(Составляющая, 25);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = СККР(Счет.Ссылка, СиО_КонтрагентыДоговоры);
		ШаблонРасшифровкиПоказателя = СтрШаблон("Отрицательное сальдо на конец периода по дебету счета %1 по субконто ""Контрагенты"", ""Договоры""",
			Счет.Код);
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчетуКонтрагентыДоговорыСКДОтрицательное(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СККО_КонтрагентыДоговоры") Тогда
		// Дебетовое сальдо на пассивных счетах, при развертке счета по субконто.
		ТокенСчета = Сред(Составляющая, 25);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = СКДР(Счет.Ссылка, СиО_КонтрагентыДоговоры);
		ШаблонРасшифровкиПоказателя = СтрШаблон("Отрицательное сальдо на конец периода по кредиту счета %1 по субконто ""Контрагенты"", ""Договоры""",
			Счет.Код);
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчетуКонтрагентыДоговорыСККОтрицательное(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СКДР_Контрагенты") Тогда
		ТокенСчета = Сред(Составляющая, 17);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = СКДР(Счет.Ссылка, СиО_Контрагенты);
		ШаблонРасшифровкиПоказателя = СтрШаблон("Сальдо на конец периода по дебету счета %1, развернутое по субконто ""Контрагенты""",
			Счет.Код);
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчетуКонтрагентыРазвернуто(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СККР_Контрагенты") Тогда
		ТокенСчета = Сред(Составляющая, 17);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = СККР(Счет.Ссылка, СиО_Контрагенты);
		ШаблонРасшифровкиПоказателя = СтрШаблон("Сальдо на конец периода по кредиту счета %1, развернутое по субконто ""Контрагенты""",
			Счет.Код);
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчетуКонтрагентыРазвернуто(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СКДР_ВидыПлатежейУровни") Тогда
		ТокенСчета = Сред(Составляющая, 24);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = СКДР(Счет.Ссылка, СиО_ВидыПлатежейУровниБюджетов);
		ШаблонРасшифровкиПоказателя = СтрШаблон("Сальдо на конец периода по дебету счета %1, развернутое по субконто ""Виды платежей в бюджет (фонды)"", ""Уровни бюджетов""",
			Счет.Код);
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчетуВидыПлатежейУровниБюджетовРазвернуто(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СККР_ВидыПлатежейУровни") Тогда
		ТокенСчета = Сред(Составляющая, 24);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = СККР(Счет.Ссылка, СиО_ВидыПлатежейУровниБюджетов);
		ШаблонРасшифровкиПоказателя = СтрШаблон("Сальдо на конец периода по кредиту счета %1, развернутое по субконто ""Виды платежей в бюджет (фонды)"", ""Уровни бюджетов""",
			Счет.Код);
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчетуВидыПлатежейУровниБюджетовРазвернуто(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СКДР_ВидыПлатежей") Тогда
		ТокенСчета = Сред(Составляющая, 18);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = СКДР(Счет.Ссылка, СиО_ВидыПлатежей);
		ШаблонРасшифровкиПоказателя = СтрШаблон("Сальдо на конец периода по дебету счета %1, развернутое по субконто ""Виды платежей в бюджет (фонды)""",
			Счет.Код);
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СККР_ВидыПлатежей") Тогда
		ТокенСчета = Сред(Составляющая, 18);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = СККР(Счет.Ссылка, СиО_ВидыПлатежей);
		ШаблонРасшифровкиПоказателя = СтрШаблон("Сальдо на конец периода по кредиту счета %1, развернутое по субконто ""Виды платежей в бюджет (фонды)""",
			Счет.Код);
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СКДР_Работники") Тогда
		ТокенСчета = Сред(Составляющая, 15);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = СКДР(Счет.Ссылка, СиО_Работники);
		ШаблонРасшифровкиПоказателя = СтрШаблон("Сальдо на конец периода по дебету счета %1, развернутое по субконто ""Работники организации""",
			Счет.Код);
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчетуРаботникиРазвернуто(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СККР_Работники") Тогда
		ТокенСчета = Сред(Составляющая, 15);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = СККР(Счет.Ссылка, СиО_Работники);
		ШаблонРасшифровкиПоказателя = СтрШаблон("Сальдо на конец периода по кредиту счета %1, развернутое по субконто ""Работники организации""",
			Счет.Код);
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчетуРаботникиРазвернуто(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СКДР_Резервы") Тогда
		ТокенСчета = Сред(Составляющая, 13);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = СКДР(Счет.Ссылка, СиО_Резервы);
		ШаблонРасшифровкиПоказателя = СтрШаблон("Сальдо на конец периода по дебету счета %1, развернутое по субконто ""Оценочные обязательства и резервы""",
			Счет.Код);
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчетуКонтрагентыРазвернуто(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СККР_Резервы") Тогда
		ТокенСчета = Сред(Составляющая, 13);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = СККР(Счет.Ссылка, СиО_Резервы);
		ШаблонРасшифровкиПоказателя = СтрШаблон("Сальдо на конец периода по кредиту счета %1, развернутое по субконто ""Оценочные обязательства и резервы""",
			Счет.Код);
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчетуКонтрагентыРазвернуто(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СК_РасчетыПоАренде") Тогда
		ИмяЗначения = СтрЗаменить(Составляющая, "СК_РасчетыПоАренде", "");
		ЗначениеСоставляющей = СК_РасчетыПоАренде[ИмяЗначения];
		ШаблонРасшифровкиПоказателя = ТекстыРасшифровки[Составляющая];
		Если ШаблонРасшифровкиПоказателя = Неопределено Тогда
			ШаблонРасшифровкиПоказателя = "";
		КонецЕсли;
		НастройкаОтчетаРасшифровки = НастройкиРасшифровкиПоказателейБалансаПоАренде(ПараметрыРасшифровки);

	ИначеЕсли СтрНачинаетсяС(Составляющая, "СКДР") Тогда
		ТокенСчета = Сред(Составляющая, 5);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = СКДР(Счет.Ссылка, СальдоИОборотыПоСчетам);
		ШаблонРасшифровкиПоказателя = "!СКДР " + Счет.Код;
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчетуРазвернуто(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СККР") Тогда
		ТокенСчета = Сред(Составляющая, 5);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = СККР(Счет.Ссылка, СальдоИОборотыПоСчетам);
		ШаблонРасшифровкиПоказателя = "!СККР " + Счет.Код;
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчетуРазвернуто(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СНД") Тогда
		ТокенСчета = Сред(Составляющая, 4);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = СНД(Счет.Ссылка, СальдоИОборотыПоСчетам);
		ШаблонРасшифровкиПоказателя = "!СНД " + Счет.Код;
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчету(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СНК") Тогда
		ТокенСчета = Сред(Составляющая, 4);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = СНК(Счет.Ссылка, СальдоИОборотыПоСчетам);
		ШаблонРасшифровкиПоказателя = "!СНК " + Счет.Код;
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчету(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СКД") Тогда
		ТокенСчета = Сред(Составляющая, 4);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = СКД(Счет.Ссылка, СальдоИОборотыПоСчетам);
		ШаблонРасшифровкиПоказателя = "!СКД " + Счет.Код;
		Если ДопПараметры = "НастройкиОтчетаКонтрагентыДоговоры" Тогда
			НастройкаОтчетаРасшифровки = НастройкиОСВПоСчетуКонтрагентыДоговоры(ПараметрыРасшифровки, Счет.Ссылка);
		Иначе
			НастройкаОтчетаРасшифровки = НастройкиОСВПоСчету(ПараметрыРасшифровки, Счет.Ссылка);
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "СКК") Тогда
		ТокенСчета = Сред(Составляющая, 4);
		Если СтрНайти(ТокенСчета, "\") > 0 Тогда
			ТокеныСчетов = СтрРазделить(ТокенСчета, "\");
			ИмяЗначения = "СКК_" + СтрЗаменить(ТокеныСчетов[0], ".", "_")
			            + "__" + СтрЗаменить(ТокеныСчетов[1], ".", "_");
			ЗначениеСоставляющей = ПроцессорПоказателя.РассчитанныеЗначения[ИмяЗначения];
			ШаблонРасшифровкиПоказателя = СтрШаблон("Сальдо на конец периода по кредиту счета %1 по объектам, учитываемым на счете %2",
				СчетСРеквизитами(ТокеныСчетов[0], СчетаСРеквизитами).Код,
				СчетСРеквизитами(ТокеныСчетов[1], СчетаСРеквизитами).Код);
			НастройкаОтчетаРасшифровки = БезРасшифровки;
		Иначе
			Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
			ЗначениеСоставляющей = СКК(Счет.Ссылка, СальдоИОборотыПоСчетам);
			ШаблонРасшифровкиПоказателя = "!СКК " + Счет.Код;
			Если ДопПараметры = "НастройкиОтчетаКонтрагентыДоговоры" Тогда
				НастройкаОтчетаРасшифровки = НастройкиОСВПоСчетуКонтрагентыДоговоры(ПараметрыРасшифровки, Счет.Ссылка);
			Иначе
				НастройкаОтчетаРасшифровки = НастройкиОСВПоСчету(ПараметрыРасшифровки, Счет.Ссылка);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "ДО") Тогда
		ТокенСчета = Сред(Составляющая, 3);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = ДО(Счет.Ссылка, СальдоИОборотыПоСчетам);
		ШаблонРасшифровкиПоказателя = "!ДО " + Счет.Код;
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчету(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "КО") Тогда
		ТокенСчета = Сред(Составляющая, 3);
		Счет = СчетСРеквизитами(ТокенСчета, СчетаСРеквизитами);
		ЗначениеСоставляющей = КО(Счет.Ссылка, СальдоИОборотыПоСчетам);
		ШаблонРасшифровкиПоказателя = "!КО " + Счет.Код;
		НастройкаОтчетаРасшифровки = НастройкиОСВПоСчету(ПараметрыРасшифровки, Счет.Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(Составляющая, "ОБ") Тогда
		Счета = СтрРазделить(Сред(Составляющая, 3), ",");
		Счета[0] = СчетСРеквизитами(Счета[0], СчетаСРеквизитами);
		Счета[1] = СчетСРеквизитами(Счета[1], СчетаСРеквизитами);
		ЗначениеСоставляющей = ОБ(Счета[0].Ссылка, Счета[1].Ссылка, ОборотыМеждуСчетами);
		ШаблонРасшифровкиПоказателя = "!ОБ " + Счета[0].Код + " " + Счета[1].Код;
		НастройкаОтчетаРасшифровки = НастройкиАнализаСчета(ПараметрыРасшифровки, Счета[0].Ссылка, Счета[1].Ссылка);
		
	Иначе
		ИмяПроцедуры = "ЗаполнениеБухгалтерскойОтчетностиОсновная.УчестьСоставляющую";
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Процедура %1:
			|Недопустимое описание составляющей показателя: %2'"),
			ИмяПроцедуры, ОписаниеСоставляющей);
		
	КонецЕсли;
	
	ПроцессорПоказателя.Показатель.ЗначениеПоказателя = ПроцессорПоказателя.Показатель.ЗначениеПоказателя
		+ Множитель * ЗначениеСоставляющей;
	
	ПараметрыСтрокиРасшифровки = Новый Структура;
	ПараметрыСтрокиРасшифровки.Вставить("НаименованиеПоказателя", ПроцессорПоказателя.Показатель.НаименованиеПоказателя);
	ПараметрыСтрокиРасшифровки.Вставить("ЗнакОперации", ТокенЗнака);
	ПараметрыСтрокиРасшифровки.Вставить("НаименованиеСлагаемого", ШаблонРасшифровкиПоказателя);
	ПараметрыСтрокиРасшифровки.Вставить("Сумма", Множитель * ЗначениеСоставляющей);
	ПараметрыСтрокиРасшифровки.Вставить("ИмяРаздела", ПроцессорПоказателя.ИмяРаздела);
	ПараметрыСтрокиРасшифровки.Вставить("ДополнительныеПараметры", НастройкаОтчетаРасшифровки);
	ПараметрыСтрокиРасшифровки.Вставить("Организация", ПроцессорПоказателя.Организация);
	
	ПроцессорПоказателя.Показатель.Расшифровка.Добавить(ПараметрыСтрокиРасшифровки);
	
	// Наименование показателя актуально только для первой строки расшифровки.
	// Принудительная очистка в вызывающем коде не требуется.
	ПроцессорПоказателя.Показатель.НаименованиеПоказателя = "";
	
КонецПроцедуры

Процедура УстановитьЗначениеПоказателяПоПроцессору(КонтейнерРаздела, ПроцессорПоказателя, АлгоритмСтроки) Экспорт
	
	ИмяПоказателя = ПроцессорПоказателя.Показатель.КодПоказателя;
	
	ЗначениеПоказателя = ПроцессорПоказателя.Показатель.ЗначениеПоказателя;
	Если АлгоритмСтроки.Вычитаемый Тогда
		ЗначениеПоказателя = -ЗначениеПоказателя;
	КонецЕсли;
	
	ПараметрыПоискаПоказателя = Новый Структура("Тип, Идентификатор", "Показатель", ИмяПоказателя);
	СтрокиПоказателей = КонтейнерРаздела.Строки.НайтиСтроки(ПараметрыПоискаПоказателя, АлгоритмСтроки.Вписываемый);
	
	Если Не ЗначениеЗаполнено(СтрокиПоказателей) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПоказателя = СтрокиПоказателей[0];
	СтрокаПоказателя.Данные = СтрокаПоказателя.Данные + ЗначениеПоказателя;
	
	Если ПроцессорПоказателя.Показатель.Расшифровка.Количество() <> 0 Тогда
		Для Каждого ПараметрыСтрокиРасшифровки Из ПроцессорПоказателя.Показатель.Расшифровка Цикл
			СтрокаРасшифровки = СтрокаПоказателя.Строки.Добавить();
			СтрокаРасшифровки.Тип = "Расшифровка";
			СтрокаРасшифровки.Идентификатор = "";
			СтрокаРасшифровки.Данные = ПараметрыСтрокиРасшифровки;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьНаименованиеВписываемогоПоказателя(КонтейнерРаздела, АлгоритмСтроки)
	
	ИмяПоказателя = "П10001А" + АлгоритмСтроки.Номер + АлгоритмСтроки.ГрафаНаименования;
	
	ПараметрыПоискаПоказателя = Новый Структура("Тип, Идентификатор", "Показатель", ИмяПоказателя);
	СтрокиПоказателей = КонтейнерРаздела.Строки.НайтиСтроки(ПараметрыПоискаПоказателя, Истина);
	
	Если Не ЗначениеЗаполнено(СтрокиПоказателей) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПоказателя = СтрокиПоказателей[0];
	СтрокаПоказателя.Данные = АлгоритмСтроки.Наименование;
	
КонецПроцедуры

Процедура ИнициализироватьЗаполнениеПоказателя(ПроцессорПоказателя, НомерСтроки, НомерГрафы, Вписываемый) Экспорт
	
	ИнициализироватьКодПоказателя(ПроцессорПоказателя, НомерСтроки, НомерГрафы, Вписываемый);
	
	ИнициализироватьПоказатель(ПроцессорПоказателя);
	
КонецПроцедуры

Процедура ИнициализироватьКодПоказателя(ПроцессорПоказателя, Знач НомерСтроки, Знач НомерГрафы, Знач Вписываемый)

	Префикс         = "П00001";
	ПолныйКодНомера = "00000";
	ПолныйКодГрафы  = "00";
	
	Если Вписываемый Тогда
		Префикс         = "П10001";
		ПолныйКодНомера = "А00000";
	КонецЕсли;
	
	ПроцессорПоказателя.Показатель.КодПоказателя = Префикс
		+ Лев(ПолныйКодНомера, 5 - СтрДлина(НомерСтроки)) + НомерСтроки
		+ Лев(ПолныйКодГрафы, 2 - СтрДлина(НомерГрафы)) + НомерГрафы;
		
КонецПроцедуры

Процедура ИнициализироватьПоказатель(ПроцессорПоказателя)
	ПроцессорПоказателя.Показатель.ЗначениеПоказателя = 0;
	ПроцессорПоказателя.Показатель.Расшифровка = Новый Массив;
КонецПроцедуры

#КонецОбласти

#Область ОбслуживаниеКонтейнера

Функция МногострочнаяЧастьРаздела(КонтейнерРаздела, ИдентификаторМСЧ)
	
	ПараметрыПоиска = Новый Структура("Тип, Идентификатор", "МногострочнаяЧасть", ИдентификаторМСЧ);

	СодержимоеКонтейнера = КонтейнерРаздела.Строки.НайтиСтроки(ПараметрыПоиска, Истина);
	Если Не ЗначениеЗаполнено(СодержимоеКонтейнера) Тогда
		Возврат Неопределено; 
	КонецЕсли;
	
	Возврат СодержимоеКонтейнера[0];
	
КонецФункции

// Возвращает строки многострочной части с сохранением порядка следования.
// 
// Параметры:
//   ОбъявлениеМногострочнойЧасти - СтрокаДереваЗначений
// 
// Возвращаемое значение:
//   Массив из СтрокаДереваЗначений
//
Функция СтрокиМногострочнойЧасти(ОбъявлениеМногострочнойЧасти)
	
	СтрокиМСЧ = Новый Массив;
	
	Для Каждого СтрокаМСЧ Из ОбъявлениеМногострочнойЧасти.Строки Цикл
		Если СтрокаМСЧ.Тип = "Строка" Тогда
			СтрокиМСЧ.Добавить(СтрокаМСЧ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрокиМСЧ;
	
КонецФункции

Процедура СкопироватьВеткуДерева(ИсходнаяВетка)
	
	РодительскаяВетка = ИсходнаяВетка.Родитель;
	
	НоваяВетка = РодительскаяВетка.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяВетка, ИсходнаяВетка);
	
	СкопироватьСтрокиДерева(НоваяВетка, ИсходнаяВетка)
	
КонецПроцедуры

Процедура СкопироватьСтрокиДерева(Приемник, Источник)
	
	Для Каждого СтрокаИсточника Из Источник.Строки Цикл
		СтрокаПриемника = Приемник.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПриемника, СтрокаИсточника);
		СкопироватьСтрокиДерева(СтрокаПриемника, СтрокаИсточника)
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обертки

Функция Счет(УсловныйКод)
	
	Возврат ЗаполнениеБухгалтерскойОтчетностиИтоги.Счет(УсловныйКод);
	
КонецФункции

Функция СчетСРеквизитами(УсловныйКод, СчетаСРеквизитами)
	
	Возврат ЗаполнениеБухгалтерскойОтчетностиИтоги.СчетСРеквизитами(УсловныйКод, СчетаСРеквизитами);
	
КонецФункции

Функция СНД(Счет, СальдоИОбороты)
	
	Возврат ЗаполнениеБухгалтерскойОтчетностиИтоги.СНД(Счет, СальдоИОбороты);
	
КонецФункции

Функция СНК(Счет, СальдоИОбороты)
	
	Возврат ЗаполнениеБухгалтерскойОтчетностиИтоги.СНК(Счет, СальдоИОбороты);
	
КонецФункции

Функция ДО(Счет, СальдоИОбороты)
	
	Возврат ЗаполнениеБухгалтерскойОтчетностиИтоги.ДО(Счет, СальдоИОбороты);
	
КонецФункции

Функция КО(Счет, СальдоИОбороты)
	
	Возврат ЗаполнениеБухгалтерскойОтчетностиИтоги.КО(Счет, СальдоИОбороты);
	
КонецФункции

Функция ОБ(Знач СчетДт, Знач СчетКт, ОборотыМеждуСчетами)
	
	Возврат ЗаполнениеБухгалтерскойОтчетностиИтоги.ОБ(СчетДт, СчетКт, ОборотыМеждуСчетами);
	
КонецФункции

Функция СКД(Счет, СальдоИОбороты)
	
	Возврат ЗаполнениеБухгалтерскойОтчетностиИтоги.СКД(Счет, СальдоИОбороты);
	
КонецФункции

Функция СКК(Счет, СальдоИОбороты)
	
	Возврат ЗаполнениеБухгалтерскойОтчетностиИтоги.СКК(Счет, СальдоИОбороты);
	
КонецФункции

Функция СКДР(Счет, СальдоИОбороты)
	
	Возврат ЗаполнениеБухгалтерскойОтчетностиИтоги.СКДР(Счет, СальдоИОбороты);
	
КонецФункции

Функция СККР(Счет, СальдоИОбороты)
	
	Возврат ЗаполнениеБухгалтерскойОтчетностиИтоги.СККР(Счет, СальдоИОбороты);
	
КонецФункции

Функция СальдоИОборотыПоСчетамИСубконто(НастройкиПолученияБухитогов, Счета, Субконто)
	
	Возврат ЗаполнениеБухгалтерскойОтчетности.СальдоИОборотыПоСчетамИСубконто(НастройкиПолученияБухитогов, Счета, Субконто);
	
КонецФункции

Функция НастройкиОСВПоСчету(ОбщиеНастройки, Счет, ОтборПоАналитике = Неопределено)
	
	Возврат ЗаполнениеБухгалтерскойОтчетности.НастройкиОСВПоСчету(ОбщиеНастройки, Счет, ОтборПоАналитике);
	
КонецФункции

Функция НастройкиОСВПоСчетуРазвернуто(ОбщиеНастройки, Счет, ОтборПоАналитике = Неопределено)
	
	Возврат ЗаполнениеБухгалтерскойОтчетности.НастройкиОСВПоСчетуРазвернуто(ОбщиеНастройки, Счет, ОтборПоАналитике);
	
КонецФункции

Функция НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеНастройки, Счет, ОтборПоАналитике = Неопределено)
	
	Возврат ЗаполнениеБухгалтерскойОтчетности.НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеНастройки, Счет, ОтборПоАналитике);
	
КонецФункции

Функция НастройкиОСВПоСчетуКонтрагентыДоговоры(ОбщиеНастройки, Счет, ОтборПоАналитике = Неопределено)
	
	Возврат ЗаполнениеБухгалтерскойОтчетности.НастройкиОСВПоСчетуКонтрагентыДоговоры(ОбщиеНастройки, Счет, ОтборПоАналитике);
	
КонецФункции

Функция НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеНастройки, Счет, ОтборПоАналитике = Неопределено)
	
	Возврат ЗаполнениеБухгалтерскойОтчетности.НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеНастройки, Счет, ОтборПоАналитике);
	
КонецФункции

Функция НастройкиОСВПоСчетуКонтрагентыДоговорыСКДПоложительное(ОбщиеНастройки, Счет)
	
	Возврат ЗаполнениеБухгалтерскойОтчетности.НастройкиОСВПоСчетуКонтрагентыДоговорыСКДПоложительное(ОбщиеНастройки, Счет);
	
КонецФункции

Функция НастройкиОСВПоСчетуКонтрагентыДоговорыСКДОтрицательное(ОбщиеНастройки, Счет)
	
	Возврат ЗаполнениеБухгалтерскойОтчетности.НастройкиОСВПоСчетуКонтрагентыДоговорыСКДОтрицательное(ОбщиеНастройки, Счет);
	
КонецФункции

Функция НастройкиОСВПоСчетуКонтрагентыДоговорыСККПоложительное(ОбщиеНастройки, Счет)
	
	Возврат ЗаполнениеБухгалтерскойОтчетности.НастройкиОСВПоСчетуКонтрагентыДоговорыСККПоложительное(ОбщиеНастройки, Счет);
	
КонецФункции

Функция НастройкиОСВПоСчетуКонтрагентыДоговорыСККОтрицательное(ОбщиеНастройки, Счет)
	
	Возврат ЗаполнениеБухгалтерскойОтчетности.НастройкиОСВПоСчетуКонтрагентыДоговорыСККОтрицательное(ОбщиеНастройки, Счет);
	
КонецФункции

Функция НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеНастройки, Счет, ОтборПоАналитике = Неопределено)
	
	Возврат ЗаполнениеБухгалтерскойОтчетности.НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеНастройки, Счет, ОтборПоАналитике);
	
КонецФункции

Функция НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеНастройки, Счет, ОтборПоАналитике = Неопределено)
	
	Возврат ЗаполнениеБухгалтерскойОтчетности.НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеНастройки, Счет, ОтборПоАналитике);
	
КонецФункции

Функция НастройкиОСВПоСчетуВидыПлатежейУровниБюджетовРазвернуто(ОбщиеНастройки, Счет, ОтборПоАналитике = Неопределено)
	
	Возврат ЗаполнениеБухгалтерскойОтчетности.НастройкиОСВПоСчетуВидыПлатежейУровниБюджетовРазвернуто(ОбщиеНастройки, Счет, ОтборПоАналитике);
	
КонецФункции

Функция НастройкиАнализаСчета(ОбщиеНастройки, Счет, КорСчет, ОтборПоАналитике = Неопределено)
	
	Возврат ЗаполнениеБухгалтерскойОтчетности.НастройкиАнализаСчета(ОбщиеНастройки, Счет, КорСчет, ОтборПоАналитике);
	
КонецФункции

Функция НастройкиРасшифровкиПоказателейБалансаПоАренде(ОбщиеНастройки)
	
	ИмяОтчета = "Отчет.СправкаРасчетКлассификацияПоСрокамАрендныхОбязательств.ФормаОбъекта";
	Возврат ЗаполнениеБухгалтерскойОтчетности.НастройкиРасшифровкиСправкиРасчетаКлассификацииЗадолженности(ОбщиеНастройки, ИмяОтчета);
	
КонецФункции

Функция ДобавитьНовыйАлгоритмСтроки(Алгоритмы, Номер, Наименование)
	
	Возврат ЗаполнениеБухгалтерскойОтчетностиОсновная.ДобавитьНовыйАлгоритмСтроки(Алгоритмы, Номер, Наименование);
	
КонецФункции

Функция ДобавитьНовыйАлгоритмСтрокиСДопСтроками(Алгоритмы, Номер, НумераторДопСтрок, Наименование)
	
	Возврат ЗаполнениеБухгалтерскойОтчетностиОсновная.ДобавитьНовыйАлгоритмСтрокиСДопСтроками(Алгоритмы, Номер,
		НумераторДопСтрок, Наименование);
	
КонецФункции

Функция Список(СписокРазделенныйЗапятыми)
	
	Возврат РегламентированнаяОтчетностьКлиентСервер.Список(СписокРазделенныйЗапятыми);
	
КонецФункции

Функция РасширенныйПериодОтчета(НачалоПериодаОтчета)
	
	Возврат ЗаполнениеБухгалтерскойОтчетности.РасширенныйПериодОтчета(НачалоПериодаОтчета);
	
КонецФункции

Функция ПривестиКДате(Период)
	
	Возврат ЗаполнениеБухгалтерскойОтчетности.ПривестиКДате(Период);
	
КонецФункции

#КонецОбласти

#Область НастраиваемаяОтчетность

Функция КонтекстОтчета(ОтчетныйПериодНачало, ОтчетныйПериодКонец, ИспользоватьСравнительныйПериод, СравнительныйПериодНачало, Знач СравнительныйПериодКонец, Организации, Упрощенная)
	
	КонтекстОтчета = БухгалтерскаяОтчетностьБРО.НовыйКонтекстОтчета();
	
	КонтекстОтчета.Упрощенная = Упрощенная;
	
	Если Не ЗначениеЗаполнено(Организации) Тогда
		Возврат КонтекстОтчета;
	КонецЕсли;
	
	КонтекстОтчета.Организация = Организации[0];
	БухгалтерскаяОтчетностьБРО.ЗаполнитьПериодОтчета(КонтекстОтчета.ОтчетныйПериод, ОтчетныйПериодНачало, ОтчетныйПериодКонец);
	КонтекстОтчета.Период = КонтекстОтчета.ОтчетныйПериод.КонецДата;
	
	Если ИспользоватьСравнительныйПериод Тогда
		
		СтандартнаяДлинаОтчетногоПериода = 12; // месяцев
		МесяцКонцаОтчетногоПериода = Месяц(КонтекстОтчета.ОтчетныйПериод.КонецДата);
		Если МесяцКонцаОтчетногоПериода <> СтандартнаяДлинаОтчетногоПериода Тогда
			// в ФБСУ 4 формулируется как "период предыдущего года, аналогичный отчетному периоду"
			СравнительныйПериодКонец = КонецМесяца(ДобавитьМесяц(КонтекстОтчета.ОтчетныйПериод.КонецДата, -СтандартнаяДлинаОтчетногоПериода));
		КонецЕсли;
		
		БухгалтерскаяОтчетностьБРО.ЗаполнитьПериодОтчета(КонтекстОтчета.СравнительныйПериод, СравнительныйПериодНачало, СравнительныйПериодКонец);
		
	КонецЕсли;
	
	Возврат КонтекстОтчета;
	
КонецФункции

Процедура ЗаполнитьОтчетПоНастройкам(Контейнер, ОтборРазделов, КонтекстОтчета, Организации, НастройкиФормы)
	
	Периоды = ПериодыОтчета(КонтекстОтчета);
	
	Если Не ЗначениеЗаполнено(Периоды) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполняемыеПоказатели = АктуальныеЗаполняемыеПоказатели(КонтекстОтчета, ОтборРазделов);
	
	Если НастройкиФормы <> Неопределено И Не КонтекстОтчета.Упрощенная Тогда
		Для Каждого ОтборРаздела Из ОтборРазделов Цикл
			Если Не ОтборРаздела.Значение Тогда
				Продолжить;
			КонецЕсли;
			НастройкиРаздела = НастройкиФормы.Разделы[ОтборРаздела.Ключ];
			Если НастройкиРаздела = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЗаполняемыеПоказатели.Разделы.Вставить(ОтборРаздела.Ключ, НастройкиРаздела);
		КонецЦикла;
	КонецЕсли;
	
	БухгалтерскаяОтчетностьБРО.ЗаполнитьОтчет(Контейнер, ЗаполняемыеПоказатели, Периоды, Организации, КонтекстОтчета.Упрощенная);
	
КонецПроцедуры

Процедура ЗаполнитьТаблицыОтчета(Контейнер, ОтборРазделов, КонтекстОтчета, Организации)
	
	Периоды = ПериодыОтчета(КонтекстОтчета);
	
	Если Не ЗначениеЗаполнено(Периоды) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнениеБухгалтерскойОтчетностиТабличное.ЗаполнитьТаблицыОтчета(Контейнер, ОтборРазделов, КонтекстОтчета, Периоды, Организации);
	
КонецПроцедуры

Функция ПериодыОтчета(КонтекстОтчета)
	
	Периоды = Новый Массив;
	
	Если КонтекстОтчета.ОтчетныйПериод.Заполнен Тогда
		Периоды.Добавить(КонтекстОтчета.ОтчетныйПериод);
	КонецЕсли;
	
	Если КонтекстОтчета.СравнительныйПериод.Заполнен Тогда
		Периоды.Добавить(КонтекстОтчета.СравнительныйПериод);
	КонецЕсли;
	
	Возврат Периоды;
	
КонецФункции

Функция АктуальныеЗаполняемыеПоказатели(КонтекстОтчета, ОтборРазделов)
	
	ЗаполняемыеПоказатели = БухгалтерскаяОтчетностьБРО.НовыйЗаполняемыеПоказатели();
	
	СохраненныеНастройки = БухгалтерскаяОтчетностьБРО.НовыйЗаполняемыеПоказатели();
	ЗаполнениеБухгалтерскойОтчетностиГибкаяНастройка.ПрочитатьСохраненныеНастройки(СохраненныеНастройки, КонтекстОтчета);
	
	Для Каждого ОтборРаздела Из ОтборРазделов Цикл
		
		Если Не ОтборРаздела.Значение Тогда
			Продолжить;
		КонецЕсли;
		
		Раздел = ОтборРаздела.Ключ;
		
		ЗаполняемыеПоказателиРаздела = СохраненныеНастройки.Разделы[Раздел];
		Если ЗаполняемыеПоказателиРаздела = Неопределено Тогда
			ЗаполняемыеПоказателиРаздела = БухгалтерскаяОтчетностьБРО.НовыйЗаполняемыеПоказателиРаздела();
			ЗаполнениеБухгалтерскойОтчетностиНастраиваемая.ОпределитьЗаполняемыеПоказатели(ЗаполняемыеПоказателиРаздела, Раздел, КонтекстОтчета);
		КонецЕсли;
		
		ЗаполняемыеПоказатели.Разделы.Вставить(Раздел, ЗаполняемыеПоказателиРаздела);
		
	КонецЦикла;
	
	Возврат ЗаполняемыеПоказатели;
	
КонецФункции

#КонецОбласти

#КонецОбласти
