
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устанавливает наименование элемента справочника в зависимости от владельца и дат начала/окончания использования.
//
Процедура УстановитьНаименование() Экспорт
	
	НаименованиеНМА = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "Наименование");

	ЧастиНаименования = Новый Массив;
	Если ЗначениеЗаполнено(НаименованиеНМА) Тогда
		ЧастиНаименования.Добавить(НаименованиеНМА);
	Иначе
		ЧастиНаименования.Добавить(ОбщегоНазначенияБПКлиентСервер.ПредставлениеНезаполненногоЗначения());
	КонецЕсли;

	ДатаНачала = "";
	Если ЗначениеЗаполнено(ДатаНачалаСписания) Тогда
		ДатаНачала = Формат(ДатаНачалаСписания, "ДФ=dd.MM.yy;");
	КонецЕсли;
	
	ДатаОкончания = "";
	Если ЗначениеЗаполнено(ДатаОкончанияСписания) Тогда
		ДатаОкончания =  Формат(ДатаОкончанияСписания, "ДФ=dd.MM.yy;");
	КонецЕсли;
	
	ЧастиНаименования.Добавить(СтрШаблон("%1 - %2", ДатаНачала, ДатаОкончания));
	
	Наименование = СтрСоединить(ЧастиНаименования, "; ");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
