#Область ОписаниеПеременных

&НаКлиенте
Перем ОткрытыеФормы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	ТекущаяДата = ТекущаяДатаСеанса();
	
КонецПроцедуры

#КонецОбласти			

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЛичныйКабинетЕНС(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РабочийРежим", Истина);
	ПараметрыФормы.Вставить("ИмяФормы", "Форма");
	
	ИмяОткрываемойФормы = "Обработка.ЕдиныйНалоговыйСчетЛичныйКабинет.Форма.ФормаДлительнаяОперация";
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы(ИмяОткрываемойФормы, ЭтотОбъект, ПараметрыФормы, , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура УведомлениеОбИсчисленныхСуммахНалогов(Команда)
	
	ИмяОткрываемойФормы = "Документ.УведомлениеОбИсчисленныхСуммахНалогов.ФормаСписка";
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы(ИмяОткрываемойФормы, ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетРасчетыПоЕНС(Команда)

	ПараметрыФормы = Новый Структура;
	Параметрыформы.Вставить("НачалоПериода", НачалоГода(ТекущаяДата));
	Параметрыформы.Вставить("КонецПериода", КонецДня(ТекущаяДата));
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);

	ИмяОткрываемойФормы = "Отчет.РасчетыПоЕНС.ФормаОбъекта";
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы(ИмяОткрываемойФормы, ЭтотОбъект, ПараметрыФормы, , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетРасчетыПоНалогамНаЕНС(Команда)

	ПараметрыФормы = Новый Структура;
	Параметрыформы.Вставить("НачалоПериода", НачалоГода(ТекущаяДата));
	Параметрыформы.Вставить("КонецПериода", КонецДня(ТекущаяДата));
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("ВариантОтчета", "РасчетыПоНалогамНаЕНС");

	ИмяОткрываемойФормы = "Отчет.РасчетыПоЕНС.ФормаОбъекта";
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы(ИмяОткрываемойФормы,
		ЭтотОбъект, ПараметрыФормы, "РасчетыПоНалогамНаЕНС", ОткрытыеФормы);

КонецПроцедуры

&НаКлиенте
Процедура ЗаявленияОЗачетеВСчетПредстоящейОбязанности(Команда)
	
	ИмяОткрываемойФормы = "Документ.ЗаявлениеОЗачетеВСчетПредстоящейОбязанности.Форма.ФормаСписка";
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы(ИмяОткрываемойФормы, ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОбУплатеНалогов(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	
	ИмяОткрываемойФормы = "Документ.СведенияОбУплатеНалогов.ФормаСписка";
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы(ИмяОткрываемойФормы, ЭтотОбъект, ПараметрыФормы, , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкиЕНС(Команда)
	
	ИмяОткрываемойФормы = "Документ.КорректировкаЕНС.ФормаСписка";
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы(ИмяОткрываемойФормы, ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

#КонецОбласти