#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Источник", ПараметрыВыполненияКоманды.Источник);
	Оповещение = Новый ОписаниеОповещения(
		"ПослеПодключенияРасширенияДляРаботыСФайлами", ЭтотОбъект, ДополнительныеПараметры);
	НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеПодключенияРасширенияДляРаботыСФайлами(Подключено, ДополнительныеПараметры) Экспорт
	
	НастройкиКлиентБанка = НастройкиКлиентБанка();
	НастройкиКлиентБанка.Вставить("ВозможностьВыбораФайлов", Подключено);
	ОткрытьФорму("Обработка.КлиентБанк.Форма.ФормаНастройкиЗаполнения",
		НастройкиКлиентБанка,
		ДополнительныеПараметры.Источник,
		Истина);
	
КонецПроцедуры

&НаСервере
Функция НастройкиКлиентБанка()
	
	НастройкиБанковскогоСчета = Обработки.КлиентБанк.ПолучитьНастройкиПрограммыКлиентаБанка(Неопределено);
	
	РежимЗагрузки = "";
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиБанковскогоСчета, "ЭтоЦифровойСчет", Ложь) Тогда
		РежимЗагрузки = "ЦифровойСчет";
	КонецЕсли;
	НастройкиКлиентБанка = Новый Структура;
	НастройкиКлиентБанка.Вставить("Организация",     НастройкиБанковскогоСчета.Организация);
	НастройкиКлиентБанка.Вставить("Кодировка",       НастройкиБанковскогоСчета.Кодировка);
	НастройкиКлиентБанка.Вставить("РежимЗагрузки",   РежимЗагрузки);
	Если НастройкиБанковскогоСчета.Свойство("СоглашениеПрямогоОбменаСБанками") Тогда
		НастройкиКлиентБанка.Вставить("СоглашениеПрямогоОбменаСБанками",
			НастройкиБанковскогоСчета.СоглашениеПрямогоОбменаСБанками);
	КонецЕсли;
	
	Возврат НастройкиКлиентБанка;
	
КонецФункции

#КонецОбласти