#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для каждого Запись Из ЭтотОбъект Цикл
		Если ТипЗнч(Запись.Касса) = Тип("Строка") Тогда
		
			СообщениеПользователю = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле",
				"Корректность",
				"Касса",
				, // НомерСтроки
				, // ИмяСписка
				НСтр("ru = 'Неверный тип значения. Выберите экземпляр подключаемого оборудования.'"));
				
			ОбщегоНазначения.СообщитьПользователю(СообщениеПользователю,,"Касса",,Отказ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецЕсли