#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Дата") 
		И Параметры.Дата < ТуристическийНалогСервер.ДатаПримененияЛьготыОплатаИзБюджета() Тогда 
		СтандартнаяОбработка = Ложь; 
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.ВидыЛьготПоТуристическомуНалогу.НеПрименяется);
		ДанныеВыбора.Добавить(Перечисления.ВидыЛьготПоТуристическомуНалогу.Федеральная);
		ДанныеВыбора.Добавить(Перечисления.ВидыЛьготПоТуристическомуНалогу.Местная);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли