#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает массив статей расходов, доступных по направлению деятельности по бюджету
//
// Параметры:
//    Организация - Справочник.Организации - Организация, по которой был сформирован бюджет
//    НаправлениеДеятельности - Справочник.НаправленияДеятельности - Направление деятельности, по которому получаем структуру
//    Период - Дата - Дата, на которую следует получить структуру
// Возвращаемое значение:
//    Массив - Массив со статьями расходов
//
Функция ДоступныеСтатьиПоНаправлениюДеятельности(Организация, НаправлениеДеятельности, Период) Экспорт
	
	Если Не ЗначениеЗаполнено(Организация) Или Не ЗначениеЗаполнено(НаправлениеДеятельности) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаправлениеДеятельности", НаправлениеДеятельности);
	Запрос.УстановитьПараметр("Период",                  Период);
	Запрос.УстановитьПараметр("Организация",             Организация);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 10
	|	СтруктураБюджетаРасходовСрезПоследних.СтатьяРасхода КАК СтатьяРасхода
	|ИЗ
	|	РегистрСведений.СтруктураБюджетаРасходы.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И НаправлениеДеятельности = &НаправлениеДеятельности
	|				И НЕ ЭтоГруппа) КАК СтруктураБюджетаРасходовСрезПоследних";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СтатьяРасхода");
	
КонецФункции


#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли