
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Документ.ЗаявлениеОВвозеТоваров.Форма.ФормаДокументаЗаявлениеОВвозе" Тогда
		ТекущийЭлементСписка = ПараметрыВыполненияКоманды.Источник.Объект;
	ИначеЕсли ПараметрыВыполненияКоманды.Источник.Элементы.Найти("Список") <> Неопределено Тогда
		ТекущийЭлементСписка = ПараметрыВыполненияКоманды.Источник.Элементы.Список.ТекущиеДанные;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ТекущийЭлементСписка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = УчетНДСВызовСервера.РеквизитыДокументаОснованияСтатформы(ТекущийЭлементСписка.Ссылка);
	
	Если Реквизиты = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		НСтр("ru = 'Невозможно создать отчет ""Статистическая форма учета перемещения товаров"". Нет доступа к реквизитам документа.'"));
		Возврат;
	КонецЕсли;
	
	Если (Реквизиты.ПометкаУдаления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		НСтр("ru = 'Отчет ""Статистическая форма учета перемещения товаров"" нельзя создать на основании документа, помеченного на удаление.'"));
		Возврат;
	КонецЕсли;
	
	СсылкаНаСуществующуюСтатформу = УчетНДСВызовСервера.ОпределитьСсылкуНаСуществующуюСтатформу(Реквизиты);
	НаправлениеПеремещения = "ИМ";
	УчетНДСКлиент.ОткрытьСтатформу(НаправлениеПеремещения, Реквизиты, СсылкаНаСуществующуюСтатформу);
	
КонецПроцедуры