
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Организация = Параметры.Организация;
	
	ТекстОбращения = ТекстОбращения(Организация);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СкопироватьИЗакрыть(Команда)
	
	Если СредстваБуфераОбмена.ИспользованиеДоступно() Тогда
		СредстваБуфераОбмена.ПоместитьДанныеАсинх(
			Новый ЭлементБуфераОбмена(СтандартныйФорматДанныхБуфераОбмена.Текст, ТекстОбращения));
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ТекстОбращения(Организация)
	
	СведенияОбОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "ИНН, НаименованиеПолное");
	
	ПредставлениеПрограммы = ОбщегоНазначенияБП.ПредставлениеПрограммыВинительныйПадеж();
	
	ШаблонТекста = НСтр("ru = 'Добрый день!
		|Я являюсь вашим клиентом (%1, ИНН %2) и активно пользуюсь вашим банком для своего бизнеса.
		|В настоящее время для ведения учета на АУСН я использую ""%3"". В программе есть удобный сервис ""1С:АУСН"", позволяющий автоматически обмениваться с банком разметкой операций и отправлять сведения о выплатах сотрудникам.
		|На данный момент ваш банк не поддерживает интеграцию с сервисом - прошу вас рассмотреть возможность интеграции с данным сервисом.'");
	
	Текст = СтрШаблон(ШаблонТекста, СведенияОбОрганизации.НаименованиеПолное, СведенияОбОрганизации.ИНН, ПредставлениеПрограммы);
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти