
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство(User_Login) Тогда
		User_Login = Параметры.User_Login;
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(User_Login)
		И ЗначениеЗаполнено(Пароль) Тогда
		СообщениеОбОшибке = "";
		Параметны2ФА = Новый Структура("Есть2ФА, Ключ2ФА, Ответ2ФА, Текст2ФА", Ложь, "", "", "");
		ОбновитьТокен(СообщениеОбОшибке, Параметны2ФА);
		Если Параметны2ФА.Есть2ФА = Истина Тогда
			РежимВвода2ФА = Истина;
			Ключ2ФА = Параметны2ФА.Ключ2ФА;
			Элементы.Пароль.Доступность           = Ложь;
			Элементы.КодПодтверждения.Доступность = Истина;
			Возврат;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
			Закрыть(Истина);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПарольНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Элемент.РежимПароля = Не Элемент.РежимПароля;
	Если Элемент.РежимПароля Тогда
		Элемент.КартинкаКнопкиВыбора = БиблиотекаКартинок.ВводимыеСимволыВидны;
	Иначе
		Элемент.КартинкаКнопкиВыбора = БиблиотекаКартинок.ВводимыеСимволыСкрыты;
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	Если ЗначениеЗаполнено(User_Login)
		И ЗначениеЗаполнено(Пароль) Тогда
		СообщениеОбОшибке = "";
		
		Если РежимВвода2ФА Тогда
			Параметны2ФА = Новый Структура("Есть2ФА, Ключ2ФА, Ответ2ФА, Текст2ФА", Истина, Ключ2ФА, КодПодтверждения, "");
			ОбновитьТокен(СообщениеОбОшибке, Параметны2ФА);
		ИначеЕсли НЕ РежимВвода2ФА Тогда
			Параметны2ФА = Новый Структура("Есть2ФА, Ключ2ФА, Ответ2ФА, Текст2ФА", Ложь, "", "", "");
			ОбновитьТокен(СообщениеОбОшибке, Параметны2ФА);
			Если Параметны2ФА.Есть2ФА = Истина Тогда
				РежимВвода2ФА = Истина;
				Ключ2ФА = Параметны2ФА.Ключ2ФА;
				Элементы.Пароль.Доступность           = Ложь;
				Элементы.КодПодтверждения.Доступность = Истина;
				Возврат;
			КонецЕсли;
		Конецесли;
		
		Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
			Сообщить(СообщениеОбОшибке);
		Иначе
			Закрыть(Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТокен(СообщениеОбОшибке, Параметны2ФА)
	
	Токен = РегистрыСведений.НастройкиYclients.Авторизация(User_Login, Пароль, СообщениеОбОшибке, Параметны2ФА);
	
	Если Параметны2ФА.Есть2ФА Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(Токен) Тогда
		СообщениеОбОшибке = Нстр("ru='Не удалось получить токен пользователя Yclients.'");
		Возврат;
	Иначе
		РегистрыСведений.НастройкиYclients.СохранитьДанныеАвторизации(User_Login, Токен);
	КонецЕсли;
	
КонецПроцедуры
