#Область СлужебныйПрограммныйИнтерфейс

Процедура СкрытьБаннерПоИдентификатору(Идентификатор, ТекущаяПозицияБаннеры) Экспорт
	
	ФинУслуги.СкрытьБаннерПоИдентификатору(Идентификатор, ТекущаяПозицияБаннеры);
	
КонецПроцедуры

Функция РолиДоступны() Экспорт
	
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь();
	ЭтоГлавныйБухгалтер = РольДоступна("ДобавлениеИзменениеНастроекБухгалтерии");
	
	Возврат (ЭтоПолноправныйПользователь ИЛИ ЭтоГлавныйБухгалтер);

КонецФункции

Функция БанкУниверсальногоОбменаПоБанку(Банк) Экспорт
	
	ИННСбербанка = "7707083893";
	ДанныеБанка = РаботаСБанкамиБП.ПолучитьДанныеКонтрагентаБанка(Банк, Ложь);
	
	Если ДанныеБанка.ИНН = ИННСбербанка Тогда
		Возврат Банк;
	Иначе
		Возврат УниверсальныйОбменСБанками.БанкУниверсальногоОбменаПоИНН(ДанныеБанка.ИНН, 
			Перечисления.СервисыОбменаСБанками.ФинансоваяОтчетность);
	КонецЕсли;

КонецФункции

Процедура ЗаполнитьТаблицыПлатежей(ДанныеПлатежейСегодня, АдресХранилища) Экспорт
	
	ФинУслуги.ЗаполнитьТаблицыПлатежей(ДанныеПлатежейСегодня, АдресХранилища);
	
КонецПроцедуры

Функция ИспользоватьПланированиеПлатежей() Экспорт
	
	Возврат ФинУслуги.ИспользоватьПланированиеПлатежей();
	
КонецФункции

Функция НаименованиеБанка(Банк) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Банк, "Наименование");
КонецФункции

Функция ПлатежиСегодняПоБанку(Банк, Организация, АдресПлатежиСегодняПоБанкам) Экспорт
	
	СуммыПоБанку = Новый Структура;
	СуммыПоБанку.Вставить("Приход", 0);
	СуммыПоБанку.Вставить("Расход", 0);
	
	Если ЭтоАдресВременногоХранилища(АдресПлатежиСегодняПоБанкам) Тогда
		ПлатежиПоБанку = ПолучитьИзВременногоХранилища(АдресПлатежиСегодняПоБанкам);
	Иначе
		Возврат СуммыПоБанку;
	КонецЕсли;
	
	Если ПлатежиПоБанку <> Неопределено Тогда
		Отбор = Новый Структура("Банк, Организация", Банк, Организация);
		СтрокиБанка = ПлатежиПоБанку.НайтиСтроки(Отбор);
		Если СтрокиБанка.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СуммыПоБанку, СтрокиБанка[0]);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СуммыПоБанку;
	
КонецФункции

// Проверяет отображение инфопанели, и удаляет сохраненные данные о закрытии
//
// Параметры:
//  ВидимостьПанели - Булево - Если Истина, инфопанель отображается
//
Процедура ОбработатьСостояниеИнфоПанели() Экспорт
	
	ИмяПользователя = ИмяПользователя();
	ФинУслуги.ПроверитьИУдалитьДанныеОЗакрытииИнфоПанели(ИмяПользователя);
	
КонецПроцедуры

// Сохраняет решение пользователя закрыть панель Платежи в хранилище
// общих настроек, см. ФинУслуги.СохранитьЗакрытиеПанелиРасчетаДепозитов.
//
Процедура ОбработатьЗакрытиеИнфоПанели() Экспорт
	
	ИмяПользователя = ИмяПользователя();
	ФинУслуги.СохранитьЗакрытиеИнфоПанели(ИмяПользователя);
	
КонецПроцедуры

Функция СтруктураГруппировокИСчетов(Раздел) Экспорт
	
	Группировки = Новый Массив;
	СписокВидовСубконто = Новый СписокЗначений;  

	Если Раздел = "Платежи" Тогда
		Группировки.Добавить(Новый Структура("Имя, Значение", "Субконто1", "БанковскиеСчета"));
		СписокВидовСубконто.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.БанковскиеСчета"));
		СчетаРасчетов = УчетДенежныхСредствПовтИсп.ПолучитьСчетаССубконтоБанковскиеСчета()
	Иначе
		Группировки.Добавить(Новый Структура("Имя, Значение", "Субконто1", "Контрагенты"));
		Группировки.Добавить(Новый Структура("Имя, Значение", "Субконто2", "Договоры"));
		СписокВидовСубконто.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты"));
		СписокВидовСубконто.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры"));
		Если Раздел = "Кредиты" Тогда
			СчетаРасчетов = СчетаРасчетовКредиты();
		Иначе
			СчетаРасчетов = СчетаРасчетовЛизинг();
		КонецЕсли;
	КонецЕсли;
		
	Возврат Новый Структура("Группировки, СписокВидовСубконто, СчетаРасчетов", Группировки, СписокВидовСубконто, СчетаРасчетов);
	
КонецФункции

Функция СчетаРасчетовКредиты() Экспорт
	
	СчетаРасчетов = Новый Массив;
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоКраткосрочнымКредитамИЗаймам); // 66
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоДолгосрочнымКредитамИЗаймам);  // 67
	
	Возврат СчетаРасчетов;
	
КонецФункции

Функция СчетаРасчетовЛизинг() Экспорт
	
	СчетаРасчетов = Новый Массив;
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАренде);    // 76.07
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАрендеВал); // 76.27
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАрендеУЕ);  // 76.37
	
	Возврат СчетаРасчетов;
	
КонецФункции

Функция ДоступенОбменДепозитами() Экспорт
	Возврат ОбменСБанкамиДепозиты.ДоступенОбменДепозитами();
КонецФункции

#КонецОбласти
