#Область СлужебныйПрограммныйИнтерфейс

// Запускает фоновое выполнение метода взаимодействия с сервисом.
// 
// Параметры:
//  ПараметрыМетода - Структура: см. ИнтеграцияСтатусСамозанятогоКлиентСервер.НовыеПараметрыМетодаВзаимодействия
//  ИдентификаторФормы - УникальныйИдентификатор, Неопределено - идентификатор формы, откуда была вызвана функция
// 
// Возвращаемое значение:
//   Структура: см. ДлительныеОперации.ВыполнитьВФоне
//
Функция ВыполнитьВФоне(ПараметрыМетода, ИдентификаторФормы) Экспорт
	
	Результат = ИнтеграцияСтатусСамозанятого.ВыполнитьВФоне(ПараметрыМетода, ИдентификаторФормы);
	
	Возврат Результат;
	
КонецФункции

// Возвращает дату не позже текущей даты в часовом поясе "Europe/Moscow"
//
// Параметры:
//  ПроверяемаяДата - Дата
//  ЧасовойПояс - Строка - часовой пояс проверяемой даты
//
// Возвращаемое значение:
//  Дата - возвращает переданную в параметре дату, если она не превышает даты текущего сеанса, в противном случае
//         возвращает дату сеанса. Все даты приводятся к часовому поясу "Europe/Moscow",
//
Функция ДатаНеПозжеТекущейПоЧасовомуПоясуСервиса(ПроверяемаяДата, ЧасовойПояс) Экспорт
	
	ТекущаяДата = ИнтеграцияСтатусСамозанятого.ДатаПоСервисуСтатусаСамозанятого(ТекущаяДатаСеанса(), ЧасовойПоясСеанса());
	ПроверяемаяДата = ИнтеграцияСтатусСамозанятого.ДатаПоСервисуСтатусаСамозанятого(ПроверяемаяДата, ЧасовойПояс);
	
	Если ПроверяемаяДата > ТекущаяДата Тогда
		Возврат ТекущаяДата;
	Иначе
		Возврат ПроверяемаяДата;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОбслуживающуюОрганизациюВФоне(ИдентификаторФормы) Экспорт
	
	Возврат ИнтеграцияСтатусСамозанятого.ПолучитьОбслуживающуюОрганизациюВФоне(ИдентификаторФормы);
	
КонецФункции

Процедура ЗаписатьОшибку(КраткоеПредставлениеОшибки, ПодробноеПредставлениеОшибки = Неопределено) Экспорт
	
	ИнтеграцияСтатусСамозанятого.ЗаписатьОшибку(КраткоеПредставлениеОшибки, ПодробноеПредставлениеОшибки);
	
КонецПроцедуры

Функция ЕстьПравоИспользовать() Экспорт
	
	Возврат ИнтеграцияСтатусСамозанятого.ЕстьПравоИспользовать();
	
КонецФункции

Функция ЕстьПравоПросмотраЖурналаРегистрации() Экспорт
	
	Возврат ИнтеграцияСтатусСамозанятого.ЕстьПравоПросмотраЖурналаРегистрации();
	
КонецФункции

#КонецОбласти