#Область ПрограммныйИнтерфейс

// Вызывается при создании формы источника доходов
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма
//   ОтображатьРеквизитыФизЛица - Булево - Отображать реквизиты физического лица
//
Процедура ИсточникДоходовПриСозданииНаСервере(Форма, ОтображатьРеквизитыФизЛица = Истина) Экспорт
	
	Форма.ЦветВыделенияНекорректногоЗначение = ЦветаСтиля.ЦветВыделенияКонтрагентаСОшибкой;
	
	Если ЗначениеЗаполнено(Форма.ИНН) ИЛИ ЗНачениеЗаполнено(Форма.КПП) Тогда
		ПомощникЗаполнения3НДФЛКлиентСервер.ПроверитьИННКПП(Форма, Истина, Истина);
	КонецЕсли;
	
	ПомощникЗаполнения3НДФЛКлиентСервер.УстановитьВидимостьПолейКонтрагента(Форма, ОтображатьРеквизитыФизЛица);
	
КонецПроцедуры

// Проверяет заполнение реквизитов источника доходов
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма
//   МассивНепроверяемыхРеквизитов - Массив из Строка - Массив непроверяемых реквизитов
//   Отказ - Булево - Отказ
//
Процедура ПроверитьЗаполнениеРеквизитовИсточникаДоходов(Форма, МассивНепроверяемыхРеквизитов, Отказ) Экспорт
	
	Если Форма.ВидКонтрагента = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ФИО");
		
		Если ЗначениеЗаполнено(Форма.КПП)
			И НЕ Форма.ОшибокПоКППнет Тогда
			
			ОбщегоНазначения.СообщитьПользователю(Форма.РезультатПроверкиКПП,, "КПП",, Отказ);
			
		КонецЕсли;
		
	ИначеЕсли Форма.ВидКонтрагента = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Наименование");
		МассивНепроверяемыхРеквизитов.Добавить("КПП");
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("ФИО");
		МассивНепроверяемыхРеквизитов.Добавить("Наименование");
		МассивНепроверяемыхРеквизитов.Добавить("КПП");
	КонецЕсли;
	
	Если МассивНепроверяемыхРеквизитов.Найти("ИНН") = Неопределено 
		И ЗначениеЗаполнено(Форма.ИНН)
		И НЕ Форма.ОшибокПоИННнет Тогда
		
		ОбщегоНазначения.СообщитьПользователю(Форма.РезультатПроверкиИНН,, "ИНН",, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает значения реквизитов формы для настройки распределения вычета по доходам
//
// Параметры:
//   ВыбраннаяФорма - Строка - Редакция формы декларации 3-НДФЛ
//   ДоступныеДоходы - Соответствие из КлючИЗначение
//     * Ключ - ПеречислениеСсылка.ИсточникиДоходовФизическихЛиц
//     * Значение - Число - Сумма доступного доходов
//   ДоходыВычеты - Структура - Структура доходов и вычетов
//   Форма - ФормаКлиентскогоПриложения - Форма
//
// Возвращаемое значение:
//   Структура - см. НовыйНастройкиРаспределенияВычетов()
//
Функция НастройкиРаспределенияВычетов(ВыбраннаяФорма, ДоступныеДоходы = Неопределено, ДоходыВычеты = Неопределено) Экспорт
	
	Результат = НовыйНастройкиРаспределенияВычетов();
	
	Если Не ПомощникЗаполнения3НДФЛКлиентСервер.ВычетыРаспределяютсяПоДоходам(ВыбраннаяФорма) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ТипЗнч(ДоступныеДоходы) = Тип("Соответствие") И ЗначениеЗаполнено(ДоступныеДоходы) Тогда
		
		// Если в переданных параметрах указана настройка распределения суммы вычета по доходам,
		// то необходимо её восстановить
		Если ЗначениеЗаполнено(ДоходыВычеты)
			И ДоходыВычеты.Свойство("ВидДохода")
			И ТипЗнч(ДоходыВычеты.ВидДохода) = Тип("Соответствие") Тогда
			
			СуммаВычетаОстаток = ДоходыВычеты.СуммаВычета;
			
			Для Каждого ТекущийДоход Из ДоходыВычеты.ВидДохода Цикл
				
				ДоступныйДоход = ДоступныеДоходы.Получить(ТекущийДоход.Ключ);
				
				НоваяСтрока = Результат.РаспределениеПоДоходам.Добавить();
				НоваяСтрока.Доход = ТекущийДоход.Ключ;
				НоваяСтрока.НалоговаяБаза = ДоступныйДоход;
				НоваяСтрока.СуммаВычета = ТекущийДоход.Значение;
				Результат.СписокВыбораДохода.Добавить(НоваяСтрока.Доход);
				
				СуммаВычетаОстаток = Макс(СуммаВычетаОстаток - НоваяСтрока.СуммаВычета, 0);
				
			КонецЦикла;
			
			// Добавим доходы, которых не хватает в списке доступных
			Для Каждого ТекущийДоход Из ДоступныеДоходы Цикл
				Если Результат.СписокВыбораДохода.Найти(ТекущийДоход.Ключ) = Неопределено Тогда
					НоваяСтрока = Результат.РаспределениеПоДоходам.Добавить();
					НоваяСтрока.Доход = ТекущийДоход.Ключ;
					НоваяСтрока.НалоговаяБаза = ТекущийДоход.Значение;
					НоваяСтрока.СуммаВычета = Мин(СуммаВычетаОстаток, ТекущийДоход.Значение);
					Результат.СписокВыбораДохода.Добавить(НоваяСтрока.Доход);
					
					СуммаВычетаОстаток = Макс(СуммаВычетаОстаток - НоваяСтрока.СуммаВычета, 0);
				КонецЕсли;
			КонецЦикла;
			
			Отбор = Новый Структура;
			Отбор.Вставить("СуммаВычета", Результат.РаспределениеПоДоходам.Итог("СуммаВычета"));
			СтрокиОтбора = Результат.РаспределениеПоДоходам.НайтиСтроки(Отбор);
			
			Если СтрокиОтбора.Количество() > 0 Тогда
				Результат.ВариантРаспределенияВычета = 0;
				Результат.ВидДохода = СтрокиОтбора[0].Доход;
			Иначе
				Результат.ВидДохода = Результат.СписокВыбораДохода[0];
				Результат.ВариантРаспределенияВычета = 1;
			КонецЕсли;
			
		Иначе
			
			СуммаРаспределить = ?(ЗначениеЗаполнено(ДоходыВычеты), ДоходыВычеты.СуммаВычета, 0);
			
			Для Каждого ТекущийДоход Из ДоступныеДоходы Цикл
				НоваяСтрока = Результат.РаспределениеПоДоходам.Добавить();
				НоваяСтрока.Доход = ТекущийДоход.Ключ;
				НоваяСтрока.НалоговаяБаза = ТекущийДоход.Значение;
				НоваяСтрока.СуммаВычета = Мин(СуммаРаспределить, НоваяСтрока.НалоговаяБаза);
				СуммаРаспределить = Макс(СуммаРаспределить - НоваяСтрока.СуммаВычета, 0);
				Результат.СписокВыбораДохода.Добавить(ТекущийДоход.Ключ);
			КонецЦикла;
			
			Результат.ВидДохода = Результат.СписокВыбораДохода[0];
			
		КонецЕсли;
		
		Результат.СуммаВычета = Результат.РаспределениеПоДоходам.Итог("СуммаВычета");
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Возвращает имя регламентированного отчета для формирования декларации 3-НДФЛ
//
// Параметры:
//   Период - Дата - Дата, на которую формируется декларация 3-НДФЛ
//
// Возвращаемое значение:
//   Строка
//
Функция ИмяРегламентированногоОтчета(Период) Экспорт
	
	Результат = "РегламентированныйОтчет3НДФЛ";
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	ТекущаяДата = ТекущаяДатаСеанса();
	
	НачалоДействияУпрощеннойФормы = ПомощникЗаполнения3НДФЛКлиентСервер.НачалоДействияУпрощеннойФормыДекларации();
	Если ТекущаяДата < НачалоДействияУпрощеннойФормы И Год(Период) >= Год(НачалоДействияУпрощеннойФормы) - 1 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТаблицаФорм = Отчеты.РегламентированныйОтчет3_НДФЛ.ТаблицаФормОтчета();
	Для Каждого ТекущаяСтрока Из ТаблицаФорм Цикл
		Если ТекущаяСтрока.ДатаНачалоДействия <= Период Тогда
			Результат = "РегламентированныйОтчет3_НДФЛ";
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#Область ЗаполнениеДекларации3НДФЛ

// Заполняет параметры отчета показателями Декларации 3-НДФЛ
//
// Параметры:
//   ИДРедакцииОтчета - Строка - идентификатор редакции формы отчета.
//   ПараметрыОтчета  - Структура - структура параметров отчета.
//
Процедура СведенияОПоказателяхОтчета3НДФЛ(ИДРедакцииОтчета, ПараметрыОтчета) Экспорт
	
	Если ПомощникЗаполнения3НДФЛКлиентСервер.УпрощеннаяФормаДекларации(ИДРедакцииОтчета) Тогда
		СведенияОПоказателяхОтчета3НДФЛ2025(ИДРедакцииОтчета, ПараметрыОтчета);
	Иначе
		СведенияОПоказателяхОтчета3НДФЛУстаревшиеРедакции(ИДРедакцииОтчета, ПараметрыОтчета);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет переданную в виде контейнера структуру данными учета для декларации 3-НДФЛ.
//
// Параметры:
//   ИДРедакцииОтчета - Строка - Имя формы декларации 3-НДФЛ.
//   ПараметрыОтчета - Структура - Параметры регламентированного отчета.
//   Контейнер - Структура - Данные регламентированного отчета.
//
Процедура ЗаполнитьОтчет3НДФЛ(ИДРедакцииОтчета, Знач ПараметрыОтчета, Контейнер) Экспорт
	
	Если ПомощникЗаполнения3НДФЛКлиентСервер.УпрощеннаяФормаДекларации(ИДРедакцииОтчета) Тогда
		Заполнить3НДФЛДля2025(ИДРедакцииОтчета, ПараметрыОтчета, Контейнер);
	Иначе
		Заполнить3НДФЛУстаревшиеРедакции(ИДРедакцииОтчета, ПараметрыОтчета, Контейнер);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция КлючиПоказателейДекларации(ВыбраннаяФорма) Экспорт
	
	Если ПомощникЗаполнения3НДФЛКлиентСервер.УпрощеннаяФормаДекларации(ВыбраннаяФорма) Тогда
		Результат = КлючиПоказателейДекларации2025();
	Иначе
		Результат = Отчеты.РегламентированныйОтчет3НДФЛ.КлючиПоказателейДекларации(ВыбраннаяФорма);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеРеглОтчета(СсылкаНаДекларацию) Экспорт
	
	ВыбраннаяФорма = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДекларацию, "ВыбраннаяФорма");
	Если ПомощникЗаполнения3НДФЛКлиентСервер.УпрощеннаяФормаДекларации(ВыбраннаяФорма) Тогда
		Результат = Отчеты.РегламентированныйОтчет3_НДФЛ.ДанныеРеглОтчета(СсылкаНаДекларацию);
	Иначе
		Результат = Отчеты.РегламентированныйОтчет3НДФЛ.ДанныеРеглОтчета(СсылкаНаДекларацию);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РазмерыВычетов(ВыбраннаяФорма, Период = '00010101') Экспорт
	
	Если ПомощникЗаполнения3НДФЛКлиентСервер.УпрощеннаяФормаДекларации(ВыбраннаяФорма) Тогда
		Результат = РазмерыВычетов2025();
	Иначе
		Результат = Отчеты.РегламентированныйОтчет3НДФЛ.РазмерыВычетов(ВыбраннаяФорма, Период);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПределыВычетов(ВыбраннаяФорма, Период = '00010101') Экспорт
	
	Если ПомощникЗаполнения3НДФЛКлиентСервер.УпрощеннаяФормаДекларации(ВыбраннаяФорма) Тогда
		Результат = ПределыВычетов2025(РазмерыВычетов(ВыбраннаяФорма));
	Иначе
		Результат = Отчеты.РегламентированныйОтчет3НДФЛ.ПределыВычетов(ВыбраннаяФорма, Период);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтандартныйВычетНаНалогоплательщика(РазмерыВычетов) Экспорт
	
	ВычетРезультат = Новый Структура;
	
	ДанныеВычета = РазмерыВычетов.СтандартныйВычетНаНалогоплательщика;
	
	ВычетРезультат.Вставить("СтандартныйВычетПо218_1_1",
		ДанныеВычета[Перечисления.СтандартныеВычетыНаНалогоплательщика.ВычетПо218_1_1]);
	
	ВычетРезультат.Вставить("СтандартныйВычетПо218_1_2",
		ДанныеВычета[Перечисления.СтандартныеВычетыНаНалогоплательщика.ВычетПо218_1_2]);
	
	КлючПоляВычетГТО = ПомощникЗаполнения3НДФЛКлиентСервер.КлючПоляВычетГТО();
	ЗначениеВычетаГТО = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РазмерыВычетов, КлючПоляВычетГТО, 0);
	ВычетРезультат.Вставить(КлючПоляВычетГТО, ЗначениеВычетаГТО);
	
	Возврат ВычетРезультат;
	
КонецФункции

Функция ТаблицаФормОтчета(ВыбраннаяФорма) Экспорт
	
	Если ПомощникЗаполнения3НДФЛКлиентСервер.УпрощеннаяФормаДекларации(ВыбраннаяФорма) Тогда
		Результат = Отчеты.РегламентированныйОтчет3_НДФЛ.ТаблицаФормОтчета();
	Иначе
		Результат = Отчеты.РегламентированныйОтчет3НДФЛ.ТаблицаФормОтчета();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроцентПрофессиональногоВычета(ВыбраннаяФорма) Экспорт
	
	Возврат 20;
	
КонецФункции

Функция НеоблагаемыйДоходПоВкладам(ВыбраннаяФорма) Экспорт
	
	Если ПомощникЗаполнения3НДФЛКлиентСервер.УпрощеннаяФормаДекларации(ВыбраннаяФорма)
		Или Отчеты.РегламентированныйОтчет3НДФЛ.ПрименяетсяОсновнаяФорма2022(ВыбраннаяФорма) Тогда
		
		Возврат НеоблагаемыеСуммыДоходов(ВыбраннаяФорма).Вклады;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция НеоблагаемыеСуммыДоходов(ВыбраннаяФорма) Экспорт
	
	НеоблагаемыеСуммыДоходов = Новый Структура;
	НеоблагаемыеСуммыДоходов.Вставить("Подарок",                      4000);
	НеоблагаемыеСуммыДоходов.Вставить("Призы",                        4000);
	НеоблагаемыеСуммыДоходов.Вставить("МатериальнаяПомощьРаботникам", 4000);
	НеоблагаемыеСуммыДоходов.Вставить("ЛекарственныеПрепараты",       4000);
	НеоблагаемыеСуммыДоходов.Вставить("РекламаТоваров",               4000);
	НеоблагаемыеСуммыДоходов.Вставить("МатериальнаяПомощьИнвалидам",  4000);
	НеоблагаемыеСуммыДоходов.Вставить("Лотереи",                      4000);
	НеоблагаемыеСуммыДоходов.Вставить("МатериальнаяПомощьСтудентам",  4000);
	НеоблагаемыеСуммыДоходов.Вставить("ПомощьУчастникамВОВ",          10000);
	НеоблагаемыеСуммыДоходов.Вставить("СтраховыеВзносы",              12000);
	НеоблагаемыеСуммыДоходов.Вставить("Вклады",                     1000000);
	НеоблагаемыеСуммыДоходов.Вставить("ДоляУставногоКапитала",     50000000);
	
	Возврат НеоблагаемыеСуммыДоходов;
	
КонецФункции

Функция КодыИсточниковДоходов(ВыбраннаяФорма) Экспорт
	
	КодыИсточниковДоходов = Новый Структура;
	КодыИсточниковДоходов.Вставить("ДоходРФ", "1");
	КодыИсточниковДоходов.Вставить("ДоходЗаПределамиРФ", "2");
	
	Возврат КодыИсточниковДоходов;
	
КонецФункции

Функция КодыВидовДоговоровДобровольныхВзносов(ВыбраннаяФорма) Экспорт
	
	Если ПомощникЗаполнения3НДФЛКлиентСервер.УпрощеннаяФормаДекларации(ВыбраннаяФорма) Тогда
		Результат = КодыВидовДоговоровДобровольныхВзносов2025();
	Иначе
		Результат = Отчеты.РегламентированныйОтчет3НДФЛ.КодыВидовДоговоровДобровольныхВзносов(ВыбраннаяФорма);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает признаки оснований заявления вычета по инвестиционному вычету
//
// Параметры:
//   ВыбраннаяФорма - Строка - Идентификатор редакции формы декларации
//
// Возвращаемое значение:
//   Структура:
//     * ПополнениеСчета - Строка - Код признака основания заявления вычета по инвестиционному вычету
//     * ДоходыПоОперациям - Строка - Код признака основания заявления вычета по инвестиционному вычету,
//   Неопределено - Если не удалось определить коды признаков оснований заявления вычета по инвестиционному вычету
//
Функция ПризнакиОснованийЗаявленияВычетаПоИИС(ВыбраннаяФорма) Экспорт
	
	Если ПомощникЗаполнения3НДФЛКлиентСервер.УпрощеннаяФормаДекларации(ВыбраннаяФорма) Тогда
		Результат = Новый Структура;
		Результат.Вставить("ПополнениеСчета", "1");
		Результат.Вставить("ДоходыПоОперациям", "2");
	Иначе
		Результат = Отчеты.РегламентированныйОтчет3НДФЛ.ПризнакиОснованийЗаявленияВычетаПоИИС(ВыбраннаяФорма);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьКлючПоказателя(ИмяКлюча, АдресКлючейПоказателей) Экспорт
	
	Если Не ЭтоАдресВременногоХранилища(АдресКлючейПоказателей) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТаблицаКлючей = ПолучитьИзВременногоХранилища(АдресКлючейПоказателей);
	Если ТипЗнч(ТаблицаКлючей) <> Тип("ТаблицаЗначений") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ТаблицаКлючей.Найти(ИмяКлюча, "Ключ") <> Неопределено;
	
КонецФункции

Функция ВидыДоходов(ВыбраннаяФорма) Экспорт
	
	Если ПомощникЗаполнения3НДФЛКлиентСервер.УпрощеннаяФормаДекларации(ВыбраннаяФорма) Тогда
		Результат = КодыВидовДоходов2025();
	Иначе
		Результат = Отчеты.РегламентированныйОтчет3НДФЛ.ВидыДоходов(ВыбраннаяФорма);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КодыВидовПредпринимательскойДеятельности(ВыбраннаяФорма) Экспорт
	
	Если ПомощникЗаполнения3НДФЛКлиентСервер.УпрощеннаяФормаДекларации(ВыбраннаяФорма) Тогда
		Результат = КодыВидовПредпринимательскойДеятельности2025();
	Иначе
		Результат = Отчеты.РегламентированныйОтчет3НДФЛ.КодыВидовПредпринимательскойДеятельности(ВыбраннаяФорма);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВидыДоходовДляСтандартныхСоциальныхИмущественногоВычетов(ВыбраннаяФорма) Экспорт
	
	Если ПомощникЗаполнения3НДФЛКлиентСервер.УпрощеннаяФормаДекларации(ВыбраннаяФорма) Тогда
		Результат = ВидыДоходовДляСтандартныхСоциальныхИмущественногоВычетов2025();
	Иначе
		Результат = Отчеты.РегламентированныйОтчет3НДФЛ.КодыВидовДоходаДляСтандартныхСоциальныхИмущественногоВычетов(ВыбраннаяФорма);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КодыПризнакаНалогоплательщикаДляИмущественногоВычета(ВыбраннаяФорма) Экспорт
	
	Если ПомощникЗаполнения3НДФЛКлиентСервер.УпрощеннаяФормаДекларации(ВыбраннаяФорма) Тогда
		Результат = КодыПризнакаНалогоплательщикаДляИмущественногоВычета2025();
	Иначе
		Результат = Отчеты.РегламентированныйОтчет3НДФЛ.КодыПризнакаНалогоплательщикаДляИмущественногоВычета(ВыбраннаяФорма);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КодыНаименованияОбъектаНедвижимости(ВыбраннаяФорма) Экспорт
	
	Если ПомощникЗаполнения3НДФЛКлиентСервер.УпрощеннаяФормаДекларации(ВыбраннаяФорма) Тогда
		Результат = КодыНаименованияОбъектаНедвижимости2025();
	Иначе
		Результат = Отчеты.РегламентированныйОтчет3НДФЛ.КодыНаименованияОбъектаНедвижимости(ВыбраннаяФорма);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КодОбъектаНедвижимости(ОбъектНедвижимости, ВыбраннаяФорма) Экспорт
	
	КодыОбъектаНедвижимости = КодыНаименованияОбъектаНедвижимости(ВыбраннаяФорма);
	Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(КодыОбъектаНедвижимости, ОбъектНедвижимости, "");
	
КонецФункции

Функция СпособыПриобретенияНедвижимости(ВыбраннаяФорма) Экспорт
	
	СпособыПриобретения = Новый Структура;
	СпособыПриобретения.Вставить("НовоеСтроительство", "1");
	СпособыПриобретения.Вставить("Приобретение", "2");
	
	Возврат СпособыПриобретения;
	
КонецФункции

Функция ГодНачалаДействияВычетаУбыткиПрошлыхЛетПоЦеннымБумагам(ВидСчета) Экспорт
	
	Если ВидСчета = ВидыИнвестиционныхСчетов().ИндивидуальныйИнвестиционныйСчет Тогда
		Возврат 2015;
	Иначе
		Возврат 2010;
	КонецЕсли;
	
КонецФункции

Функция ВидыИнвестиционныхСчетов() Экспорт
	
	ВидыСчетов = Новый Структура;
	ВидыСчетов.Вставить("ИндивидуальныйИнвестиционныйСчет", "ИндивидуальныйИнвестиционныйСчет");
	ВидыСчетов.Вставить("ПрочиеСчета", "ПрочиеСчета");
	
	Возврат ВидыСчетов;
	
КонецФункции

Функция КодыВидовОперацийСЦеннымиБумагами(ВыбраннаяФорма) Экспорт
	
	Если ПомощникЗаполнения3НДФЛКлиентСервер.УпрощеннаяФормаДекларации(ВыбраннаяФорма) Тогда
		Результат = КодыВидовОперацийСЦеннымиБумагами2025();
	Иначе
		Результат = Отчеты.РегламентированныйОтчет3НДФЛ.КодыВидовОперацийСЦеннымиБумагами(ВыбраннаяФорма);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПризнакиУчетаУбытковПоЦеннымБумагам(ВыбраннаяФорма3НДФЛ) Экспорт
	
	ПризнакиУчетаУбытков = Новый Структура;
	ПризнакиУчетаУбытков.Вставить("УбытокНеУчитывается", "0");
	ПризнакиУчетаУбытков.Вставить("УбытокУчитывается", "1");
	
	Возврат ПризнакиУчетаУбытков;
	
КонецФункции

Функция ПризнакиУплатыВозврата(ВыбраннаяФорма) Экспорт
	
	ПризнакУплатыВозврата = Новый Структура;
	ПризнакУплатыВозврата.Вставить("Уплата", "1");
	ПризнакУплатыВозврата.Вставить("Возврат", "2");
	ПризнакУплатыВозврата.Вставить("ОтсутствиеУплатыВозврата", "3");
	
	Возврат ПризнакУплатыВозврата;
	
КонецФункции

Функция СредиПриложенийЕстьЗаявлениеНаВозвратНалога(ВыбраннаяФорма) Экспорт
	
	РеквизитыФормы = ТаблицаФормОтчета(ВыбраннаяФорма).Найти(ВыбраннаяФорма, "ФормаОтчета");
	Если РеквизитыФормы = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат РеквизитыФормы.ДатаНачалоДействия >= '20200101';
	
КонецФункции

Функция МожноНеУказыватьНаименованиеИсточникаДохода(ВыбраннаяФорма) Экспорт
	
	РеквизитыФормы = ТаблицаФормОтчета(ВыбраннаяФорма).Найти(ВыбраннаяФорма, "ФормаОтчета");
	Если РеквизитыФормы = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат РеквизитыФормы.ДатаНачалоДействия >= '20180101';
	
КонецФункции

Функция НоваяТаблицаДанныхЗаполнения(ВыбраннаяФорма) Экспорт
	
	Если ПомощникЗаполнения3НДФЛКлиентСервер.УпрощеннаяФормаДекларации(ВыбраннаяФорма) Тогда
		Результат = НоваяТаблицаДанныхЗаполнения2025();
	Иначе
		Результат = Отчеты.РегламентированныйОтчет3НДФЛ.НоваяТаблицаДанныхЗаполнения(ВыбраннаяФорма);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НалоговыеСтавки(ВыбраннаяФорма) Экспорт
	
	Если ПомощникЗаполнения3НДФЛКлиентСервер.УпрощеннаяФормаДекларации(ВыбраннаяФорма) Тогда
		Результат = НалоговыеСтавки2025();
	Иначе
		Результат = Отчеты.РегламентированныйОтчет3НДФЛ.НалоговыеСтавки(ВыбраннаяФорма);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КодГруппыДохода(КодВидаДохода, ВыбраннаяФорма) Экспорт
	
	ЗначениеПоУмолчанию = "";
	
	Если ПомощникЗаполнения3НДФЛКлиентСервер.УпрощеннаяФормаДекларации(ВыбраннаяФорма) Тогда
		КодыВидовДоходов = КодыГруппДоходов2025();
		КодГруппыДохода = КодыВидовДоходов.Получить(КодВидаДохода);
		Возврат ?(ЗначениеЗаполнено(КодГруппыДохода), КодГруппыДохода, ЗначениеПоУмолчанию);
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
КонецФункции

Функция КБКПоВидуДохода(ВидНалога, ПериодСобытия, КодВидаДоходов = "") Экспорт
	
	Налог = Справочники.ВидыНалоговИПлатежейВБюджет.НалогПоВиду(ВидНалога, , ПериодСобытия, КодВидаДоходов);
	Возврат Справочники.ВидыНалоговИПлатежейВБюджет.КБК(Налог, , ПериодСобытия);
	
КонецФункции

Функция ТекстПодсказкиЗаполнениеПомощникаВСледующихВерсиях(Период) Экспорт
	
	Возврат СтрШаблон(
		НСтр("ru = 'Заполнение декларации за %1 год будет реализовано в будущих версиях программы. Заполните декларацию вручную через 1С-Отчетность - Отчеты - %2'"),
		Формат(Период, "ДФ=yyyy"),
		Метаданные.Отчеты[ИмяРегламентированногоОтчета(Период)].Представление())
	
КонецФункции

Функция КБК(ВыбраннаяФорма) Экспорт
	
	Если ПомощникЗаполнения3НДФЛКлиентСервер.УпрощеннаяФормаДекларации(ВыбраннаяФорма) Тогда
		Результат = КБК2025();
	Иначе
		Результат = Отчеты.РегламентированныйОтчет3НДФЛ.КБК(ВыбраннаяФорма);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КодыВидовДоходовЦенныеБумаги(ВыбраннаяФорма) Экспорт
	
	Если ПомощникЗаполнения3НДФЛКлиентСервер.УпрощеннаяФормаДекларации(ВыбраннаяФорма) Тогда
		Результат = КодыВидовДоходовЦенныеБумаги2025();
	Иначе
		Результат = КодыВидовДоходовЦенныеБумагиУстаревшейРедакции();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеНалоговойБазы(ГруппаДоходов, НалоговаяСтавка) Экспорт
	
	ФиксированныеПредставления = Новый Соответствие;
	ФиксированныеПредставления.Вставить("01", НСтр("ru = 'Налог по прогрессивной шкале'"));
	ФиксированныеПредставления.Вставить("02", НСтр("ru = 'Налог с продажи имущества'"));
	ФиксированныеПредставления.Вставить("03", НСтр("ru = 'Налог с зарплаты в особых условиях'"));
	
	Результат = ФиксированныеПредставления.Получить(ГруппаДоходов);
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = СтрШаблон(НСтр("ru = 'Налог по ставке %1%%'"), НалоговаяСтавка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоПрибыльКИК(ВидДохода) Экспорт
	
	ВидыПрибылиКИК = Новый Массив;
	ВидыПрибылиКИК.Добавить(Перечисления.ИсточникиДоходовФизическихЛиц.ПрибыльКИК);
	ВидыПрибылиКИК.Добавить(Перечисления.ИсточникиДоходовФизическихЛиц.ПрибыльКИК_ИСБОЮЛ);
	ВидыПрибылиКИК.Добавить(Перечисления.ИсточникиДоходовФизическихЛиц.ФиксированнаяПрибыльКИК);
	
	Возврат ВидыПрибылиКИК.Найти(ВидДохода) <> Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыеКлючиПоказателейДекларации()
	
	КлючиПоказателей = Новый ТаблицаЗначений;
	КлючиПоказателей.Колонки.Добавить("Ключ", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	КлючиПоказателей.Колонки.Добавить("ИмяСтраницы", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	КлючиПоказателей.Колонки.Добавить("ИмяПоля", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	КлючиПоказателей.Колонки.Добавить("ИмяПоказателя", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	КлючиПоказателей.Колонки.Добавить("МногостраничныйРаздел", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	КлючиПоказателей.Колонки.Добавить("МногострочныйРаздел", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	КлючиПоказателей.Колонки.Добавить("ОбщееПолеМногострочногоРаздела", Новый ОписаниеТипов("Булево"));
	
	КлючиПоказателей.Индексы.Добавить("Ключ");
	КлючиПоказателей.Индексы.Добавить("ИмяПоля");
	
	Возврат КлючиПоказателей;
	
КонецФункции

Процедура ДобавитьКлючПоказателя(Ключ, ИмяСтраницы, ИмяПоля, СвойстваРазделовДекларации, КлючиПоказателей, ОбщееПолеМногострочногоРаздела = Ложь)
	
	СвойствоРаздела = СвойстваРазделовДекларации.Строки.Найти(ИмяСтраницы, "ИмяСтраницы");
	Если СвойствоРаздела = Неопределено Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не найден раздел декларации ""%1""'"), ИмяСтраницы);
	КонецЕсли;
	
	Если КлючиПоказателей.Найти(Ключ, "Ключ") <> Неопределено Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Дубль ключа показателя ""%1""'"), Ключ);
	КонецЕсли;
	
	НоваяСтрока = КлючиПоказателей.Добавить();
	НоваяСтрока.Ключ = Ключ;
	НоваяСтрока.ИмяСтраницы = ИмяСтраницы;
	НоваяСтрока.ИмяПоля = ИмяПоля;
	Если СвойствоРаздела.МногострочностьВРазделе.Количество() <> 0 И Не ОбщееПолеМногострочногоРаздела Тогда
		НоваяСтрока.МногострочныйРаздел = ИмяМногострочногоРаздела(ИмяПоля, СвойствоРаздела.МногострочностьВРазделе);
	КонецЕсли;
	НоваяСтрока.ОбщееПолеМногострочногоРаздела = ОбщееПолеМногострочногоРаздела;
	
КонецПроцедуры

Функция СвойстваРазделовДекларации()
	
	ИдентификаторыМногострочныхГрупп = ИдентификаторыМногострочныхГрупп();
	
	СвойстваРазделовДекларации = НовыйСвойстваРазделовДекларации();
	
	СвойстваРаздела = СвойстваРазделовДекларации.Строки.Добавить();
	СвойстваРаздела.ИмяСтраницы = "Титульный";
	СвойстваРаздела.ПредставлениеДанных = Истина;
	
	СвойстваРаздела = СвойстваРазделовДекларации.Строки.Добавить();
	СвойстваРаздела.ИмяСтраницы = "Раздел1";
	СвойстваРаздела.СохранятьМногострКакТЗ = Истина;
	СвойстваРаздела.МногостраничностьВРазделе = Истина;
	СвойстваРаздела.МаксКолвоЭкз = 999;
	СвойстваРаздела.ОчищатьРаздел = Истина;
	СвойстваРаздела.ПредставлениеДанных = Истина;
	СвойстваРаздела.ПоказыватьИтогиТолькоНаПоследнейСтранице = Ложь;
	
	СвойстваРаздела.МногострочностьВРазделе = НовыйМногострочностьВРазделе();
	НовСтр = СвойстваРаздела.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = ИдентификаторыМногострочныхГрупп[ИмяРаздела(1, 1)];
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 8;
	НовСтр.МаксимальноеКоличествоСтрокНаСтранице = 2;
	
	НовСтр = СвойстваРаздела.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = ИдентификаторыМногострочныхГрупп[ИмяРаздела(1, 2)];
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 8;
	НовСтр.МаксимальноеКоличествоСтрокНаСтранице = 1;
	
	СвойстваРаздела = СвойстваРазделовДекларации.Строки.Добавить();
	СвойстваРаздела.ИмяСтраницы = "Раздел1Приложение";
	СвойстваРаздела.ОчищатьРаздел = Истина;
	
	СвойстваРаздела = СвойстваРазделовДекларации.Строки.Добавить();
	СвойстваРаздела.ИмяСтраницы = "Раздел2";
	СвойстваРаздела.МногостраничностьВРазделе = Истина;
	СвойстваРаздела.МаксКолвоЭкз = 9;
	СвойстваРаздела.ОчищатьРаздел = Истина;
	СвойстваРаздела.ПредставлениеДанных = Истина;

	СвойстваРаздела = СвойстваРазделовДекларации.Строки.Добавить();
	СвойстваРаздела.ИмяСтраницы = "Приложение1";
	СвойстваРаздела.СохранятьМногострКакТЗ = Истина;
	СвойстваРаздела.МногостраничностьВРазделе = Истина;
	СвойстваРаздела.МаксКолвоЭкз = 999;
	СвойстваРаздела.ОчищатьРаздел = Истина;
	СвойстваРаздела.ПредставлениеДанных = Истина;
	СвойстваРаздела.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Истина;

	СвойстваРаздела.МногострочностьВРазделе = НовыйМногострочностьВРазделе();
	НовСтр = СвойстваРаздела.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = ИдентификаторыМногострочныхГрупп[ИмяПриложения(1)];
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 12;
	НовСтр.МаксимальноеКоличествоСтрокНаСтранице = 3;
	
	СвойстваРаздела = СвойстваРазделовДекларации.Строки.Добавить();
	СвойстваРаздела.ИмяСтраницы = "Приложение1Расчет";
	СвойстваРаздела.СохранятьМногострКакТЗ = Истина;
	СвойстваРаздела.МногостраничностьВРазделе = Истина;
	СвойстваРаздела.МаксКолвоЭкз = 999;
	СвойстваРаздела.ОчищатьРаздел = Истина;
	СвойстваРаздела.ПредставлениеДанных = Истина;
	СвойстваРаздела.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Истина;
	
	СвойстваРаздела.МногострочностьВРазделе = НовыйМногострочностьВРазделе();
	НовСтр = СвойстваРаздела.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = ИдентификаторыМногострочныхГрупп[ИмяРасчетаКПриложению(1, 1)];
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 9;
	НовСтр.МаксимальноеКоличествоСтрокНаСтранице = 4;
	
	НовСтр = СвойстваРаздела.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = ИдентификаторыМногострочныхГрупп[ИмяРасчетаКПриложению(1, 2)];
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 9;
	НовСтр.МаксимальноеКоличествоСтрокНаСтранице = 4;
	
	НовСтр = СвойстваРаздела.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = ИдентификаторыМногострочныхГрупп[ИмяРасчетаКПриложению(1, 3)];
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 9;
	НовСтр.МаксимальноеКоличествоСтрокНаСтранице = 4;
	
	СвойстваРаздела = СвойстваРазделовДекларации.Строки.Добавить();
	СвойстваРаздела.ИмяСтраницы = "Приложение2";
	СвойстваРаздела.МногостраничностьВРазделе = Истина;
	СвойстваРаздела.МаксКолвоЭкз = 999;
	СвойстваРаздела.ОчищатьРаздел = Истина;
	СвойстваРаздела.ПредставлениеДанных = Истина;
	
	СвойстваРаздела = СвойстваРазделовДекларации.Строки.Добавить();
	СвойстваРаздела.ИмяСтраницы = "Приложение3";
	СвойстваРаздела.МногостраничностьВРазделе = Истина;
	СвойстваРаздела.МаксКолвоЭкз = 999;
	СвойстваРаздела.ОчищатьРаздел = Истина;
	СвойстваРаздела.ПредставлениеДанных = Истина;
	СвойстваРаздела.РазделЯвляетсяАвтозаполняемым = Истина;
	СвойстваРаздела.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Истина;
	СвойстваРаздела.ПоказыватьИтогиТолькоНаПоследнейСтранице = Истина;
	
	СвойстваРаздела.МногострочностьВРазделе = НовыйМногострочностьВРазделе();
	НовСтр = СвойстваРаздела.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = ИдентификаторыМногострочныхГрупп[ИмяРасчетаКПриложению(3)];
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 9;
	НовСтр.МаксимальноеКоличествоСтрокНаСтранице = 4;
	
	СвойстваРаздела = СвойстваРазделовДекларации.Строки.Добавить();
	СвойстваРаздела.ИмяСтраницы = "Приложение3Продолжение";
	СвойстваРаздела.МногостраничностьВРазделе = Истина;
	СвойстваРаздела.МаксКолвоЭкз = 1;
	СвойстваРаздела.ОчищатьРаздел = Истина;
	СвойстваРаздела.ПредставлениеДанных = Истина;
	СвойстваРаздела.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Истина;
	
	СвойстваРаздела = СвойстваРазделовДекларации.Строки.Добавить();
	СвойстваРаздела.ИмяСтраницы = "Приложение4";
	СвойстваРаздела.ОчищатьРаздел = Истина;
	
	СвойстваРаздела = СвойстваРазделовДекларации.Строки.Добавить();
	СвойстваРаздела.ИмяСтраницы = "Приложение5";
	СвойстваРаздела.ОчищатьРаздел = Истина;
	
	СвойстваРаздела = СвойстваРазделовДекларации.Строки.Добавить();
	СвойстваРаздела.ИмяСтраницы = "Приложение5Продолжение";
	СвойстваРаздела.ОчищатьРаздел = Истина;

	СвойстваРаздела = СвойстваРазделовДекларации.Строки.Добавить();
	СвойстваРаздела.ИмяСтраницы = "Приложение5Расчет";
	СвойстваРаздела.МногостраничностьВРазделе = Истина;
	СвойстваРаздела.МаксКолвоЭкз = 999;
	СвойстваРаздела.ОчищатьРаздел = Истина;
	СвойстваРаздела.ПредставлениеДанных = Истина;
	СвойстваРаздела.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Истина;
	
	СвойстваРаздела.МногострочностьВРазделе = НовыйМногострочностьВРазделе();
	НовСтр = СвойстваРаздела.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = ИдентификаторыМногострочныхГрупп[ИмяРасчетаКПриложению(5, 1)];
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 12;
	НовСтр.МаксимальноеКоличествоСтрокНаСтранице = 3;
	
	НовСтр = СвойстваРаздела.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = ИдентификаторыМногострочныхГрупп[ИмяРасчетаКПриложению(5, 2)];
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 12;
	НовСтр.МаксимальноеКоличествоСтрокНаСтранице = 3;
	
	СвойстваРаздела = СвойстваРазделовДекларации.Строки.Добавить();
	СвойстваРаздела.ИмяСтраницы = "Приложение6";
	СвойстваРаздела.ОчищатьРаздел = Истина;
	
	СвойстваРаздела = СвойстваРазделовДекларации.Строки.Добавить();
	СвойстваРаздела.ИмяСтраницы = "Приложение7";
	СвойстваРаздела.МногостраничностьВРазделе = Истина;
	СвойстваРаздела.МаксКолвоЭкз = 999;
	СвойстваРаздела.ОчищатьРаздел = Истина;
	СвойстваРаздела.ПредставлениеДанных = Истина;
	СвойстваРаздела.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Истина;
	СвойстваРаздела.ПоказыватьИтогиТолькоНаПоследнейСтранице = Истина;
	
	СвойстваРаздела.МногострочностьВРазделе = НовыйМногострочностьВРазделе();
	НовСтр = СвойстваРаздела.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = ИдентификаторыМногострочныхГрупп[ИмяПриложения(7)];
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 12;
	НовСтр.МаксимальноеКоличествоСтрокНаСтранице = 3;
	
	СвойстваРаздела = СвойстваРазделовДекларации.Строки.Добавить();
	СвойстваРаздела.ИмяСтраницы = "Приложение8";
	СвойстваРаздела.СохранятьМногострКакТЗ = Истина;
	СвойстваРаздела.МногостраничностьВРазделе = Истина;
	СвойстваРаздела.МаксКолвоЭкз = 999;
	СвойстваРаздела.ОчищатьРаздел = Истина;
	СвойстваРаздела.ПредставлениеДанных = Истина;
	СвойстваРаздела.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Истина;
	
	СвойстваРаздела.МногострочностьВРазделе = НовыйМногострочностьВРазделе();
	НовСтр = СвойстваРаздела.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = ИдентификаторыМногострочныхГрупп[ИмяПриложения(8)];
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 12;
	НовСтр.МаксимальноеКоличествоСтрокНаСтранице = 3;
	
	Возврат СвойстваРазделовДекларации;
	
КонецФункции

Функция НовыйСвойстваРазделовДекларации()
	
	СвойстваРазделовДекларации = Новый ДеревоЗначений;
	СвойстваРазделовДекларации.Колонки.Добавить("ИмяСтраницы", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	СвойстваРазделовДекларации.Колонки.Добавить("МногострочностьВРазделе", Новый ОписаниеТипов("ТаблицаЗначений"));
	СвойстваРазделовДекларации.Колонки.Добавить("СохранятьМногострКакТЗ", Новый ОписаниеТипов("Булево"));
	СвойстваРазделовДекларации.Колонки.Добавить("МногостраничностьВРазделе", Новый ОписаниеТипов("Булево"));
	СвойстваРазделовДекларации.Колонки.Добавить("ОчищатьРаздел", Новый ОписаниеТипов("Булево"));
	СвойстваРазделовДекларации.Колонки.Добавить("ИмяПредставления", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	СвойстваРазделовДекларации.Колонки.Добавить("ПредставлениеДанных", Новый ОписаниеТипов("Булево"));
	СвойстваРазделовДекларации.Колонки.Добавить("РазделОбязателенДляВыгрузки", Новый ОписаниеТипов("Булево"));
	СвойстваРазделовДекларации.Колонки.Добавить("РазделЯвляетсяАвтозаполняемым", Новый ОписаниеТипов("Булево"));
	СвойстваРазделовДекларации.Колонки.Добавить("МаксКолвоЭкз", ОбщегоНазначения.ОписаниеТипаЧисло(3, 0));
	СвойстваРазделовДекларации.Колонки.Добавить("ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста", Новый ОписаниеТипов("Булево"));
	СвойстваРазделовДекларации.Колонки.Добавить("ПоказыватьИтогиТолькоНаПоследнейСтранице", Новый ОписаниеТипов("Булево"));
	
	Возврат СвойстваРазделовДекларации;
	
КонецФункции

Функция НовыйМногострочностьВРазделе()
	
	МногострочностьВРазделе = Новый ТаблицаЗначений;
	МногострочностьВРазделе.Колонки.Добавить("ИдГруппы", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	МногострочностьВРазделе.Колонки.Добавить("Область", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	МногострочностьВРазделе.Колонки.Добавить("ВысотаСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0));
	МногострочностьВРазделе.Колонки.Добавить("НезаполняемыеПоказателиЕсть", Новый ОписаниеТипов("Булево"));
	МногострочностьВРазделе.Колонки.Добавить("МаксимальноеКоличествоСтрокНаСтранице", ОбщегоНазначения.ОписаниеТипаЧисло(1, 0));

	Возврат МногострочностьВРазделе;
	
КонецФункции

Функция ИдентификаторыМногострочныхГрупп()
	
	ИдентификаторыМногострочных = Новый Структура;
	ИдентификаторыМногострочных.Вставить(ИмяРаздела(1, 1), "П00001М1");
	ИдентификаторыМногострочных.Вставить(ИмяРаздела(1, 2), "П00001М2");
	ИдентификаторыМногострочных.Вставить(ИмяПриложения(1), "П000П1М1");
	ИдентификаторыМногострочных.Вставить(ИмяРасчетаКПриложению(1, 1), "П00П1РМ1");
	ИдентификаторыМногострочных.Вставить(ИмяРасчетаКПриложению(1, 2), "П00П1РМ2");
	ИдентификаторыМногострочных.Вставить(ИмяРасчетаКПриложению(1, 3), "П00П1РМ3");
	ИдентификаторыМногострочных.Вставить(ИмяРасчетаКПриложению(3), "П000П3М1");
	ИдентификаторыМногострочных.Вставить(ИмяРасчетаКПриложению(5, 1), "П00П5РМ1");
	ИдентификаторыМногострочных.Вставить(ИмяРасчетаКПриложению(5, 2), "П00П5РМ2");
	ИдентификаторыМногострочных.Вставить(ИмяПриложения(7), "П000П7М1");
	ИдентификаторыМногострочных.Вставить(ИмяПриложения(8), "П000П8М1");
	
	Возврат ИдентификаторыМногострочных;
	
КонецФункции

Функция ИмяРаздела(НомерРаздела, НомерПункта = 0)
	
	Если ЗначениеЗаполнено(НомерПункта) Тогда
		Возврат СтрШаблон("Раздел%1_%2", НомерРаздела, НомерПункта);
	Иначе
		Возврат СтрШаблон("Раздел%1", НомерРаздела);
	КонецЕсли;
	
КонецФункции

Функция ИмяПриложения(НомерПриложения)
	
	Возврат СтрШаблон("Приложение%1", НомерПриложения);
	
КонецФункции

Функция ИмяРасчетаКПриложению(НомерПриложения, НомерПункта = 0)
	
	Если ЗначениеЗаполнено(НомерПункта) Тогда
		Возврат СтрШаблон("Приложение%1Расчет%2", НомерПриложения, НомерПункта);
	Иначе
		Возврат СтрШаблон("Приложение%1Расчет", НомерПриложения);
	КонецЕсли;
	
КонецФункции

// Возвращает структуру с настройками распределения вычетов по доходам.
//
// Возвращаемое значение:
//  Структура:
//   * ВариантРаспределенияВычета - Число - 0 - не распределяется, 1 - распределяется по доходам, 2 - распределяется по видам доходов.
//   * ВидДохода - ПеречислениеСсылка.ИсточникиДоходовФизическихЛиц - вид дохода, по которому распределяется вычет.
//   * СуммаВычета - Число - сумма вычета, которую необходимо распределить.
//   * РаспределениеПоДоходам - ТаблицаЗначений - таблица с распределением вычета по доходам
//   * СписокВыбораДохода - Массив из ПеречислениеСсылка.ИсточникиДоходовФизическихЛиц - список доходов, которые можно выбрать для распределения вычета.
//
Функция НовыйНастройкиРаспределенияВычетов()
	
	Результат = Новый Структура;
	Результат.Вставить("ВариантРаспределенияВычета", 0);
	Результат.Вставить("ВидДохода",  Перечисления.ИсточникиДоходовФизическихЛиц.ПустаяСсылка());
	Результат.Вставить("СуммаВычета", 0);
	Результат.Вставить("РаспределениеПоДоходам", Новый ТаблицаЗначений());
	Результат.Вставить("СписокВыбораДохода", Новый Массив);
	
	ТипЧисло = ОбщегоНазначения.ОписаниеТипаЧисло(15, 2);
	Результат.РаспределениеПоДоходам.Колонки.Добавить("Доход", Новый ОписаниеТипов("ПеречислениеСсылка.ИсточникиДоходовФизическихЛиц"));
	Результат.РаспределениеПоДоходам.Колонки.Добавить("НалоговаяБаза", ТипЧисло);
	Результат.РаспределениеПоДоходам.Колонки.Добавить("СуммаВычета", ТипЧисло);
	
	Возврат Результат;
	
КонецФункции

Функция ИмяМногострочногоРаздела(ИмяПоля, МногострочныеРазделы)
	
	Если МногострочныеРазделы.Количество() = 1 Тогда
		Возврат МногострочныеРазделы[0].ИдГруппы;
	КонецЕсли;
	
	Для Каждого ТекущийРаздел Из МногострочныеРазделы Цикл
		Если СтрНайти(ИмяПоля, ТекущийРаздел.ИдГруппы) > 0 Тогда
			Возврат ТекущийРаздел.ИдГруппы;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

Функция КлючПоляДоходы(ИмяПериода)
	
	Возврат СтрШаблон("ДоходыИП%1", ИмяПериода);
	
КонецФункции

Функция КлючПоляПрофВычет(ИмяПериода)
	
	Возврат СтрШаблон("ПрофВычетИП%1", ИмяПериода);
	
КонецФункции

Функция КлючПоляСтандартныйВычет(ИмяПериода)
	
	Возврат СтрШаблон("СтандартныйВычетИП%1", ИмяПериода);
	
КонецФункции

Функция КлючПоляНалоговаяБаза(ИмяПериода)
	
	Возврат СтрШаблон("НалоговаяБазаИП%1", ИмяПериода);
	
КонецФункции

Функция КлючПоляАвансовыйПлатеж(ИмяПериода)
	
	Возврат СтрШаблон("АвансовыйПлатежИП%1", ИмяПериода);
	
КонецФункции

Функция МассивИменПериодов()
	
	Результат = Новый Массив;
	Результат.Добавить("1Квартал"); // ДоходыИП1Квартал
	Результат.Добавить("Полугодие"); // ДоходыИППолугодие
	Результат.Добавить("9Месяцев"); // ДоходыИП9Месяцев
	
	Возврат Результат;
	
КонецФункции

#Область ЗаполнениеДекларации

Процедура Заполнить3НДФЛДля2025(ВыбраннаяФорма, ПараметрыОтчета, Контейнер)
	
	КлючиПоказателей = КлючиПоказателейДекларации(ВыбраннаяФорма);
	Если КлючиПоказателей = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючПоказателя = КлючиПоказателей.Найти("КодВидаДеятельностиИП", "Ключ");
	Если КлючПоказателя <> Неопределено Тогда
		ИмяРаздела = КлючПоказателя.ИмяСтраницы;
	Иначе
		ВызватьИсключение НСтр("ru = 'Не определен раздел для заполнения'");
	КонецЕсли;
	
	Если ДекларацияЗаполненаПоДаннымПомощника(ПараметрыОтчета, КлючиПоказателей, Контейнер) Тогда
		ПоместитьВоВременноеХранилище(Новый Структура("Контейнер", Контейнер), ПараметрыОтчета.АдресВоВременномХранилище);
		Возврат;
	КонецЕсли;
	
	// Заполняем декларацию данными учета по умолчанию доходом от предпринимательской деятельности
	
	ЗаполнитьТитульныйЛистДекларации(ПараметрыОтчета, Контейнер);
	
	ТаблицаСуммНалога = Новый ТаблицаЗначений;
	ТаблицаСуммНалога.Колонки.Добавить("Период", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаСуммНалога.Колонки.Добавить("КБК", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаСуммНалога.Колонки.Добавить("Сумма", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ТаблицаСуммНалога.Колонки.Добавить("ПредставлениеПериода", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	
	ПравилоУплаты = РегистрыСведений.ЗадачиБухгалтера.ПорядокУплатыНалогаЗаПериод(
		ПараметрыОтчета.Организация,
		Перечисления.ВидыНалогов.НДФЛ_ИП,
		НачалоГода(ПараметрыОтчета.ДатаНачалаПериодаОтчета));
	
	ПараметрыНалоговойБазы = Новый Структура;
	ПараметрыНалоговойБазы.Вставить("ВыбраннаяФорма", ВыбраннаяФорма);
	ПараметрыНалоговойБазы.Вставить("ТаблицаСуммНалога", ТаблицаСуммНалога);
	ПараметрыНалоговойБазы.Вставить("ПравилоУплаты", ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПравилоУплаты, "Правило"));
	
	ЗаполняемыеПоказатели = Новый Структура;
	СведенияОПоказателяхОтчета3НДФЛ(ВыбраннаяФорма, ЗаполняемыеПоказатели);
	ЗаполнитьПоказателиАвансовыхПлатежей(ПараметрыОтчета, ПараметрыНалоговойБазы, Контейнер, КлючиПоказателей);
	
	// Код вида деятельности
	КодыВидовДеятельности = КодыВидовПредпринимательскойДеятельности(ВыбраннаяФорма);
	КодВидаДеятельности = КодыВидовДеятельности.ПредпринимательскаяДеятельность;
	ПараметрыКУДИР = Новый Структура;
	ПараметрыКУДИР.Вставить("Организация", ПараметрыОтчета.Организация);
	ПараметрыКУДИР.Вставить("мДатаНачалаПериодаОтчета", ПараметрыОтчета.ДатаНачалаПериодаОтчета);
	ПараметрыКУДИР.Вставить("мДатаКонцаПериодаОтчета", ПараметрыОтчета.ДатаКонцаПериодаОтчета);
	ПараметрыКУДИР.Вставить("УникальныйИдентификаторФормы");
	
	ДоходыРасходы = УчетДоходовИРасходовПредпринимателя.ДоходыРасходыПоВидамДеятельности(ПараметрыКУДИР);
	РазделДекларации = Контейнер[ИмяРаздела];
	ОчиститьРазделДекларации(РазделДекларации, ЗаполняемыеПоказатели, ДоходыРасходы.Количество());
	
	КлючиРаздела = КлючиПоказателей.Скопировать(Новый Структура("ИмяСтраницы, ОбщееПолеМногострочногоРаздела", ИмяРаздела, Ложь));
	ОбщиеИтоги = КлючиПоказателей.Скопировать(Новый Структура("ИмяСтраницы, ОбщееПолеМногострочногоРаздела", ИмяРаздела, Истина));
	
	СтраховыеВзносы = УчетДоходовИРасходовПредпринимателя.РасходыНаУплатуСтраховыхВзносовЗаТекущийПериод(
		ПараметрыОтчета.Организация,
		ПараметрыОтчета.ДатаКонцаПериодаОтчета);
	
	Для Индекс = 0 По ДоходыРасходы.Количество() - 1 Цикл
		
		Если Индекс = 0 Тогда
			// Первая строка всегда есть в контейнере - просто заполняем её данными
			НоваяСтрока = РазделДекларации.Строки[Индекс];
		Иначе
			// Остальные строки создаем по шаблону первой
			НоваяСтрока = РазделДекларации.Строки.Добавить();
			НоваяСтрока.Данные = ШаблонДанныхРаздела(РазделДекларации.Строки[0].Данные, ЗаполняемыеПоказатели);
			НоваяСтрока.ДанныеМногострочныхЧастей = ШаблонДанныхМногострочныхЧастей(
				РазделДекларации.Строки[0].ДанныеМногострочныхЧастей,
				ЗаполняемыеПоказатели);
		КонецЕсли;
		
		ПараметрыЗаполнения = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ДоходыРасходы[Индекс]);
		ПараметрыЗаполнения.Вставить("КодВидаДеятельности", КодВидаДеятельности);
		// Страховые взносы ИП включаются в КУДИР в прочие расходы, в декларации же они выделены в отдельное поле
		ПараметрыЗаполнения.Вставить("СтраховыеВзносы", Мин(СтраховыеВзносы, ПараметрыЗаполнения.ПрочиеРасходы));
		ПараметрыЗаполнения.ПрочиеРасходы = ПараметрыЗаполнения.ПрочиеРасходы - СтраховыеВзносы;
		
		ЗаполнитьПредпринимательскуюДеятельностьДекларации(
			НоваяСтрока.ДанныеМногострочныхЧастей,
			КлючиРаздела,
			ПараметрыЗаполнения);
		
		ЗаполнитьОбщиеИтогиПредпринимательскойДеятельности(
			РазделДекларации.Строки[Индекс].Данные,
			ОбщиеИтоги,
			ДоходыРасходы[Индекс]);
		
		СтраховыеВзносы = Макс(0, СтраховыеВзносы - ПараметрыЗаполнения.СтраховыеВзносы);
		
	КонецЦикла;
	
	АвансовыеПлатежи = УчетНДФЛПредпринимателя.УплаченныйНалогЗаПериод(ПараметрыОтчета.Организация,
		ПараметрыОтчета.ДатаНачалаПериодаОтчета,
		ПараметрыОтчета.ДатаКонцаПериодаОтчета);
	
	ЗаполнитьПоказательЛистаДекларации("СуммаУплаченныхАвансовыхПлатежейИП",
		АвансовыеПлатежи,
		РазделДекларации.Строки[0].Данные,
		ОбщиеИтоги);
	
	ПараметрыНалоговойБазы.Вставить("КодГруппыДохода", КодГруппыДохода(КодыВидовДоходов2025().ПредпринимательскаяДеятельность, ВыбраннаяФорма));
	
	ЗаполнитьНалоговуюБазуПредпринимательскойДеятельности(
		ПараметрыОтчета,
		ПараметрыНалоговойБазы,
		Контейнер,
		КлючиПоказателей);
	
	ЗаполнитьСуммыКУплатеВозврату(ПараметрыОтчета, Контейнер, КлючиПоказателей, ПараметрыНалоговойБазы.ТаблицаСуммНалога);
	
	ПоместитьВоВременноеХранилище(Новый Структура("Контейнер", Контейнер), ПараметрыОтчета.АдресВоВременномХранилище);
	
КонецПроцедуры

Процедура ОчиститьРазделДекларации(РазделДекларации, ЗаполняемыеПоказатели, Знач КоличествоЛистов = 1)
	
	Если РазделДекларации.Строки.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Контейнер раздела не инициализирован'");
	КонецЕсли;
	
	Если КоличествоЛистов = 0 Тогда
		// Всегда есть одна строка в разделе
		КоличествоЛистов = 1;
	КонецЕсли;
	
	ШаблонЛистаДанных = ШаблонДанныхРаздела(РазделДекларации.Строки[0].Данные, ЗаполняемыеПоказатели);
	ШаблонМногострочныхДанных = ШаблонДанныхМногострочныхЧастей(РазделДекларации.Строки[0].ДанныеМногострочныхЧастей, ЗаполняемыеПоказатели);
	
	РазделДекларации.Строки.Очистить();
	Для НомерЛиста = 1 По КоличествоЛистов Цикл
		НоваяСтрока = РазделДекларации.Строки.Добавить();
		НоваяСтрока.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ШаблонЛистаДанных);
		НоваяСтрока.ДанныеМногострочныхЧастей = ОбщегоНазначения.СкопироватьРекурсивно(ШаблонМногострочныхДанных);
	КонецЦикла;
	
КонецПроцедуры

Функция ШаблонДанныхРаздела(ДанныеРаздела, ЗаполняемыеПоказатели = Неопределено)
	
	Результат = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеРаздела);
	Для Каждого Показатель Из Результат Цикл
		Если ЗаполняемыеПоказатели = Неопределено Или ЗаполняемыеПоказатели.Свойство(Показатель.Ключ) Тогда
			ТипПоказателя = ТипЗнч(Показатель.Значение);
			Результат[Показатель.Ключ] = ОбщегоНазначенияБПКлиентСервер.ПустоеЗначениеТипа(ТипПоказателя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ШаблонДанныхМногострочныхЧастей(ДанныеМногострочныхЧастей, ЗаполняемыеПоказатели = Неопределено)
	
	Результат = Новый Структура;
	Для Каждого МногострочнаяЧасть Из ДанныеМногострочныхЧастей Цикл
		ТипПоказателя = ТипЗнч(МногострочнаяЧасть.Значение);
		Если ТипПоказателя = Тип("ДеревоЗначений") Тогда
			ШаблонДереваЗначений = ОбщегоНазначения.СкопироватьРекурсивно(МногострочнаяЧасть.Значение);
			ОчиститьРазделДекларации(ШаблонДереваЗначений, ЗаполняемыеПоказатели);
			Результат.Вставить(МногострочнаяЧасть.Ключ, ШаблонДереваЗначений);
		Иначе
			Результат.Вставить(МногострочнаяЧасть.Ключ, ШаблонДанныхРаздела(МногострочнаяЧасть.Значение, ЗаполняемыеПоказатели));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСведенияОПоказателеОтчета3НДФЛ(ИмяПоказателя, ПоказателиОтчета, КлючиПоказателей)
	
	Если КлючиПоказателей = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючПоказателя = КлючиПоказателей.Найти(ИмяПоказателя, "Ключ");
	Если КлючПоказателя <> Неопределено Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(
			ПоказателиОтчета,
			КлючПоказателя.ИмяПоля,
			Истина,
			Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоказательЛистаДекларации(ИмяПоказателя, Значение, ПоказателиЛиста, КлючиПоказателей)
	
	КлючПоказателя = КлючиПоказателей.Найти(ИмяПоказателя, "Ключ");
	Если КлючПоказателя = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючПоказателя.МногострочныйРаздел)
		И ПоказателиЛиста.Свойство(КлючПоказателя.МногострочныйРаздел) Тогда
		
		ПоказателиЛиста[КлючПоказателя.МногострочныйРаздел].Строки[0].Данные[КлючПоказателя.ИмяПоля] = Значение;
	Иначе
		ПоказателиЛиста[КлючПоказателя.ИмяПоля] = Значение;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПредпринимательскуюДеятельностьДекларации(ПоказателиЛиста, КлючиПоказателей, Параметры)
	
	ЗаполнитьПоказательЛистаДекларации("КодВидаДеятельностиИП", Параметры.КодВидаДеятельности, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("СуммаДоходаИП", Параметры.ИтогоДоходов, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("СуммаРасходовИП", Параметры.ИтогоРасходов, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("МатериальныеРасходыИП", Параметры.МатериальныеРасходы, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("АмортизацияИП", Параметры.Амортизация, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("ЗарплатаИП", Параметры.РасходыНаОплатуТруда, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("ПрочиеРасходыИП", Параметры.ПрочиеРасходы, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("СтраховыеВзносыИП", Параметры.СтраховыеВзносы, ПоказателиЛиста, КлючиПоказателей);
	
КонецПроцедуры

Процедура ЗаполнитьОбщиеИтогиПредпринимательскойДеятельности(ПоказателиЛиста, КлючиПоказателей, ДоходыРасходы)
	
	ЗаполнитьПоказательЛистаДекларации("ОбщаяСуммаДоходаИП", ДоходыРасходы.ИтогоДоходов, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("ОбщаяСуммаВычетаИП", ДоходыРасходы.ИтогоРасходов, ПоказателиЛиста, КлючиПоказателей);
	
КонецПроцедуры

Процедура ЗаполнитьПоказателиАвансовыхПлатежей(ПараметрыОтчета, ПараметрыАвансов, Контейнер, КлючиПоказателей)
	
	РазделДекларации = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Контейнер, "Приложение3Продолжение");
	
	Если Не ЗначениеЗаполнено(РазделДекларации) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполняемыеПоказатели = Новый Структура;
	
	// Расчет к приложению 3 заполняется нарастающим итогом.
	// Поэтому подготовим имена периодов и будем запрашивать данные последовательно.
	МассивИменПериодов = МассивИменПериодов();
	
	Для Каждого ИмяПериода Из МассивИменПериодов Цикл
		ДобавитьСведенияОПоказателеОтчета3НДФЛ(КлючПоляДоходы(ИмяПериода), ЗаполняемыеПоказатели, КлючиПоказателей);
		ДобавитьСведенияОПоказателеОтчета3НДФЛ(КлючПоляПрофВычет(ИмяПериода), ЗаполняемыеПоказатели, КлючиПоказателей);
		ДобавитьСведенияОПоказателеОтчета3НДФЛ(КлючПоляСтандартныйВычет(ИмяПериода), ЗаполняемыеПоказатели, КлючиПоказателей);
		ДобавитьСведенияОПоказателеОтчета3НДФЛ(КлючПоляНалоговаяБаза(ИмяПериода), ЗаполняемыеПоказатели, КлючиПоказателей);
		ДобавитьСведенияОПоказателеОтчета3НДФЛ(КлючПоляАвансовыйПлатеж(ИмяПериода), ЗаполняемыеПоказатели, КлючиПоказателей);
	КонецЦикла;
	
	ОчиститьРазделДекларации(РазделДекларации, ЗаполняемыеПоказатели);
	ПоказателиЛиста = РазделДекларации.Строки[0].Данные;
	
	НомерПериода = 1;
	СтандартныйВычетНаДетейВсего = 0;
	СтандартныйВычетНаНалогоплательщикаВсего = 0;
	
	Для Каждого ИмяПериода Из МассивИменПериодов Цикл
		
		КоличествоМесяцевПериода = 3 * НомерПериода;
		ПериодСобытия = ДобавитьМесяц(ПараметрыОтчета.ДатаНачалаПериодаОтчета, КоличествоМесяцевПериода) - 1;
		Показатели = Обработки.ПомощникЗаполнения3НДФЛ.НачальныеПоказатели(ПараметрыОтчета.Организация, ПериодСобытия);
		
		СтандартныйВычетНаДетейВсего = Показатели.СтандартныйВычетНаДетей;
		СтандартныйВычетНаНалогоплательщикаВсего = Показатели.СтандартныйВычетНаНалогоплательщика;
		
		Доходы = Окр(Показатели.Доходы + Показатели.ПрочиеДоходы + Показатели.АвансыПокупателей, 0);
		СтандартныйВычет = Окр(СтандартныйВычетНаДетейВсего + СтандартныйВычетНаНалогоплательщикаВсего, 0);
		ПрофессиональныйВычет = Окр(Показатели.ПрофессиональныйВычет, 0);
		НалоговаяБаза = Макс(0, Окр(Показатели.НалоговаяБаза, 0));
		НалогИсчисленныйВсего = Макс(0, Показатели.НалогИсчисленныйВсего);
		
		ЗаполнитьПоказательЛистаДекларации(КлючПоляДоходы(ИмяПериода), Доходы, ПоказателиЛиста, КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации(КлючПоляПрофВычет(ИмяПериода), ПрофессиональныйВычет, ПоказателиЛиста, КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации(КлючПоляСтандартныйВычет(ИмяПериода), СтандартныйВычет, ПоказателиЛиста, КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации(КлючПоляНалоговаяБаза(ИмяПериода), НалоговаяБаза, ПоказателиЛиста, КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации(КлючПоляАвансовыйПлатеж(ИмяПериода), НалогИсчисленныйВсего, ПоказателиЛиста, КлючиПоказателей);
		
		ДобавитьСуммыУплатыНалога(ПараметрыАвансов.ТаблицаСуммНалога,
			ПараметрыОтчета.Организация,
			ПериодСобытия,
			ИмяПериода,
			Показатели,
			ПараметрыАвансов.ПравилоУплаты);
		
		НомерПериода = НомерПериода + 1;
		
	КонецЦикла;
	
	ПараметрыВычета = Новый Структура;
	ПараметрыВычета.Вставить("СуммаВычета", СтандартныйВычетНаДетейВсего + СтандартныйВычетНаНалогоплательщикаВсего);
	ПараметрыВычета.Вставить("ВычетНаДетей", СтандартныйВычетНаДетейВсего);
	ПараметрыВычета.Вставить("ВыбраннаяФорма", ПараметрыАвансов.ВыбраннаяФорма);
	
	ЗаполнитьСтандартныйВычетВРазделДекларации(ПараметрыОтчета, ПараметрыВычета, Контейнер, КлючиПоказателей);
	
КонецПроцедуры

Процедура ЗаполнитьСтандартныйВычетВРазделДекларации(ПараметрыОтчета, ДанныеВычета, Контейнер, КлючиПоказателей)
	
	// Заполним Приложение 5 в части стандартных вычетов, которые учтены при расчете НДФЛ ИП
	РазделСтандартныеВычеты = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Контейнер, "Приложение5");
	
	Если Не ЗначениеЗаполнено(РазделСтандартныеВычеты) Тогда
		Возврат;
	КонецЕсли;
	
	ПоказателиЛиста = РазделСтандартныеВычеты.Строки[0].Данные;
	КлючПоляВычетГТО = ПомощникЗаполнения3НДФЛКлиентСервер.КлючПоляВычетГТО();
	
	ПоказателиСтандартныхВычетов = Новый Структура;
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("СтандартныйВычетПо218_1_1", ПоказателиСтандартныхВычетов, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("СтандартныйВычетПо218_1_2", ПоказателиСтандартныхВычетов, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ(КлючПоляВычетГТО, ПоказателиСтандартныхВычетов, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("СтандартныйВычетНаДетей", ПоказателиСтандартныхВычетов, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("СтандартныйВычетНаДетейЕдинственномуРодителю", ПоказателиСтандартныхВычетов, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("СтандартныйВычетНаДетейИнвалидов", ПоказателиСтандартныхВычетов, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("СтандартныйВычетНаДетейИнвалидовЕдинственномуРодителю", ПоказателиСтандартныхВычетов, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("ОбщаяСуммаСтандартныхВычетов", ПоказателиСтандартныхВычетов, КлючиПоказателей);
	
	ОчиститьРазделДекларации(РазделСтандартныеВычеты, ПоказателиСтандартныхВычетов);
	
	ПараметрыВычета = УчетНДФЛПредпринимателя.НовыйПараметрыВычета();
	ПараметрыВычета.Организация = ПараметрыОтчета.Организация;
	ПараметрыВычета.ВыбраннаяФорма = ДанныеВычета.ВыбраннаяФорма;
	ПараметрыВычета.ИмяОбъектаМетаданных = "РегистрСведений.ИПСтандартныеВычетыНаНалогоплательщика";
	ПараметрыВычета.НачалоПериода = ПараметрыОтчета.ДатаНачалаПериодаОтчета;
	ПараметрыВычета.КонецПериода = ПараметрыОтчета.ДатаКонцаПериодаОтчета;
	ПараметрыВычета.КоличествоМесяцев = 12;
	
	ДанныеВычетаНаНалогоплательщика = УчетНДФЛПредпринимателя.ДанныеВычетаПоМесяцамЗаПериод(ПараметрыВычета);
	СуммаВычетаПо218_1_1 = 0;
	СуммаВычетаПо218_1_2 = 0;
	СданыНормыГТО = Ложь;
	СуммаВычетаГТО = 0;
	
	Для Каждого ТекущаяСтрока Из ДанныеВычетаНаНалогоплательщика Цикл
		Если ТекущаяСтрока.ВидВычета = Перечисления.СтандартныеВычетыНаНалогоплательщика.ВычетПо218_1_1 Тогда
			СуммаВычетаПо218_1_1 = СуммаВычетаПо218_1_1 + ТекущаяСтрока.СуммаВычета;
		Иначе
			СуммаВычетаПо218_1_2 = СуммаВычетаПо218_1_2 + ТекущаяСтрока.СуммаВычета;
		КонецЕсли;
		Если ТекущаяСтрока.СданыНормыГТО Тогда
			СданыНормыГТО = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если СданыНормыГТО Тогда
		СуммаВычетаГТО = ПределыВычетов(ДанныеВычета.ВыбраннаяФорма)[КлючПоляВычетГТО];
		ЗаполнитьПоказательЛистаДекларации(КлючПоляВычетГТО, СуммаВычетаГТО, ПоказателиЛиста, КлючиПоказателей);
	КонецЕсли;
	
	ЗаполнитьПоказательЛистаДекларации("СтандартныйВычетПо218_1_1", СуммаВычетаПо218_1_1, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("СтандартныйВычетПо218_1_2", СуммаВычетаПо218_1_2, ПоказателиЛиста, КлючиПоказателей);
	
	ПараметрыВычета.ИмяОбъектаМетаданных = "РегистрСведений.ИПСтандартныеВычетыНаДетей";
	ДанныеВычетаНаДетей = УчетНДФЛПредпринимателя.ДанныеВычетаПоМесяцамЗаПериод(ПараметрыВычета);
	СтандартныйВычетНаДетей = 0;
	СтандартныйВычетНаДетейИнвалидов = 0;
	СтандартныйВычетНаДетейИнвалидовЕдинственномуРодителю = 0;
	СтандартныйВычетНаДетейЕдинственномуРодителю = 0;
	
	Для Каждого ТекущаяСтрока Из ДанныеВычетаНаДетей Цикл
		
		ЕстьДетиИнвалиды = (ТекущаяСтрока.РодныеДетиИнвалиды <> 0 Или ТекущаяСтрока.ПриемныеДетиИнвалиды <> 0);
		Если ЕстьДетиИнвалиды И ТекущаяСтрока.ПрименяетсяДвойнойВычет Тогда
			СтандартныйВычетНаДетейИнвалидовЕдинственномуРодителю = СтандартныйВычетНаДетейИнвалидовЕдинственномуРодителю + ТекущаяСтрока.СуммаВычета;
		ИначеЕсли ЕстьДетиИнвалиды Тогда
			СтандартныйВычетНаДетейИнвалидов = СтандартныйВычетНаДетейИнвалидов + ТекущаяСтрока.СуммаВычета;
		ИначеЕсли ТекущаяСтрока.ПрименяетсяДвойнойВычет Тогда
			СтандартныйВычетНаДетейЕдинственномуРодителю = СтандартныйВычетНаДетейЕдинственномуРодителю + ТекущаяСтрока.СуммаВычета;
		Иначе
			СтандартныйВычетНаДетей = СтандартныйВычетНаДетей + ТекущаяСтрока.СуммаВычета;
		КонецЕсли;
		
	КонецЦикла;
	
	СтандартныйВычетНаДетейИнвалидовЕдинственномуРодителю = Мин(ДанныеВычета.ВычетНаДетей,
		СтандартныйВычетНаДетейИнвалидовЕдинственномуРодителю);
	
	СтандартныйВычетНаДетейИнвалидов = Мин(ДанныеВычета.ВычетНаДетей,
		СтандартныйВычетНаДетейИнвалидов - СтандартныйВычетНаДетейИнвалидовЕдинственномуРодителю);
	
	СтандартныйВычетНаДетейЕдинственномуРодителю = Мин(ДанныеВычета.ВычетНаДетей,
		СтандартныйВычетНаДетейЕдинственномуРодителю
		- СтандартныйВычетНаДетейИнвалидовЕдинственномуРодителю
		- СтандартныйВычетНаДетейИнвалидов);
	
	СтандартныйВычетНаДетей = Мин(ДанныеВычета.ВычетНаДетей,
		СтандартныйВычетНаДетей
		- СтандартныйВычетНаДетейИнвалидовЕдинственномуРодителю
		- СтандартныйВычетНаДетейИнвалидов
		- СтандартныйВычетНаДетейЕдинственномуРодителю);
	
	ЗаполнитьПоказательЛистаДекларации("СтандартныйВычетНаДетей",
		СтандартныйВычетНаДетей,
		ПоказателиЛиста,
		КлючиПоказателей);
	
	ЗаполнитьПоказательЛистаДекларации("СтандартныйВычетНаДетейЕдинственномуРодителю",
		СтандартныйВычетНаДетейЕдинственномуРодителю,
		ПоказателиЛиста,
		КлючиПоказателей);
	
	ЗаполнитьПоказательЛистаДекларации("СтандартныйВычетНаДетейИнвалидов",
		СтандартныйВычетНаДетейИнвалидов,
		ПоказателиЛиста,
		КлючиПоказателей);
	
	ЗаполнитьПоказательЛистаДекларации("СтандартныйВычетНаДетейИнвалидовЕдинственномуРодителю",
		СтандартныйВычетНаДетейИнвалидовЕдинственномуРодителю,
		ПоказателиЛиста,
		КлючиПоказателей);
	
	ЗаполнитьПоказательЛистаДекларации("ОбщаяСуммаСтандартныхВычетов",
		ДанныеВычета.СуммаВычета,
		ПоказателиЛиста,
		КлючиПоказателей);
	
	ЗаполнитьПоказательЛистаДекларации("ОбщаяСуммаСтандартныхСоциальныхВычетов",
		ДанныеВычета.СуммаВычета,
		ПоказателиЛиста,
		КлючиПоказателей);
	
	ЗаполнитьЗначенияСвойств(РазделСтандартныеВычеты.Строки[0].Данные, ПоказателиЛиста);
	
КонецПроцедуры

Процедура ЗаполнитьНалоговуюБазуПредпринимательскойДеятельности(ПараметрыОтчета, ПараметрыНалоговойБазы, Контейнер, КлючиПоказателей)
	
	// Заполним Раздел 2 в части налоговой базы предпринимателя
	
	РазделДекларации = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Контейнер, "Раздел2");
	
	Если Не ЗначениеЗаполнено(РазделДекларации) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполняемыеПоказатели = Новый Структура;
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("ГруппаДоходов", ЗаполняемыеПоказатели, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("ОбщаяСуммаДоходов", ЗаполняемыеПоказатели, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("ОбщаяСуммаДоходовПодлежащаяНалогообложению", ЗаполняемыеПоказатели, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("СуммаНалоговыхВычетов", ЗаполняемыеПоказатели, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("НалоговаяБаза", ЗаполняемыеПоказатели, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("СуммаНалогаИсчисленная", ЗаполняемыеПоказатели, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("СуммаНалогаПодлежащаяУплате", ЗаполняемыеПоказатели, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("СуммаНалогаПодлежащаяВозврату", ЗаполняемыеПоказатели, КлючиПоказателей);
	
	ОчиститьРазделДекларации(РазделДекларации, ЗаполняемыеПоказатели);
	ПоказателиЛиста = РазделДекларации.Строки[0].Данные;
	
	Показатели = Обработки.ПомощникЗаполнения3НДФЛ.НачальныеПоказатели(
		ПараметрыОтчета.Организация,
		ПараметрыОтчета.ДатаКонцаПериодаОтчета);
	
	ОбщаяСуммаДоходов = Показатели.Доходы + Показатели.АвансыПокупателей + Показатели.ПрочиеДоходы;
	
	// Сумма налоговых вычетов не может быть больше суммы, подлежащей налогооболожению
	СуммаНалоговыхВычетов = Мин(ОбщаяСуммаДоходов, Показатели.ПрофессиональныйВычет
		+ Показатели.СтандартныйВычетНаДетей
		+ Показатели.СтандартныйВычетНаНалогоплательщика);
	
	ЗаполнитьПоказательЛистаДекларации("ГруппаДоходов", ПараметрыНалоговойБазы.КодГруппыДохода, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("ОбщаяСуммаДоходов", ОбщаяСуммаДоходов, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("ОбщаяСуммаДоходовПодлежащаяНалогообложению", ОбщаяСуммаДоходов, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("СуммаНалоговыхВычетов", СуммаНалоговыхВычетов, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("НалоговаяБаза", Показатели.НалоговаяБаза, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("СуммаНалогаИсчисленная", Показатели.НалогИсчисленныйВсего, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("СуммаНалогаПодлежащаяУплате", Показатели.НалогИсчисленныйВсего, ПоказателиЛиста, КлючиПоказателей);
	
	ДобавитьСуммыУплатыНалога(ПараметрыНалоговойБазы.ТаблицаСуммНалога,
		ПараметрыОтчета.Организация,
		ПараметрыОтчета.ДатаКонцаПериодаОтчета,
		"Год",
		Показатели,
		ПараметрыНалоговойБазы.ПравилоУплаты);
	
	Переплата = Показатели.НалогИсчисленныйВсего - Показатели.АвансовыеПлатежи;
	ЗаполнитьЗаявлениеОПереплатеНДФЛ(ПараметрыОтчета, Контейнер, КлючиПоказателей, -Переплата);
	
КонецПроцедуры

Процедура ЗаполнитьСуммыКУплатеВозврату(ПараметрыОтчета, Контейнер, КлючиПоказателей, СуммыНалога)
	
	// Заполним Раздел 1 в части сумм к уплате или возврату для предпринимателя
	ИмяРаздела = "Раздел1";
	РазделДекларации = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Контейнер, ИмяРаздела);
	
	Если Не ЗначениеЗаполнено(РазделДекларации) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполняемыеПоказатели = Новый Структура;
	КлючиРаздела = КлючиПоказателей.НайтиСтроки(Новый Структура("ИмяСтраницы", ИмяРаздела));
	Для Каждого ТекущаяСтрока Из КлючиРаздела Цикл
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ЗаполняемыеПоказатели, ТекущаяСтрока.ИмяПоля, Истина, Ложь);
	КонецЦикла;
	
	ОчиститьРазделДекларации(РазделДекларации, ЗаполняемыеПоказатели);
	
	СуммыНалога.Сортировать("КБК, Период");
	ПредыдущийКБК = "";
	ПоказателиЛиста = Неопределено;
	Конец1Квартала = КонецКвартала(НачалоГода(ПараметрыОтчета.ДатаНачалаПериодаОтчета));
	ПоказательСтроки = "КБКИП";
	
	ОКТМОИП1Квартал = Справочники.Организации.КодПоОКТМОНаДату(ПараметрыОтчета.Организация, Конец1Квартала);
	ОКТМОИППолугодие = Справочники.Организации.КодПоОКТМОНаДату(ПараметрыОтчета.Организация, ДобавитьМесяц(Конец1Квартала, 3));
	ОКТМОИП9Месяцев = Справочники.Организации.КодПоОКТМОНаДату(ПараметрыОтчета.Организация, ДобавитьМесяц(Конец1Квартала, 6));
	ОКТМОИПГод = Справочники.Организации.КодПоОКТМОНаДату(ПараметрыОтчета.Организация, ПараметрыОтчета.ДатаКонцаПериодаОтчета);
	
	Если Не ЗначениеЗаполнено(СуммыНалога) Тогда
		
		// Если по предпринимательской деятельности нет сумм к уплате, то заполняем в Разделе 1 пункт 2 нулевыми суммами
		КлючПоказателя = КлючиПоказателей.Найти(ПоказательСтроки, "Ключ");
		Если КлючПоказателя = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		КБК = КБКПоВидуДохода(Перечисления.ВидыНалогов.НДФЛ_ИП,
			ПараметрыОтчета.ДатаНачалаПериодаОтчета,
			Справочники.ВидыНалоговИПлатежейВБюджет.КодВидаДоходаНДФЛПредпринимателя13());
		
		ПоказателиЛиста = РазделДекларации.Строки[0].ДанныеМногострочныхЧастей[КлючПоказателя.МногострочныйРаздел].Строки[0].Данные;
		
		ЗаполнитьПоказательЛистаДекларации(ПоказательСтроки, КБК, ПоказателиЛиста, КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации("ОКТМОИП1Квартал", ОКТМОИП1Квартал, ПоказателиЛиста, КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации("ОКТМОИППолугодие", ОКТМОИППолугодие, ПоказателиЛиста, КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации("ОКТМОИП9Месяцев", ОКТМОИП9Месяцев, ПоказателиЛиста, КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации("ОКТМОИПГод", ОКТМОИПГод, ПоказателиЛиста, КлючиПоказателей);
		Возврат;
		
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из СуммыНалога Цикл
		
		Если ТекущаяСтрока.КБК <> ПредыдущийКБК Тогда
			
			КлючПоказателя = КлючиПоказателей.Найти(ПоказательСтроки, "Ключ");
			Если КлючПоказателя = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ПерваяСтрока = РазделДекларации.Строки[0].ДанныеМногострочныхЧастей[КлючПоказателя.МногострочныйРаздел].Строки[0];
			
			Если Не ЗначениеЗаполнено(ПерваяСтрока.Данные[КлючПоказателя.ИмяПоля]) Тогда
				ПоказателиЛиста = ПерваяСтрока.Данные;
			Иначе
				НоваяСтрока = РазделДекларации.Строки[0].ДанныеМногострочныхЧастей[КлючПоказателя.МногострочныйРаздел].Строки.Добавить();
				НоваяСтрока.Данные = ШаблонДанныхРаздела(ПерваяСтрока.Данные, ЗаполняемыеПоказатели);
				НоваяСтрока.ДанныеМногострочныхЧастей = ШаблонДанныхМногострочныхЧастей(ПерваяСтрока.ДанныеМногострочныхЧастей, ЗаполняемыеПоказатели);
				ПоказателиЛиста = НоваяСтрока.Данные;
			КонецЕсли;
			
			ЗаполнитьПоказательЛистаДекларации(ПоказательСтроки, ТекущаяСтрока.КБК, ПоказателиЛиста, КлючиПоказателей);
			ПредыдущийКБК = ТекущаяСтрока.КБК;
			
		КонецЕсли;
		
		ЗаполнитьПоказательЛистаДекларации("ОКТМОИП1Квартал", ОКТМОИП1Квартал, ПоказателиЛиста, КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации("ОКТМОИППолугодие", ОКТМОИППолугодие, ПоказателиЛиста, КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации("ОКТМОИП9Месяцев", ОКТМОИП9Месяцев, ПоказателиЛиста, КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации("ОКТМОИПГод", ОКТМОИПГод, ПоказателиЛиста, КлючиПоказателей);
		
		Если ПоказателиЛиста <> Неопределено Тогда
			
			Если ТекущаяСтрока.Сумма < 0 Тогда
				ЗаполнитьПоказательЛистаДекларации(СтрШаблон("СуммаНалогаИПКУменьшению%1", ТекущаяСтрока.ПредставлениеПериода),
					-ТекущаяСтрока.Сумма,
					ПоказателиЛиста,
					КлючиПоказателей);
			Иначе
				ЗаполнитьПоказательЛистаДекларации(СтрШаблон("СуммаНалогаИПКУплате%1", ТекущаяСтрока.ПредставлениеПериода),
					ТекущаяСтрока.Сумма,
					ПоказателиЛиста,
					КлючиПоказателей);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТитульныйЛистДекларации(ПараметрыОтчета, Контейнер)
	
	// Заполним Титульный лист декларации
	
	РазделДекларации = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Контейнер, "Титульный");
	
	Если Не ЗначениеЗаполнено(РазделДекларации) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполняемыеПоказатели = Новый Структура;
	ЗаполняемыеПоказатели.Вставить("Фамилия", "ФамилияИП");
	ЗаполняемыеПоказатели.Вставить("Имя", "ИмяИП");
	ЗаполняемыеПоказатели.Вставить("Отчество", "ОтчествоИП");
	ЗаполняемыеПоказатели.Вставить("СерияИНомерДокумента", "%1 %2");
	ЗаполняемыеПоказатели.Вставить("НомерТелефона", "ТелОрганизации");
	ЗаполняемыеПоказатели.Вставить("НалоговыйОрган", "КодНО");
	ЗаполняемыеПоказатели.Вставить("КодСтраны", "Гражд");
	ЗаполняемыеПоказатели.Вставить("ИНН", "ИННФЛ");
	
	РеквизитыОрганизации = Новый Массив;
	РеквизитыОрганизации.Добавить("СерияУдЛичн");
	РеквизитыОрганизации.Добавить("НомерУдЛичн");
	Для Каждого ТекущийПараметр Из ЗаполняемыеПоказатели Цикл
		Если ТекущийПараметр.Ключ = "СерияИНомерДокумента" Тогда
			Продолжить;
		КонецЕсли;
		РеквизитыОрганизации.Добавить(ТекущийПараметр.Значение);
	КонецЦикла;
	
	СведенияОбОрганизации = РегламентированнаяОтчетностьПереопределяемый.ПолучитьСведенияОбОрганизации(
		ПараметрыОтчета.Организация,
		ПараметрыОтчета.ДатаНачалаПериодаОтчета,
		РеквизитыОрганизации);
	
	Для Каждого ТекущийПараметр Из ЗаполняемыеПоказатели Цикл
		
		Если Не РазделДекларации.Свойство(ТекущийПараметр.Ключ) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущийПараметр.Ключ = "СерияИНомерДокумента" Тогда
			РазделДекларации[ТекущийПараметр.Ключ] = СтрШаблон(ТекущийПараметр.Значение,
				СведенияОбОрганизации.СерияУдЛичн,
				СведенияОбОрганизации.НомерУдЛичн);
		Иначе
			РазделДекларации[ТекущийПараметр.Ключ] = СведенияОбОрганизации[ТекущийПараметр.Значение];
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСуммыУплатыНалога(Результат, Организация, ПериодСобытия, ИмяПериода, Показатели, Правило)
	
	ПараметрыВыполнения = Обработки.ПомощникЗаполнения3НДФЛ.НовыйПараметрыФормированияДокументовОплаты();
	ПараметрыВыполнения.Организация = Организация;
	ПараметрыВыполнения.СпособОплаты = Перечисления.СпособыУплатыНалогов.БанковскийПеревод;
	ПараметрыВыполнения.Правило = Правило;
	ПараметрыВыполнения.Период = ПериодСобытия;
	ПараметрыВыполнения.НалогИсчисленныйВсего = Показатели.НалогИсчисленныйВсего;
	ПараметрыВыполнения.АвансовыеПлатежи = Показатели.АвансовыеПлатежи;
	ПараметрыВыполнения.НалогКУплате = Показатели.НалогКУплате;
	ПараметрыВыполнения.ОсвобождениеОтНалога = Показатели.ОсвобождениеОтНалога;
	
	Если Не ЗначениеЗаполнено(Показатели.НалогКУплате)
		И Показатели.НалогИсчисленныйВсего < Показатели.АвансовыеПлатежи
		И НачалоКвартала(ПериодСобытия) <> НачалоГода(ПериодСобытия) Тогда
		
		// Отразим переплату по налогу как разницу между переплатой относительно предыдущего квартала по начисленным ранее КБК
		
		СуммаПереплатыВсего = -Мин(Показатели.НалогИсчисленныйВсего - Показатели.АвансовыеПлатежи, 0);
		Если ЗначениеЗаполнено(Результат) Тогда
			
			СуммыКУплате = Результат.Скопировать();
			СуммыКУплате.Сортировать("КБК Убыв");
			КБК = КБКПоВидуДохода(Перечисления.ВидыНалогов.НДФЛ_ИП, ПериодСобытия);
			
			Для Каждого ТекущаяСтрока Из СуммыКУплате Цикл
				
				Если Не ЗначениеЗаполнено(ТекущаяСтрока.Сумма) Или СуммаПереплатыВсего <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ПереплатаЗаПрошлыйПериод = Мин(ТекущаяСтрока.Сумма, СуммаПереплатыВсего);
				КБК = ТекущаяСтрока.КБК;
				НоваяСтрока = Результат.Добавить();
				НоваяСтрока.Период = ПериодСобытия;
				НоваяСтрока.КБК = КБК;
				НоваяСтрока.ПредставлениеПериода = ИмяПериода;
				НоваяСтрока.Сумма = ПереплатаЗаПрошлыйПериод;
				
				СуммаПереплатыВсего = Макс(СуммаПереплатыВсего - ПереплатаЗаПрошлыйПериод, 0);
				
			КонецЦикла;
			
			Если СуммаПереплатыВсего > 0 Тогда
				НоваяСтрока = Результат.Добавить();
				НоваяСтрока.Период = ПериодСобытия;
				НоваяСтрока.КБК = КБК;
				НоваяСтрока.ПредставлениеПериода = ИмяПериода;
				НоваяСтрока.Сумма = СуммаПереплатыВсего;
			КонецЕсли;
			
		Иначе
			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.Период = ПериодСобытия;
			НоваяСтрока.КБК = КБКПоВидуДохода(Перечисления.ВидыНалогов.НДФЛ_ИП, ПериодСобытия);
			НоваяСтрока.ПредставлениеПериода = ИмяПериода;
			НоваяСтрока.Сумма = СуммаПереплатыВсего;
		КонецЕсли;
		
	Иначе
		ТаблицаНалога = Обработки.ПомощникЗаполнения3НДФЛ.НеоплаченныеНалоги(ПараметрыВыполнения);
		Для Каждого ТекущийПлатеж Из ТаблицаНалога Цикл
			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.Период = ПериодСобытия;
			НоваяСтрока.КБК = КБКПоВидуДохода(ТекущийПлатеж.ВидНалога, ПериодСобытия, ТекущийПлатеж.КодВидаДоходов);
			НоваяСтрока.ПредставлениеПериода = ИмяПериода;
			НоваяСтрока.Сумма = ТекущийПлатеж.Сумма;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЗаявлениеОПереплатеНДФЛ(ПараметрыОтчета, Контейнер, КлючиПоказателей, СуммаПереплаты)
	
	// Заполним приложение к Разделу 1 в части суммы переплаты НДФЛ предпринимателя
	ИмяРаздела = "Раздел1Приложение";
	РазделДекларации = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Контейнер, ИмяРаздела);
	
	Если Не ЗначениеЗаполнено(РазделДекларации) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполняемыеПоказатели = Новый Структура;
	КлючиРаздела = КлючиПоказателей.НайтиСтроки(Новый Структура("ИмяСтраницы", ИмяРаздела));
	Для Каждого ТекущаяСтрока Из КлючиРаздела Цикл
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ЗаполняемыеПоказатели, ТекущаяСтрока.ИмяПоля, Истина, Ложь);
	КонецЦикла;
	
	ОчиститьРазделДекларации(РазделДекларации, ЗаполняемыеПоказатели);
	
	Если СуммаПереплаты <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыОрганизации = Новый Массив;
	РеквизитыОрганизации.Добавить("БанкСчетНомер");
	РеквизитыОрганизации.Добавить("БанкСчетБИКБанка");
	
	СведенияОбОрганизации = РегламентированнаяОтчетностьПереопределяемый.ПолучитьСведенияОбОрганизации(
		ПараметрыОтчета.Организация,
		ПараметрыОтчета.ДатаНачалаПериодаОтчета,
		РеквизитыОрганизации);
	
	Если Не ЗначениеЗаполнено(СведенияОбОрганизации.БанкСчетНомер)
		Или Не ЗначениеЗаполнено(СведенияОбОрганизации.БанкСчетБИКБанка) Тогда
		
		Возврат;
	КонецЕсли;
	
	ПоказателиЛиста = РазделДекларации.Строки[0].Данные;
	
	ЗаполнитьПоказательЛистаДекларации("СуммаВозврат", СуммаПереплаты, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("БИКВозврат", СведенияОбОрганизации.БанкСчетБИКБанка, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("НомерСчетаВозврат", СведенияОбОрганизации.БанкСчетНомер, ПоказателиЛиста, КлючиПоказателей);
	
КонецПроцедуры

Функция ДекларацияЗаполненаПоДаннымПомощника(ПараметрыОтчета, КлючиПоказателей, Контейнер)
	
	НастройкиАвтозаполнения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтчета, "НастройкиАвтозаполнения");
	Если Не ЗначениеЗаполнено(НастройкиАвтозаполнения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеЗаполнения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиАвтозаполнения, "ДанныеЗаполнения");
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Или ТипЗнч(ДанныеЗаполнения) <> Тип("ТаблицаЗначений") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтрокиСтандратногоСоциальногоВычета = Новый Массив;
	
	Для Каждого ТекущаяСтрока Из ДанныеЗаполнения Цикл
		
		ТекущиеДанные = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТекущаяСтрока);
		СтруктураДанных = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущиеДанные, "СтруктураДанных");
		
		Если Не ЗначениеЗаполнено(СтруктураДанных) Или ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭтоСтандартныйСоциальныйВычет(ТекущаяСтрока.Вид) Тогда
			// Для социальных и стандартных вычетов данные указываются на одном листе
			НоваяСтрока = Не ЗначениеЗаполнено(СтрокиСтандратногоСоциальногоВычета);
			СтрокиСтандратногоСоциальногоВычета.Добавить(ТекущаяСтрока.Вид);
		Иначе
			НоваяСтрока = Истина;
		КонецЕсли;
		
		Для Каждого ТекущееПоле Из СтруктураДанных Цикл
			
			КлючПоказателя = КлючиПоказателей.Найти(ТекущееПоле.Ключ, "Ключ");
			Если Не ЗначениеЗаполнено(КлючПоказателя) Тогда
				Продолжить;
			КонецЕсли;
			
			РазделДекларации = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Контейнер, КлючПоказателя.ИмяСтраницы);
			Если Не ЗначениеЗаполнено(РазделДекларации) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(ТекущееПоле.Значение) = Тип("СписокЗначений") Тогда
				
				Для Каждого ТекущееЗначениеСписка Из ТекущееПоле.Значение Цикл
					ПоказателиЛиста = НовыеПоказателиЛиста(РазделДекларации, КлючПоказателя, НоваяСтрока);
					ЗаполнитьПоказательЛистаДекларации(ТекущееПоле.Ключ,
						ТекущееЗначениеСписка.Значение,
						ПоказателиЛиста,
						КлючиПоказателей);
					НоваяСтрока = Истина;
				КонецЦикла;
				
			Иначе
				
				ПоказателиЛиста = НовыеПоказателиЛиста(РазделДекларации, КлючПоказателя, НоваяСтрока);
				ЗаполнитьПоказательЛистаДекларации(ТекущееПоле.Ключ, ТекущееПоле.Значение, ПоказателиЛиста, КлючиПоказателей);
			
			КонецЕсли;
			
			НоваяСтрока = Ложь;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ЭтоСтандартныйСоциальныйВычет(Вычет)
	
	ВидыВычетов = Новый Массив;
	ВидыВычетов.Добавить(Перечисления.ВычетыФизическихЛиц.СтандартныйНаДетей);
	ВидыВычетов.Добавить(Перечисления.ВычетыФизическихЛиц.СтандартныйНаНалогоплательщика);
	ВидыВычетов.Добавить(Перечисления.ВычетыФизическихЛиц.Социальный);
	
	Возврат ВидыВычетов.Найти(Вычет) <> Неопределено;
	
КонецФункции

Функция НовыеПоказателиЛиста(РазделДекларации, КлючПоказателя, НоваяСтрока)
	
	Если ЭтоПолеМногострочногоРаздела(КлючПоказателя) Тогда
		КрайняяСтрокаРаздела = РазделДекларации.Строки[РазделДекларации.Строки.Количество() - 1];
		ИсточникДанных = КрайняяСтрокаРаздела.ДанныеМногострочныхЧастей[КлючПоказателя.МногострочныйРаздел].Строки;
	Иначе
		ИсточникДанных = РазделДекларации.Строки;
	КонецЕсли;
	
	КоличествоСтрок = ИсточникДанных.Количество();
	
	Если Не НоваяСтрока Или ПустаяСтраница(ИсточникДанных[КоличествоСтрок - 1].Данные) Тогда
		ПоказателиЛиста = ИсточникДанных[КоличествоСтрок - 1].Данные;
	Иначе
		НовыйЛист = ИсточникДанных.Добавить();
		НовыйЛист.Данные = ШаблонДанныхРаздела(ИсточникДанных[0].Данные);
		НовыйЛист.ДанныеМногострочныхЧастей = ШаблонДанныхМногострочныхЧастей(ИсточникДанных[0].ДанныеМногострочныхЧастей);
		ПоказателиЛиста = НовыйЛист.Данные;
	КонецЕсли;
	
	Возврат ПоказателиЛиста;
	
КонецФункции

Функция ПустаяСтраница(ДанныеСтраницы)
	
	Для Каждого ТекущееПоле Из ДанныеСтраницы Цикл
		Если ЗначениеЗаполнено(ТекущееПоле.Значение) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ЭтоПолеМногострочногоРаздела(КлючПоказателя)
	
	Возврат ЗначениеЗаполнено(КлючПоказателя.МногострочныйРаздел) И Не КлючПоказателя.ОбщееПолеМногострочногоРаздела;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеДекларацииУстаревшиеРедакции

Процедура СведенияОПоказателяхОтчета3НДФЛУстаревшиеРедакции(ИДРедакцииОтчета, ПоказателиОтчета)
	
	КлючиПоказателей = КлючиПоказателейДекларации(ИДРедакцииОтчета);
	
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("ПризнакУплатыВозврата", ПоказателиОтчета, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("ОКТМО", ПоказателиОтчета, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("СуммаНалога", ПоказателиОтчета, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("СуммаВозвратаНалога", ПоказателиОтчета, КлючиПоказателей);
	
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("КодВидаДеятельностиИП", ПоказателиОтчета, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("ОКВЭДИП", ПоказателиОтчета, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("СуммаДоходаИП", ПоказателиОтчета, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("СуммаРасходовИП", ПоказателиОтчета, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("МатериальныеРасходыИП", ПоказателиОтчета, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("АмортизацияИП", ПоказателиОтчета, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("ЗарплатаИП", ПоказателиОтчета, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("ЗарплатаПоТрудовымДоговорамИП", ПоказателиОтчета, КлючиПоказателей);
	ДобавитьСведенияОПоказателеОтчета3НДФЛ("ПрочиеРасходыИП", ПоказателиОтчета, КлючиПоказателей);
	
КонецПроцедуры

Процедура Заполнить3НДФЛУстаревшиеРедакции(ИДРедакцииОтчета, Знач ПараметрыОтчета, Контейнер)
	
	Если ИДРедакцииОтчета = "ФормаОтчета2011кв1" Или ИДРедакцииОтчета = "ФормаОтчета2014кв1" Тогда
		ЗаполнитьРегламентированныйОтчет3НДФЛ2011(ПараметрыОтчета, Контейнер);
	ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2015кв1" Тогда
		КлючиПоказателей = КлючиПоказателейДекларации("ФормаОтчета2018кв1");
		ЗаполнитьРегламентированныйОтчет3НДФЛ2015(ИДРедакцииОтчета, ПараметрыОтчета, Контейнер, КлючиПоказателей);
	ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2016кв1"
		Или ИДРедакцииОтчета = "ФормаОтчета2017кв1" Тогда
		КлючиПоказателей = КлючиПоказателейДекларации("ФормаОтчета2018кв1");
		ЗаполнитьРегламентированныйОтчет3НДФЛ2016(ИДРедакцииОтчета, ПараметрыОтчета, Контейнер, КлючиПоказателей);
	ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2018кв1"
		Или ИДРедакцииОтчета = "ФормаОтчета2019кв1"
		Или ИДРедакцииОтчета = "ФормаОтчета2020кв1" 
		Или ИДРедакцииОтчета = "ФормаОтчета2021кв1" Тогда
		КлючиПоказателей = КлючиПоказателейДекларации(ИДРедакцииОтчета);
		ЗаполнитьРегламентированныйОтчет3НДФЛ2018(ИДРедакцииОтчета, ПараметрыОтчета, Контейнер, КлючиПоказателей);
	ИначеЕсли Отчеты.РегламентированныйОтчет3НДФЛ.ПрименяетсяОсновнаяФорма2022(ИДРедакцииОтчета) Тогда
		КлючиПоказателей = КлючиПоказателейДекларации(ИДРедакцииОтчета);
		ЗаполнитьРегламентированныйОтчет3НДФЛ2022(ИДРедакцииОтчета, ПараметрыОтчета, Контейнер, КлючиПоказателей);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРегламентированныйОтчет3НДФЛ2011(ПараметрыОтчета, Контейнер)
	
	ПараметрыЗаполненияОтчета = УчетДоходовИРасходовПредпринимателя.ПараметрыФормированияНалоговойБазы(ПараметрыОтчета);
	Если ПараметрыЗаполненияОтчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НомерСтроки = 1;
	
	Если УчетнаяПолитика.ВестиУчетПоВидамДеятельностиИП(ПараметрыОтчета.Организация, ПараметрыОтчета.мДатаНачалаПериодаОтчета) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВидыДеятельностиПредпринимателей.Ссылка КАК ВидДеятельности
		|ИЗ
		|	Справочник.ВидыДеятельностиПредпринимателей КАК ВидыДеятельностиПредпринимателей");
		
		ВыборкаВидов = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаВидов.Следующий() Цикл 
			
			ПараметрыЗаполненияОтчета.Вставить("ВидДеятельности", ВыборкаВидов.ВидДеятельности);
			ЗаполнитьЛистВ3НДФЛ2011(НомерСтроки, Контейнер, ПараметрыЗаполненияОтчета);
			
		КонецЦикла;
	
	Иначе
		
		ОсновнойВидДеятельности = УчетнаяПолитика.ОсновнойВидДеятельности(
			ПараметрыОтчета.Организация,
			ПараметрыОтчета.мДатаНачалаПериодаОтчета);
		
		ПараметрыЗаполненияОтчета.Вставить("ВидДеятельности" , ОсновнойВидДеятельности);
		ЗаполнитьЛистВ3НДФЛ2011(НомерСтроки, Контейнер, ПараметрыЗаполненияОтчета);
		
	КонецЕсли;
	
	ЗаполнитьРаздел63НДФЛ(Контейнер, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ЗаполнитьРегламентированныйОтчет3НДФЛ2015(ИДРедакцииОтчета, ПараметрыОтчета, Контейнер, КлючиПоказателей)
	
	ПараметрыОтчета.Вставить("ОсновнойКодОКВЭД", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОтчета.Организация, "КодОКВЭД"));
	ЗаполнитьКонтейнер3НДФЛ2015(ИДРедакцииОтчета, ПараметрыОтчета, Контейнер, КлючиПоказателей);
	
КонецПроцедуры

Процедура ЗаполнитьРегламентированныйОтчет3НДФЛ2016(ИДРедакцииОтчета, ПараметрыОтчета, Контейнер, КлючиПоказателей)
	
	ПараметрыОтчета.Вставить("ОсновнойКодОКВЭД", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОтчета.Организация, "КодОКВЭД"));
	ЗаполнитьКонтейнер3НДФЛ2015(ИДРедакцииОтчета, ПараметрыОтчета, Контейнер, КлючиПоказателей);
	
	ПоместитьВоВременноеХранилище(Контейнер, ПараметрыОтчета.АдресВоВременномХранилище);
	
КонецПроцедуры

Процедура ЗаполнитьРегламентированныйОтчет3НДФЛ2018(ИДРедакцииОтчета, ПараметрыОтчета, Контейнер, КлючиПоказателей)
	
	ПараметрыОтчета.Вставить("ОсновнойКодОКВЭД", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОтчета.Организация, "КодОКВЭД2"));
	ЗаполнитьКонтейнер3НДФЛ2015(ИДРедакцииОтчета, ПараметрыОтчета, Контейнер, КлючиПоказателей);
	
	ПоместитьВоВременноеХранилище(Контейнер, ПараметрыОтчета.АдресВоВременномХранилище);
	
КонецПроцедуры

Процедура ЗаполнитьРегламентированныйОтчет3НДФЛ2022(ИДРедакцииОтчета, ПараметрыОтчета, Контейнер, КлючиПоказателей)
	
	ЗаполнитьКонтейнер3НДФЛ2022(ИДРедакцииОтчета, ПараметрыОтчета, Контейнер, КлючиПоказателей);
	ПоместитьВоВременноеХранилище(Контейнер, ПараметрыОтчета.АдресВоВременномХранилище);
	
КонецПроцедуры

Процедура ЗаполнитьКонтейнер3НДФЛ2022(ИДРедакцииОтчета, ПараметрыОтчета, Контейнер, КлючиПоказателей)
	Перем КодВидаДеятельности;
	
	Если КлючиПоказателей = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючПоказателя = КлючиПоказателей.Найти("КодВидаДеятельностиИП", "Ключ");
	Если КлючПоказателя <> Неопределено Тогда
		ИмяРаздела = КлючПоказателя.ИмяСтраницы;
	Иначе
		ВызватьИсключение НСтр("ru = 'Не определен раздел для заполнения'");
	КонецЕсли;
	
	ЗаполняемыеПоказатели = Новый Структура;
	СведенияОПоказателяхОтчета3НДФЛ(ИДРедакцииОтчета, ЗаполняемыеПоказатели);
	
	ТаблицаДоходовРасходов = УчетДоходовИРасходовПредпринимателя.ДоходыРасходыПоВидамДеятельности(ПараметрыОтчета);
	ТаблицаДоходовРасходов.Колонки.Добавить("СуммаРасходовВПределахНорматива", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	Если Отчеты.РегламентированныйОтчет3НДФЛ.ПрофессиональныйВычетРассчитываетсяПострочно(ИДРедакцииОтчета) Тогда
		РассчитатьПрофессиональныйВычетВПределахНорматива(ТаблицаДоходовРасходов, ИДРедакцииОтчета);
	КонецЕсли;
	
	Если ИДРедакцииОтчета = "ФормаОтчета2022кв1" Тогда
		ЗаполнитьПриложение3Расчет2022(ПараметрыОтчета, Контейнер, КлючиПоказателей);
	Иначе
		ЗаполнитьПриложение3Продолжение2023(ПараметрыОтчета, Контейнер, КлючиПоказателей);
	КонецЕсли;
	
	// Код вида деятельности
	КодыВидовПредпринимательскойДеятельности = КодыВидовПредпринимательскойДеятельности(ИДРедакцииОтчета);
	КодыВидовПредпринимательскойДеятельности.Свойство("ПредпринимательскаяДеятельность", КодВидаДеятельности);
	
	РазделДекларации = Контейнер[ИмяРаздела];
	ОчиститьРазделДекларацииУстаревшейРедакции(РазделДекларации, ЗаполняемыеПоказатели, ТаблицаДоходовРасходов.Количество());
	
	Для Индекс = 0 По ТаблицаДоходовРасходов.Количество() - 1 Цикл
		
		ДоходыРасходы = ТаблицаДоходовРасходов[Индекс];
		
		ЗаполнитьПредпринимательскуюДеятельностьУстаревшейРедакции(
			РазделДекларации[Индекс].Данные[0].Значение,
			КлючиПоказателей,
			ДоходыРасходы,
			Новый Структура("Код", КодВидаДеятельности));
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКонтейнер3НДФЛ2015(ИДРедакцииОтчета, ПараметрыОтчета, Контейнер, КлючиПоказателей)
	Перем КодВидаДеятельности;
	
	Если КлючиПоказателей = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючПоказателя = КлючиПоказателей.Найти("КодВидаДеятельностиИП", "Ключ");
	Если КлючПоказателя <> Неопределено Тогда
		ИмяРаздела = КлючПоказателя.ИмяСтраницы;
	Иначе
		ВызватьИсключение НСтр("ru = 'Не определен раздел для заполнения'");
	КонецЕсли;
	
	ЗаполняемыеПоказатели = Новый Структура;
	СведенияОПоказателяхОтчета3НДФЛ(ИДРедакцииОтчета, ЗаполняемыеПоказатели);
	
	ТаблицаДоходовРасходов = УчетДоходовИРасходовПредпринимателя.ДоходыРасходыПоВидамДеятельности(ПараметрыОтчета);
	ТаблицаДоходовРасходов.Колонки.Добавить("СуммаРасходовВПределахНорматива", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	Если Отчеты.РегламентированныйОтчет3НДФЛ.ПрофессиональныйВычетРассчитываетсяПострочно(ИДРедакцииОтчета) Тогда
		РассчитатьПрофессиональныйВычетВПределахНорматива(ТаблицаДоходовРасходов, ИДРедакцииОтчета);
	КонецЕсли;
	
	ЗаполнитьПриложение3Расчет2021(ПараметрыОтчета, Контейнер, КлючиПоказателей);
	
	// Код вида деятельности
	КодыВидовПредпринимательскойДеятельности = КодыВидовПредпринимательскойДеятельности(ИДРедакцииОтчета);
	КодыВидовПредпринимательскойДеятельности.Свойство("ПредпринимательскаяДеятельность", КодВидаДеятельности);
	
	// Код основного вида экономической деятельности
	КодыОКВЭД = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
		ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаДоходовРасходов, "ВидДеятельности"),
		"КодОКВЭД");
	
	РазделДекларации = Контейнер[ИмяРаздела];
	ОчиститьРазделДекларацииУстаревшейРедакции(РазделДекларации, ЗаполняемыеПоказатели, ТаблицаДоходовРасходов.Количество());
	
	Для Индекс = 0 По ТаблицаДоходовРасходов.Количество() - 1 Цикл
		
		ДоходыРасходы = ТаблицаДоходовРасходов[Индекс];
		
		КодОКВЭД = КодыОКВЭД[ДоходыРасходы.ВидДеятельности];
		Если Не ЗначениеЗаполнено(КодОКВЭД) Тогда
			КодОКВЭД = ПараметрыОтчета.ОсновнойКодОКВЭД;
		КонецЕсли;
		
		ЗаполнитьПредпринимательскуюДеятельностьУстаревшейРедакции(
			РазделДекларации[Индекс].Данные[0].Значение,
			КлючиПоказателей,
			ДоходыРасходы,
			Новый Структура("Код, ОКВЭД", КодВидаДеятельности, КодОКВЭД));
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПриложение3Расчет2021(ПараметрыОтчета, Контейнер, КлючиПоказателей)
	
	Если Не Контейнер.Свойство("Приложение3Расчет") Тогда
		Возврат;
	КонецЕсли;
	
	// Расчет к приложению 3 заполняется нарастающим итогом.
	// Поэтому подготовим имена периодов и будем запрашивать данные последовательно.
	МассивИменПериодов = МассивИменПериодов();
	
	НомерПериода = 1;
	
	Для Каждого ИмяПериода Из МассивИменПериодов Цикл
		КоличествоМесяцевПериода = 3 * НомерПериода;
		Показатели = Обработки.ПомощникЗаполнения3НДФЛ.НачальныеПоказатели(
			ПараметрыОтчета.Организация,
			ДобавитьМесяц(ПараметрыОтчета.мДатаНачалаПериодаОтчета, КоличествоМесяцевПериода)-1);
		
		Доходы = Окр(Показатели.Доходы + Показатели.ПрочиеДоходы + Показатели.АвансыПокупателей, 0);
		СтандартныйВычет = Окр(Показатели.СтандартныйВычетНаДетей + Показатели.СтандартныйВычетНаНалогоплательщика, 0);
		ПрофессиональныйВычет = Окр(Показатели.ПрофессиональныйВычет, 0);
		НалоговаяБаза = Окр(Показатели.НалоговаяБаза, 0);
		
		ЗаполнитьПоказательЛистаДекларации(КлючПоляДоходы(ИмяПериода), Доходы, Контейнер["Приложение3Расчет"], КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации(КлючПоляПрофВычет(ИмяПериода), ПрофессиональныйВычет, Контейнер["Приложение3Расчет"], КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации(КлючПоляСтандартныйВычет(ИмяПериода), СтандартныйВычет, Контейнер["Приложение3Расчет"], КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации(КлючПоляНалоговаяБаза(ИмяПериода), НалоговаяБаза, Контейнер["Приложение3Расчет"], КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации(КлючПоляАвансовыйПлатеж(ИмяПериода), Показатели.НалогИсчисленныйВсего, Контейнер["Приложение3Расчет"], КлючиПоказателей);
		НомерПериода = НомерПериода + 1;
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьПриложение3Расчет2022(ПараметрыОтчета, Контейнер, КлючиПоказателей)
	
	Перем РазделДекларации;
	
	Если Не Контейнер.Свойство("Приложение3Расчет", РазделДекларации) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполняемыеПоказатели = Новый Структура;
	
	// Расчет к приложению 3 заполняется нарастающим итогом.
	// Поэтому подготовим имена периодов и будем запрашивать данные последовательно.
	МассивИменПериодов = МассивИменПериодов();
	
	Для Каждого ИмяПериода Из МассивИменПериодов Цикл
		ДобавитьСведенияОПоказателеОтчета3НДФЛ(КлючПоляДоходы(ИмяПериода), ЗаполняемыеПоказатели, КлючиПоказателей);
		ДобавитьСведенияОПоказателеОтчета3НДФЛ(КлючПоляПрофВычет(ИмяПериода), ЗаполняемыеПоказатели, КлючиПоказателей);
		ДобавитьСведенияОПоказателеОтчета3НДФЛ(КлючПоляСтандартныйВычет(ИмяПериода), ЗаполняемыеПоказатели, КлючиПоказателей);
		ДобавитьСведенияОПоказателеОтчета3НДФЛ(КлючПоляНалоговаяБаза(ИмяПериода), ЗаполняемыеПоказатели, КлючиПоказателей);
		ДобавитьСведенияОПоказателеОтчета3НДФЛ(КлючПоляАвансовыйПлатеж(ИмяПериода), ЗаполняемыеПоказатели, КлючиПоказателей);
	КонецЦикла;
	
	ОчиститьРазделДекларацииУстаревшейРедакции(РазделДекларации, ЗаполняемыеПоказатели, 1);
	
	ПоказателиЛиста = РазделДекларации[0].Данные[0].Значение;
	
	НомерПериода = 1;
	МесяцевВКвартале = 3;
	
	Для Каждого ИмяПериода Из МассивИменПериодов Цикл
		КоличествоМесяцевПериода = МесяцевВКвартале * НомерПериода;
		Показатели = Обработки.ПомощникЗаполнения3НДФЛ.НачальныеПоказатели(
			ПараметрыОтчета.Организация,
			ДобавитьМесяц(ПараметрыОтчета.мДатаНачалаПериодаОтчета, КоличествоМесяцевПериода) - 1);
		
		Доходы = Окр(Показатели.Доходы + Показатели.ПрочиеДоходы + Показатели.АвансыПокупателей, 0);
		СтандартныйВычет = Окр(Показатели.СтандартныйВычетНаДетей + Показатели.СтандартныйВычетНаНалогоплательщика, 0);
		ПрофессиональныйВычет = Окр(Показатели.ПрофессиональныйВычет, 0);
		НалоговаяБаза = Окр(Показатели.НалоговаяБаза, 0);
		
		ЗаполнитьПоказательЛистаДекларации(КлючПоляДоходы(ИмяПериода), Доходы, ПоказателиЛиста, КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации(КлючПоляПрофВычет(ИмяПериода), ПрофессиональныйВычет, ПоказателиЛиста, КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации(КлючПоляСтандартныйВычет(ИмяПериода), СтандартныйВычет, ПоказателиЛиста, КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации(КлючПоляНалоговаяБаза(ИмяПериода), НалоговаяБаза, ПоказателиЛиста, КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации(КлючПоляАвансовыйПлатеж(ИмяПериода), Показатели.НалогИсчисленныйВсего, 
			ПоказателиЛиста, КлючиПоказателей);
		НомерПериода = НомерПериода + 1;
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьПриложение3Продолжение2023(ПараметрыОтчета, Контейнер, КлючиПоказателей)
	
	Перем РазделДекларации;
	
	Если Не Контейнер.Свойство("Приложение3Продолжение", РазделДекларации) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполняемыеПоказатели = Новый Структура;
	
	// Расчет к приложению 3 заполняется нарастающим итогом.
	// Поэтому подготовим имена периодов и будем запрашивать данные последовательно.
	МассивИменПериодов = МассивИменПериодов();
	
	Для Каждого ИмяПериода Из МассивИменПериодов Цикл
		ДобавитьСведенияОПоказателеОтчета3НДФЛ(КлючПоляДоходы(ИмяПериода), ЗаполняемыеПоказатели, КлючиПоказателей);
		ДобавитьСведенияОПоказателеОтчета3НДФЛ(КлючПоляПрофВычет(ИмяПериода), ЗаполняемыеПоказатели, КлючиПоказателей);
		ДобавитьСведенияОПоказателеОтчета3НДФЛ(КлючПоляСтандартныйВычет(ИмяПериода), ЗаполняемыеПоказатели, КлючиПоказателей);
		ДобавитьСведенияОПоказателеОтчета3НДФЛ(КлючПоляНалоговаяБаза(ИмяПериода), ЗаполняемыеПоказатели, КлючиПоказателей);
		ДобавитьСведенияОПоказателеОтчета3НДФЛ(КлючПоляАвансовыйПлатеж(ИмяПериода), ЗаполняемыеПоказатели, КлючиПоказателей);
	КонецЦикла;
	
	ОчиститьРазделДекларацииУстаревшейРедакции(РазделДекларации, ЗаполняемыеПоказатели, 1);
	ПоказателиЛиста = РазделДекларации[0].Данные[0].Значение;
	
	НомерПериода = 1;
	АвансовыеПлатежи = 0;
	
	Для Каждого ИмяПериода Из МассивИменПериодов Цикл
		КоличествоМесяцевПериода = 3 * НомерПериода;
		Показатели = Обработки.ПомощникЗаполнения3НДФЛ.НачальныеПоказатели(
			ПараметрыОтчета.Организация,
			ДобавитьМесяц(ПараметрыОтчета.мДатаНачалаПериодаОтчета, КоличествоМесяцевПериода)-1);
		
		Доходы = Окр(Показатели.Доходы + Показатели.ПрочиеДоходы + Показатели.АвансыПокупателей, 0);
		СтандартныйВычет = Окр(Показатели.СтандартныйВычетНаДетей + Показатели.СтандартныйВычетНаНалогоплательщика, 0);
		ПрофессиональныйВычет = Окр(Показатели.ПрофессиональныйВычет, 0);
		НалоговаяБаза = Окр(Показатели.НалоговаяБаза, 0);
		
		ЗаполнитьПоказательЛистаДекларации(КлючПоляДоходы(ИмяПериода), Доходы, ПоказателиЛиста, КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации(КлючПоляПрофВычет(ИмяПериода), ПрофессиональныйВычет, ПоказателиЛиста, КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации(КлючПоляСтандартныйВычет(ИмяПериода), СтандартныйВычет, ПоказателиЛиста, КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации(КлючПоляНалоговаяБаза(ИмяПериода), НалоговаяБаза, ПоказателиЛиста, КлючиПоказателей);
		ЗаполнитьПоказательЛистаДекларации(КлючПоляАвансовыйПлатеж(ИмяПериода), Показатели.НалогИсчисленныйВсего, ПоказателиЛиста, КлючиПоказателей);
		
		НомерПериода = НомерПериода + 1;
	КонецЦикла;
	
	РазделПриложение3 = Неопределено;
	Если Не Контейнер.Свойство("Приложение3", РазделПриложение3) Тогда
		Возврат;
	КонецЕсли;
	
	АвансовыеПлатежи = УчетНДФЛПредпринимателя.УплаченныйНалогЗаПериод(
		ПараметрыОтчета.Организация,
		ПараметрыОтчета.мДатаНачалаПериодаОтчета,
		ПараметрыОтчета.мДатаКонцаПериодаОтчета);
	
	ЗаполнитьПоказательЛистаДекларации("СуммаУплаченныхАвансовыхПлатежейИП",
		АвансовыеПлатежи,
		РазделПриложение3[0].Данные[0].Значение,
		КлючиПоказателей);
	
КонецПроцедуры

Процедура РассчитатьПрофессиональныйВычетВПределахНорматива(ТаблицаДоходовРасходов, ИДРедакцииОтчета)
	
	Если ТаблицаДоходовРасходов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПроцентПрофессиональногоВычета = ПроцентПрофессиональногоВычета(ИДРедакцииОтчета);
	
	МассивРасходов = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаДоходовРасходов, "ИтогоРасходов", Истина);
	Если МассивРасходов.Количество() = 1 И МассивРасходов[0] = 0 Тогда
		Для Каждого СтрокаТаблицы Из ТаблицаДоходовРасходов Цикл
			СтрокаТаблицы.СуммаРасходовВПределахНорматива = Окр(СтрокаТаблицы.ИтогоДоходов * ПроцентПрофессиональногоВычета / 100, 2);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьРазделДекларацииУстаревшейРедакции(РазделДекларации, ЗаполняемыеПоказатели, Знач КоличествоЛистов = 0)
	
	Если РазделДекларации.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Контейнер раздела не инициализирован'");
	КонецЕсли;
	
	Если КоличествоЛистов = 0 Тогда
		КоличествоЛистов = 1; // Один лист должен быть всегда
	КонецЕсли;
	
	ШаблонЛиста = ОбщегоНазначения.СкопироватьРекурсивно(РазделДекларации[0].Данные[0].Значение);
	Для Каждого Показатель Из ШаблонЛиста Цикл
		Если ЗаполняемыеПоказатели.Свойство(Показатель.Ключ) Тогда
			ТипПоказателя = ТипЗнч(Показатель.Значение);
			ШаблонЛиста[Показатель.Ключ] = ОбщегоНазначенияБПКлиентСервер.ПустоеЗначениеТипа(ТипПоказателя);
		КонецЕсли;
	КонецЦикла;
	
	РазделДекларации.Очистить();
	Для НомерЛиста = 1 По КоличествоЛистов Цикл
		НоваяСтрока = РазделДекларации.Добавить();
		НоваяСтрока.Данные = Новый СписокЗначений;
		НоваяСтрока.Данные.Добавить(ОбщегоНазначения.СкопироватьРекурсивно(ШаблонЛиста));
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРаздел63НДФЛ(Контейнер, ПараметрыОтчета)
	
	Раздел6 = Контейнер.Раздел6;
	ЛистВ = Контейнер.ЛистВ;
	
	ТаблицаБлокаРаздел6 = Раздел6[0].Данные[0].Значение;
	
	Для Каждого Показатель Из ТаблицаБлокаРаздел6 Цикл
		ТаблицаБлокаРаздел6[Показатель.Ключ] = ОбщегоНазначенияБПКлиентСервер.ПустоеЗначениеТипа(ТипЗнч(Показатель.Значение));
	КонецЦикла;
	
	Пока Раздел6.Количество()>1 Цикл
		Раздел6.Удалить(1);
	КонецЦикла;
	
	ТаблицаБлокаРаздел6.П000060002003 = ?(Год(ПараметрыОтчета.мДатаКонцаПериодаОтчета) > 2011 , "18210102020011000110", "18210102022011000110");
	РегистрацияВНалоговомОргане = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОтчета.Организация, "РегистрацияВНалоговомОргане");
	Если ЗначениеЗаполнено(РегистрацияВНалоговомОргане) Тогда
		РеквизитКода = ?(Год(ПараметрыОтчета.мДатаКонцаПериодаОтчета) > 2012 , "КодПоОКТМО", "КодПоОКАТО");
		ТаблицаБлокаРаздел6.П000060003003 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РегистрацияВНалоговомОргане, РеквизитКода);
	Иначе
		ТаблицаБлокаРаздел6.П000060003003 = "";
	КонецЕсли;
	
	ИтогоДоходов = 0;
	ИтогоРасходов = 0;
	
	Для Каждого СтраницаЛистаВ Из ЛистВ Цикл
		
		ТаблицаБлока = СтраницаЛистаВ.Данные[0].Значение;
		ИтогоДоходов = ИтогоДоходов + ТаблицаБлока.П000090001003;
		ИтогоРасходов = ИтогоРасходов + ТаблицаБлока.П000090001004;
		
	КонецЦикла;
	
	Налог = Окр(УчетНДФЛПредпринимателя.СуммаНалога(
		ИтогоДоходов - ИтогоРасходов,
		ПараметрыОтчета.мДатаКонцаПериодаОтчета));
	
	ТаблицаБлокаРаздел6.П000060004003 = ?(Налог > 0 , Налог, 0);
	
	ТаблицаБлокаРаздел6.П000060001001 = ?(Налог > 0 , 1, 3);
	
КонецПроцедуры

Процедура ЗаполнитьЛистВ3НДФЛ2011(НомерСтроки, Контейнер, ПараметрыОтчета)
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	Отчеты.КнигаУчетаДоходовИРасходовПредпринимателя.СформироватьОтчет(ПараметрыОтчета, АдресХранилища);
	
	СтруктураДанныхЛистаВ = Новый Структура("Доходы, ПрочиеДоходы, МатериальныеРасходы, Амортизация, РасходыНаОплатуТруда, ПрочиеРасходы");
	
	ВыборкаОбщие = ПараметрыОтчета.НалоговаяБаза.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОБЩИЕ");
	Если ВыборкаОбщие.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураДанныхЛистаВ, ВыборкаОбщие);
	Иначе
		Возврат
	КонецЕсли;
	
	СтруктураДанныхЛистаВ.Вставить("КодОКВЭД",      ПараметрыОтчета.ВидДеятельности.КодОКВЭД);
	СтруктураДанныхЛистаВ.Вставить("ИтогоДоходов",  СтруктураДанныхЛистаВ.Доходы + СтруктураДанныхЛистаВ.ПрочиеДоходы);
	СтруктураДанныхЛистаВ.Вставить("ИтогоРасходов", СтруктураДанныхЛистаВ.МатериальныеРасходы
		+ СтруктураДанныхЛистаВ.Амортизация
		+ СтруктураДанныхЛистаВ.РасходыНаОплатуТруда + СтруктураДанныхЛистаВ.ПрочиеРасходы);
	
	Если СтруктураДанныхЛистаВ.ИтогоДоходов <> 0 ИЛИ СтруктураДанныхЛистаВ.ИтогоРасходов <> 0 Тогда
		
		ЛистВ = Контейнер.ЛистВ;
		
		ТаблицаБлока = ЛистВ[0].Данные[0].Значение;
		
		// В старых версиях отчета Фаимилия Имя Отчество и ИНН указывались в заголовке каждого листа
		// Сохраним их во временной структуре, и вставим обратно после очистки контейнера
		СтруктураШапкиЛистаВ = Новый Структура();
		
		СтруктураШапкиЛистаВ.Вставить("Фамилия", "");
		СтруктураШапкиЛистаВ.Вставить("Имя1", "");
		СтруктураШапкиЛистаВ.Вставить("Отчество1", "");
		СтруктураШапкиЛистаВ.Вставить("Инн1", "");
		
		ЗаполнитьЗначенияСвойств(СтруктураШапкиЛистаВ, ТаблицаБлока);
		
		Если НомерСтроки <> 1 Тогда //Добавляем строку
			
			СтруктураНовойТаблицы = Новый Структура();
			Для Каждого Показатель Из ТаблицаБлока Цикл
				СтруктураНовойТаблицы.Вставить(Показатель.Ключ, ОбщегоНазначенияБПКлиентСервер.ПустоеЗначениеТипа(ТипЗнч(Показатель.Значение)));
			КонецЦикла;
			
			ЛистВ.Добавить().Данные = Новый СписокЗначений();
			ЛистВ[ЛистВ.Количество() - 1].Данные.Добавить(СтруктураНовойТаблицы);
			
			ТаблицаБлока = ЛистВ[ЛистВ.Количество() - 1].Данные[0].Значение;
			
		Иначе
			
			Для Каждого Показатель Из ТаблицаБлока Цикл
				ТаблицаБлока[Показатель.Ключ] = ОбщегоНазначенияБПКлиентСервер.ПустоеЗначениеТипа(ТипЗнч(Показатель.Значение));
			КонецЦикла;
			
			Пока ЛистВ.Количество() > 1 Цикл
				ЛистВ.Удалить(1);
			КонецЦикла;
			
		КонецЕсли;
		
		//ЛистВ
		// заполняем реквизиты шапки, если они имеются
		ЗаполнитьЗначенияСвойств(ТаблицаБлока, СтруктураШапкиЛистаВ);
		
		ТаблицаБлока.П000090001001 = "1";
		ТаблицаБлока.П000090001002 = СтруктураДанныхЛистаВ.КодОКВЭД;
		ТаблицаБлока.П000090001003 = СтруктураДанныхЛистаВ.ИтогоДоходов;
		ТаблицаБлока.П000090001004 = СтруктураДанныхЛистаВ.ИтогоРасходов;
		ТаблицаБлока.П000090001005 = СтруктураДанныхЛистаВ.МатериальныеРасходы;
		ТаблицаБлока.П000090001006 = СтруктураДанныхЛистаВ.Амортизация;
		ТаблицаБлока.П000090001007 = СтруктураДанныхЛистаВ.РасходыНаОплатуТруда;
		ТаблицаБлока.П000090001009 = СтруктураДанныхЛистаВ.ПрочиеРасходы;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПредпринимательскуюДеятельностьУстаревшейРедакции(ПоказателиЛиста, КлючиПоказателей, ДоходыРасходы, ВидДеятельности)
	
	КодВидаДеятельностиИП = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ВидДеятельности, "Код");
	Если ЗначениеЗаполнено(КодВидаДеятельностиИП) Тогда
		ЗаполнитьПоказательЛистаДекларации("КодВидаДеятельностиИП", КодВидаДеятельностиИП, ПоказателиЛиста, КлючиПоказателей);
	КонецЕсли;
	
	ЗаполнитьПоказательЛистаДекларации("СуммаДоходаИП", ДоходыРасходы.ИтогоДоходов, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("СуммаРасходовИП", ДоходыРасходы.ИтогоРасходов, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("МатериальныеРасходыИП", ДоходыРасходы.МатериальныеРасходы, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("АмортизацияИП", ДоходыРасходы.Амортизация, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("ЗарплатаИП", ДоходыРасходы.РасходыНаОплатуТруда, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("ПрочиеРасходыИП", ДоходыРасходы.ПрочиеРасходы, ПоказателиЛиста, КлючиПоказателей);
	
	ОКВЭДИП = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ВидДеятельности, "ОКВЭД");
	Если ЗначениеЗаполнено(ОКВЭДИП) Тогда
		ЗаполнитьПоказательЛистаДекларации("ОКВЭДИП", ОКВЭДИП, ПоказателиЛиста, КлючиПоказателей);
	КонецЕсли;
	ЗаполнитьПоказательЛистаДекларации("ЗарплатаПоТрудовымДоговорамИП", ДоходыРасходы.РасходыНаОплатуТруда, ПоказателиЛиста, КлючиПоказателей);
	ЗаполнитьПоказательЛистаДекларации("СуммаРасходовВПределахНормативаИП", ДоходыРасходы.СуммаРасходовВПределахНорматива, ПоказателиЛиста, КлючиПоказателей);
	
КонецПроцедуры

Функция КодыВидовДоходовЦенныеБумагиУстаревшейРедакции()

	Результат = Новый Структура;
	Результат.Вставить("ЦифровыеАктивы", "2540,2650,2651,3030,3031,3032");
	Результат.Вставить("Вклады", "3020");
	Результат.Вставить("Облигации", "1011,1110,3023");
	Результат.Вставить("ИИС", "1544,1545,1546,1547,1548,1549,1551,1552,1553,1554");
	Результат.Вставить("ЦенныеБумаги",
		"1530,1531,1532,1533,1535,1536,1537,1538,1539,1541,1544,1545,1546,1547,1548,1549,1551,1552,1553,1554");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПоказателиРедакцииДекларации2025

Функция КлючиПоказателейДекларации2025()
	
	КлючиПоказателей = НовыеКлючиПоказателейДекларации();
	СвойстваРазделовДекларации = СвойстваРазделовДекларации();
	
	// Раздел 1
	ДобавитьКлючПоказателя("КБК", "Раздел1", "П00001М102003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ОКТМО", "Раздел1", "П00001М103003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалога", "Раздел1", "П00001М104003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаВозвратаНалога", "Раздел1", "П00001М105003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("КБКИП", "Раздел1", "П00001М206003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ОКТМОИП1Квартал", "Раздел1", "П00001М207003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалогаИПКУплате1Квартал", "Раздел1", "П00001М208003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ОКТМОИППолугодие", "Раздел1", "П00001М209003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалогаИПКУплатеПолугодие", "Раздел1", "П00001М210003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалогаИПКУменьшениюПолугодие", "Раздел1", "П00001М211003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ОКТМОИП9Месяцев", "Раздел1", "П00001М212003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалогаИПКУплате9Месяцев", "Раздел1", "П00001М213003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалогаИПКУменьшению9Месяцев", "Раздел1", "П00001М214003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ОКТМОИПГод", "Раздел1", "П00001М215003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалогаИПКУплатеГод", "Раздел1", "П00001М216003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалогаИПКУменьшениюГод", "Раздел1", "П00001М217003", СвойстваРазделовДекларации, КлючиПоказателей);
	
	// Раздел1Приложение
	ДобавитьКлючПоказателя("СуммаВозврат", "Раздел1Приложение", "П0001П0001003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("БИКВозврат", "Раздел1Приложение", "П0001П0002003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("НомерСчетаВозврат", "Раздел1Приложение", "П0001П0003003", СвойстваРазделовДекларации, КлючиПоказателей);
	
	// Раздел2
	ДобавитьКлючПоказателя("ГруппаДоходов", "Раздел2", "П000020000103", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ОбщаяСуммаДоходов", "Раздел2", "П000020001003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ОбщаяСуммаДоходовНеПодлежащаяНалогообложению", "Раздел2", "П000020002003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ОбщаяСуммаДоходовПодлежащаяНалогообложению", "Раздел2", "П000020003003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалоговыхВычетов", "Раздел2", "П000020004003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаРасходов", "Раздел2", "П000020005003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("НалоговаяБаза", "Раздел2", "П000020006003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалогаИсчисленная", "Раздел2", "П000020007003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалогаУдержанная", "Раздел2", "П000020008003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалогаУдержаннаяСМатериальнойВыгоды", "Раздел2", "П000020009003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаТорговогоСбора", "Раздел2", "П000020010003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаФиксированныхАвансовыхПлатежей", "Раздел2", "П000020012003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалогаИностранногоГосударства", "Раздел2", "П000020013003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалогаПСН", "Раздел2", "П000020014003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалогаПодлежащаяУплате", "Раздел2", "П000020015003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалогаПодлежащаяВозврату", "Раздел2", "П000020016003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалогаВозвращеннаяВУпрощенномПорядке", "Раздел2", "П000020017003", СвойстваРазделовДекларации, КлючиПоказателей);
	
	// Приложение1
	ДобавитьКлючПоказателя("КодВидаДоходаРФ", "Приложение1", "П000П1М101003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("НалоговаяСтавкаДоходаРФ", "Приложение1", "П000П1М102003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ИННИсточникаДоходаРФ", "Приложение1", "П000П1М103003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("КППИсточникаДоходаРФ", "Приложение1", "П000П1М104003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ОКТМОИсточникаДоходаРФ", "Приложение1", "П000П1М105003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("НаименованиеИсточникаДоходаРФ", "Приложение1", "П000П1М106003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаДоходаРФ", "Приложение1", "П000П1М107003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалогаУдержаннаяРФ", "Приложение1", "П000П1М108003", СвойстваРазделовДекларации, КлючиПоказателей);
	
	// Приложение1Расчет
	ДобавитьКлючПоказателя("ВидПолученияДоходаПоИмуществу", "Приложение1Расчет", "П00П1РМ101003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("НомерКадастровыйОтчуждаемогоОбъектаНедвижимогоИмущества", "Приложение1Расчет", "П00П1РМ102003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("КадастроваяСтоимостьГодРегистрации", "Приложение1Расчет", "П00П1РМ103003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ДоходПродажиЦенаДоговора", "Приложение1Расчет", "П00П1РМ104003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("КадастроваяСтоимостьКоэффициент", "Приложение1Расчет", "П00П1РМ105003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ДоходПродажиНалогооблагаемый", "Приложение1Расчет", "П00П1РМ106003", СвойстваРазделовДекларации, КлючиПоказателей);
	
	ДобавитьКлючПоказателя("ВидПолученияДоходаПоТС", "Приложение1Расчет", "П00П1РМ207003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("КодТранспортногоСредства", "Приложение1Расчет", "П00П1РМ208003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("МаркаМодельТС", "Приложение1Расчет", "П00П1РМ209003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ГосНомерТС", "Приложение1Расчет", "П00П1РМ210003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаПродажиТС", "Приложение1Расчет", "П00П1РМ211003", СвойстваРазделовДекларации, КлючиПоказателей);
	
	ДобавитьКлючПоказателя("НомерДоговораУступкиПрав", "Приложение1Расчет", "П00П1РМ312003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ДатаДоговораУступкиПрав", "Приложение1Расчет", "П00П1РМ313003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаДоговораУступкиПрав", "Приложение1Расчет", "П00П1РМ314003", СвойстваРазделовДекларации, КлючиПоказателей);
	
	// Приложение2
	ДобавитьКлючПоказателя("ОКСМДоходаЗаПределамиРФ", "Приложение2", "П000П20001003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ОКСМСтраныЗачисленияДоходаЗаПределамиРФ", "Приложение2", "П000П20001103", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("НаименованиеИсточникаДоходаЗаПределамиРФ", "Приложение2", "П000П20002003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ВалютаДоходаЗаПределамиРФ", "Приложение2", "П000П20003003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("КодВидаДоходаЗаПределамиРФ", "Приложение2", "П000П20003103", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("НомерКИК", "Приложение2", "П000П20003203", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ДатаПолученияДоходаЗаПределамиРФ", "Приложение2", "П000П20004003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("НалоговаяСтавкаДоходаЗаПределамиРФ", "Приложение2", "П000П20004103", СвойстваРазделовДекларации, КлючиПоказателей, Истина);
	ДобавитьКлючПоказателя("КурсНаДатуДоходаЗаПределамиРФ", "Приложение2", "П000П20005003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаДоходаЗаПределамиРФ", "Приложение2", "П000П20006003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаРубДоходаЗаПределамиРФ", "Приложение2", "П000П20007003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаДоходаОсвобождаемогоОтНалогообложенияЗаПределамиРФ", "Приложение2", "П000П20008003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("КодВидаОсвобожденияОтНалогообложенияЗаПределамиРФ", "Приложение2", "П000П20009003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ПорядокОпределенияПрибылиУбыткаКИК", "Приложение2", "П000П20010003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ДатаУплатыНалогаЗаПределамиРФ", "Приложение2", "П000П20011003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("КурсНаДатуУплатыНалогаЗаПределамиРФ", "Приложение2", "П000П20012003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалогаУплаченнаяЗаПределамиРФ", "Приложение2", "П000П20013003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалогаРубУплаченнаяЗаПределамиРФ", "Приложение2", "П000П20014003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалогаИсчисленнаяВОтношенииПрибылиКИК", "Приложение2", "П000П20015003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаНалогаИсчисленнаяДоходаЗаПределамиРФ", "Приложение2", "П000П20016003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаПодлежащаяЗачетуВРФ", "Приложение2", "П000П20017003", СвойстваРазделовДекларации, КлючиПоказателей);
	
	// Приложение3
	ДобавитьКлючПоказателя("КодВидаДеятельностиИП", "Приложение3", "П000П3М101003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаДоходаИП", "Приложение3", "П000П3М103003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаРасходовИП", "Приложение3", "П000П3М104003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("МатериальныеРасходыИП", "Приложение3", "П000П3М104103", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("АмортизацияИП", "Приложение3", "П000П3М104203", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ЗарплатаИП", "Приложение3", "П000П3М104303", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СтраховыеВзносыИП", "Приложение3", "П000П3М104403", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ПрочиеРасходыИП", "Приложение3", "П000П3М104503", СвойстваРазделовДекларации, КлючиПоказателей);
	
	ДобавитьКлючПоказателя("ОбщаяСуммаДоходаИП", "Приложение3", "П000П30005003", СвойстваРазделовДекларации, КлючиПоказателей, Истина);
	ДобавитьКлючПоказателя("ОбщаяСуммаВычетаИП", "Приложение3", "П000П30006003", СвойстваРазделовДекларации, КлючиПоказателей, Истина);
	ДобавитьКлючПоказателя("СуммаУплаченныхАвансовыхПлатежейИП", "Приложение3", "П000П30007003", СвойстваРазделовДекларации, КлючиПоказателей, Истина);
	ДобавитьКлючПоказателя("СуммаСкорректированнойНалоговойБазы", "Приложение3", "П000П30009003", СвойстваРазделовДекларации, КлючиПоказателей, Истина);
	ДобавитьКлючПоказателя("СуммаСкорректированногоНалога", "Приложение3", "П000П30010003", СвойстваРазделовДекларации, КлючиПоказателей, Истина);
	
	ДобавитьКлючПоказателя("КодИсточникаДоходаПрофессиональныхВычетов", "Приложение3", "П000П3М211003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаРасходовПоДоговорамГПХ", "Приложение3", "П000П3М212003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ФактическийРасходАвторскоеВознаграждение", "Приложение3", "П000П3М213003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("НормативныйРасходАвторскоеВознаграждение", "Приложение3", "П000П3М214003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ОбщаяСуммаПрофессиональныхВычетов", "Приложение3", "П000П3М215003", СвойстваРазделовДекларации, КлючиПоказателей);
	
	// Приложение3Продолжение
	ДобавитьКлючПоказателя("ДоходыИП1Квартал", "Приложение3Продолжение", "П000П30016003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ДоходыИППолугодие", "Приложение3Продолжение", "П000П30016103", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ДоходыИП9Месяцев", "Приложение3Продолжение", "П000П30016203", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ПрофВычетИП1Квартал", "Приложение3Продолжение", "П000П30017003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ПрофВычетИППолугодие", "Приложение3Продолжение", "П000П30017103", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ПрофВычетИП9Месяцев", "Приложение3Продолжение", "П000П30017203", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СтандартныйВычетИП1Квартал", "Приложение3Продолжение", "П000П30018003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СтандартныйВычетИППолугодие", "Приложение3Продолжение", "П000П30018103", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СтандартныйВычетИП9Месяцев", "Приложение3Продолжение", "П000П30018203", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("НалоговаяБазаИП1Квартал", "Приложение3Продолжение", "П000П30019003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("НалоговаяБазаИППолугодие", "Приложение3Продолжение", "П000П30019103", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("НалоговаяБазаИП9Месяцев", "Приложение3Продолжение", "П000П30019203", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("АвансовыйПлатежИП1Квартал", "Приложение3Продолжение", "П000П30020003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("АвансовыйПлатежИППолугодие", "Приложение3Продолжение", "П000П30020103", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("АвансовыйПлатежИП9Месяцев", "Приложение3Продолжение", "П000П30020203", СвойстваРазделовДекларации, КлючиПоказателей);
	
	// Приложение4
	ДобавитьКлючПоказателя("МатериальнаяПомощьРождениеРебенкаНеПодлежащаяНалогообложению", "Приложение4", "П000П40001003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СтоимостьПодарковНеПодлежащаяНалогообложению", "Приложение4", "П000П40002003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СтоимостьПризовНеПодлежащаяНалогообложению", "Приложение4", "П000П40003003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("МатериальнаяПомощьРаботникамНеПодлежащаяНалогообложению", "Приложение4", "П000П40004003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ОплатаЛекарственныхПрепаратовНеПодлежащаяНалогообложению", "Приложение4", "П000П40005003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СтоимостьПризовРекламаТоваровНеПодлежащаяНалогообложению", "Приложение4", "П000П40006003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("МатериальнаяПомощьИнвалидамНеПодлежащаяНалогообложению", "Приложение4", "П000П40007003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СтоимостьВыигрышейЛотерейНеПодлежащаяНалогообложению", "Приложение4", "П000П40008003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("МатериальнаяПомощьСтудентамНеПодлежащаяНалогообложению", "Приложение4", "П000П40009003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ВзносыРаботодателяНеПодлежащиеНалогообложению", "Приложение4", "П000П40010003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаДоходовПродажаДолиУставногоКапитала", "Приложение4", "П000П40010503", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ИныеДоходыНеПодлежащиеНалогообложению", "Приложение4", "П000П40011003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаДоходовНеПодлежащаяНалогообложению", "Приложение4", "П000П40012003", СвойстваРазделовДекларации, КлючиПоказателей);
	
	// Приложение5
	
	ДобавитьКлючПоказателя("СтандартныйВычетПо218_1_1", "Приложение5", "П000П50001003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СтандартныйВычетПо218_1_2", "Приложение5", "П000П50002003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя(ПомощникЗаполнения3НДФЛКлиентСервер.КлючПоляВычетГТО(), "Приложение5", "П000П50002503", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СтандартныйВычетНаДетей", "Приложение5", "П000П50003003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СтандартныйВычетНаДетейЕдинственномуРодителю", "Приложение5", "П000П50004003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СтандартныйВычетНаДетейИнвалидов", "Приложение5", "П000П50005003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СтандартныйВычетНаДетейИнвалидовЕдинственномуРодителю", "Приложение5", "П000П50006003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаСтандартныхВычетовПредоставленныхНалоговымиАгентами", "Приложение5", "П000П50007003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ОбщаяСуммаСтандартныхВычетов", "Приложение5", "П000П50008003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СоциальныйВычетПожертвования", "Приложение5", "П000П50009003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СоциальныйВычетОбучениеДетей", "Приложение5", "П000П50010003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СоциальныйВычетДорогостоящееЛечение", "Приложение5", "П000П50011003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ОбщаяСуммаСоциальныхВычетовБезОграничения", "Приложение5", "П000П50012003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СоциальныйВычетОбучениеСвое", "Приложение5", "П000П50013003", СвойстваРазделовДекларации, КлючиПоказателей);
	
	// Приложение5Продолжение
	
	ДобавитьКлючПоказателя("СоциальныйВычетОбычноеЛечение", "Приложение5", "П000П50014003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СоциальныйВычетМедикаменты", "Приложение5", "П000П50014103", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СоциальныйВычетМедицинскоеСтрахование", "Приложение5", "П000П50015003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ОбщаяСуммаПенсионныеВзносыИСтрахованиеЖизни", "Приложение5", "П000П50016003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("РасходыНаПрохождениеНезависимойОценкиКвалификации", "Приложение5", "П000П50017003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СоциальныйВычетЗаФитнес", "Приложение5", "П000П50017103", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ОбщаяСуммаСоциальныхВычетовСОграничением", "Приложение5", "П000П50018003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ОбщаяЗаявляемаяСуммаСоциальныхВычетов", "Приложение5", "П000П50019003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ОбщаяСуммаСтандартныхСоциальныхВычетов", "Приложение5", "П000П50020003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ИнвестиционныйВычет", "Приложение5", "П000П50021003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ИнвестиционныйВычетКВосстановлению", "Приложение5", "П000П50022003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СтраховыеВзносыНакопительнаяПенсия", "Приложение5", "П000П50016103", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ДолгосрочныеСбереженияНПФ", "Приложение5", "П000П50024003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ДолгосрочныеСбереженияИИС", "Приложение5", "П000П50025003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ДолгосрочныеСбереженияОбщаяСумма", "Приложение5", "П000П50028003", СвойстваРазделовДекларации, КлючиПоказателей);
	
	// Приложение5Расчет
	
	// Расчет сумм, принимаемых к вычету
	ДобавитьКлючПоказателя("ИННПенсионногоФонда", "Приложение5Расчет", "П00П5РМ101003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("КПППенсионногоФонда", "Приложение5Расчет", "П00П5РМ102003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ВидДоговораПенсионногоОбеспечения", "Приложение5Расчет", "П00П5РМ102103", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("НаименованиеПенсионногоФонда", "Приложение5Расчет", "П00П5РМ103003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ДатаДоговораПенсионногоОбеспечения", "Приложение5Расчет", "П00П5РМ104003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("НомерДоговораПенсионногоОбеспечения", "Приложение5Расчет", "П00П5РМ105003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаВзносовПенсионныйФондКВычету", "Приложение5Расчет", "П00П5РМ106003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ПризнакУпрощенногоПорядкаВычетаНПФ", "Приложение5Расчет", "П00П5РМ106103", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СтраховыеВзносыНаПенсиюКВычету", "Приложение5Расчет", "П00П5Р0007003", СвойстваРазделовДекларации, КлючиПоказателей);
	// Расчет суммы денежных средств, внесенных на индивидуальный инвестиционный счет, принимаемых к вычету
	ДобавитьКлючПоказателя("ПризнакОснованияЗаявленияВычетаИИС", "Приложение5Расчет", "П00П5РМ208003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ИННИИС", "Приложение5Расчет", "П00П5РМ209003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("КППИИС", "Приложение5Расчет", "П00П5РМ210003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("НаименованиеИИС", "Приложение5Расчет", "П00П5РМ211003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ДатаДоговораИИС", "Приложение5Расчет", "П00П5РМ212003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("НомерДоговораИИС", "Приложение5Расчет", "П00П5РМ213003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ДатаОткрытияИИС", "Приложение5Расчет", "П00П5РМ214003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ОбщаяСуммаВычетаИИС", "Приложение5Расчет", "П00П5РМ215003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ПризнакУпрощенногоПорядкаВычетаИИС", "Приложение5Расчет", "П00П5РМ216003", СвойстваРазделовДекларации, КлючиПоказателей);
	
	// Приложение6
	
	ДобавитьКлючПоказателя("ИмущественныйВычетПродажаЖилойНедвижимости", "Приложение6", "П000П60001003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("РасходыПродажаЖилойНедвижимости", "Приложение6", "П000П60002003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ИмущественныйВычетПродажаДолиЖилойНедвижимости", "Приложение6", "П000П60003003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("РасходыПродажаДолиЖилойНедвижимости", "Приложение6", "П000П60004003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ИмущественныйВычетПродажаИнойНедвижимости", "Приложение6", "П000П60005003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("РасходыПродажаИнойНедвижимости", "Приложение6", "П000П60006003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ИмущественныйВычетПродажаИногоИмущества", "Приложение6", "П000П60007003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("РасходыПродажаИногоИмущества", "Приложение6", "П000П60008003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("РасходыПродажаДолиУставногоКапитала", "Приложение6", "П000П60012003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("РасходыДолевоеСтроительство", "Приложение6", "П000П60015003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ОбщаяСуммаИмущественногоВычета", "Приложение6", "П000П60016003", СвойстваРазделовДекларации, КлючиПоказателей);
	
	// Приложение7
	
	ДобавитьКлючПоказателя("КодНаименованияОбъектаНедвижимости", "Приложение7", "П000П7М101003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ПризнакНалогоплательщикаОбъектаНедвижимости", "Приложение7", "П000П7М102003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СпособПриобретенияНедвижимости", "Приложение7", "П000П7М102003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("КадастровыйНомерОбъектаНедвижимости", "Приложение7", "П000П7М103203", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("АдресОбъектаНедвижимости", "Приложение7", "П000П7М103303", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ДатаАктаОПередачеОбъектаНедвижимости", "Приложение7", "П000П7М104003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ДатаРегистрацииПравСобственностиНаЖилье", "Приложение7", "П000П7М105003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаРасходовНаПриобретениеНедвижимости", "Приложение7", "П000П7М108003", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("СуммаПроцентовПоКредитуНаНедвижимость", "Приложение7", "П000П7М109003", СвойстваРазделовДекларации, КлючиПоказателей);
	
	ДобавитьКлючПоказателя("СуммаВычетовЗаПредыдущиеГодыПоРасходамНаПриобретениеНедвижимости", "Приложение7", "П000П70010003", СвойстваРазделовДекларации, КлючиПоказателей, Истина);
	ДобавитьКлючПоказателя("СуммаВычетовЗаПредыдущиеГодыПроцентыПоКредиту", "Приложение7", "П000П70011003", СвойстваРазделовДекларации, КлючиПоказателей, Истина);
	ДобавитьКлючПоказателя("РазмерНалоговойБазыДляРасчетаИмущественногоВычета", "Приложение7", "П000П70014003", СвойстваРазделовДекларации, КлючиПоказателей, Истина);
	ДобавитьКлючПоказателя("СуммаРасходовНаПриобретениеНедвижимостиКВычету", "Приложение7", "П000П70015003", СвойстваРазделовДекларации, КлючиПоказателей, Истина);
	ДобавитьКлючПоказателя("СуммаПроцентовПоКредитуНаНедвижимостьКВычету", "Приложение7", "П000П70016003", СвойстваРазделовДекларации, КлючиПоказателей, Истина);
	ДобавитьКлючПоказателя("ОстатокНаКонецРасходыНаПриобретениеНедвижимости", "Приложение7", "П000П70017003", СвойстваРазделовДекларации, КлючиПоказателей, Истина);
	ДобавитьКлючПоказателя("ОстатокНаКонецПроцентыПоКредитуНаНедвижимость", "Приложение7", "П000П70018003", СвойстваРазделовДекларации, КлючиПоказателей, Истина);
	
	// Приложение8
	ДобавитьКлючПоказателя("ЦенныеБумагиВидОперации", "Приложение8", "П000П80001003", СвойстваРазделовДекларации, КлючиПоказателей, Истина);
	ДобавитьКлючПоказателя("ЦенныеБумагиСуммаДохода", "Приложение8", "П000П80002003", СвойстваРазделовДекларации, КлючиПоказателей, Истина);
	ДобавитьКлючПоказателя("ЦенныеБумагиСуммаРасходовПоРеализации", "Приложение8", "П000П80003003", СвойстваРазделовДекларации, КлючиПоказателей, Истина);
	ДобавитьКлючПоказателя("ЦенныеБумагиСуммаРасходовУменьшающаяДоходы", "Приложение8", "П000П80004003", СвойстваРазделовДекларации, КлючиПоказателей, Истина);
	ДобавитьКлючПоказателя("ЦенныеБумагиПризнакУчетаУбытков", "Приложение8", "П000П80005003", СвойстваРазделовДекларации, КлючиПоказателей, Истина);
	ДобавитьКлючПоказателя("ЦенныеБумагиСуммаПрибылиКВычету", "Приложение8", "П000П80006003", СвойстваРазделовДекларации, КлючиПоказателей, Истина);
	ДобавитьКлючПоказателя("ЦенныеБумагиСуммаПрибылиПоОперациямНаИИСкВычету", "Приложение8", "П000П80007003", СвойстваРазделовДекларации, КлючиПоказателей, Истина);
	
	ДобавитьКлючПоказателя("ЦенныеБумагиУчетУбытковВидОперации", "Приложение8", "П000П8М105103", СвойстваРазделовДекларации, КлючиПоказателей);
	ДобавитьКлючПоказателя("ЦенныеБумагиСуммаУбытка", "Приложение8", "П000П8М105203", СвойстваРазделовДекларации, КлючиПоказателей);
	
	Возврат КлючиПоказателей;
	
КонецФункции

Функция РазмерыВычетов2025()
	
	РазмерыВычетов = Новый Структура;
	
	РазмерыВычетов.Вставить("СтандартныйВычетНаДетей", Новый Структура);
	РазмерыВычетов.СтандартныйВычетНаДетей.Вставить("ПервыйРебенок", 1400);
	РазмерыВычетов.СтандартныйВычетНаДетей.Вставить("ВторойРебенок", 2800);
	РазмерыВычетов.СтандартныйВычетНаДетей.Вставить("ТретийРебенок", 6000);
	РазмерыВычетов.СтандартныйВычетНаДетей.Вставить("РоднойИнвалид", 12000);
	РазмерыВычетов.СтандартныйВычетНаДетей.Вставить("ПриемныйИнвалид", 12000);
	
	РазмерыВычетов.Вставить("СтандартныйВычетНаНалогоплательщика", Новый Соответствие);
	РазмерыВычетов.СтандартныйВычетНаНалогоплательщика.Вставить(
		Перечисления.СтандартныеВычетыНаНалогоплательщика.ВычетПо218_1_1, 3000);
	РазмерыВычетов.СтандартныйВычетНаНалогоплательщика.Вставить(
		Перечисления.СтандартныеВычетыНаНалогоплательщика.ВычетПо218_1_2, 500);
	
	РазмерыВычетов.Вставить(ПомощникЗаполнения3НДФЛКлиентСервер.КлючПоляВычетГТО(), 18000);
	
	Возврат РазмерыВычетов;
	
КонецФункции

Функция ПределыВычетов2025(РазмерыВычетов)
	
	ПределыВычетов = Новый Структура;
	ПределыВычетов.Вставить("СоциальныеВычеты", 150000);
	ПределыВычетов.Вставить("ПожертвованияПроцентДохода", 0.25);
	ПределыВычетов.Вставить("ПожертвованияФондыПроцентДохода", 0.3);
	ПределыВычетов.Вставить("ВычетНаДетейДоходы", 450000);
	
	ВычетНаНалогоплательщика = СтандартныйВычетНаНалогоплательщика(РазмерыВычетов);
	
	Для Каждого ТекущийВычет Из ВычетНаНалогоплательщика Цикл
		Если ТекущийВычет.Ключ = ПомощникЗаполнения3НДФЛКлиентСервер.КлючПоляВычетГТО() Тогда
			// Вычет предоставляется всей суммой с квартала, когда получен знак отличия ГТО
			ПределыВычетов.Вставить(ТекущийВычет.Ключ, ТекущийВычет.Значение);
		Иначе
			// Предел стандартного вычета на налогоплательщика вычисляется из значения за месяц * 12 мес.
			ПределыВычетов.Вставить(ТекущийВычет.Ключ, ТекущийВычет.Значение * 12);
		КонецЕсли;
	КонецЦикла;
	
	ПределыВычетов.Вставить("ПродажаЖилойНедвижимости", 1000000);
	ПределыВычетов.Вставить("ПродажаИногоИмущества", 250000);
	ПределыВычетов.Вставить("НаПриобретениеНедвижимостиСтоимость", 2000000);
	ПределыВычетов.Вставить("НаПриобретениеНедвижимостиПроценты", 3000000);
	
	ПределыВычетов.Вставить("ИнвестиционныйВычет", 400000);
	ПределыВычетов.Вставить("ДолгосрочныеСбереженияИИС", 30000000);
	ПределыВычетов.Вставить("ДолгосрочныеСбереженияНПФ", 400000);
	
	Возврат ПределыВычетов;
	
КонецФункции

Функция КодыВидовПредпринимательскойДеятельности2025()
	
	КодыВидовПредпринимательскойДеятельности = Новый Структура;
	КодыВидовПредпринимательскойДеятельности.Вставить("ПредпринимательскаяДеятельность", "01");
	КодыВидовПредпринимательскойДеятельности.Вставить("НотариальнаяДеятельность", "02");
	КодыВидовПредпринимательскойДеятельности.Вставить("АдвокатскаяДеятельность", "03");
	КодыВидовПредпринимательскойДеятельности.Вставить("ДеятельностьАрбитражногоУправляющего", "04");
	КодыВидовПредпринимательскойДеятельности.Вставить("ДеятельностьГлавыКФХ", "05");
	КодыВидовПредпринимательскойДеятельности.Вставить("ДеятельностьОценщика", "06");
	КодыВидовПредпринимательскойДеятельности.Вставить("ДеятельностьПатентногоПоверенного", "07");
	КодыВидовПредпринимательскойДеятельности.Вставить("ДеятельностьМедиатора", "08");
	КодыВидовПредпринимательскойДеятельности.Вставить("ИнаяДеятельность", "09");
	КодыВидовПредпринимательскойДеятельности.Вставить("Майнинг", "10");
	КодыВидовПредпринимательскойДеятельности.Вставить("ПродажаКриптовалюты", "11");
	КодыВидовПредпринимательскойДеятельности.Вставить("ДроблениеБизнеса", "12");
	
	Возврат КодыВидовПредпринимательскойДеятельности;
	
КонецФункции

Функция КодыВидовДоговоровДобровольныхВзносов2025()
	
	КодыВидовДоговоров = Новый Структура;
	КодыВидовДоговоров.Вставить("ПенсионноеОбеспечение", "1");
	КодыВидовДоговоров.Вставить("ПенсионноеСтрахование", "2");
	КодыВидовДоговоров.Вставить("СтрахованиеЖизни", "3");
	КодыВидовДоговоров.Вставить("ДолгосрочныеСбережения", "4");
	
	Возврат КодыВидовДоговоров;
	
КонецФункции

Функция КодыВидовДоходов2025()
	
	КодыВидовДоходов = Новый Структура;
	КодыВидовДоходов.Вставить("Дивиденды", "001");
	КодыВидовДоходов.Вставить("ВыигрышиВЛотереяхАзартныхИграх", "002");
	КодыВидовДоходов.Вставить("ОперацииСЦеннымиБумагами", "003");
	КодыВидовДоходов.Вставить("ПрибыльКИК", "005");
	КодыВидовДоходов.Вставить("ФиксированнаяПрибыльКИК", "006");
	КодыВидовДоходов.Вставить("ПредпринимательскаяДеятельность", "007");
	КодыВидовДоходов.Вставить("СдачаИмуществаВАренду", "008");
	КодыВидовДоходов.Вставить("ЦифровыеПрава", "009");
	КодыВидовДоходов.Вставить("ИнойДоходПоПрогрессивнойШкале", "010");
	КодыВидовДоходов.Вставить("РаспределениеПрибылиИностраннойСтруктуры", "011");
	КодыВидовДоходов.Вставить("Роялти_ЗаПределамиРФ", "012");
	КодыВидовДоходов.Вставить("БанковскиеПроценты_ЗаПределамиРФ", "013");
	КодыВидовДоходов.Вставить("БанковскиеПроценты", "014");
	КодыВидовДоходов.Вставить("БанковскиеПроценты_Нерезидентов", "015");
	КодыВидовДоходов.Вставить("ОплатаТрудаНерезидентов", "016");
	КодыВидовДоходов.Вставить("СтраховаяВыплата", "017");
	КодыВидовДоходов.Вставить("ПродажаИмущества", "018");
	КодыВидовДоходов.Вставить("Выигрыш", "019");
	КодыВидовДоходов.Вставить("ИнойДоход_Нерезидентов", "020");
	КодыВидовДоходов.Вставить("Дивиденды_Нерезидентов", "021");
	КодыВидовДоходов.Вставить("ДивидендыПубличныхКомпаний_Нерезидентов", "022");
	КодыВидовДоходов.Вставить("ИнойДоходПоИнойСтавке", "025");
	КодыВидовДоходов.Вставить("ИнвестиционноеТоварищество", "026");
	КодыВидовДоходов.Вставить("Майнинг", "027");
	КодыВидовДоходов.Вставить("МайнингИП", "028");
	КодыВидовДоходов.Вставить("ОперацииСКриптовалютойИП", "029");
	КодыВидовДоходов.Вставить("ЦифровыеАктивы", "030");
	КодыВидовДоходов.Вставить("МатВыгодаОтПродажиДолиУставногоКапитала", "031");
	КодыВидовДоходов.Вставить("ПродажаДолиУставногоКапитала", "032");
	КодыВидовДоходов.Вставить("ОперацииРЕПО", "033");
	КодыВидовДоходов.Вставить("ОперацииСЦеннымиБумагамиИИС", "034");
	КодыВидовДоходов.Вставить("ОперацииСКриптовалютой", "035");
	КодыВидовДоходов.Вставить("ОплатаТрудаСВО", "036");
	КодыВидовДоходов.Вставить("ОплатаТрудаСевер", "037");
	КодыВидовДоходов.Вставить("ЭкономияНаПроцентах", "038");
	КодыВидовДоходов.Вставить("Паи", "039");
	КодыВидовДоходов.Вставить("ОблигацииДо2007", "040");
	КодыВидовДоходов.Вставить("ВыигрышНерезидентов", "041");
	КодыВидовДоходов.Вставить("ОперацииРЕПОНерезидентов", "042");
	КодыВидовДоходов.Вставить("ОперацииСЦеннымиБумагамиНерезидентов", "043");
	КодыВидовДоходов.Вставить("ПродажаИмуществаНерезидентов", "044");
	КодыВидовДоходов.Вставить("ЦифровыеАктивыНерезидентов", "045");
	КодыВидовДоходов.Вставить("ИнойДоходПоИнойСтавкеНерезидентов", "046");
	
	Возврат КодыВидовДоходов;
	
КонецФункции

Функция КодыГруппДоходов2025()
	
	КодыВидовДоходов = КодыВидовДоходов2025();
	ГруппыДоходов = ПомощникЗаполнения3НДФЛКлиентСервер.ГруппыДоходов();
	
	Результат = Новый Соответствие;
	Результат.Вставить(КодыВидовДоходов.Дивиденды, ГруппыДоходов.Имущество); // 001
	Результат.Вставить(КодыВидовДоходов.ВыигрышиВЛотереяхАзартныхИграх, ГруппыДоходов.Основная); // 002
	Результат.Вставить(КодыВидовДоходов.ОперацииСЦеннымиБумагами, ГруппыДоходов.Имущество); // 003
	Результат.Вставить(КодыВидовДоходов.ПрибыльКИК, ГруппыДоходов.Основная); // 005
	Результат.Вставить(КодыВидовДоходов.ФиксированнаяПрибыльКИК, ГруппыДоходов.Основная); // 006
	Результат.Вставить(КодыВидовДоходов.ПредпринимательскаяДеятельность, ГруппыДоходов.Основная); // 007
	Результат.Вставить(КодыВидовДоходов.СдачаИмуществаВАренду, ГруппыДоходов.Основная); // 008
	Результат.Вставить(КодыВидовДоходов.ЦифровыеПрава, ГруппыДоходов.Имущество); // 009
	Результат.Вставить(КодыВидовДоходов.ИнойДоходПоПрогрессивнойШкале, ГруппыДоходов.Основная); // 010
	Результат.Вставить(КодыВидовДоходов.РаспределениеПрибылиИностраннойСтруктуры, ГруппыДоходов.Основная); // 011
	Результат.Вставить(КодыВидовДоходов.Роялти_ЗаПределамиРФ, ГруппыДоходов.Основная); // 012
	Результат.Вставить(КодыВидовДоходов.БанковскиеПроценты_ЗаПределамиРФ, ГруппыДоходов.Основная); // 013
	Результат.Вставить(КодыВидовДоходов.БанковскиеПроценты, ГруппыДоходов.Имущество); // 014
	Результат.Вставить(КодыВидовДоходов.БанковскиеПроценты_Нерезидентов, ГруппыДоходов.БанковскиеПроцентыНерезиденты); // 015
	Результат.Вставить(КодыВидовДоходов.ОплатаТрудаНерезидентов, ГруппыДоходов.ОплатаТрудаНерезидентов); // 016
	Результат.Вставить(КодыВидовДоходов.СтраховаяВыплата, ГруппыДоходов.Имущество); // 017
	Результат.Вставить(КодыВидовДоходов.ПродажаИмущества, ГруппыДоходов.Имущество); // 018
	Результат.Вставить(КодыВидовДоходов.Выигрыш, ГруппыДоходов.ВыигрышЭкономияПаи); // 019
	Результат.Вставить(КодыВидовДоходов.ИнойДоход_Нерезидентов, ГруппыДоходов.Нерезиденты); // 020
	Результат.Вставить(КодыВидовДоходов.Дивиденды_Нерезидентов, ГруппыДоходов.ДивидендыНерезидентов); // 021
	Результат.Вставить(КодыВидовДоходов.ДивидендыПубличныхКомпаний_Нерезидентов, ГруппыДоходов.ДивидендыПАОНерезиденты); // 022
	Результат.Вставить(КодыВидовДоходов.ИнойДоходПоИнойСтавке, ГруппыДоходов.ИныеДоходы); // 025
	Результат.Вставить(КодыВидовДоходов.ИнвестиционноеТоварищество, ГруппыДоходов.Основная); // 026
	Результат.Вставить(КодыВидовДоходов.Майнинг, ГруппыДоходов.Основная); // 027
	Результат.Вставить(КодыВидовДоходов.МайнингИП, ГруппыДоходов.Основная); // 028
	Результат.Вставить(КодыВидовДоходов.ОперацииСКриптовалютойИП, ГруппыДоходов.Основная); // 029
	Результат.Вставить(КодыВидовДоходов.ЦифровыеАктивы, ГруппыДоходов.Имущество); // 030
	Результат.Вставить(КодыВидовДоходов.МатВыгодаОтПродажиДолиУставногоКапитала, ГруппыДоходов.Имущество); // 031
	Результат.Вставить(КодыВидовДоходов.ПродажаДолиУставногоКапитала, ГруппыДоходов.Имущество); // 032
	Результат.Вставить(КодыВидовДоходов.ОперацииРЕПО, ГруппыДоходов.Имущество); // 033
	Результат.Вставить(КодыВидовДоходов.ОперацииСЦеннымиБумагамиИИС, ГруппыДоходов.Имущество); // 034
	Результат.Вставить(КодыВидовДоходов.ОперацииСКриптовалютой, ГруппыДоходов.Имущество); // 035
	Результат.Вставить(КодыВидовДоходов.ОплатаТрудаСВО, ГруппыДоходов.ОсобыеУсловия); // 036
	Результат.Вставить(КодыВидовДоходов.ОплатаТрудаСевер, ГруппыДоходов.ОсобыеУсловия); // 037
	Результат.Вставить(КодыВидовДоходов.ЭкономияНаПроцентах, ГруппыДоходов.ВыигрышЭкономияПаи); // 038
	Результат.Вставить(КодыВидовДоходов.Паи, ГруппыДоходов.ВыигрышЭкономияПаи); // 039
	Результат.Вставить(КодыВидовДоходов.ОблигацииДо2007, ГруппыДоходов.ВыигрышЭкономияПаи); // 040
	Результат.Вставить(КодыВидовДоходов.ВыигрышНерезидентов, ГруппыДоходов.Нерезиденты); // 041
	Результат.Вставить(КодыВидовДоходов.ОперацииРЕПОНерезидентов, ГруппыДоходов.Нерезиденты); // 042
	Результат.Вставить(КодыВидовДоходов.ОперацииСЦеннымиБумагамиНерезидентов, ГруппыДоходов.Нерезиденты); // 043
	Результат.Вставить(КодыВидовДоходов.ПродажаИмуществаНерезидентов, ГруппыДоходов.Нерезиденты); // 044
	Результат.Вставить(КодыВидовДоходов.ЦифровыеАктивыНерезидентов, ГруппыДоходов.Нерезиденты); // 045
	Результат.Вставить(КодыВидовДоходов.ИнойДоходПоИнойСтавкеНерезидентов, ГруппыДоходов.ИныеДоходыНерезидентов); // 046
	
	Возврат Результат;
	
КонецФункции

Функция КодыПризнакаНалогоплательщикаДляИмущественногоВычета2025()
	
	КодыНалогоплательщика = Новый Структура;
	КодыНалогоплательщика.Вставить("Собственник", "01");
	КодыНалогоплательщика.Вставить("СобственникПенсионер", "11");
	КодыНалогоплательщика.Вставить("СупругСобственника", "02");
	КодыНалогоплательщика.Вставить("СупругСобственникаПенсионер", "12");
	КодыНалогоплательщика.Вставить("Родитель", "03");
	КодыНалогоплательщика.Вставить("РодительПенсионер", "04");
	КодыНалогоплательщика.Вставить("СобственникСРебенком", "13");
	КодыНалогоплательщика.Вставить("СобственникСРебенкомПенсионер", "14");
	КодыНалогоплательщика.Вставить("СупругСобственникаСРебенком", "23");
	КодыНалогоплательщика.Вставить("СупругСобственникаСРебенкомПенсионер", "24");
	
	Возврат КодыНалогоплательщика;
	
КонецФункции

Функция КодыНаименованияОбъектаНедвижимости2025()
	
	КодыОбъектаНедвижимости = Новый Структура;
	КодыОбъектаНедвижимости.Вставить("ЖилойДом", "1");
	КодыОбъектаНедвижимости.Вставить("Квартира", "2");
	КодыОбъектаНедвижимости.Вставить("Комната", "3");
	КодыОбъектаНедвижимости.Вставить("ЗемельныйУчастокПодСтроительство", "5");
	КодыОбъектаНедвижимости.Вставить("ЗемельныйУчасток", "6");
	КодыОбъектаНедвижимости.Вставить("ДоляВДоме", "7");
	КодыОбъектаНедвижимости.Вставить("ДоляВКвартире", "8");
	
	Возврат КодыОбъектаНедвижимости;
	
КонецФункции

Функция КодыВидовОперацийСЦеннымиБумагами2025()
	
	КодыВидовОпераций = Новый Структура;
	
	// Не учитываемые на индивидуальном инвестиционном счете
	КодыВидовОпераций.Вставить("ЦенныеБумагиНаОрганизованномРынке", "01");
	КодыВидовОпераций.Вставить("ЦенныеБумагиПрекратившиеОбращение", "03");
	КодыВидовОпераций.Вставить("ЦенныеБумагиНаПрочихРынках", "04");
	КодыВидовОпераций.Вставить("ПФИсЦенныхБумагНаОрганизованномРынке", "06");
	КодыВидовОпераций.Вставить("ПФИсТоваровНаОрганизованномРынке", "07");
	КодыВидовОпераций.Вставить("ПФИнаПрочихРынках", "08");
	КодыВидовОпераций.Вставить("РЕПО", "10");
	КодыВидовОпераций.Вставить("Займы", "12");
	КодыВидовОпераций.Вставить("ПрочиеОперации", "15");
	
	// Учитываемые на индивидуальном инвестиционном счете
	КодыВидовОпераций.Вставить("ЦенныеБумагиНаОрганизованномРынкеИИС", "16");
	КодыВидовОпераций.Вставить("ЦенныеБумагиПрекратившиеОбращениеИИС", "18");
	КодыВидовОпераций.Вставить("ЦенныеБумагиНаПрочихРынкахИИС", "19");
	КодыВидовОпераций.Вставить("ПФИсЦенныхБумагНаОрганизованномРынкеИИС", "21");
	КодыВидовОпераций.Вставить("ПФИсТоваровНаОрганизованномРынкеИИС", "22");
	КодыВидовОпераций.Вставить("ПФИнаПрочихРынкахИИС", "23");
	КодыВидовОпераций.Вставить("РЕПОнаИИС", "25");
	КодыВидовОпераций.Вставить("ЗаймыИИС", "27");
	КодыВидовОпераций.Вставить("ПрочиеОперацииИИС", "30");
	
	// Убытки прошлых лет
	КодыВидовОпераций.Вставить("УбыткиПоЦеннымБумагам", "31");
	КодыВидовОпераций.Вставить("УбыткиПоПФИ", "32");
	КодыВидовОпераций.Вставить("УбыткиПоЦеннымБумагамНаИИС", "16");
	КодыВидовОпераций.Вставить("УбыткиПоПФИнаИИС", "21");
	
	Возврат КодыВидовОпераций;
	
КонецФункции

Функция ВидыДоходовДляСтандартныхСоциальныхИмущественногоВычетов2025()
	
	КодыВидовДоходов = КодыВидовДоходов2025();
	
	Результат = Новый Массив;
	Результат.Добавить(КодыВидовДоходов.ПредпринимательскаяДеятельность); // 007
	Результат.Добавить(КодыВидовДоходов.СдачаИмуществаВАренду); // 008
	Результат.Добавить(КодыВидовДоходов.ИнойДоходПоПрогрессивнойШкале); // 010
	Результат.Добавить(КодыВидовДоходов.РаспределениеПрибылиИностраннойСтруктуры); // 011
	Результат.Добавить(КодыВидовДоходов.Роялти_ЗаПределамиРФ); // 012
	Результат.Добавить(КодыВидовДоходов.БанковскиеПроценты_ЗаПределамиРФ); // 013
	Результат.Добавить(КодыВидовДоходов.БанковскиеПроценты); // 014
	Результат.Добавить(КодыВидовДоходов.СтраховаяВыплата); // 017
	Результат.Добавить(КодыВидовДоходов.ПродажаИмущества); // 018
	Результат.Добавить(КодыВидовДоходов.МатВыгодаОтПродажиДолиУставногоКапитала); // 031
	Результат.Добавить(КодыВидовДоходов.ПродажаДолиУставногоКапитала); // 032
	Результат.Добавить(КодыВидовДоходов.ОперацииРЕПО); // 033
	Результат.Добавить(КодыВидовДоходов.ОперацииСЦеннымиБумагамиИИС); // 034
	Результат.Добавить(КодыВидовДоходов.ОплатаТрудаСВО); // 036
	Результат.Добавить(КодыВидовДоходов.ОплатаТрудаСевер); // 037
	
	Возврат Результат;
	
КонецФункции

Функция НоваяТаблицаДанныхЗаполнения2025()
	
	ДанныеЗаполнения = Новый ТаблицаЗначений;
	ДанныеЗаполнения.Колонки.Добавить("ГруппаДоходов", ОбщегоНазначения.ОписаниеТипаСтрока(2));
	ДанныеЗаполнения.Колонки.Добавить("ВидДохода", ОбщегоНазначения.ОписаниеТипаСтрока(3));
	ДанныеЗаполнения.Колонки.Добавить("НалоговаяСтавка", ОбщегоНазначения.ОписаниеТипаЧисло(2, 0));
	ДанныеЗаполнения.Колонки.Добавить("КБК", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ДанныеЗаполнения.Колонки.Добавить("ОКТМО", ОбщегоНазначения.ОписаниеТипаСтрока(11));
	ДанныеЗаполнения.Колонки.Добавить("СтруктураДанных", Новый ОписаниеТипов("Структура"));
	ДанныеЗаполнения.Колонки.Добавить("СуммаОблагаемогоДохода", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ДанныеЗаполнения.Колонки.Добавить("СуммаНалогаИсчисленная", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ДанныеЗаполнения.Колонки.Добавить("СуммаНалогаУплаченнаяУдержанная", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ДанныеЗаполнения.Колонки.Добавить("Информация", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Функция НалоговыеСтавки2025()
	
	ВидыДоходов = КодыВидовДоходов2025();
	
	НалоговыеСтавки = Новый Соответствие;
	НалоговыеСтавки.Вставить(ВидыДоходов.Дивиденды, "13/15"); // 01
	НалоговыеСтавки.Вставить(ВидыДоходов.ВыигрышиВЛотереяхАзартныхИграх, "13/15/18/20/22"); // 02
	НалоговыеСтавки.Вставить(ВидыДоходов.ОперацииСЦеннымиБумагами, "13/15"); // 03
	НалоговыеСтавки.Вставить(ВидыДоходов.ПрибыльКИК, "13/15/18/20/22"); // 05
	НалоговыеСтавки.Вставить(ВидыДоходов.ФиксированнаяПрибыльКИК, "13/15/18/20/22"); // 06
	НалоговыеСтавки.Вставить(ВидыДоходов.ПредпринимательскаяДеятельность, "13/15/18/20/22"); // 07
	НалоговыеСтавки.Вставить(ВидыДоходов.СдачаИмуществаВАренду, "13/15/18/20/22"); // 08
	НалоговыеСтавки.Вставить(ВидыДоходов.ЦифровыеПрава, "13/15"); // 09
	НалоговыеСтавки.Вставить(ВидыДоходов.ИнойДоходПоПрогрессивнойШкале, "13/15/18/20/22"); // 10
	НалоговыеСтавки.Вставить(ВидыДоходов.РаспределениеПрибылиИностраннойСтруктуры, "13/15/18/20/22"); // 11
	НалоговыеСтавки.Вставить(ВидыДоходов.Роялти_ЗаПределамиРФ, "13/15/18/20/22"); // 12
	НалоговыеСтавки.Вставить(ВидыДоходов.БанковскиеПроценты_ЗаПределамиРФ, "13/15/18/20/22"); // 13
	НалоговыеСтавки.Вставить(ВидыДоходов.БанковскиеПроценты, "13/15"); // 14
	НалоговыеСтавки.Вставить(ВидыДоходов.БанковскиеПроценты_Нерезидентов, "15"); // 15
	НалоговыеСтавки.Вставить(ВидыДоходов.ОплатаТрудаНерезидентов, "13/15/18/20/22"); // 16
	НалоговыеСтавки.Вставить(ВидыДоходов.СтраховаяВыплата, "13/15"); // 17
	НалоговыеСтавки.Вставить(ВидыДоходов.ПродажаИмущества, "13/15"); // 18
	НалоговыеСтавки.Вставить(ВидыДоходов.Выигрыш, "35"); // 19
	НалоговыеСтавки.Вставить(ВидыДоходов.ИнойДоход_Нерезидентов, "30"); // 20
	НалоговыеСтавки.Вставить(ВидыДоходов.Дивиденды_Нерезидентов, "15"); // 21
	НалоговыеСтавки.Вставить(ВидыДоходов.ДивидендыПубличныхКомпаний_Нерезидентов, "5"); // 22
	НалоговыеСтавки.Вставить(ВидыДоходов.ИнойДоходПоИнойСтавке, ""); // 25
	НалоговыеСтавки.Вставить(ВидыДоходов.ИнвестиционноеТоварищество, "13/15/18/20/22"); // 26
	НалоговыеСтавки.Вставить(ВидыДоходов.Майнинг, "13/15/18/20/22"); // 27
	НалоговыеСтавки.Вставить(ВидыДоходов.МайнингИП, "13/15/18/20/22"); // 28
	НалоговыеСтавки.Вставить(ВидыДоходов.ОперацииСКриптовалютойИП, "13/15/18/20/22"); // 29
	НалоговыеСтавки.Вставить(ВидыДоходов.ЦифровыеАктивы, "13/15"); // 30
	НалоговыеСтавки.Вставить(ВидыДоходов.МатВыгодаОтПродажиДолиУставногоКапитала, "13/15"); // 31
	НалоговыеСтавки.Вставить(ВидыДоходов.ПродажаДолиУставногоКапитала, "13/15"); // 32
	НалоговыеСтавки.Вставить(ВидыДоходов.ОперацииРЕПО, "13/15"); // 33
	НалоговыеСтавки.Вставить(ВидыДоходов.ОперацииСЦеннымиБумагамиИИС, "13/15"); // 34
	НалоговыеСтавки.Вставить(ВидыДоходов.ОперацииСКриптовалютой, "13/15"); // 35
	НалоговыеСтавки.Вставить(ВидыДоходов.ОплатаТрудаСВО, "13/15"); // 36
	НалоговыеСтавки.Вставить(ВидыДоходов.ОплатаТрудаСевер, "13/15"); // 37
	НалоговыеСтавки.Вставить(ВидыДоходов.ЭкономияНаПроцентах, "35"); // 38
	НалоговыеСтавки.Вставить(ВидыДоходов.Паи, "35"); // 39
	НалоговыеСтавки.Вставить(ВидыДоходов.ОблигацииДо2007, "9"); // 40
	НалоговыеСтавки.Вставить(ВидыДоходов.ВыигрышНерезидентов, "30"); // 41
	НалоговыеСтавки.Вставить(ВидыДоходов.ОперацииРЕПОНерезидентов, "30"); // 42
	НалоговыеСтавки.Вставить(ВидыДоходов.ОперацииСЦеннымиБумагамиНерезидентов, "30"); // 43
	НалоговыеСтавки.Вставить(ВидыДоходов.ПродажаИмуществаНерезидентов, "30"); // 44
	НалоговыеСтавки.Вставить(ВидыДоходов.ЦифровыеАктивыНерезидентов, "30"); // 45
	НалоговыеСтавки.Вставить(ВидыДоходов.ИнойДоходПоИнойСтавкеНерезидентов, ""); // 46
	
	Возврат НалоговыеСтавки;
	
КонецФункции

Процедура СведенияОПоказателяхОтчета3НДФЛ2025(ИДРедакцииОтчета, ПоказателиОтчета)
	
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П00001М103003", Истина, Ложь); // ОКТМО
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П00001М104003", Истина, Ложь); // СуммаНалога
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П00001М105003", Истина, Ложь); // СуммаВозвратаНалога
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000П3М101003", Истина, Ложь); // КодВидаДеятельностиИП
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000П3М103003", Истина, Ложь); // СуммаДоходаИП
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000П3М104003", Истина, Ложь); // СуммаРасходовИП
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000П3М104103", Истина, Ложь); // МатериальныеРасходыИП
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000П3М104203", Истина, Ложь); // АмортизацияИП
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000П3М104303", Истина, Ложь); // ЗарплатаИП
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000П3М104403", Истина, Ложь); // СтраховыеВзносыИП
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000П3М104503", Истина, Ложь); // ПрочиеРасходыИП
	
КонецПроцедуры

Функция КБК2025()
	
	КБК = Новый Структура;
	КБК.Вставить("ДоходыПолученныеОтНалоговыхАгентов", "18210102010011000110");
	КБК.Вставить("ДоходыПолученныеОтНалоговыхАгентов15", "18210102080011000110");
	КБК.Вставить("ДоходыПолученныеОтНалоговыхАгентов18", "18210102150011000110");
	КБК.Вставить("ДоходыПолученныеОтНалоговыхАгентов20", "18210102160011000110");
	КБК.Вставить("ДоходыПолученныеОтНалоговыхАгентов22", "18210102170011000110");
	
	КБК.Вставить("ДоходыОтПредпринимательскойДеятельности", "18210102020011000110");
	КБК.Вставить("ДоходыПриПолученииКоторыхНеУдержанНалог", "18210102030011000110");
	КБК.Вставить("ФиксированныеПлатежиИностранныхГраждан", "18210102040011000110");
	КБК.Вставить("ДоходыВВидеБанковскихПроцентов", "18210102060011000110");
	КБК.Вставить("ДоходыВВидеПроцентовПоОблигациям", "18210102070011000110");
	КБК.Вставить("ДоходыОблагаемыеПоПовышеннойСтавке", "18210102080011000110");
	
	КБК.Вставить("ДоходыСПрибылиКИК", "18210102050011000110");
	КБК.Вставить("ДоходыСПрибылиКИК15", "18210102100011000110");
	КБК.Вставить("ДоходыСПрибылиКИК18", "18210102101011000110");
	КБК.Вставить("ДоходыСПрибылиКИК20", "18210102102011000110");
	КБК.Вставить("ДоходыСПрибылиКИК22", "18210102103011000110");
	
	КБК.Вставить("ДоходыСПрибылиКИКОсобыйПорядокУплаты", "18210102090011000110");
	КБК.Вставить("ДоходыСПрибылиКИКОсобыйПорядокУплаты15", "18210102110011000110");
	КБК.Вставить("ДоходыСПрибылиКИКОсобыйПорядокУплаты18", "18210102111011000110");
	КБК.Вставить("ДоходыСПрибылиКИКОсобыйПорядокУплаты20", "18210102112011000110");
	КБК.Вставить("ДоходыСПрибылиКИКОсобыйПорядокУплаты22", "18210102113011000110");
	
	КБК.Вставить("НалогПоПовышеннойСтавкеНаОснованииУведомления", "18210102120011000110");
	КБК.Вставить("ДоходыСДивидендов", "18210102130011000110");
	КБК.Вставить("ДоходыСДивидендовПоПовышеннойСтавке", "18210102140011000110");
	
	КБК.Вставить("ДоходыВОсобыхУсловиях", "18210102210011000110");
	КБК.Вставить("ДоходыВОсобыхУсловияхПоПовышеннойСтавке", "18210102230011000110");
	
	Возврат КБК;
	
КонецФункции

Функция КодыВидовДоходовЦенныеБумаги2025()
	
	Результат = Новый Структура;
	Результат.Вставить("ЦифровыеАктивы", "2650,3030");
	Результат.Вставить("ЦифровыеАктивыПрава", "3031,2651,2540");
	Результат.Вставить("Вклады", "6014");
	Результат.Вставить("Облигации", "1110");
	Результат.Вставить("ИИС", "1544,1545,1546,1547,1548,1549,1551,1552,1553,1554");
	Результат.Вставить("РЕПО", "1537,1539,1541");
	Результат.Вставить("ЦенныеБумаги", "1530,1531,1532,1533,1535,1536,1538,3023_2021,1011,3032");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти
