#Область СлужебныеПроцедурыИФункции

// Возвращает признак необходимости контролировать право применения спецрежима для организации
// 
// Параметры:
//   Организация - СправочникСсылка.Организации
//   НаДату - Дата, Неопределено - дата проверки
// 
// Возвращаемое значение:
//   Булево - Истина, если нужно контролировать
//
Функция Контролировать(Организация, НаДату) Экспорт
	
	Возврат КонтрольПраваПримененияСпецрежима.Контролировать(Организация, НаДату);
	
КонецФункции

Функция МесяцПревышенияГраницыПримененияНДС(Организация, НаДату = Неопределено) Экспорт
	
	Возврат КонтрольПраваПримененияСпецрежима.МесяцПревышенияГраницыПримененияНДС(Организация, НаДату);
	
КонецФункции

Функция ПараметрыУстановкиСтавкиНДС(Организация, НаДату = Неопределено) Экспорт
	
	Возврат КонтрольПраваПримененияСпецрежима.ПараметрыУстановкиСтавкиНДС(Организация, НаДату);
	
КонецФункции


#КонецОбласти