
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание формы которую нужно открыть для настройки поля формы статистики
// подробнее см. РегистрыСведений.НастройкаЗаполненияФормСтатистики.ОписаниеФормыНастройкиПоля
//
Функция ОписаниеФормыНастройкиПоля(ИмяОтчета, ИмяФормы, ИмяПоля, Организация, ДатаНачала, ДатаОкончания) Экспорт
	
	Возврат РегистрыСведений.НастройкаЗаполненияФормСтатистики.ОписаниеФормыНастройкиПоля(
		ИмяОтчета, ИмяФормы, ИмяПоля, Организация, ДатаНачала, ДатаОкончания);
	
КонецФункции

// Проверяет выполнялась ли настройка заполнения для формы статистики
// Прараметры:
//	- ИмяРегламентированногоОтчета - Строка    - идентификатор отчета (имя отчета в метаданных).
//	- ИдентификаторФормы           - Строка    - идентификатор редакции отчета (имя формы в метаданных).
//	- Организация                  - СправочникСсылка.Организации - организация для которой нужно проверить настройки.
// Возвращаемое значение:
//	- Структура - содержит ключи
//		* ФормаСтатистики - СправочникСсылка.ФормыСтатистики.
//		* ВыполнялисьНастройкиФормы - Булево, истина - для этой формы настройки уже выполнялись, в противном случае ложь.
//
Функция ПроверитьНастройкиЗаполненияОтчета(ИмяРегламентированногоОтчета, ИдентификаторФормы, Организация) Экспорт
	
	ДоступноРедактированиеНастроек = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НастройкаЗаполненияФормСтатистики);
	Если Не ДоступноРедактированиеНастроек Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяОтчета", ИмяРегламентированногоОтчета);
	Отбор.Вставить("ИмяФормы",  ИдентификаторФормы);
	ОписаниеФормы = ЗаполнениеФормСтатистики.НастраиваемыеФормыСтатистики(Отбор);
	Если ОписаниеФормы.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ФормаСтатистики = ОписаниеФормы[0].ФормаСтатистики;
		
	ВыполнялисьНастройкиФормы = РегистрыСведений.СостояниеНастройкиЗаполненияФормСтатистики.ВыполнялисьНастройкиФормы(
		ФормаСтатистики, 
		Организация);
	
	Результат = Новый Структура;
	Результат.Вставить("ФормаСтатистики",           ФормаСтатистики);
	Результат.Вставить("ВыполнялисьНастройкиФормы", ВыполнялисьНастройкиФормы);
	Возврат Результат;
	
КонецФункции

// Устанавливает признак того что для формы статистики выполнялась настройка
// подробнее см. РегистрыСведений.СостояниеНастройкиЗаполненияФормСтатистики.ЗаписатьНастройкиВыполнены
//
Процедура ЗаписатьНастройкиВыполнены(ФормаСтатистики, Организация) Экспорт
	
	РегистрыСведений.СостояниеНастройкиЗаполненияФормСтатистики.ЗаписатьНастройкиВыполнены(ФормаСтатистики, Организация);
	
КонецПроцедуры

Функция ФормаЗаполняетсяОтдельноПоКаждомуОбособленномуПодразделению(ИмяОтчета) Экспорт

	ФормыЗаполняемыеПоКаждомуОП = Новый Массив;
	ЗаполнениеФормСтатистикиПоОбособленнымПодразделениям.ДобавитьФормыЗаполняемыеОтдельноПоОбособленнымПодразделениям(ФормыЗаполняемыеПоКаждомуОП);
	
	Возврат ФормыЗаполняемыеПоКаждомуОП.Найти(ИмяОтчета) <> Неопределено;	

КонецФункции

Процедура ОбработатьРаспределениеВыручкиПоОКВЭД(АдресРаспределениеВыручки, АдресДоступныеКодыПоКлассификатору, ДополнительныеПараметры) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяОтчета", ДополнительныеПараметры.ИмяОтчета);
	Отбор.Вставить("ИмяФормы",  ДополнительныеПараметры.ИмяФормы);
	НастраиваемыеФормыСтатистики = ЗаполнениеФормСтатистики.НастраиваемыеФормыСтатистики(Отбор);
	
	Если ДополнительныеПараметры.ИмяОтчета = "РегламентированныйОтчетПодтверждениеВидаДеятельности" Тогда
		РегистрыСведений.НастройкиКлассификацииВыручки.ЗаполнитьРаспределениеВыручкиПоОКВЭД(
			АдресРаспределениеВыручки, ДополнительныеПараметры.Организация);
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(НастраиваемыеФормыСтатистики) Тогда
		Возврат;
	КонецЕсли;
	ФормаСтатистики = НастраиваемыеФормыСтатистики[0].ФормаСтатистики;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФормаСтатистики", ФормаСтатистики);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоляФормСтатистики.СтатистическийПоказатель.Владелец КАК ОбъектНаблюдения
	|ПОМЕСТИТЬ НастраиваемыеОбъектыНаблюдения
	|ИЗ
	|	Справочник.ПоляФормСтатистики КАК ПоляФормСтатистики
	|ГДЕ
	|	ПоляФормСтатистики.Владелец = &ФормаСтатистики
	|	И НЕ ПоляФормСтатистики.ПометкаУдаления
	|	И НЕ ПоляФормСтатистики.ЭтоГруппа
	|	И ПоляФормСтатистики.СтатистическийПоказатель <> ЗНАЧЕНИЕ(Справочник.СтатистическиеПоказатели.ПустаяСсылка)
	|	И ПоляФормСтатистики.СтатистическийПоказатель.Детализировать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыСтатистическогоНаблюдения.Ссылка КАК ОбъектНаблюдения
	|ИЗ
	|	НастраиваемыеОбъектыНаблюдения КАК НастраиваемыеОбъектыНаблюдения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыСтатистическогоНаблюдения КАК ОбъектыСтатистическогоНаблюдения
	|		ПО НастраиваемыеОбъектыНаблюдения.ОбъектНаблюдения = ОбъектыСтатистическогоНаблюдения.Ссылка
	|ГДЕ
	|	ОбъектыСтатистическогоНаблюдения.Детализация = ЗНАЧЕНИЕ(Перечисление.ВидыСвободныхСтрокФормСтатистики.ВидыДеятельности)
	|	И НастраиваемыеОбъектыНаблюдения.ОбъектНаблюдения.ТребуетНастройки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	// Предполагается только один объект наблюдения для конкретного отчета.
	ОбъектНаблюдения = Выборка.ОбъектНаблюдения;
	
	СообщенияОбОшибках = Новый Массив;
	РегистрыСведений.НастройкиКлассификацииВыручки.ЗаполнитьРаспределениеВыручкиПоОКВЭД(
		АдресРаспределениеВыручки, ДополнительныеПараметры.Организация, ОбъектНаблюдения, АдресДоступныеКодыПоКлассификатору, СообщенияОбОшибках);
		
	Для Каждого ТекстСообщения Из СообщенияОбОшибках Цикл
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти