#Область ПрограммныйИнтерфейс

// Переключает видимость быстрых настроек в переданной форме отчета
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма отчета.
//
Процедура ПереключитьВидимостьБыстрыхНастроек(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	Отчет = Форма.Отчет;
	
	Элементы.БыстрыеНастройкиОтчета.Видимость = Отчет.ПоказыватьБыстрыеНастройки;
	
	Если Элементы.МакетОформленияБыстрыеНастройки.СписокВыбора.Количество() > 0
		И (ПустаяСтрока(Форма.МакетОформления) Или Форма.МакетОформления = "МакетОформленияОтчетовЗеленый") Тогда
		Форма.МакетОформления = Элементы.МакетОформленияБыстрыеНастройки.СписокВыбора[0].Значение;
	КонецЕсли;

	Если Отчет.ПоказыватьБыстрыеНастройки Тогда
		Элементы.ПоказатьБыстрыеНастройки.Картинка = БиблиотекаКартинок.СтрелкаВправо;
	Иначе
		Элементы.ПоказатьБыстрыеНастройки.Картинка = БиблиотекаКартинок.СтрелкаВлево;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
