#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыборСтрокиУслугиРазмещения(Форма, СтандартнаяОбработка, АдресТаблицыУслуг, ИмяТабличнойЧасти) Экспорт
	
	Элементы = Форма.Элементы;
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущиеДанные", Элементы[ИмяТабличнойЧасти].ТекущиеДанные);
	ИмяРеквизитаТабличнойЧасти = ТуристическийНалогКлиентСервер.ИмяРеквизитаТабличнойЧасти(ИмяТабличнойЧасти);
	ДополнительныеПараметры.Вставить("ТаблицаОсновныхУслугРазмещения", Форма.ТаблицаОсновныхУслугРазмещения);

	СтандартнаяОбработка = Ложь; 
	ПараметрыФормы = Новый Структура("АдресТаблицыУслуг", АдресТаблицыУслуг);	
	Обработчик = Новый ОписаниеОповещения("ПослеВыбораСтрокиУслугиРазмещения", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораУслугРазмещения", ПараметрыФормы, Форма, , , , Обработчик);
			
КонецПроцедуры

Процедура ПослеВыбораСтрокиУслугиРазмещения(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатВыбора) Тогда
		Возврат;
	КонецЕсли;
	ДополнительныеПараметры.ТекущиеДанные.ИдентификаторРодительскойСтроки = РезультатВыбора;
	ТуристическийНалогКлиентСервер.ПредставлениеИДРодСтроки(ДополнительныеПараметры.ТекущиеДанные, 
		ДополнительныеПараметры.ТаблицаОсновныхУслугРазмещения);

КонецПроцедуры

#КонецОбласти

