
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		МобильныйКлиентАдаптацияФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БольшеНеПоказывать(Команда)
	
	БольшеНеПоказыватьНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура БольшеНеПоказыватьНаСервере()
	
	ХранилищеОбщихНастроек.Сохранить("ПомеченныеНаУдаление", "НеПоказыватьВопросПриПометкеНаУдаление", Истина);
	
КонецПроцедуры

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	ДобавитьЭлементыФормыМК();
	
	НастроитьПоложениеЭлементовМК();
	
	НастроитьОтображениеЭлементовФормыМК();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыФормыМК()
	
	НовыйЭлемент = Элементы.Добавить("ГруппаКоманды", Тип("ГруппаФормы"));
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	НовыйЭлемент.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьПоложениеЭлементовМК()
	
	//Группа команды
	Элементы.Переместить(Элементы.ФормаНапомнитьВСледующийРаз, Элементы.ГруппаКоманды);
	Элементы.Переместить(Элементы.ФормаБольшеНеПоказывать, Элементы.ГруппаКоманды);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОтображениеЭлементовФормыМК()
	
	//Декорации
	Элементы.Пояснение2.Высота = 0;
	
КонецПроцедуры

#КонецОбласти


