////////////////////////////////////////////////////////////////////////////////
// ЕдиныйНалоговыйСчетИнтеграцияКлиентБП:
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура СоздатьПлатежныйДокумент(Форма) Экспорт
	
	Задолженность = Форма.БлижайшийРекомендуемыйПлатеж + Форма.Задолженность;
	
	ТекущийДокумент =
		ЕдиныйНалоговыйСчетИнтеграцияВызовСервераБП.ПараметрыФормыПлатежногоДокумента(
			Форма.Объект.Организация,
			Форма.Объект.Период,
			Задолженность);
	
	ОткрытьФорму(
		"Документ.ПлатежноеПоручение.Форма.ФормаДокументаНалоговая",
		ТекущийДокумент,
		Форма,
		,
		,
		,
		,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ПодсказкаИнтеграцияСЛичнымКабинетомЕНСОбработкаНавигационнойСсылки(Организация, НавигационнаяСсылка, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылка = "ПодключитьПромоЕНС" Тогда
		Если МобильныйКлиентБПКлиент.ЭтоМобильныйКлиент() Тогда
			МобильныйКлиентБПКлиент.ПоказатьФормуНедоступнаяФункциональность(
				НСтр("ru = 'Подключить доступ к личному кабинету ЕНС'"));
			Возврат;
		КонецЕсли;
		ДокументооборотСКОКлиент.ПоказатьРекламуПромоЕНС(Организация);
	ИначеЕсли НавигационнаяСсылка = "СведенияОбУплатеНалогов" Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Новый Структура);
		ПараметрыФормы.Отбор.Вставить("Организация", Организация);
		ОткрытьФорму("Документ.СведенияОбУплатеНалогов.ФормаСписка", ПараметрыФормы, , Истина);
	ИначеЕсли НавигационнаяСсылка = "ЛичныйКабинетЕНС" Тогда
		Если МобильныйКлиентБПКлиент.ЭтоМобильныйКлиент() Тогда
			МобильныйКлиентБПКлиент.ПоказатьФормуНедоступнаяФункциональность(
				НСтр("ru = 'Получить сведения из личного кабинета ЕНС'"));
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Организация", Организация);
		ОткрытьФорму("Обработка.ЕдиныйНалоговыйСчетЛичныйКабинет.Форма", ПараметрыФормы, , Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтразитьВУчетеПениШтрафыНачисления(Данные, Результат) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияВызовСервераБП.ОтразитьВУчетеПениШтрафыНачисления(Данные, Результат);
	
КонецПроцедуры

Процедура ОтразитьВУчетеУплаты(Данные, Результат) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияВызовСервераБП.ОтразитьВУчетеУплаты(Данные, Результат);
	
КонецПроцедуры

#КонецОбласти


