////////////////////////////////////////////////////////////////////////////////
// ЕдиныйНалоговыйСчетИнтеграцияВнутреннийБП
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПоказатьПодсказкуИнтеграцияСЛичнымКабинетомЕНС(Форма, Организация, Период) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ПоказатьПодсказкуИнтеграцияСЛичнымКабинетомЕНС(Форма, Организация, Период)

КонецПроцедуры

Процедура ЗарегистрироватьУплатуНалоговИВзносов(Параметры) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ЗарегистрироватьУплатуНалоговИВзносов(Параметры);
	
КонецПроцедуры

Процедура ЗарегистрироватьОперацииЕНС(Параметры) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ЗарегистрироватьОперацииЕНС(Параметры);
	
КонецПроцедуры

Функция ИмяНастройкиБольшеНеПоказыватьБаннерПредупреждение(Параметры) Экспорт
	
	Возврат ЕдиныйНалоговыйСчетИнтеграцияБП.ИмяНастройкиБольшеНеПоказыватьБаннерПредупреждение(Параметры);
	
КонецФункции

Процедура УстановитьУчетПоДаннымФНСПослеРегистрацииВСервисе(Параметры) Экспорт
	
	НачалоЭтогоМесяца = НачалоМесяца(ОбщегоНазначенияБП.ТекущаяДатаНаСервере());
	ЕдиныйНалоговыйСчет.УстановитьУчетПоДаннымФНС(Параметры.Организация, НачалоЭтогоМесяца);
	
КонецПроцедуры

#КонецОбласти
