
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбновлениеИнформационнойБазы

Процедура УстановкаЗначенияПриОбновленииИнформационнойБазы() Экспорт
	
	МенеджерКонстанты = СоздатьМенеджерЗначения();
	МенеджерКонстанты.Значение = Истина;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерКонстанты);
	
КонецПроцедуры

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("УстановкаЗначенияПриОбновленииИнформационнойБазы");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли