Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
КонецПроцедуры

Процедура ПриВключенииВестиУчетПоПодразделениям() Экспорт
	
КонецПроцедуры

Процедура ДобавитьТипДокументаАвизоОСИсходящее(Типы) Экспорт
	
КонецПроцедуры

Процедура ДобавитьТипДокументаОбособленныхПодразделений(СписокТипов, ТипДокумента) Экспорт
	
КонецПроцедуры

Процедура ОпределитьТаблицуОписанияОбъектовРегламентированнойОтчетности(ТаблицаОписания) Экспорт
	
КонецПроцедуры

Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
КонецПроцедуры

Процедура ПриПолученииСпискаРегламентированныхОтчетов(СписокРегламентированныхОтчетов) Экспорт
	
КонецПроцедуры

Процедура ПриДобавленииПереименованийОбъектовМетаданных(Итог) Экспорт
	
КонецПроцедуры

Процедура ПроверитьИспользованиеОбособленныхПодразделенийНеВыделенныхНаОтдельныйБаланс(
	ОбособленныеПодразделенияИспользуются, Организация) Экспорт
	
КонецПроцедуры

Процедура ОбособленныеПодразделенияНеВыделенныеНаОтдельныйБаланс(СписокПодразделений, Организация) Экспорт
	
КонецПроцедуры

Процедура ЯвляютсяВзаимозависимыми(ДатаЗапроса, Контрагент, Организация, ЯвляютсяВзаимозависимыми) Экспорт
	
КонецПроцедуры

Процедура ПолучитьСведенияОбОрганизации(ОргСведения, Знач Организация, Знач ДатаЗначения = Неопределено, Знач СписокПоказателей = Неопределено) Экспорт
	
КонецПроцедуры

Процедура УточнитьКППНаДату(КППНаДату, Знач Организация, Знач ДатаСведений) Экспорт
	
КонецПроцедуры

Процедура УточнитьКодНалоговогоОрганаОрганизации(КодГосударственногоОргана, Знач Организация, Знач ВидГосударственногоОргана) Экспорт
	
КонецПроцедуры

Процедура ИспользуетсяРасширенныйФункционал(ИспользуетсяРасширенныйФункционал = Ложь) Экспорт
	
КонецПроцедуры

Процедура КрупнейшийНалогоплательщикРегистрацияВНалоговомОрганеОрганизации(РегистрацияВНалоговомОргане, Организация, Знач ДатаАктуальности = Неопределено) Экспорт
	
КонецПроцедуры

Процедура ДобавитьДокументыПоСкладу(ПодключаемыеДокументы) Экспорт
	
КонецПроцедуры

Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(Знач ИсточникиДанных) Экспорт
	
КонецПроцедуры

Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
КонецПроцедуры

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
КонецПроцедуры

Процедура ДополнитьМассивИменамиДокументовАвизо(ИмяМассива, Входящие = Истина) Экспорт
	
КонецПроцедуры

Процедура УстановитьТекстЗапросаЗаполнитьСтрануРегистрацииВКонтрагентах(ТекстЗапроса) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьСтрануРегистрацииКонтрагента(КонтрагентОбъект, Выборка) Экспорт
	
КонецПроцедуры

Процедура УстановитьВерсиюУведомленияОКонтролируемыхСделках2019() Экспорт
	
КонецПроцедуры

Процедура УстановитьВерсиюУведомленияОКонтролируемыхСделках2021() Экспорт
	
КонецПроцедуры

Процедура УстановитьВерсиюУведомленияОКонтролируемыхСделках2024() Экспорт
	
КонецПроцедуры

Процедура ИсправитьСтруктуруЦепочекКонтролируемыхСделок(Параметры) Экспорт
	
КонецПроцедуры

Процедура ОбработатьРеквизитыКрупнейшегоНалогоплательщика() Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьДатыПериодаДокумента(ПериодОтчета, Ссылка, Заполнено) Экспорт
	
КонецПроцедуры

Процедура ВыгрузитьДокумент(ФайлДляОтправки, ВыгруженныеДокументы, Ссылка, УникальныйИдентификатор = Неопределено) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьКодИФНСПолучателяПоСсылке(ОбъектСсылка, КодИФНСПолучателя) Экспорт
	
КонецПроцедуры

Процедура ПодготовитьИнформационнуюБазу() Экспорт
	
КонецПроцедуры

Процедура ПолучитьВидОтправляемогоДокументаПоСсылке(ВидОтправляемогоДокумента, ОбъектСсылка) Экспорт
	
КонецПроцедуры

Процедура ОпределитьСвойстваОбъектовДляОтображенииВФормеОтчетность(СвойстваОбъектов) Экспорт
	
КонецПроцедуры

Процедура УстановитьВерсиюУведомленияОКонтролируемыхСделках() Экспорт
	
КонецПроцедуры

