#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяРеквизита(Идентификатор) Экспорт
	
	Возврат "ДополнительныйПоказатель_" + Идентификатор;
	
КонецФункции

Функция ИмяРеквизитаФайла(Идентификатор) Экспорт
	
	Возврат "ДополнительныйФайл_" + Идентификатор;
	
КонецФункции

Функция ИмяАдресаЗначений(ИмяЭлемента) Экспорт
	
	Возврат ИмяЭлемента + "_АдресЗначений";
	
КонецФункции

Функция ИмяПредставления(ИмяЭлемента) Экспорт
	
	Возврат ИмяЭлемента + "_Представление";
	
КонецФункции

Функция ИмяОчистки(ИмяЭлемента) Экспорт
	
	Возврат ИмяЭлемента + "_Очистка";
	
КонецФункции

Функция ИмяПереключателя(ИмяЭлемента) Экспорт
	
	Возврат ИмяЭлемента + "_Переключатель";
	
КонецФункции

Функция ИмяСвязанногоЭлементаПереключателя(ИмяПереключателя) Экспорт
	
	Возврат СтрЗаменить(ИмяПереключателя, "_Переключатель", "");
	
КонецФункции

Функция ИмяЗаглушки(ИмяЭлемента) Экспорт
	
	Возврат ИмяЭлемента + "_Заглушка";
	
КонецФункции

Функция ИмяОписания(ИмяЭлемента) Экспорт
	
	Возврат ИмяЭлемента + "_Описание";
	
КонецФункции

Функция ИмяДействия(ИмяЭлемента) Экспорт
	
	Возврат ИмяЭлемента + "_Действие";
	
КонецФункции

Функция ИмяШаблона(ИмяЭлемента) Экспорт
	
	Возврат ИмяЭлемента + "_Шаблон";
	
КонецФункции

Функция РазделительЭлементовСтроки() Экспорт
	
	Возврат "#!#";
	
КонецФункции

Функция НаименованиеПравилаФинОтчетности(Получатель, ПредставлениеКомплекта, Организация) Экспорт
	
	Возврат СтрШаблон("%1 - %2 (%3)", Получатель, ПредставлениеКомплекта, Организация);
	
КонецФункции

Функция СсылкаНаИнструкциюПоУстановкеЭлектроннойПодписи() Экспорт
	
	Возврат "https://its.1c.ru/bmk/metod81_csp_setup";
	
КонецФункции

Функция СсылкаНаИнструкцииПоРаботеСПрограммамиЭлектроннойПодписи() Экспорт
	
	Возврат "https://its.1c.ru/bmk/metod81_crypt";
	
КонецФункции

Функция СсылкаОписание1СПодпись() Экспорт
	
	Возврат "https://portal.1c.ru/applications/31";
	
КонецФункции

// Конструктор для параметров выбора присоединенного файла в заявках на кредит и фин.отчетности.
//
// Возвращаемое значение:
//   Структура   - параметры для открытия общей формы ФормаВыборПрисоединенногоФайла.
//
Функция ПараметрыДиалогаВыбораФайла() Экспорт
	
	ПараметрыДиалога = Новый Структура;
	ПараметрыДиалога.Вставить("Заголовок",          НСтр("ru = 'присоединенный файл'"));
	ПараметрыДиалога.Вставить("МножественныйВыбор", Ложь);
	
	// По-умолчанию используем ограничение, установленное БСП.
	ПараметрыДиалога.Вставить("МаксимальныйРазмер",  0);  // максимально допустимый размер файла в Кб
	
	ПараметрыДиалога.Вставить("Расширение", "." + ЗаполнениеФинОтчетностиВБанкиКлиентСервер.РасширениеТабличногоДокумента());
	ПараметрыДиалога.Вставить("ФильтрДиалогаВыбора",
		НСтр("ru = 'Книга Excel (*.xls; *.xlsx)|*.xls; *.xlsx|Документ Adobe PDF (*.pdf)|*.pdf|
				|Документ Word (*.doc; *.docx)|*.doc; *.docx|Текст в формате RTF (*.rtf)|*.rtf|
				|Формат JPEG (*.jpg; *.jpeg)|*.jpg; *.jpeg|Формат PNG (*.png)|*.png|
				|Текстовый документ (*.txt)|*.txt|Веб-страница (*.htm;*.html)|*.htm;*.html|
				|Архив ZIP (*.zip)|*.zip|Все файлы (*.*)|*.*'"));
	
	Возврат ПараметрыДиалога;
	
КонецФункции

// Конструктор для параметров формы с описанием файла.
//
// Возвращаемое значение:
//   Структура   - параметры для открытия общей формы ФормаОписаниеОтчета.
//
Функция ПараметрыФормыОписания() Экспорт

	Результат = Новый Структура();
	Результат.Вставить("Сервис",            ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ПустаяСсылка"));
	Результат.Вставить("Банки",             Новый СписокЗначений); // список из СправочникСсылка.БанкиУниверсальногоОбмена
	Результат.Вставить("Характеристика");
	Результат.Вставить("Заголовок",         "");
	Результат.Вставить("ПодробноеОписание", "");
	Результат.Вставить("ИмяФайлаШаблона",   "");
	
	Возврат Результат;

КонецФункции

// Возвращает текст для представления пустого юридического адреса в форме заявки.
// Редактирование самого адреса в форме заявки не поддерживается, его необходимо заполнять
// в форме организации, т.к. при его изменении возможно изменение регистрации в ФНС, ПФР и т.п.
//
// Возвращаемое значение:
//	Строка - представление пустого адреса.
Функция ТекстПустогоЮрАдресаВВидеГиперссылки() Экспорт

	Возврат НСтр("ru = 'Заполнить в форме организации'");

КонецФункции

Функция СсылкаНаИнструкциюГдеПолучитьЭлектроннуюПодпись() Экспорт
	
	Возврат "https://its.1c.ru/bmk/esig_uc";
	
КонецФункции

// Определяет, подходит ли сертификат для выполнения указанной операции для организации.
//
// Параметры:
//	Сертификат - СертификатКриптографии - Сертификат, для которого выполняется проверка.
//	ПараметрыОтбора - Структура - см. ПараметрыОтбораСертификата().
//	Результат - Структура - см. УниверсальныйОбменСБанкамиКлиентСервер.РезультатФункцийСоответствияОтбору().
//	
Процедура СертификатСоответствуетОтбору(Сертификат, ПараметрыОтбора, Результат) Экспорт

	ДанныеСубъекта = УниверсальныйОбменСБанкамиКлиентСервер.ДанныеСубъектаСертификата(Сертификат);

	ЮридическоеФизическоеЛицо = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтбора, "ЮридическоеФизическоеЛицо");
	ЭтоЮрЛицо = (ЮридическоеФизическоеЛицо <> ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо"));
	
	УниверсальныйОбменСБанкамиКлиентСервер.СертификатСоответствуетОтборуПоИНН(ДанныеСубъекта, ЭтоЮрЛицо, ПараметрыОтбора, Результат);
	Если Не Результат.ПризнакСоответствия Тогда
		// Остальные поля проверять нет смысла.
		Возврат;
	КонецЕсли;
			
	// СНИЛС владельца сертификата.
	СНИЛС = "";
	Если ПараметрыОтбора.Свойство("СНИЛС", СНИЛС) И Не ПустаяСтрока(СНИЛС) Тогда
		// Чтобы не зависеть от формата хранения, оставляем только цифровые символы.
		СНИЛС = ОбщегоНазначенияБПКлиентСервер.ОставитьВСтрокеТолькоЦифры(СНИЛС);
		СНИЛССертификата = ОбщегоНазначенияБПКлиентСервер.ОставитьВСтрокеТолькоЦифры(ДанныеСубъекта.СНИЛС);
		
		Если СНИЛС <> СНИЛССертификата Тогда
			
			Результат.ПризнакСоответствия = Ложь;
			Если ЭтоЮрЛицо Тогда
				Результат.СообщениеДляПользователя = СтрШаблон(
					НСтр("ru='СНИЛС владельца сертификата (%1) не совпадает со СНИЛС руководителя (%2)'"),
					СНИЛССертификата,
					СНИЛС);
			Иначе
				Результат.СообщениеДляПользователя = СтрШаблон(
					НСтр("ru='СНИЛС владельца сертификата (%1) не совпадает со СНИЛС предпринимателя (%2)'"),
					СНИЛССертификата,
					СНИЛС);
			КонецЕсли;

		КонецЕсли;
	КонецЕсли;
	Если Не Результат.ПризнакСоответствия Тогда
		// Остальные поля проверять нет смысла.
		Возврат;
	КонецЕсли;
	
	// ФИО владельца сертификата
	Фамилия = "";
	Если ПараметрыОтбора.Свойство("Фамилия", Фамилия) И Не ПустаяСтрока(Фамилия) Тогда
	
		ФИО = ФИОИзПараметровОтбораСертификата(ПараметрыОтбора);	
	
		// Проверяем точное совпадение.
		Если СокрЛП(ВРег(ФИО)) <> СокрЛП(ВРег(ДанныеСубъекта.Имя)) Тогда
			
			Результат.ПризнакСоответствия = Ложь;
			Если ЭтоЮрЛицо Тогда
				Результат.СообщениеДляПользователя = СтрШаблон(
					НСтр("ru='ФИО владельца сертификата (%1) не совпадает со ФИО руководителя (%2)'"),
					ДанныеСубъекта.Имя,
					ФИО);
			Иначе
				Результат.СообщениеДляПользователя = СтрШаблон(
					НСтр("ru='ФИО владельца сертификата (%1) не совпадает со ФИО предпринимателя (%2)'"),
					ДанныеСубъекта.Имя,
					ФИО);
			КонецЕсли;

		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#Область Криптография

// Возвращает пустую структуру с ключами для проверки сертификата.
//
// Параметры:
//	СервисОбменаСБанками - ПеречислениеСсылка.СервисыОбменаСБанками - Сервис.
//
// Возвращаемое значение:
//	Структура - см. Результат.
//
Функция ПараметрыОтбораСертификата(СервисОбменаСБанками) Экспорт

	Результат = УниверсальныйОбменСБанкамиКлиентСервер.ПараметрыОтбораСертификата(
		СервисОбменаСБанками, 
		ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));
		
	// Дополнительные параметры, которые проверяются в рамках сервиса.
	Результат.Вставить("ИНН",      ""); // ИНН заемщика - юридического лица или ИП
	Результат.Вставить("ЮридическоеФизическоеЛицо", ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ПустаяСсылка"));
	// Данные руководителя юридического лица или ИП.
	Результат.Вставить("Фамилия",  "");
	Результат.Вставить("Имя",      "");
	Результат.Вставить("Отчество", "");
	Результат.Вставить("СНИЛС",    "");
	
	Возврат Результат;

КонецФункции

// Формирует строковое представление отбора по заполненным значения отбора 
// для показа пользователю на форме выбора сертификатов.
//
// Параметры:
//	ПараметрыОтбора - Структура - см. ПараметрыОтбораСертификата()
//
Функция ПредставлениеОтбораСертификата(ПараметрыОтбора) Экспорт

	Подстроки = Новый Массив; // Массив для формирования строкового представления отбора.

	// ФИО руководителя.
	Если ПараметрыОтбора.Свойство("Фамилия") Тогда
		ФИО = ФИОИзПараметровОтбораСертификата(ПараметрыОтбора);	
		Подстроки.Добавить(СтрШаблон(НСтр("ru = 'Имя владельца=%1'"), ФИО));
	КонецЕсли;

	// ИНН организации.
	ИНН = СокрЛП(ПараметрыОтбора.ИНН);
	Если ЗначениеЗаполнено(ИНН) Тогда
		Подстроки.Добавить(СтрШаблон(НСтр("ru = 'ИНН=%1'"), ИНН));
	КонецЕсли;

	// СНИЛС руководителя организации.
	// Чтобы не зависеть от формата хранения, оставляем только цифровые символы.
	СНИЛС = СокрЛП(ПараметрыОтбора.СНИЛС);
	Если ЗначениеЗаполнено(СНИЛС) Тогда
		СНИЛС = ОбщегоНазначенияБПКлиентСервер.ОставитьВСтрокеТолькоЦифры(СНИЛС);
		Подстроки.Добавить(СтрШаблон(НСтр("ru = 'СНИЛС=%1'"), СНИЛС));
	КонецЕсли;

	Если ЗначениеЗаполнено(Подстроки) Тогда
		Возврат СтрСоединить(Подстроки, НСтр("ru = ' и '"));
	КонецЕсли;

	Возврат "";

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ФИОИзПараметровОтбораСертификата(ПараметрыОтбора)

	Фамилия  = СокрЛП(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтбора, "Фамилия", ""));
	Имя      = СокрЛП(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтбора, "Имя", ""));
	Отчество = СокрЛП(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтбора, "Отчество", ""));

	ФИО = ?(НЕ ПустаяСтрока(Фамилия), Фамилия, "") + ?(НЕ ПустаяСтрока(Имя), " " + Имя, "")
		+ ?(НЕ ПустаяСтрока(Отчество) , " " + Отчество, "");

	Возврат ФИО;

КонецФункции

#КонецОбласти