#Область ОписаниеПеременных

&НаКлиенте
Перем ОткрытыеФормы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МобильныйКлиентАдаптацияФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КадровыеДокументы(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("ЖурналДокументов.КадровыеДокументы.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);

КонецПроцедуры

&НаКлиенте
Процедура ДоговорыГПХ(Команда)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ПростойИнтерфейсСотрудникиДоговорыГПХ", , Истина);
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ДоговорРаботыУслуги.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры


&НаКлиенте
Процедура ЭлектронныеТрудовыеКнижки(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("ЖурналДокументов.ЭлектронныеТрудовыеКнижки.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры


&НаКлиенте
Процедура ИсполнительныеЛисты(Команда)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ПростойИнтерфейсСотрудникиИсполнительныеЛисты", , Истина);
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ИсполнительныйЛист.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатистикаПерсонала(Команда)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ПростойИнтерфейсСотрудникиСтатистикаПерсонала", , Истина);
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.СтатистикаПерсонала.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);

КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаКадры);
	
КонецПроцедуры

#КонецОбласти
