////////////////////////////////////////////////////////////////////////////////
// ЕдиныйНалоговыйСчетЛичныйКабинетКлиентПереопределяемый:
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ТаблицаПлатежиВыбор(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ТаблицаОтчетыВыбор(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ТаблицаНачисленияВыбор(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
КонецПроцедуры

Процедура ТаблицаТаблицаУплатыВыбор(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
КонецПроцедуры

Процедура ТаблицаПениШтрафыВыбор(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
КонецПроцедуры

Процедура ТаблицаОперацииЕНПДеревоСверкиВыбор(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура СверкаСальдоЕНСПоДаннымУчета(Форма, Элемент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	// ДатаАктуальности в ЛК ЕНС с временем GMT, нам нужно время GMT+3 - добавляем 3 часа
	ДатаАктуальности = Форма.ДатаАктуальности + 3 * 60 * 60;
	ПараметрыФормы = Новый Структура;
	Параметрыформы.Вставить("НачалоПериода",           НачалоГода(ДатаАктуальности));
	Параметрыформы.Вставить("КонецПериода",            КонецДня(ДатаАктуальности));
	ПараметрыФормы.Вставить("Организация",             Форма.Объект.Организация);
	ПараметрыФормы.Вставить("РежимРасшифровки",        Истина);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	
	ОткрытьФорму("Отчет.РасчетыПоЕНС.Форма.ФормаОтчета", ПараметрыФормы);
	
КонецПроцедуры

Процедура СверкаСальдоЕНППоДаннымУчета(Форма, Элемент, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

