#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием(ПараметрыВыполненияКоманды);
	ПараметрыОткрытия.ИмяФормы = "РегистрСведений.УчетнаяПолитика.ФормаЗаписи";
	
	ПараметрыФормы = ПараметрыФормы();
	ПараметрыФормы.Вставить("ИдентификаторФормыВладельца", ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор);
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Справочник.Организации.Форма.ФормаОрганизации" Тогда 
		ПараметрыФормы.Вставить("Организация", ПараметрКоманды);
	КонецЕсли;
	
	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПараметрыФормы()
	
	Возврат РегистрыСведений.УчетнаяПолитика.ПараметрыОткрытияФормыДляКомандыУчетнаяПолитика();
	
КонецФункции

#КонецОбласти