
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ВключитьПриОбновлении");
	
КонецПроцедуры

// Возвращает значение константы в привилегированном режиме.
//
// Возвращаемое значение:
//  Булево - значение константы.
//
Функция ПолучитьЗначение() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ОтображатьИтогиПоНачислениямИВыплатамВСпискеСотрудников.Получить();
	
КонецФункции
 
#Область ОбработчикиОбновления

// Включает отображение итогов по начислениям и выплатам в списке сотрудников при обновлении программы.
//
Процедура ВключитьПриОбновлении() Экспорт
	
	МенеджерКонстанты = Константы.ОтображатьИтогиПоНачислениямИВыплатамВСпискеСотрудников.СоздатьМенеджерЗначения();
	МенеджерКонстанты.Значение = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерКонстанты);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
