
#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	Если Константы.УчетЗарплатыИКадровВоВнешнейПрограмме.Получить() Тогда
		Элементы.ГруппаВариантыУчетаЗарплаты.ТекущаяСтраница = Элементы.СтраницаУчетЗарплатыИКадровВоВнешнейПрограмме;
		Возврат;
	КонецЕсли;
	
	Если УчетЗарплаты.ИспользоватьКадровуюИсторию() Тогда
		Обработки.ПростойИнтерфейсРазделСотрудники.ЗаменитьТекстЗапросаСпискаСотрудников(ЭтотОбъект);
	КонецЕсли;
	
	ЭтоМедленныйРежимРаботы = ОбщегоНазначенияБП.ЭтоМедленныйРежимРаботы() Или ОбщегоНазначения.ЭтоМобильныйКлиент();
	ЭтоВебКлиент            = ОбщегоНазначения.ЭтоВебКлиент();
	
	ОсновнаяОрганизация           = Справочники.Организации.ОрганизацияПоУмолчанию();
	ОтборОрганизация              = ОсновнаяОрганизация;
	ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
	
	ТекущаяДатаРаботы = ТекущаяДатаСеанса();
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДатаРаботы", ТекущаяДатаРаботы);
	
	ПоказыватьУволенных = Истина;
	Элементы.ПоказыватьУволенных.Пометка = ПоказыватьУволенных;
	
	ПериодРегистрации = РасчетныйПериод(ОтборОрганизация, ТекущаяДатаРаботы);
	ОрганизацияПриИзмененииНаСервере();
		
	Список.Параметры.УстановитьЗначениеПараметра("ПериодРегистрации", ПериодРегистрации); 
	Список.Параметры.УстановитьЗначениеПараметра("ПериодРегистрацииНачало", НачалоМесяца(ПериодРегистрации));
	Список.Параметры.УстановитьЗначениеПараметра("ПериодРегистрацииКонец", КонецМесяца(ПериодРегистрации));
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	Список.Параметры.УстановитьЗначениеПараметра("АдресХранилища", АдресХранилища);
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Работает", Истина, Ложь);
	
	ОтображатьИтогиПоНачислениямИВыплатамВСпискеСотрудников = ОтображатьИтогиПоНачислениямИВыплатамВСпискеСотрудников();
	Список.Параметры.УстановитьЗначениеПараметра("ОтображатьИтогиПоНачислениямИВыплатамВСпискеСотрудников",
		ОтображатьИтогиПоНачислениямИВыплатамВСпискеСотрудников);
	ПомеченныеНаУдалениеСервер.СкрытьПомеченныеНаУдаление(ЭтотОбъект);
	
	ПредставлениеПериодаРегистрации = ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
		Перечисления.ДоступныеПериодыОтчета.Месяц, ПериодРегистрации, КонецМесяца(ПериодРегистрации));
	
	СпособВыплатыЗарплата = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.СпособыВыплатыЗарплаты.Зарплата");
	СпособВыплатыАванс    = Справочники.СпособыВыплатыЗарплаты.НайтиПоРеквизиту("ХарактерВыплаты", Перечисления.ХарактерВыплатыЗарплаты.Аванс);
	
	РасчетЗарплатыДляНебольшихОрганизаций = ПолучитьФункциональнуюОпцию("РасчетЗарплатыДляНебольшихОрганизаций");
	Элементы.ГруппаКомандыДокументы.Видимость = РасчетЗарплатыДляНебольшихОрганизаций;
	Элементы.ДокументСправкаНДФЛ.Видимость = Не РасчетЗарплатыДляНебольшихОрганизаций;
	Элементы.СотрудникОформитьДоговорРаботыУслуги.Видимость = РасчетЗарплатыДляНебольшихОрганизаций;
	
	ИспользоватьКадровыйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьКадровыйУчет");
	ИспользоватьНачисленияПоДоговорам = ПолучитьФункциональнуюОпцию("ИспользоватьНачисленияПоДоговорам");
	
	Если ИспользоватьНачисленияПоДоговорам Тогда
		ОтборРолиСотрудников = Перечисления.РолиСотрудников.ПустаяСсылка();
		ДополнитьОтборНаСервере();
	КонецЕсли;
	
	ИмяРаздела = Новый Структура;
	ИмяРаздела.Вставить("ИмяФормы","Раздел.Сотрудники");
	ИмяРаздела.Вставить("Элементы",Элементы);
	УправлениеПанельюПодсказки.ПриСозданииНаСервере(ИмяРаздела);
	
	УстановитьУсловноеОформление();
	
	Если Не ЗначениеЗаполнено(ОтборОрганизация) Тогда
		УправлениеФормой(ЭтотОбъект);
	Иначе
		ПустойСписок = ПустойСписок(ОтборОрганизация);
		Если ПустойСписок Тогда
			УправлениеФормой(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
	Если ОтображатьИтогиПоНачислениямИВыплатамВСпискеСотрудников
		И Не ПустойСписок И Не ЭтоМедленныйРежимРаботы И Не ЭтоВебКлиент Тогда
		ОбновитьИтогиРаздела();
		ЗагрузитьИтоги();
	КонецЕсли;
	
	// ИнтернетПоддержкаПользователей.Новости.КонтекстныеНовости_ПриСозданииНаСервере
	ИдентификаторыСобытийПриОткрытии = "ПриОткрытии";
	ОбработкаНовостейПереопределяемый.КонтекстныеНовости_ПриСозданииНаСервере(
		ЭтотОбъект,
		"БП.Обработка.ПростойИнтерфейсРазделСотрудники",
		"Форма",
		НСтр("ru='Новости: Сотрудники'"),
		ИдентификаторыСобытийПриОткрытии
	);
	// Конец ИнтернетПоддержкаПользователей.Новости.КонтекстныеНовости_ПриСозданииНаСервере
	
	СкрыватьПомеченныеНаУдаление = ПомеченныеНаУдалениеСервер.СкрыватьПомеченныеНаУдаление();
	ОтслеживатьПометкуУдаления = ПомеченныеНаУдалениеСервер.ОтслеживатьПометкуУдаления();
	
	МобильныйКлиентАдаптацияФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ПустойСписок Тогда
		
		Если (ЭтоМедленныйРежимРаботы Или ЭтоВебКлиент)  Тогда
			ПодключитьОбработчикОжидания("Подключаемый_ПолучитьИтогиРаздела",0.5, Истина);
		КонецЕсли;
		
		ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
		
		ПодключитьОбработчикОжидания("ПоказатьПредупреждениеПревышениеЛимитаТарифа", 0.1, Истина);
		
	КонецЕсли;
	
	// ИнтернетПоддержкаПользователей.Новости.ПриОткрытии
	ОбработкаНовостейКлиент.КонтекстныеНовости_ПриОткрытии(ЭтотОбъект);
	// Конец ИнтернетПоддержкаПользователей.Новости.ПриОткрытии
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	УправлениеПанельюПодсказкиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);

	Организация = ОрганизацияДляОтбора(ОтборОрганизацияИспользование, ОтборОрганизация);
	
	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		ОсновнаяОрганизация = Параметр;
		Если ОсновнаяОрганизация <> ОтборОрганизация Тогда
			ОтборОрганизация                 = ОсновнаяОрганизация;
			ОтборОрганизацияИспользование    = ЗначениеЗаполнено(ОтборОрганизация);
			ОбнулитьИтоги(ЭтотОбъект);
			ОрганизацияПриИзмененииНаСервере();
			ПодключитьОбработчикОжидания("Подключаемый_ПолучитьИтогиРаздела",0.5, Истина);
			УстановитьБаннер();
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ИзменениеДанныхМестаРаботы" Тогда
		
		ПодключитьОбработчикОжидания("Подключаемый_ПолучитьИтогиРаздела",0.5, Истина);
		
	ИначеЕсли ИмяСобытия = "СозданСотрудник"
		Или ИмяСобытия = "Запись_Сотрудники" Или ИмяСобытия = "ИзменениеКадровыхДокументов" Тогда
		
		Элементы.Список.Обновить();
		ПодключитьОбработчикОжидания("Подключаемый_ПолучитьИтогиРаздела",0.5, Истина);
		
		Если ПустойСписок Тогда
			ПустойСписок = Ложь;
			УправлениеФормой(ЭтотОбъект);
		КонецЕсли;
		
		ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
		Оповестить("ПоказатьИнформациюОПравеПримененияСпецрежима", Организация, ЭтотОбъект);
		
		ПодключитьОбработчикОжидания("ПоказатьПредупреждениеПревышениеЛимитаТарифа", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "Запись_НачислениеЗарплаты"
		Или ИмяСобытия = "Запись_БольничныйЛист"
		Или ИмяСобытия = "Запись_Отпуск"
		Или ИмяСобытия = "Запись_ВедомостьНаВыплатуЗарплатыВБанк"
		Или ИмяСобытия = "Запись_ВедомостьНаВыплатуЗарплатыВКассу"
		Или ИмяСобытия = "Запись_ПриемНаРаботу"
		Или ИмяСобытия = "Запись_КадровыйПеревод"
		Или ИмяСобытия = "Запись_Увольнение" Тогда
		
		Элементы.Список.Обновить();
		ПоместитьВоВременноеХранилище(Неопределено, АдресХранилища);
		ПодключитьОбработчикОжидания("Подключаемый_ПолучитьИтогиРаздела",0.5, Истина);
		
		ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
		Оповестить("ПоказатьИнформациюОПравеПримененияСпецрежима", Организация, ЭтотОбъект);
		
		ПодключитьОбработчикОжидания("ПоказатьПредупреждениеПревышениеЛимитаТарифа", 0.1, Истина);
			
	ИначеЕсли ИмяСобытия = "Запись_НачислениеДивидендов"
		Или ИмяСобытия = "Запись_ДоговорРаботыУслуги" Тогда
		
		Элементы.Список.Обновить();
		ПоместитьВоВременноеХранилище(Неопределено, АдресХранилища);
		ПодключитьОбработчикОжидания("Подключаемый_ПолучитьИтогиРаздела",0.5, Истина);
		
	ИначеЕсли ИмяСобытия = "Запись_СписаниеСРасчетногоСчета"
		Или ИмяСобытия = "Запись_РасходныйКассовыйОрдер" 
		Или ИмяСобытия = "ОбновитьФорму" Тогда
		
		Если ТребуетсяПолучитьДанныеОплаты(Источник) Тогда
			Элементы.Список.Обновить();
			ПоместитьВоВременноеХранилище(Неопределено, АдресХранилища);
			ПодключитьОбработчикОжидания("Подключаемый_ПолучитьИтогиРаздела",0.5, Истина);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ЗарплатаРассчитана_ПомощникУчетаЗарплаты" Тогда
		Элементы.Список.Обновить();
		ПоместитьВоВременноеХранилище(Неопределено, АдресХранилища);
		ПодключитьОбработчикОжидания("Подключаемый_ПолучитьИтогиРаздела",0.5, Истина);
		
	ИначеЕсли ИмяСобытия = "ПоказатьИнформациюОПравеПримененияСпецрежима" Тогда
		Если Источник <> ЭтотОбъект И Параметр = Организация Тогда
			ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "Запись_НаборКонстант" И Источник
		= "ОтображатьИтогиПоНачислениямИВыплатамВСпискеСотрудников" Тогда

		ОтображатьИтогиПоНачислениямИВыплатамВСпискеСотрудников =
			ОтображатьИтогиПоНачислениямИВыплатамВСпискеСотрудников();
		Список.Параметры.УстановитьЗначениеПараметра("ОтображатьИтогиПоНачислениямИВыплатамВСпискеСотрудников",
			ОтображатьИтогиПоНачислениямИВыплатамВСпискеСотрудников);
		УправлениеФормой(ЭтотОбъект);
		ПоместитьВоВременноеХранилище(Неопределено, АдресХранилища);
		ПодключитьОбработчикОжидания("Подключаемый_ПолучитьИтогиРаздела", 0.5, Истина);

	ИначеЕсли (ИмяСобытия = "Запись_УзелПланаОбмена" 
		Или ИмяСобытия = "ИзменениеРежимаВеденияКадровогоУчетаИРасчетаЗарплаты") И ВключенаПодсистемаЗарплата() Тогда

		ПараметрыОткрытияРаздела = Новый Структура;
		ПараметрыОткрытияРаздела.Вставить("Уникальность", Истина);
	
		ОткрытьФорму("ЖурналДокументов.ЖурналОпераций.Форма.ФормаСпискаОтражениеЗарплаты",
			,
			,
			ПараметрыОткрытияРаздела.Уникальность);
		
		Закрыть();
		
	КонецЕсли;
	
	// ИнтернетПоддержкаПользователей.Новости.ОбработкаОповещения
	ОбработкаНовостейКлиент.КонтекстныеНовости_ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец ИнтернетПоддержкаПользователей.Новости.ОбработкаОповещения
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ПерсонализированныеПредложенияСервисовКлиент.ПерейтиПоСсылкеБаннера(
		НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Баннер, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	СтруктураОтбора = Неопределено;
	Если Параметры.Свойство("Отбор", СтруктураОтбора) И ЗначениеЗаполнено(СтруктураОтбора) 
		И СтруктураОтбора.Свойство("Организация") И ЗначениеЗаполнено(СтруктураОтбора.Организация) Тогда
		
		ОтборОрганизация = СтруктураОтбора.Организация;
		ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
		Параметры.Отбор.Удалить("Организация");
	Иначе
		Если ЗначениеЗаполнено(ОсновнаяОрганизация) И ОтборОрганизация <> ОсновнаяОрганизация Тогда
			ОтборОрганизация = ОсновнаяОрганизация;
			ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
		ИначеЕсли Не ОтборОрганизацияИспользование Тогда
			ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
		КонецЕсли;
	КонецЕсли;
	
	ОрганизацияПриИзмененииНаСервере();

	ДополнитьОтборНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
	ОрганизацияПриИзмененииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияИспользованиеПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииПриИзменении(Элемент)
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбора = Новый Структура("НачалоПериода, КонецПериода", ПериодРегистрации, КонецМесяца(ПериодРегистрации));
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц", ПараметрыВыбора, Элементы.ПредставлениеПериодаРегистрации, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПриемНаРаботуНажатие(Элемент)
	
	СоздатьДокументПриемНаРаботу();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОформитьДоговорНажатие(Элемент)
	
	ОткрытьФорму("Документ.ДоговорРаботыУслуги.Форма.ФормаДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСообщениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Обработка.ПанельАдминистрированияБП.Форма.Интерфейс");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодробнееНажатие(Элемент)
	
	КонтрольПраваПримененияСпецрежимаКлиент.ПодробнееНажатие(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НапомнитьПозжеНажатие(Элемент)
	
	ОтложитьПоказНапоминанияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодробнееОТарифах(Элемент)
	
	ОплатаСервисаКлиент.ОткрытьФормуОплатыСервиса();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьБаннерНажатие(Элемент)
	
	ОтключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер");
	
	ПерсонализированныеПредложенияСервисовКлиент.ЗакрытьБаннер(ЭтотОбъект, ОтборОрганизация);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущийБаннерНажатие(Элемент)
	
	ОтключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер");
	
	ПерсонализированныеПредложенияСервисовКлиент.УстановитьРежимОжиданияНаБаннере(ЭтотОбъект);
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьПредыдущийБаннер", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СледующийБаннерНажатие(Элемент)
	
	ОтключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер");
	
	ПерсонализированныеПредложенияСервисовКлиент.УстановитьРежимОжиданияНаБаннере(ЭтотОбъект);
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборРолиСотрудниковПриИзменении(Элемент)
	
	ДополнитьОтборНаСервере();
	ПодключитьОбработчикОжидания("Подключаемый_ПолучитьИтогиРаздела", 0.5, Истина);

КонецПроцедуры

#Область Панель_Подсказки

&НаКлиенте
Процедура НавигацияВПрограммеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	УправлениеПанельюПодсказкиКлиент.НавигацияВПрограммеОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительнаяФункциональностьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	УправлениеПанельюПодсказкиКлиент.ДополнительнаяФункциональностьОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылка,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СоветПоРаботе1ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	УправлениеПанельюПодсказкиКлиент.СоветПоРаботеОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СоветПоРаботе2ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	УправлениеПанельюПодсказкиКлиент.СоветПоРаботеОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры


&НаКлиенте
Процедура СоветПоРаботе3ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	УправлениеПанельюПодсказкиКлиент.СоветПоРаботеОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры


&НаКлиенте
Процедура СоветПоРаботе4ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	УправлениеПанельюПодсказкиКлиент.СоветПоРаботеОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "ВидНачисленияЗарплата"
		Или Поле.Имя = "Начислено"
		Или Поле.Имя = "Удержано"
		Или Поле.Имя = "Выплачено"
		Или Поле.Имя = "КВыплате"
		Или Поле.Имя = "НачисленоДоговоры" Тогда
		ОткрытьРасчетныйДокумент("НачислениеЗарплаты");
	ИначеЕсли Поле.Имя = "ВидНачисленияДивиденды"
		Или Поле.Имя = "НачисленоДивиденды"
		Или Поле.Имя = "НДФЛДивиденды"
		Или Поле.Имя = "ВыплаченоДивиденды"
		Или Поле.Имя = "КВыплатеДивиденды" Тогда
		ОткрытьРасчетныйДокумент("НачислениеДивидендов");
	Иначе
		ОткрытьКарточкуСотрудника();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Если Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Организация = Настройки.ПараметрыДанных.Элементы.Найти("Организация").Значение;
	ПериодРегистрации = Настройки.ПараметрыДанных.Элементы.Найти("ПериодРегистрации").Значение;
	ТекущаяДатаРаботы = Настройки.ПараметрыДанных.Элементы.Найти("ТекущаяДатаРаботы").Значение;
	РолиСотрудников = Настройки.ПараметрыДанных.Элементы.Найти("РолиСотрудников").Значение;
	АдресХранилища = Настройки.ПараметрыДанных.Элементы.Найти("АдресХранилища").Значение;
	ОтображатьИтогиПоНачислениямИВыплатамВСпискеСотрудников =
		Настройки.ПараметрыДанных.Элементы.Найти("ОтображатьИтогиПоНачислениямИВыплатамВСпискеСотрудников").Значение;
	МассивСотрудников = Строки.ПолучитьКлючи();
	
	ПараметрыОбработки = Обработки.ПростойИнтерфейсРазделСотрудники.НовыйПараметрыОбработки();
	ПараметрыОбработки.Организация = Организация;
	ПараметрыОбработки.РолиСотрудников = РолиСотрудников;
	ПараметрыОбработки.ПериодРегистрации = ПериодРегистрации;
	ПараметрыОбработки.ТекущаяДатаРаботы = ТекущаяДатаРаботы;
	ПараметрыОбработки.ВключатьСведенияПоСотрудникам = Ложь;
		
	Если Не ОтображатьИтогиПоНачислениямИВыплатамВСпискеСотрудников Тогда
		ПараметрыОбработки.МассивСотрудников =  МассивСотрудников;
	КонецЕсли;
	
	ТаблицаВзаиморасчетов = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ТаблицаВзаиморасчетов = Неопределено Тогда

		Обработки.ПростойИнтерфейсРазделСотрудники.ПодготовитьДанные(
			ПараметрыОбработки, АдресХранилища);
		ПодготовленныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
		
		Если ЗначениеЗаполнено(ПодготовленныеДанные.Список) Тогда
			ПоместитьВоВременноеХранилище(ПодготовленныеДанные.Список, АдресХранилища);
			ТаблицаВзаиморасчетов = ПодготовленныеДанные.Список;
		Иначе
			Возврат;
		КонецЕсли;
		
		ПоместитьВоВременноеХранилище(ТаблицаВзаиморасчетов, АдресХранилища);
	КонецЕсли;
	
	Если ТипЗнч(ТаблицаВзаиморасчетов) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Сотрудник Из МассивСотрудников Цикл
		Отбор = Новый Структура("Ссылка", Сотрудник);
		СтрокиВзаиморасчетов = ТаблицаВзаиморасчетов.НайтиСтроки(Отбор);
		Если СтрокиВзаиморасчетов.Количество() > 0 Тогда
			СтрокаВзаиморасчетов = СтрокиВзаиморасчетов[0];
			Строка = Строки.Получить(СтрокаВзаиморасчетов.Ссылка);
			ЗаполнитьЗначенияСвойств(Строка.Данные, СтрокаВзаиморасчетов, , "Работает");
			УстановитьОформлениеСтроки(Строка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки, ИспользуютсяСтандартныеНастройки)
	ПомеченныеНаУдалениеСервер.УдалитьОтборПометкаУдаления(Настройки);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)

	ПомеченныеНаУдалениеКлиент.ПриИзмененииСписка(ЭтотОбъект, Элемент);
	ОбновитьСтатусСотрудника();
	ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УменьшитьПериод(Команда)
	
	ПериодРегистрации = ДобавитьМесяц(ПериодРегистрации,-1);
	Список.Параметры.УстановитьЗначениеПараметра("ПериодРегистрации", ПериодРегистрации);
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьПериод(Команда)
	
	ПериодРегистрации = ДобавитьМесяц(ПериодРегистрации, 1);
	Список.Параметры.УстановитьЗначениеПараметра("ПериодРегистрации", ПериодРегистрации);
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетЗарплаты(Команда)
	
	Организация = ОрганизацияДляОтбора(ОтборОрганизацияИспользование, ОтборОрганизация);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация",      Организация);
	ПараметрыФормы.Вставить("ПериодСобытия",    КонецМесяца(ПериодРегистрации));
	ПараметрыФормы.Вставить("Правило",          "");
	
	ОткрытьФорму("Обработка.ПомощникУчетаЗарплаты.Форма.Форма", ПараметрыФормы);
		
КонецПроцедуры

&НаКлиенте
Процедура ВыплатитьАванс(Команда)
	
	Организация = ОрганизацияДляОтбора(ОтборОрганизацияИспользование, ОтборОрганизация);
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация",      Организация);
	ПараметрыФормы.Вставить("ПериодСобытия",    КонецМесяца(ПериодРегистрации));
	ПараметрыФормы.Вставить("Аванс",            Истина);
	ПараметрыФормы.Вставить("Правило",          "");
	
	ОткрытьФорму("Обработка.ПомощникУчетаЗарплаты.Форма.Форма", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура НачислитьПремию(Команда)
	
	Организация = ОрганизацияДляОтбора(ОтборОрганизацияИспользование, ОтборОрганизация);
	
	ПараметрыДокумента = Новый Структура("Организация, ПериодРегистрации", 
										Организация, НачалоМесяца(ПериодРегистрации));
	ЗначенияЗаполнения = Новый Структура("ЗначенияЗаполнения", ПараметрыДокумента);
	ОткрытьФорму("Документ.Премия.ФормаОбъекта",
		ЗначенияЗаполнения,
		ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Или СтрокаТаблицы.Свойство("ГруппировкаСтроки") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не СтрокаТаблицы.Работает Тогда
		
		ТекущийМесяц = Месяц(ПериодРегистрации);
		
		ТекстГод   = Прав(ПредставлениеПериодаРегистрации,4);
		ТекстМесяц = Лев(ПредставлениеПериодаРегистрации,
			СтрДлина(ПредставлениеПериодаРегистрации)-?(ТекущийМесяц = 3 Или ТекущийМесяц = 8,5,6));
		ТекстМесяц = СтрШаблон(НСтр("ru = '%1е'"), ТекстМесяц);
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Сотрудник ""%1"" не работает в организации в %2 %3 г.'"),
			СтрокаТаблицы.Наименование,
			ТекстМесяц,
			ТекстГод);
	Иначе
		
		Организация = ОрганизацияДляОтбора(ОтборОрганизацияИспользование, ОтборОрганизация);
	
		Если Не(Команда.Имя = "ДокументСправкаНДФЛ" Или Команда.Имя = "ДокументИсполнительныйЛист") Тогда
			ПараметрыДокумента = Новый Структура("Организация, ПериодРегистрации, Сотрудник", 
												Организация, НачалоМесяца(ПериодРегистрации), СтрокаТаблицы.Ссылка);
			ЗначенияЗаполнения = Новый Структура("ЗначенияЗаполнения", ПараметрыДокумента);
		Иначе
			ЗначенияЗаполнения = Новый Структура("Основание", СтрокаТаблицы.Ссылка);
		КонецЕсли;
		
		ОткрытьФорму("Документ." + СтрЗаменить(Команда.Имя, "Документ","") + ".ФормаОбъекта",
			ЗначенияЗаполнения,
			ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументПриемНаРаботу(Команда)
	
	СоздатьДокументПриемНаРаботу();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументКадровыйПеревод(Команда)
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Или СтрокаТаблицы.Свойство("ГруппировкаСтроки") Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьКадровыйУчет Тогда
		СотрудникиКлиент.ОформитьНаОсновании(ЭтотОбъект, СтрокаТаблицы.Ссылка, "Документ." + СтрЗаменить(Команда.Имя, "Документ",""));
	Иначе
		ПараметрыСотрудника = Новый Структура("Ключ", СтрокаТаблицы.Ссылка);
		ФормаСотрудника = ПолучитьФорму("Справочник.Сотрудники.ФормаОбъекта", ПараметрыСотрудника);
		ФормаСотрудника.ТекущийЭлемент = ФормаСотрудника.Элементы.ТекущаяТарифнаяСтавка;
		ФормаСотрудника.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУвольнение(Команда)
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Или СтрокаТаблицы.Свойство("ГруппировкаСтроки") Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьКадровыйУчет Тогда
		СотрудникиКлиент.ОформитьНаОсновании(ЭтотОбъект, СтрокаТаблицы.Ссылка, "Документ." + СтрЗаменить(Команда.Имя, "Документ",""));
	Иначе
		ПараметрыСотрудника = Новый Структура("Ключ", СтрокаТаблицы.Ссылка);
		ФормаСотрудника = ПолучитьФорму("Справочник.Сотрудники.ФормаОбъекта", ПараметрыСотрудника);
		ФормаСотрудника.Элементы.ДатаУвольнения.Видимость = Истина;
		ФормаСотрудника.Элементы.Уволить.Видимость        = Ложь;
		ФормаСотрудника.ТекущийЭлемент = ФормаСотрудника.Элементы.ДатаУвольнения;
		ФормаСотрудника.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументНачислениеДивидендов(Команда)
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Или СтрокаТаблицы.Свойство("ГруппировкаСтроки") Тогда
		Возврат;
	КонецЕсли;
	
	ДатаДокумента = ?(КонецМесяца(ТекущаяДата()) = КонецМесяца(ПериодРегистрации),
		ТекущаяДата(),
		КонецМесяца(ПериодРегистрации));
	Организация = ОрганизацияДляОтбора(ОтборОрганизацияИспользование, ОтборОрганизация);
			
	ПараметрыДокумента = Новый Структура("Организация, Дата, Учредитель", 
										Организация, ДатаДокумента, СтрокаТаблицы.ФизическоеЛицо);
	ЗначенияЗаполнения = Новый Структура("ЗначенияЗаполнения", ПараметрыДокумента);
		
	ОткрытьФорму("Документ.НачислениеДивидендов.ФормаОбъекта",
		ЗначенияЗаполнения,
		ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументДоговорРаботыУслуги(Команда)
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Или СтрокаТаблицы.Свойство("ГруппировкаСтроки") Тогда
		Возврат;
	КонецЕсли;
	
	СотрудникиКлиент.ОформитьНаОсновании(ЭтотОбъект, СтрокаТаблицы.Ссылка, "Документ." + СтрЗаменить(Команда.Имя, "Документ",""));
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьДокументДоговорРаботыУслуги(Команда)
	
	ОткрытьФорму("Документ.ДоговорРаботыУслуги.Форма.ФормаДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетТ2(Команда)
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Или СтрокаТаблицы.Свойство("ГруппировкаСтроки") Тогда
		Возврат;
	КонецЕсли;
	
	МассивСотрудников = Новый Массив;
	МассивСотрудников.Добавить(СтрокаТаблицы.Ссылка);
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.Сотрудники",
		"ПФ_MXL_Т2",
		МассивСотрудников,
		ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетВзаиморасчеты(Команда)
	
	Вариант = ПолучитьВариантОтчета("АнализНачисленийИУдержаний", СтрЗаменить(Команда.Имя, "Отчет",""));
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтотОбъект, Вариант);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетНДФЛ(Команда)
	
	Вариант = ПолучитьВариантОтчета("АнализНДФЛ", СтрЗаменить(Команда.Имя, "Отчет",""));
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтотОбъект, Вариант);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыСотрудникамПриАУСН(Команда)
	
	Вариант = ПолучитьВариантОтчета("ВыплатыПриИспользованииАУСН", СтрЗаменить(Команда.Имя, "Отчет",""));
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтотОбъект, Вариант);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетСтраховыеВзносы(Команда)
	
	Вариант = ПолучитьВариантОтчета("АнализВзносовВФонды", СтрЗаменить(Команда.Имя, "Отчет",""));
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтотОбъект, Вариант);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетСотрудники(Команда)
	
	Вариант = ПолучитьВариантОтчета("ОтчетыПоСотрудникам", СтрЗаменить(Команда.Имя, "Отчет",""));
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтотОбъект, Вариант);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетНалогиИВзносыКратко(Команда)
	
	Вариант = ПолучитьВариантОтчета("НалогиИВзносыКратко", СтрЗаменить(Команда.Имя, "Отчет",""));
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтотОбъект, Вариант);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетТ13(Команда)
	
	Вариант = ПолучитьВариантОтчета("УнифицированнаяФормаТ13", СтрЗаменить(Команда.Имя, "Отчет",""));
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтотОбъект, Вариант);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетАнализРасходовНаОплатуТруда(Команда)
	
	ОткрытьФорму("Отчет.АнализРасходовНаОплатуТруда.ФормаОбъекта");
	
КонецПроцедуры

&НаКлиенте
Процедура КарточкаСотрудника(Команда)
	
	ОткрытьКарточкуСотрудника();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ПодключитьОбработчикОжидания("Подключаемый_ПолучитьИтогиРаздела",0.5, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКонтекстныеНовости(Команда)

	ОбработкаНовостейКлиент.КонтекстныеНовости_ОбработкаКомандыНовости(
		ЭтотОбъект,
		Команда
	);

КонецПроцедуры

&НаКлиенте
Процедура ОтчетДругиеОтчеты(Команда)
	
	ВариантыОтчетовКлиент.ПоказатьПанельОтчетов(
		"Отчеты.Сотрудники",
		Неопределено);
		
КонецПроцедуры

// Процедура показывает новости, требующие прочтения (важные и очень важные)
//
&НаКлиенте
Процедура Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии()

	// ИнтернетПоддержкаПользователей.Новости.Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии
	ИдентификаторыСобытийПриОткрытии = "ПриОткрытии";
	// Конец ИнтернетПоддержкаПользователей.Новости.Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии

	ОбработкаНовостейКлиент.КонтекстныеНовости_ПоказатьНовостиТребующиеПрочтенияПриОткрытии(ЭтотОбъект, ИдентификаторыСобытийПриОткрытии);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидимостьПодсказок(Команда)
	
	ИзменитьВидимостьПодсказокНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПанельПодсказок(Команда)
	
	ИзменитьВидимостьПодсказокНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьУволенных(Команда)
	ПоказыватьУволенных = Не ПоказыватьУволенных;
	Элементы.ПоказыватьУволенных.Пометка = ПоказыватьУволенных;
	ПодключитьОбработчикОжидания("Подключаемый_ПоказыватьУволенных", 0.1, Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьВидимостьПодсказокНаСервере()
	
	ИмяРаздела = Новый Структура;
	ИмяРаздела.Вставить("ИмяФормы","Раздел.Сотрудники");
	ИмяРаздела.Вставить("Элементы",Элементы);
	
	УправлениеПанельюПодсказки.ИзменитьВидимостьПодсказок(ИмяРаздела);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//Оформление таблицы Список
	
	УсловноеОформление.Элементы.Очистить();

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТекущаяОрганизация");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОтборОрганизацияИспользование", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	
	Если Форма.ОтображатьИтогиПоНачислениямИВыплатамВСпискеСотрудников Тогда
		Элементы.Наименование.ТекстПодвала = НСтр("ru = 'Итого:'");
	Иначе
		Элементы.Наименование.ТекстПодвала = "";
	КонецЕсли;
	
	Если Форма.ПустойСписок Тогда
		Если Элементы.ГруппаСписокСотрудников.ТекущаяСтраница <> Элементы.СтраницаПустая Тогда
			Элементы.ГруппаСписокСотрудников.ТекущаяСтраница = Элементы.СтраницаПустая;
		КонецЕсли;
		Элементы.ГруппаКомандныеПанели.Доступность = Ложь;
		Элементы.ДекорацияИли.Видимость = Форма.ИспользоватьНачисленияПоДоговорам;
		Элементы.ДекорацияОформитьДоговор.Видимость = Форма.ИспользоватьНачисленияПоДоговорам;
	Иначе
		Если Элементы.ГруппаСписокСотрудников.ТекущаяСтраница <> Элементы.СтраницаСписок Тогда
			Элементы.ГруппаСписокСотрудников.ТекущаяСтраница = Элементы.СтраницаСписок;
		КонецЕсли;
		Элементы.ГруппаКомандныеПанели.Доступность = Истина;
	КонецЕсли;

	Элементы.ОтчетВыплатыСотрудникамПриАУСН.Видимость = Форма.ПрименяетсяАУСН;
	Элементы.ОтчетАнализВзносовВФонды.Видимость       = Не Форма.ПрименяетсяАУСН;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	УстановитьВосстановленныеОтборы();
	ПоместитьВоВременноеХранилище(Неопределено, АдресХранилища);
	Организация = ОрганизацияДляОтбора(ОтборОрганизацияИспользование, ОтборОрганизация);
	Список.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
	ПустойСписок = ПустойСписок(Организация);
	ЭтоПредприниматель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮридическоеФизическоеЛицо") =
							Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	ПрименяетсяАУСН    = УчетнаяПолитика.ПрименяетсяАУСН(Организация, ПериодРегистрации);	
		
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПериодаНаСервере()
	
	ПоместитьВоВременноеХранилище(Неопределено, АдресХранилища);
	// Обновляем представление периода на форме.
	ПредставлениеПериодаРегистрации = ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
		ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"),
		ПериодРегистрации,
		КонецМесяца(ПериодРегистрации));
		
	Если ПериодРегистрации > ТекущаяДатаРаботы Тогда
		ТекущаяДатаРаботы = ПериодРегистрации;
		Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДатаРаботы", ТекущаяДатаРаботы);
	КонецЕсли;

	Список.Параметры.УстановитьЗначениеПараметра("ПериодРегистрации", ПериодРегистрации);
	Список.Параметры.УстановитьЗначениеПараметра("ПериодРегистрацииНачало", НачалоМесяца(ПериодРегистрации));
	Список.Параметры.УстановитьЗначениеПараметра("ПериодРегистрацииКонец", КонецМесяца(ПериодРегистрации));

	Организация = ОрганизацияДляОтбора(ОтборОрганизацияИспользование, ОтборОрганизация);
	
	ПрименяетсяАУСН = УчетнаяПолитика.ПрименяетсяАУСН(Организация, ПериодРегистрации);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПустойСписок(Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ГоловнаяОрганизация В (&Организации)";
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Организации = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация);
	Иначе
		Организации = ОбщегоНазначенияБПВызовСервераПовтИсп.ВсеОрганизацииДанныеКоторыхДоступныПоRLS(Ложь);
	КонецЕсли;
	Запрос.УстановитьПараметр("Организации", Организации); 
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Пустой();
	
КонецФункции

&НаСервере
Процедура ЗагрузитьИтоги()
	
	Если Не ОтображатьИтогиПоНачислениямИВыплатамВСпискеСотрудников Тогда
		ОбнулитьИтоги(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	Если АдресХранилища = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Итоги = ПолучитьИзВременногоХранилища(АдресХранилища);

	Если ТипЗнч(Итоги) <> Тип("ТаблицаЗначений") Тогда
		ОбнулитьИтоги(ЭтотОбъект);
		Возврат;
	КонецЕсли;

	ИтогоНачислено = Итоги.Итог("Начислено") 
		+ Итоги.Итог("НачисленоДивиденды") 
		+ Итоги.Итог("НачисленоДоговоры");
	
	ИтогоУдержано = Итоги.Итог("Удержано")
		+ Итоги.Итог("НДФЛДивиденды");
	
	ИтогоВыплачено = Итоги.Итог("Выплачено")
		+ Итоги.Итог("ВыплаченоДивиденды")
		+ Итоги.Итог("ВыплаченоДоговоры");
	
	ИтогоКВыплате = Итоги.Итог("КВыплате")
		+ Итоги.Итог("КВыплатеДивиденды")
		+ Итоги.Итог("КВыплатеДоговоры");
		
	НачисленияПоДоговорамИДивидендам = Итоги.Итог("НачисленоДивиденды") + Итоги.Итог("НачисленоДоговоры");
	КВыплатеПоДоговорамИДивидендам = Итоги.Итог("КВыплатеДивиденды") + Итоги.Итог("КВыплатеДоговоры");

	Элементы.ГруппаНачисленоВидНачисления.Видимость = НачисленияПоДоговорамИДивидендам <> 0
		Или КВыплатеПоДоговорамИДивидендам <> 0;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолучитьИтогиРаздела()
	
	Если ПустойСписок Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтображатьИтогиПоНачислениямИВыплатамВСпискеСотрудников Тогда
		ОбновитьИтогиРаздела();
	КонецЕсли;
	
	ЗагрузитьИтоги();
	
КонецПроцедуры

&НаСервере
Функция ТребуетсяПолучитьДанныеОплаты(Источник)
	
	Если ТипЗнч(Источник) <> Тип("ДокументСсылка.СписаниеСРасчетногоСчета")
		И ТипЗнч(Источник) <> Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Организация, ВидОперации");
	Организация = ОрганизацияДляОтбора(ОтборОрганизацияИспользование, ОтборОрганизация);
	Если РеквизитыДокумента.Организация = Организация Тогда
		Если РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаДивидендов
			Или РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыПоВедомостям
			Или РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыРаботнику
			Или РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеДивидендов
			Или РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеЗП
			Или РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеЗаработнойПлатыРаботнику Тогда
			
			Возврат Истина;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПериодРегистрации = РезультатВыбора.НачалоПериода;
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьРасчетныйДокументЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", РезультатВыбора.Значение);
	ОткрытьФорму("Документ." + ДополнительныеПараметры.ТипРасчета + ".ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументПриемНаРаботу()
	
	Если ИспользоватьКадровыйУчет Тогда
		ОткрытьФорму("Документ.ПриемНаРаботу.Форма.ФормаДокумента");
	Иначе
		ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаЭлемента");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВариантОтчета(ИмяОтчета, ИмяВарианта)
	
	Отчет         = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Отчет." + ИмяОтчета);
	ВариантОтчета = ВариантыОтчетов.ВариантОтчета(Отчет, ИмяВарианта);
	Возврат ВариантОтчета;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьКарточкуСотрудника()
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Или СтрокаТаблицы.Свойство("ГруппировкаСтроки") Тогда
		Возврат;
	КонецЕсли;
	ОценкаПроизводительностиКлиент.ЗамерВремени("ОткрытиеФормыЭлементаСправочникаСотрудники", , Истина);
	
	ПараметрыФормы = Новый Структура("Ключ", СтрокаТаблицы.Ссылка);
	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаЭлемента", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасчетныйДокумент(ТипРасчета)
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Или СтрокаТаблицы.Свойство("ГруппировкаСтроки") Тогда
		Возврат;
	КонецЕсли;
	
	РасчетныйДокумент = РасчетныйДокументНаСервере(СтрокаТаблицы.Ссылка, ТипРасчета);
	Если РасчетныйДокумент <> Неопределено Тогда
		Если ТипЗнч(РасчетныйДокумент) = Тип("СписокЗначений") Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьРасчетныйДокументЗавершение", ЭтотОбъект, Новый Структура("ТипРасчета", ТипРасчета));
			ПоказатьВыборИзМеню(ОписаниеОповещения, РасчетныйДокумент);
		Иначе
			ПараметрыФормы = Новый Структура("Ключ", РасчетныйДокумент);
			ОткрытьФорму("Документ." + ТипРасчета + ".ФормаОбъекта", ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РасчетныйДокументНаСервере(Сотрудник, ТипРасчета)
	
	Запрос = Новый Запрос;
	
	Организация = ОрганизацияДляОтбора(ОтборОрганизацияИспользование, ОтборОрганизация);
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Организация = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация);
	Иначе
		Организация = ОбщегоНазначенияБПВызовСервераПовтИсп.ВсеОрганизацииДанныеКоторыхДоступныПоRLS(Ложь);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация",             Организация);
	Запрос.УстановитьПараметр("Сотрудник",               Сотрудник);
	Запрос.УстановитьПараметр("ФизическоеЛицо",          ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ФизическоеЛицо"));
	Запрос.УстановитьПараметр("ПериодРегистрацииНачало", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("ПериодРегистрацииКонец",  КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("Зарплата",                ТипРасчета = "НачислениеЗарплаты");
	Запрос.УстановитьПараметр("Дивиденды",               ТипРасчета = "НачислениеДивидендов");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеЗарплатыСотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.НачислениеЗарплаты.Сотрудники КАК НачислениеЗарплатыСотрудники
	|ГДЕ
	|	НачислениеЗарплатыСотрудники.Ссылка.Организация В (&Организация)
	|	И НачислениеЗарплатыСотрудники.Ссылка.Проведен
	|	И НачислениеЗарплатыСотрудники.Сотрудник = &Сотрудник
	|	И НачислениеЗарплатыСотрудники.Ссылка.МесяцНачисления МЕЖДУ &ПериодРегистрацииНачало И &ПериодРегистрацииКонец
	|	И &Зарплата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеДивидендов.Ссылка
	|ИЗ
	|	Документ.НачислениеДивидендов КАК НачислениеДивидендов
	|ГДЕ
	|	НачислениеДивидендов.Организация В (&Организация)
	|	И НачислениеДивидендов.Проведен
	|	И НачислениеДивидендов.ТипУчредителя = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
	|	И НачислениеДивидендов.Учредитель = &ФизическоеЛицо
	|	И НачислениеДивидендов.Дата МЕЖДУ &ПериодРегистрацииНачало И &ПериодРегистрацииКонец
	|	И &Дивиденды";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Возврат Неопределено;
	ИначеЕсли Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	Иначе
		СписокДокументов = Новый СписокЗначений;
		Пока Выборка.Следующий() Цикл
			СписокДокументов.Добавить(Выборка.Ссылка);
		КонецЦикла;
		Возврат СписокДокументов;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция РасчетныйПериод(Организация, ТекущаяДатаРаботы);
	
	ТекущийПериод       = НачалоМесяца(ТекущаяДатаРаботы);
	ПериодЗадолженности = ТекущийПериод;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		ДатаВыплатыЗарплаты = День(УчетЗарплаты.ПланируемаяДатаВыплатыЗарплаты(Организация, ТекущийПериод));
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗарплатаКВыплатеОстатки.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов
		|ИЗ
		|	РегистрНакопления.ЗарплатаКВыплате.Остатки(, Организация = &Организация) КАК ЗарплатаКВыплатеОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодВзаиморасчетов";
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ПериодЗадолженности = НачалоМесяца(Выборка.ПериодВзаиморасчетов);
		КонецЕсли;
	Иначе
		ДатаВыплатыЗарплаты = День(ТекущаяДатаРаботы);
	КонецЕсли;
	
	Если ПериодЗадолженности < ТекущийПериод Тогда
		РасчетныйПериод = ПериодЗадолженности;
	Иначе
		Если ДатаВыплатыЗарплаты >= День(ТекущаяДатаРаботы) Тогда
			РасчетныйПериод = НачалоМесяца(ДобавитьМесяц(ТекущийПериод, -1));
		Иначе
			РасчетныйПериод = ТекущийПериод;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РасчетныйПериод;
	
КонецФункции

#Область ДлительныеОперации

#КонецОбласти

#Область Баннер

&НаКлиенте
Процедура Подключаемый_УстановитьБаннер()
	
	УстановитьБаннер();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьСледующийБаннер()
	
	// Поскольку обработчик может вызываться не только интерактивно пользователем,
	// но и автоматически по таймеру, меняем баннер при условии, что форма находится в фокусе.
	Если Не ВводДоступен() Тогда
		ПодключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер",
			ПерсонализированныеПредложенияСервисовКлиент.ИнтервалПереключенияБаннеров(), Истина);
		Возврат;
	КонецЕсли;
	
	УстановитьБаннер();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьПредыдущийБаннер()
	
	УстановитьБаннер(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьБаннер(ПоказатьПредыдущий = Ложь)
	
	ДлительнаяОперация = ПолучитьБаннерНаСервере(ПоказатьПредыдущий);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус <> "Ошибка" Тогда
		
		НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
		
		Обработчик = Новый ОписаниеОповещения("ПослеПолученияБаннераВФоне", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияБаннераВФоне(ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		УстановитьБаннерНаФорме(ДлительнаяОперация.АдресРезультата);
		ПодключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер",
			ПерсонализированныеПредложенияСервисовКлиент.ИнтервалПереключенияБаннеров(), Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьБаннерНаСервере(ПоказатьПредыдущий)
	
	НастройкиЗапуска = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	НастройкиЗапуска.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение баннера в фоне'");
	НастройкиЗапуска.ЗапуститьВФоне = Истина;
	НастройкиЗапуска.ОжидатьЗавершение = 0;
	
	Организация = ОрганизацияДляОтбора(ОтборОрганизацияИспользование, ОтборОрганизация);
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Организация", Организация);	
	СтруктураПараметров.Вставить("Размещение", ПерсонализированныеПредложенияСервисов.ИмяРазмещенияПростойИнтерфейсРазделСотрудники());
	СтруктураПараметров.Вставить("ПоказатьПредыдущий", ПоказатьПредыдущий);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"ПерсонализированныеПредложенияСервисов.ПолучитьБаннер",
		СтруктураПараметров,
		НастройкиЗапуска);
	
КонецФункции

&НаСервере
Процедура УстановитьБаннерНаФорме(АдресРезультата)
	
	ПерсонализированныеПредложенияСервисов.УстановитьБаннерНаФорме(ЭтотОбъект, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти

#Область ПравоПримененияСпецрежима

&НаКлиенте
Процедура ПоказатьИнформациюОПравеПримененияСпецрежима()
	
	Организация = ОрганизацияДляОтбора(ОтборОрганизацияИспользование, ОтборОрганизация);
	
	Если Не ЗначениеЗаполнено(Организация)
		Или Не КонтрольПраваПримененияСпецрежимаКлиент.Контролировать(Организация) Тогда
		Элементы.ИнформацияОПравеПримененияСпецрежима.Видимость = Ложь;
	Иначе
		ПоказатьИнформациюОПравеПримененияСпецрежимаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьИнформациюОПравеПримененияСпецрежимаНаСервере()
	
	Организация = ОрганизацияДляОтбора(ОтборОрганизацияИспользование, ОтборОрганизация);
	
	ИнформацияОПравеПримененияСпецрежима = КонтрольПраваПримененияСпецрежима.ИнформацияОПравеПримененияСпецрежима(
		Организация, 
		КонтрольПраваПримененияСпецрежима.ИмяПоказателяСпецрежимаРаботники());
	СледующееЗначениеНапоминания = ИнформацияОПравеПримененияСпецрежима.СледующееЗначениеНапоминания;
	СсылкаНаПояснение = ИнформацияОПравеПримененияСпецрежима.СсылкаНаПояснение;
	
	Элементы.ИнформацияОПравеПримененияСпецрежима.Видимость = ИнформацияОПравеПримененияСпецрежима.Показать;
	Элементы.ИнформацияОПравеПримененияСпецрежима.ЦветФона = ИнформацияОПравеПримененияСпецрежима.ЦветФонаГруппы;
	Элементы.ТекстИнформации.Заголовок = ИнформацияОПравеПримененияСпецрежима.ТекстИнформации;
	
	Элементы.Подробнее.Видимость = ЗначениеЗаполнено(СсылкаНаПояснение);
	
	Элементы.НапомнитьПозже.Заголовок = ИнформацияОПравеПримененияСпецрежима.ТекстНапомнитьПозже;
	Элементы.НапомнитьПозже.Видимость = ИнформацияОПравеПримененияСпецрежима.ОтображатьНапоминание;

КонецПроцедуры

&НаСервере
Процедура ОтложитьПоказНапоминанияНаСервере()
	
	Организация = ОрганизацияДляОтбора(ОтборОрганизацияИспользование, ОтборОрганизация);
	КонтрольПраваПримененияСпецрежима.ОтложитьПоказНапоминания(
		Организация,
		КонтрольПраваПримененияСпецрежима.ИмяПоказателяСпецрежимаРаботники(),
		СледующееЗначениеНапоминания);
		
	Элементы.ИнформацияОПравеПримененияСпецрежима.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПоказатьПредупреждениеПревышениеЛимитаТарифа()
	Организация = ОрганизацияДляОтбора(ОтборОрганизацияИспользование, ОтборОрганизация);
	ТарификацияБПКлиент.ОтобразитьБаннерПревышенияЛимитаТарифаНаЧислоСотрудников(
		ЭтотОбъект, Организация, Истина);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПоказыватьУволенных() Экспорт
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Работает", Истина, Не ПоказыватьУволенных);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьОформлениеСтроки(Строка)
	
	ДанныеСтроки = Строка.Данные;
	
	НачисленоДивиденды = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСтроки, "НачисленоДивиденды", 0);
	КВыплатеДивиденды = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСтроки, "КВыплатеДивиденды", 0); 
	ВыплаченоДивиденды = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСтроки, "ВыплаченоДивиденды", 0);
	НДФЛДивиденды = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСтроки, "НДФЛДивиденды", 0);
	НачисленоДоговоры = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСтроки, "НачисленоДоговоры", 0);
	КВыплатеДоговоры = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСтроки, "КВыплатеДоговоры", 0);
	ВыплаченоДоговоры = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСтроки, "ВыплаченоДоговоры", 0);
	
	ВидимостьДивидендов = НачисленоДивиденды = 0 И КВыплатеДивиденды = 0 И ВыплаченоДивиденды = 0 И НДФЛДивиденды = 0;
	ВидимостьДоговоров = НачисленоДоговоры = 0 И КВыплатеДоговоры = 0 И ВыплаченоДоговоры = 0;
	ВидимостьЗарплаты = ВидимостьДивидендов И ВидимостьДоговоров;
	
	УстановитьВидимостьЯчейки(Строка, "ВидНачисленияЗарплата", Не ВидимостьЗарплаты);
	УстановитьВидимостьЯчейки(Строка, "ВидНачисленияДивиденды", Не ВидимостьДивидендов);
	УстановитьВидимостьЯчейки(Строка, "НачисленоДивиденды", Не ВидимостьДивидендов);
	УстановитьВидимостьЯчейки(Строка, "КВыплатеДивиденды", Не ВидимостьДивидендов);
	УстановитьВидимостьЯчейки(Строка, "ВыплаченоДивиденды", Не ВидимостьДивидендов);
	УстановитьВидимостьЯчейки(Строка, "НДФЛДивиденды", Не ВидимостьДивидендов);
	
	УстановитьВидимостьЯчейки(Строка, "ВидНачисленияДоговоры", Не ВидимостьДоговоров);
	УстановитьВидимостьЯчейки(Строка, "НачисленоДоговоры", Не ВидимостьДоговоров);
	УстановитьВидимостьЯчейки(Строка, "КВыплатеДоговоры", Не ВидимостьДоговоров);
	УстановитьВидимостьЯчейки(Строка, "ВыплаченоДоговоры", Не ВидимостьДоговоров);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьВидимостьЯчейки(Строка, ИмяЯчейки, УсловиеВидимости)

	Если Не ЗначениеЗаполнено(ИмяЯчейки) Тогда
		Возврат;
	КонецЕсли;
	
	Если Строка.Оформление.Получить(ИмяЯчейки) <> Неопределено Тогда
		Строка.Оформление[ИмяЯчейки].УстановитьЗначениеПараметра("Видимость", УсловиеВидимости);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзмененииНаКлиенте()
	
	ОбнулитьИтоги(ЭтотОбъект);
	
	ОрганизацияПриИзмененииНаСервере();

	ПодключитьОбработчикОжидания("Подключаемый_ПолучитьИтогиРаздела",0.5, Истина);
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 0.1, Истина);
	
	ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
	
	ПодключитьОбработчикОжидания("ПоказатьПредупреждениеПревышениеЛимитаТарифа", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПериода()
	
	ПриИзмененииПериодаНаСервере();
	
	ПодключитьОбработчикОжидания("Подключаемый_ПолучитьИтогиРаздела",0.5, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьОтборНаСервере()
	
	Список.Параметры.УстановитьЗначениеПараметра("РолиСотрудников", ОтборРолиСотрудников);
	
	ОсновнаяГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы, "ОтборРолиСотрудников" , ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	// Очистим таблицу взаиморасчетов с работниками, чтобы обновить данные
	ПоместитьВоВременноеХранилище(Неопределено, АдресХранилища);
	
	Если ОтборРолиСотрудников = Перечисления.РолиСотрудников.Договорник Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ОсновнаяГруппаОтбора,
			"ОформленПоДоговоруПодряда",
			Истина,
			ВидСравненияКомпоновкиДанных.Равно,
			"ОтборРолиСотрудниковДоговорник",
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
			
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ОсновнаяГруппаОтбора,
			"ОформленПоТрудовомуДоговору",
			,
			,
			"ОтборРолиСотрудниковРаботник",
			Ложь,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
				
	ИначеЕсли ОтборРолиСотрудников = Перечисления.РолиСотрудников.Работник Тогда
				
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ОсновнаяГруппаОтбора,
			"ОформленПоДоговоруПодряда",
			,
			,
			"ОтборРолиСотрудниковДоговорник",
			Ложь,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ОсновнаяГруппаОтбора,
			"ОформленПоТрудовомуДоговору",
			Истина,
			ВидСравненияКомпоновкиДанных.Равно,
			"ОтборРолиСотрудниковРаботник",
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
			
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ОсновнаяГруппаОтбора,
			"ОформленПоДоговоруПодряда",
			,
			,
			"ОтборРолиСотрудниковДоговорник",
			Ложь,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
			
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ОсновнаяГруппаОтбора,
			"ОтборРолиСотрудниковРаботник",
			,
			,
			"ОтборРолиСотрудниковРаботник",
			Ложь,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИтогиРаздела()
		
		Организация = ОрганизацияДляОтбора(ОтборОрганизацияИспользование, ОтборОрганизация);
		
		ПараметрыОбработки = Обработки.ПростойИнтерфейсРазделСотрудники.НовыйПараметрыОбработки();
		ПараметрыОбработки.Организация = Организация;
		ПараметрыОбработки.РолиСотрудников = ОтборРолиСотрудников;
		ПараметрыОбработки.ПериодРегистрации = ПериодРегистрации;
		ПараметрыОбработки.ТекущаяДатаРаботы = ТекущаяДатаРаботы;
		ПараметрыОбработки.ВключатьСведенияПоСотрудникам = Ложь;
		
		Обработки.ПростойИнтерфейсРазделСотрудники.ПодготовитьДанные(
			ПараметрыОбработки, АдресХранилища);
		ПодготовленныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
		
		Если ЗначениеЗаполнено(ПодготовленныеДанные.Список) Тогда
			ПоместитьВоВременноеХранилище(ПодготовленныеДанные.Список, АдресХранилища);
		КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтображатьИтогиПоНачислениямИВыплатамВСпискеСотрудников()
	
	Возврат Константы.ОтображатьИтогиПоНачислениямИВыплатамВСпискеСотрудников.ПолучитьЗначение();
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбнулитьИтоги(Форма)
	
	Форма.ИтогоНачислено = 0;
	Форма.ИтогоУдержано = 0;
	Форма.ИтогоКВыплате = 0;
	Форма.ИтогоВыплачено = 0;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВосстановленныеОтборы()
	
	ИмяПоляОтбораПоОрганизации = "ТекущаяОрганизация";
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.КомпоновщикНастроек.Настройки.Отбор, ИмяПоляОтбораПоОрганизации);

	Если ОтборОрганизацияИспользование Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.КомпоновщикНастроек.Настройки.Отбор,
			ИмяПоляОтбораПоОрганизации,
			ОтборОрганизация,
			,
			,
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусСотрудника()
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СведенияОСотруднике = Новый Структура();
	СведенияОСотруднике.Вставить("Ссылка");
	СведенияОСотруднике.Вставить("ДатаПриема");
	СведенияОСотруднике.Вставить("ДатаУвольнения");
	СведенияОСотруднике.Вставить("ДатаРождения");
	СведенияОСотруднике.Вставить("Работает");
	СведенияОСотруднике.Вставить("ОформленПоДоговоруПодряда");
	СведенияОСотруднике.Вставить("Картинка");
	СведенияОСотруднике.Вставить("ПометкаУдаления");
	
	ЗаполнитьЗначенияСвойств(СведенияОСотруднике, СтрокаТаблицы);
	
	ОбновитьСтатусСотрудникаНаСервере(СведенияОСотруднике);
	СтрокаТаблицы.Картинка = СведенияОСотруднике.Картинка;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусСотрудникаНаСервере(СведенияОСотруднике)
	
	ТаблицаВзаиморасчетов = ПолучитьИзВременногоХранилища(АдресХранилища);

	Если ТаблицаВзаиморасчетов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СведенияОСотруднике.ПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СведенияОСотруднике.Ссылка, "ПометкаУдаления");
	
	Обработки.ПростойИнтерфейсРазделСотрудники.УстановитьСтатусСотрудника(СведенияОСотруднике, ПериодРегистрации);
	
	СтрокаТаблицыВзаиморасчетов = ТаблицаВзаиморасчетов.Найти(СведенияОСотруднике.Ссылка, "Ссылка");
	Если СтрокаТаблицыВзаиморасчетов <> Неопределено Тогда
		СтрокаТаблицыВзаиморасчетов.Картинка = СведенияОСотруднике.Картинка;
	КонецЕсли;
	ПоместитьВоВременноеХранилище(ТаблицаВзаиморасчетов, АдресХранилища);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОрганизацияДляОтбора(ОтборОрганизацияИспользование, ОтборОрганизация)
	
	Если ОтборОрганизацияИспользование И ЗначениеЗаполнено(ОтборОрганизация) Тогда
		Организация = ОтборОрганизация;
	Иначе
		Организация = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
	КонецЕсли;
	
	Возврат Организация
	
КонецФункции

&НаСервереБезКонтекста
Функция ВключенаПодсистемаЗарплата()
	
	Возврат ПолучитьФункциональнуюОпцию("ОтображатьПодсистемуЗарплата");
	
КонецФункции

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	МобильныйКлиентБПФормаСписка.НастроитьФормуОбъекта(ЭтотОбъект, Истина);
	
	Если Не ЭтотОбъект.ПустойСписок Тогда
		Предупреждение = МобильныйКлиентБПФормаОбъекта.СоздатьПредупреждениеОбОграничениях(ЭтотОбъект,
			"Для изменения сведений о сотрудниках перейдите в версию для компьютера");
		МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМКШапка(ЭтотОбъект, Предупреждение);
	КонецЕсли;
	
	Элементы.ПредставлениеПериодаРегистрации.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМКШапка(ЭтотОбъект, Элементы.ГруппаШапка);
	
	Элементы.ГруппаКомандныеПанели.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМКШапка(ЭтотОбъект, Элементы.ГруппаСписокСотрудников);
	
	Элементы.ГруппаПринятьНаРаботу.Видимость = Ложь;
	Если ЭтотОбъект.ПустойСписок Тогда
		ЭлементПредупреждение = МобильныйКлиентБПФормаОбъекта.СоздатьПредупреждениеОбОграничениях(ЭтотОбъект,
			НСтр("ru = 'Добавьте нового сотрудника в версии для компьютера'"));
		Элементы.Переместить(ЭлементПредупреждение, Элементы.СтраницаПустая);
	КонецЕсли;
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМКСписок(ЭтотОбъект, Элементы.ГруппаСписокСотрудников);
	
	МобильныйКлиентБПФормаСписка.СкрытьЭлементФормыСписка(ЭтотОбъект, Элементы.ГруппаОсновныеКоманды);
	МобильныйКлиентБПФормаСписка.СкрытьЭлементФормыСписка(ЭтотОбъект, Элементы.КоманднаяПанельФормы);
	МобильныйКлиентБПФормаСписка.СкрытьЭлементФормыСписка(ЭтотОбъект, Элементы.ИзменитьВидимостьПодсказок);
	МобильныйКлиентБПФормаСписка.СкрытьЭлементФормыСписка(ЭтотОбъект, Элементы.Отступ);
	
	АдаптироватьМККоманднаяПанельФормы();
	АдаптироватьМКОтборыФормы();
	АдаптироватьМКСписокФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМККоманднаяПанельФормы()
	
	КомандыПоля = МобильныйКлиентБПФормаСписка.НовыйОписаниеКомандТабличноеПоле();
	КомандыПоля.РазрешеноИзменение = Ложь;
	КомандыПоля.ДоступноУправлениеОтбором = Ложь;
	МобильныйКлиентБПФормаСписка.АдаптироватьМККоманднаяПанельФормы(ЭтотОбъект, КомандыПоля);
	
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМКПерваяКомандаПанели(ЭтотОбъект, Элементы.ГруппаКомандыОтчеты);
	МобильныйКлиентБПФормаСписка.ПеренестиЭлементВМККомандыФормы(ЭтотОбъект, Элементы.ПоказыватьУволенных);
	МобильныйКлиентБПФормаСписка.ПеренестиЭлементВМККомандыФормы(ЭтотОбъект, Элементы.ГруппаСтандартныеКоманды);
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКСписокФормы()
	
	Элементы.Список.ТолькоПросмотр = Истина;
	
	Элементы.Список.Шапка = Ложь;
	Элементы.Список.Подвал = Ложь;
	Элементы.Список.ПоведениеПриСжатииПоГоризонтали = ПоведениеТаблицыПриСжатииПоГоризонтали.ПереноситьЭлементыПоВажности;
	Элементы.Список.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	
	Элементы.Наименование.ВажностьПриОтображении = ВажностьПриОтображении.ОченьВысокая;
	
	Элементы.Начислено.Формат = "ЧФ='Начислено з/п: Ч'";
	Элементы.НачисленоДивиденды.Формат = "ЧФ='Начислено дивиденды: Ч'";
	Элементы.НачисленоДоговоры.Формат = "ЧФ='Начислено по договору ГПХ: Ч'";
	
	Элементы.Удержано.Формат = "ЧФ='НДФЛ и алименты: Ч'";
	Элементы.НДФЛДивиденды.Формат = "ЧФ='НДФЛ дивиденды: Ч'";
	
	Элементы.Выплачено.Формат = "ЧФ='Выплачено: Ч'";
	Элементы.ВыплаченоДивиденды.Формат = "ЧФ='Выплачено дивиденды: Ч'";
	Элементы.ВыплаченоДоговоры.Формат = "ЧФ='Выплачено по договору ГПХ: Ч'";
	
	Элементы.КВыплате.Формат = "ЧФ='К выплате зарплата: Ч'";
	Элементы.КВыплатеДивиденды.Формат = "ЧФ='К выплате дивиденды: Ч'";
	Элементы.КВыплатеДоговоры.Формат = "ЧФ='К выплате по договору ГПХ: Ч'";
	
	Элементы.ТекущийПроцентСевернойНадбавки.Формат = "ЧФ='Северная надбавка: Ч'";
	Элементы.ТекущийАванс.Формат = "ЧФ='Аванс: Ч'";
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКОтборыФормы()
	
	МобильныйКлиентБПФормаСписка.НастроитьФормуОтбораМК(ЭтотОбъект, "Список", "Организация");
	
	МобильныйКлиентБПФормаСписка.АдаптироватьМКЭлементОтбораОрганизация(ЭтотОбъект,
		Элементы.ОтборТекущаяОрганизация,
		"",
		НСтр("ru = 'Все организации'"));
		
	МобильныйКлиентБПФормаСписка.СкрытьЭлементФормыСписка(ЭтотОбъект, Элементы.ОтборТекущаяОрганизацияИспользование);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

