#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ЗаполнениеЗадачНачалаРаботыПриОбновленииС20");
	
КонецПроцедуры

// Обработчик обновления отмечает делает часть задач начала работы при обновлении с 2.0
//
Процедура ЗаполнениеЗадачНачалаРаботыПриОбновленииС20() Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда // В подчиненных узлах РИБ не выполняется
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НевыполненныеЗадачи = Новый Массив;
	Если РегламентированнаяОтчетностьБП.Используется1СОтчетность() Тогда
		НевыполненныеЗадачи.Добавить(Перечисления.ЗадачиНачалаРаботы.Подключение1СОтчетности); // Нужно подключиться
	КонецЕсли;
	Если Не ОбщегоНазначенияБП.ЭтоИнтерфейсИнтеграцииСБанком() Тогда
		НевыполненныеЗадачи.Добавить(Перечисления.ЗадачиНачалаРаботы.СписокНалоговОтчетов);    // Нужно проверить - в 2.0 не было
		НевыполненныеЗадачи.Добавить(Перечисления.ЗадачиНачалаРаботы.Подключение1СЭДО);        // Нужно подключиться
	КонецЕсли;
	Если НевыполненныеЗадачи.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗадачиОрганизаций",   РегистрыСведений.ЗадачиБухгалтера.ЗадачиНовыхОрганизаций());
	Запрос.УстановитьПараметр("НевыполненныеЗадачи", НевыполненныеЗадачи);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗадачиОрганизаций.Задача КАК Задача,
	|	ЗадачиОрганизаций.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	ЗадачиОрганизаций.УникальнаяЗадача КАК УникальнаяЗадача
	|ПОМЕСТИТЬ ВыполненныеЗадачиНачалаРаботы
	|ИЗ
	|	&ЗадачиОрганизаций КАК ЗадачиОрганизаций
	|ГДЕ
	|	НЕ ЗадачиОрганизаций.Задача В (&НевыполненныеЗадачи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация,
	|	ВыполненныеЗадачиНачалаРаботы.Задача КАК Задача
	|ПОМЕСТИТЬ ВыполненныеЗадачиПоОрганизациям
	|ИЗ
	|	ВыполненныеЗадачиНачалаРаботы КАК ВыполненныеЗадачиНачалаРаботы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ВыполненныеЗадачиНачалаРаботы.ОбособленноеПодразделение = Организации.ОбособленноеПодразделение
	|ГДЕ
	|	НЕ ВыполненныеЗадачиНачалаРаботы.УникальнаяЗадача
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка),
	|	УникальныеЗадачиНачалаРаботы.Задача
	|ИЗ
	|	ВыполненныеЗадачиНачалаРаботы КАК УникальныеЗадачиНачалаРаботы
	|ГДЕ
	|	УникальныеЗадачиНачалаРаботы.УникальнаяЗадача
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Задача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыполненныеЗадачиПоОрганизациям.Организация,
	|	ВыполненныеЗадачиПоОрганизациям.Задача КАК Правило,
	|	ПРЕДСТАВЛЕНИЕ(ВыполненныеЗадачиПоОрганизациям.Задача) КАК Наименование,
	|	ИСТИНА КАК Выполнено
	|ИЗ
	|	ВыполненныеЗадачиПоОрганизациям КАК ВыполненныеЗадачиПоОрганизациям
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗадачиБухгалтера КАК СуществующиеЗадачи
	|		ПО ВыполненныеЗадачиПоОрганизациям.Организация = СуществующиеЗадачи.Организация
	|			И ВыполненныеЗадачиПоОрганизациям.Задача = СуществующиеЗадачи.Правило
	|ГДЕ
	|	СуществующиеЗадачи.Организация ЕСТЬ NULL ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ЗадачиБухгалтера.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СдвинутьСроки(Срок, ПериодСобытия, Правило, День, ОсобыеСрокиСверкиИмущественныхНалогов, ПараметрыПродленияСроков) Экспорт
	
	ОснованияПродления = ПараметрыПродленияСроков.ОснованияПродления;
	
	ВыборкаОснованияПродленияСроков = Правило.ОснованияПродленияСроков.Выбрать();
	Пока ВыборкаОснованияПродленияСроков.Следующий() Цикл
		Если ОснованияПродления.Найти(ВыборкаОснованияПродленияСроков.ОснованиеПродленияСроковНалоговОтчетов) <> Неопределено Тогда
			СдвинутьСрокВыполнения(Срок, ПериодСобытия, ВыборкаОснованияПродленияСроков.ОснованиеПродленияСроковНалоговОтчетов);
		КонецЕсли;
	КонецЦикла;
	
	СдвинутьМестныеСрокиУСН(Срок, ПериодСобытия, Правило, ПараметрыПродленияСроков);
	СдвинутьМестныеСрокиЕНВД(Срок, ПериодСобытия, Правило, ПараметрыПродленияСроков);
	СдвинутьСрокиСверкиИмущественныхНалогов(Срок, ПериодСобытия, Правило, ОсобыеСрокиСверкиИмущественныхНалогов);
	СдвинутьСрокиУведомлений(Срок, ПериодСобытия, Правило, День);
	
КонецПроцедуры

Процедура ЗаполнитьРасписаниеФинОтчетности(Организация, Правила, Расписание, Знач НачалоОбзора, Знач КонецОбзора) Экспорт
	
	День = 24 * 60 * 60;
	
	Для каждого Правило Из Правила Цикл
		
		НачалоПериодаСдачи = Макс(НачалоОбзора,
			ИнтерфейсыВзаимодействияБРОКлиентСервер.НачалоПериода(Правило.Периодичность, Правило.НачалоВыполнения));
		
		КонецПериодаСдачи = ?(ЗначениеЗаполнено(Правило.ОкончаниеВыполнения),
			Мин(КонецОбзора, ИнтерфейсыВзаимодействияБРОКлиентСервер.НачалоПериода(Правило.Периодичность, Правило.ОкончаниеВыполнения)),
			КонецОбзора);
		
		Периоды = КалендарьБухгалтера.Периоды(НачалоПериодаСдачи, КонецПериодаСдачи, Правило.Периодичность);
		
		ОписаниеКомплекта = ЗаполнениеФинОтчетностиВБанки.НастройкиКомплектаОтчетности(Правило.Получатель, Правило.ИдентификаторКомплекта);
		Если ОписаниеКомплекта = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого Период Из Периоды Цикл
			ПериодРасписания = ИнтерфейсыВзаимодействияБРОКлиентСервер.ДобавитьПериод(Период, Правило.Периодичность);
			
			СрокПредставленияМесяцев = ОписаниеКомплекта.СрокПредставленияМесяцев;
			СрокПредставленияДней = ОписаниеКомплекта.СрокПредставленияДней;
			
			ЭтоКонецГода = ИнтерфейсыВзаимодействияБРОКлиентСервер.КонецПериода(Правило.Периодичность, Период) = КонецГода(Период);
			Если ЭтоКонецГода И ОписаниеКомплекта.ОсобыйСрокПредставленияЗаГод Тогда
				СрокПредставленияМесяцев = ОписаниеКомплекта.СрокПредставленияЗаГодМесяцев;
				СрокПредставленияДней = ОписаниеКомплекта.СрокПредставленияЗаГодДней;
			КонецЕсли;
			
			Если ОписаниеКомплекта.СрокПредставленияВРабочихДнях Тогда
				СрокСдачи = ДобавитьМесяц(ПериодРасписания, СрокПредставленияМесяцев);
				Если ЗначениеЗаполнено(СрокПредставленияДней) Тогда
					ГрафикРаботы = УчетЗарплаты.ГрафикРаботыОрганизации(Организация);
					НачалоОтсчета = НачалоДня(СрокСдачи) - 1;
					СрокСдачиВРабочихДнях = ГрафикиРаботы.ДатаПоГрафику(ГрафикРаботы, НачалоОтсчета, СрокПредставленияДней, Ложь);
					Если СрокСдачиВРабочихДнях = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					СрокСдачи = СрокСдачиВРабочихДнях;
				КонецЕсли;
			Иначе
				СрокСдачи = ДобавитьМесяц(ПериодРасписания, СрокПредставленияМесяцев) + День * СрокПредставленияДней - 1;
			КонецЕсли;
			
			Представление = ПредставлениеПериода(Период,
				ИнтерфейсыВзаимодействияБРОКлиентСервер.КонецПериода(Правило.Периодичность, Период));
			
			ЗаполнитьЗаписьРасписанияФинОтчетность(Расписание.Добавить(),
				Правило,
				ПериодРасписания,
				Представление,
				СрокСдачи,
				ОписаниеКомплекта.ПереносСрокаПредставления);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРасписаниеРегулярныеПлатежи(Организация, Правила, Расписание, Знач НачалоОбзора, Знач КонецОбзора) Экспорт
	
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	
	Для каждого Правило Из Правила Цикл
		
		Если ЗначениеЗаполнено(НачалоОбзора) Тогда
			НачалоПериодаОбзора = НачалоОбзора;
			КонецПериодаОбзора = Макс(КонецОбзора, Правило.НачалоВыполнения)+1;
		Иначе
			// Событиями, приводящими к появлению напоминаний которые еще можно выполнить в срок, могут являться только события предыдущего и текущего периодов
			// т.к. оценка актуальности срока выполнения считается относительно текущей даты, глубину поиска источников актуальных задач отсчитываем -1 период от текущей даты сеанса
			НачалоПериодаОбзора = Макс(
				Правило.НачалоВыполнения, // период анализа не может быть раньше периода начала выполнения правила
				ИнтерфейсыВзаимодействияБРОКлиентСервер.ДобавитьПериод(ТекущаяДата, Правило.Периодичность, -1)); 
			КонецПериодаОбзора = КонецОбзора;
		КонецЕсли;
		
		// Первая задача по правилу в дату НачалоВыполнения, основное условие добавления - задача еще может быть выполнена в срок
		// Планируется в составе недавних событий в случае если дата начала выполнения больше текущей даты актуальности, 
		// И в составе давних - если дата начала выполнения меньше даты актуальности но больше текущей даты.
		Если Правило.НачалоВыполнения >= ТекущаяДата 
			И (Правило.НачалоВыполнения >= НачалоПериодаОбзора И Правило.НачалоВыполнения < КонецПериодаОбзора) Тогда
		
			ЗаполнитьЗаписьРасписанияРегулярныеПлатежи(
				Расписание.Добавить(), 
				Правило, 
				ИнтерфейсыВзаимодействияБРОКлиентСервер.НачалоПериода(Правило.Периодичность, Правило.НачалоВыполнения));
		
		КонецЕсли; 
		
		// Массив дат начала периодов выполнения правила лежащих в периоде обзора. Соотвественно массив дат начала месяца, квартала или года
		// Для правил дата начала выполнения которых больше даты конца обзора - содержит один элемент - начало периода первого выполнения
		// Для правил, которые уже действуют на дату КонецОбзора будет содержать массив дат за периоды лежащие внутри обозреваемого интервала.
		Периоды = КалендарьБухгалтера.Периоды(НачалоПериодаОбзора, КонецОбзора, Правило.Периодичность);
		
		// Для каждого анализируемого периода рассчитаем срок выполнения правила в нем и проверим
		// - начинается ли в нем какое либо правило (тогда создаем задачу по правилу в этом периоде)
		// - попадает ли срок выполнения задачи по правилу в период обзора (тогда создаем очередную задачу по правилу в следующем периоде)
		Для каждого Период Из Периоды Цикл
			// Срок выполнения задачи по правилу в анализируемом периоде. Всегда лежит внутри периода.
			Срок = Справочники.ПравилаРегулярныхПлатежей.ДатаПлатежаВПериоде(Правило.Правило, Период);
			
			// Добавляем новую задачу по правилу, когда срок очередного выполнения задачи по правилу наступает в обозреваемом интервале. 
			// В этом случае записываем задачу по правилу на следующий, по отношению к анализируемому, период.
			Если Срок >= НачалоПериодаОбзора И Срок < КонецОбзора Тогда
				
				ЗаполнитьЗаписьРасписанияРегулярныеПлатежи(
					Расписание.Добавить(), 
					Правило,
					ИнтерфейсыВзаимодействияБРОКлиентСервер.ДобавитьПериод(Период, Правило.Периодичность));
					
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРасписаниеУплатыИПродленияПатентов(Организация, Правила, Расписание) Экспорт
	
	ПараметрыПродленияСроков = РегистрыСведений.НастройкиПродленияСроковНалоговОтчетов.ПараметрыПродленияСроков(
		Организация);
	ОснованияПродленияСроков = ПараметрыПродленияСроков.ОснованияПродления;
	
	Для Каждого Правило Из Правила Цикл
		
		ЗаписьРасписания = Расписание.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьРасписания, Правило);
		
		Если Не ЗначениеЗаполнено(Правило.Действие)
			Или Правило.Действие = Перечисления.ВидыДействийКалендаряБухгалтера.Отчет Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОснованияПродленияСроков.Найти(
			ОснованияПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвитияП1аАбз4()) <> Неопределено Тогда
			// налог, уплачиваемый в связи с применением патентной системы
			// налогообложения, срок уплаты которого приходится на II квартал 2020 г., -
			// на 4 месяца;
			Срок = ЗаписьРасписания.Срок;
			Если КонецКвартала(Срок) = КонецКвартала(Дата(2020, 6, 30)) Тогда
				
				ЗаписьРасписания.Срок = ДобавитьМесяц(Срок, 4);
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьСрокНачалаВыполненияТребования(Правило) Экспорт
	
	Возврат Правило.НачальныйСрокМесяцев <> 0 Или Правило.НачальныйСрокДней <> 0;
	
КонецФункции

Функция СрокЗакрывающейЗадачиОрганизации(Расписание, ПериодСобытия, Действие, Владелец) Экспорт
	
	ОтборСнятиеСУчета = Новый Структура("Действие, Периодичность");
	ОтборСнятиеСУчета.Действие = Действие;
	ОтборСнятиеСУчета.Периодичность = Перечисления.Периодичность.Год; // У задач снятия с учета периодичность - год
	
	ТекущиеЗадачи = Расписание.НайтиСтроки(ОтборСнятиеСУчета);
	
	Для Каждого ТекущаяСтрока Из ТекущиеЗадачи Цикл
		
		Если ТекущаяСтрока.ПериодСобытия > ПериодСобытия Тогда
			РеквизитыПравила = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущаяСтрока.Правило, "Код, Владелец");
			Если РеквизитыПравила.Владелец = Владелец
				И ВыполнениеЗадачБухгалтераПовтИспНаВызов.ЭтоЗадачаЗакрытияИП(РеквизитыПравила.Код) Тогда
				
				Возврат ТекущаяСтрока.Срок;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ТаблицаСоответствияЗадачБухгалтераДляУведомлений() Экспорт
	
	Возврат РасчетыСБюджетом.ТаблицаСоответствияЗадачБухгалтераДляУведомлений();
	
КонецФункции

Процедура МобильныйКлиентАдаптацияФормыВводКомментария(Форма) Экспорт
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	Если Не ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	Элементы.ГруппаКомандыФормы.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Право;
	Элементы.ГруппаКомандыФормы.РастягиватьПоГоризонтали = Истина;
	
КонецПроцедуры

Процедура АдаптироватьМККоманднаяПанельФормы(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	КомандыПоля = МобильныйКлиентБПФормаСписка.НовыйОписаниеКомандТабличноеПоле();
	КомандыПоля.ДоступноУправлениеОтбором = Ложь;
	КомандыПоля.РазрешеноИзменение = Ложь;
	КомандыПоля.СворачиватьПрочиеКолонки = Ложь;
	МобильныйКлиентБПФормаСписка.АдаптироватьМККоманднаяПанельФормы(Форма, КомандыПоля);
	
	Элементы.КоманднаяПанель.Видимость = Ложь;
	Элементы.СписокЗадачКонтекстноеМенюПоместитьЗадачуВАрхив.Видимость = Истина;
	Элементы.ВыполненныеЗадачи.Заголовок = "Архив задач";
	
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМКПерваяКомандаПанели(Форма, Элементы.ВыполненныеЗадачи);
	МобильныйКлиентБПФормаСписка.ПеренестиЭлементВМККомандыФормы(Форма, Элементы.НастройкаЗадач);
	МобильныйКлиентБПФормаСписка.ПеренестиЭлементВМККомандыФормы(Форма, Элементы.КалендарьНаИТС);
	МобильныйКлиентБПФормаСписка.ПеренестиЭлементВМККомандыФормы(Форма, Элементы.Открыть1СОтчетность);
	МобильныйКлиентБПФормаСписка.ПеренестиКомандыВМККомандыФормы(Форма, Элементы.КоманднаяПанельПраво.ПодчиненныеЭлементы);

КонецПроцедуры

Процедура АдаптироватьМКШапкаФормы(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	Элементы.ГруппаШапка.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Право;
	
	Элементы.ГруппаШапка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Элементы.ОрганизацияПредставление.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элементы.Организация.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элементы.ОрганизацияПредставление.АвтоМаксимальнаяШирина = Ложь;
	Элементы.Организация.АвтоМаксимальнаяШирина = Ложь;
	Элементы.ОрганизацияПредставление.МаксимальнаяШирина = 0;
	Элементы.Организация.МаксимальнаяШирина = 0;
	Элементы.ОрганизацияПредставление.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	Элементы.Организация.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	Элементы.ОрганизацияПредставление.РастягиватьПоГоризонтали = Истина;
	Элементы.Организация.РастягиватьПоГоризонтали = Истина;
	
КонецПроцедуры

Процедура АдаптироватьМКСписокФормы(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	Элементы.СписокЗадач.ЗапросОбновления = СпособЗапросаОбновления.ПотянутьСверху;
	Элементы.СписокЗадач.ПоведениеПриСжатииПоГоризонтали = ПоведениеТаблицыПриСжатииПоГоризонтали.СкрыватьЭлементыПоВажности;

	//Список

	ГруппаКолонокМК_Корень = МобильныйКлиентБПФормаОбъекта.ДобавитьКорневуюГруппуСписка(Форма, Элементы.СписокЗадач);

	ГруппаКолонокМК_Строки = МобильныйКлиентБПФормаОбъекта.ДобавитьГруппуКолонок(Форма,
		"ГруппаКолонокМК_Строки",
		ГруппировкаКолонок.Вертикальная,
		ГруппаКолонокМК_Корень);
	
	ГруппаКолонокМК_ДатаСтатус = МобильныйКлиентБПФормаОбъекта.ДобавитьГруппуКолонок(Форма,
		"ГруппаКолонокМК_ДатаСтатус",
		ГруппировкаКолонок.Горизонтальная,
		ГруппаКолонокМК_Строки);
	
	ГруппаКолонокМК_Дата = МобильныйКлиентБПФормаОбъекта.ДобавитьГруппуКолонок(Форма,
		"ГруппаКолонокМК_Дата",
		ГруппировкаКолонок.Вертикальная,
		ГруппаКолонокМК_ДатаСтатус);
	
	ГруппаКолонокМК_Статус = МобильныйКлиентБПФормаОбъекта.ДобавитьГруппуКолонок(Форма,
		"ГруппаКолонокМК_Статус",
		ГруппировкаКолонок.Вертикальная,
		ГруппаКолонокМК_ДатаСтатус);
	
	ГруппаКолонокМК_Важное = МобильныйКлиентБПФормаОбъекта.ДобавитьГруппуКолонок(Форма,
		"ГруппаКолонокМК_Важное",
		ГруппировкаКолонок.Горизонтальная,
		ГруппаКолонокМК_Строки);
	
	ГруппаКолонокМК_Строка1 = МобильныйКлиентБПФормаОбъекта.ДобавитьГруппуКолонок(Форма,
		"ГруппаКолонокМК_Строка1",
		ГруппировкаКолонок.Горизонтальная,
		ГруппаКолонокМК_Строки);
	
	ГруппаКолонокМК_Прочее = МобильныйКлиентБПФормаОбъекта.ДобавитьГруппуКолонок(Форма,
		"ГруппаКолонокМК_Прочее",
		ГруппировкаКолонок.ВЯчейке,
		ГруппаКолонокМК_Строки);
	
	//
	Элементы.СписокЗадачСрок.Высота = 2;
	Элементы.СписокЗадачСрок.РастягиватьПоГоризонтали = Истина;

	ГруппаКолонокМК_Дата.Ширина = 15;
	Элементы.Переместить(Элементы.СписокЗадачСрок, ГруппаКолонокМК_Дата);
	Элементы.СписокЗадачОсталосьДней.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	Элементы.Переместить(Элементы.СписокЗадачОсталосьДней, ГруппаКолонокМК_Статус);

	Элементы.Переместить(Элементы.СписокЗадачГруппаПредставление, ГруппаКолонокМК_Важное);

	Элементы.Переместить(Элементы.СписокЗадачГруппаНачальныйСрокКомментарий, ГруппаКолонокМК_Строка1);

	Элементы.СписокЗадачГруппаНачальныйСрокКомментарий.РастягиватьПоГоризонтали = Истина;
	Элементы.СписокЗадачНачальныйСрок.РастягиватьПоГоризонтали = Истина;

	Элементы.ГруппаСтатус.РастягиватьПоГоризонтали = Ложь;
	Элементы.СписокЗадачОсталосьДней.РастягиватьПоГоризонтали = Ложь;
	Элементы.Статус.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Право;
	Элементы.Статус.АвтоМаксимальнаяШирина = Ложь;
	Элементы.Статус.МаксимальнаяШирина = 10;
	Элементы.Статус.РастягиватьПоГоризонтали = Ложь;
	Элементы.Статус.РастягиватьПоВертикали = Ложь;
	Элементы.РучнойСтатусКартинка.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
	Элементы.Переместить(Элементы.Статус, ГруппаКолонокМК_Строка1);
	Элементы.Переместить(Элементы.СписокЗадачГруппаСтатусУстановленВручную, ГруппаКолонокМК_Строка1);

	МобильныйКлиентБПФормаСписка.СкрытьЭлементФормыСписка(Форма, Элементы.СписокЗадачПравило);
	МобильныйКлиентБПФормаСписка.СкрытьЭлементФормыСписка(Форма, Элементы.СписокЗадачГруппаЗавершить);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СдвинутьМестныеСрокиУСН(Срок, ПериодСобытия, Правило, ПараметрыПереносаСроков)
	
	// По УСН возможно продление сроков уплаты налога и авансов по решению субъектов РФ (см. 102-ФЗ от 01.04.2020).
	Если Правило.ИдентификаторЗадачи <> "УСН" ИЛИ Правило.Действие <> Перечисления.ВидыДействийКалендаряБухгалтера.УплатаНалога Тогда
		Возврат;
	КонецЕсли;	
	
	// Могут быть продлены сроки по задачам, попадающим в указанный в законе интервал.
	ПериодПереносаСроков = РегистрыСведений.НастройкиПродленияСроковНалоговОтчетов.ПериодПереносаСроковНалоговОтчетов();
	Если Срок < ПериодПереносаСроков.Начало ИЛИ Срок > ПериодПереносаСроков.Окончание Тогда
		Возврат;
	КонецЕсли;	
		
	Если Правило.ИдентификаторПравила = "2013_УплатаОрганизация" ИЛИ Правило.ИдентификаторПравила = "2013_УплатаПредприниматель" Тогда
		// Регионы могут продлить (но не сократить) срок уплаты налога 
		Срок = Макс(Срок, ПараметрыПереносаСроков.ДатаУплатыУСНЗа2019Год); 
	КонецЕсли;
	
	Если Правило.ИдентификаторПравила = "2013_УплатаАвансов" Тогда
		// Регионы могут продлить (но не сократить)срок уплаты авансов 
		Если ПериодСобытия = Дата(Год(ПериодСобытия), 3, 31) Тогда // конец 1 квартала
			Срок = Макс(Срок, ПараметрыПереносаСроков.ДатаУплатыУСНЗа1Кв2020);
		ИначеЕсли ПериодСобытия = Дата(Год(ПериодСобытия), 6, 30) Тогда // конец 2 квартала
			Срок = Макс(Срок, ПараметрыПереносаСроков.ДатаУплатыУСНЗа2Кв2020);
		ИначеЕсли ПериодСобытия = Дата(Год(ПериодСобытия), 9, 30) Тогда // конец 3 квартала
			Срок = Макс(Срок, ПараметрыПереносаСроков.ДатаУплатыУСНЗа3Кв2020);
		КонецЕсли;	
	КонецЕсли;
			
КонецПроцедуры	

Процедура СдвинутьМестныеСрокиЕНВД(Срок, ПериодСобытия, Правило, ПараметрыПереносаСроков)
	
	// По ЕНВД возможно продление сроков уплаты налога по решению субъектов РФ (см. 102-ФЗ от 01.04.2020).
	Если Правило.ИдентификаторЗадачи <> "ЕНВД" ИЛИ Правило.Действие <> Перечисления.ВидыДействийКалендаряБухгалтера.УплатаНалога Тогда
		Возврат;
	КонецЕсли;	
	
	// Могут быть продлены сроки по задачам, попадающим в указанный в законе интервал.
	ПериодПереносаСроков = РегистрыСведений.НастройкиПродленияСроковНалоговОтчетов.ПериодПереносаСроковНалоговОтчетов();
	Если Срок < ПериодПереносаСроков.Начало ИЛИ Срок > ПериодПереносаСроков.Окончание Тогда
		Возврат;
	КонецЕсли;	
		
	// Регионы могут продлить (но не сократить)срок уплаты налога 
	Если ПериодСобытия = Дата(Год(ПериодСобытия), 3, 31) Тогда // конец 1 квартала
		Срок = Макс(Срок, ПараметрыПереносаСроков.ДатаУплатыЕНВДЗа1Кв2020);
	ИначеЕсли ПериодСобытия = Дата(Год(ПериодСобытия), 6, 30) Тогда // конец 2 квартала
		Срок = Макс(Срок, ПараметрыПереносаСроков.ДатаУплатыЕНВДЗа2Кв2020);
	ИначеЕсли ПериодСобытия = Дата(Год(ПериодСобытия), 9, 30) Тогда // конец 3 квартала
		Срок = Макс(Срок, ПараметрыПереносаСроков.ДатаУплатыЕНВДЗа3Кв2020);
	КонецЕсли;	
			
КонецПроцедуры	

Процедура СдвинутьСрокиСверкиИмущественныхНалогов(Срок, ПериодСобытия, Правило, ОсобыеСрокиСверкиИмущественныхНалогов)

	Если Правило.ИдентификаторЗадачи <> ЗадачиБухгалтераКлиентСервер.КодЗадачиТранспортныйНалог()
		 И Правило.ИдентификаторЗадачи <> ЗадачиБухгалтераКлиентСервер.КодЗадачиЗемельныйНалог()
		 И Правило.ИдентификаторЗадачи <> ЗадачиБухгалтераКлиентСервер.КодЗадачиНалогНаИмущество()
		 Или Правило.ИдентификаторПравила <> "СверкаРасчета" Тогда
		Возврат;
	КонецЕсли;	

	Поиск = Новый Структура;
	Поиск.Вставить("Налог", Правило.ИдентификаторЗадачи);
	Поиск.Вставить("ПериодСобытия", ПериодСобытия);
	Поиск.Вставить("КодНалоговогоОргана", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Правило.РегистрацияВНалоговомОргане, "Код"));
	
	НовыеСроки = ОсобыеСрокиСверкиИмущественныхНалогов.НайтиСтроки(Поиск);
	
	Если НовыеСроки.Количество() > 0 Тогда
		Срок = НовыеСроки[0].Срок;
	КонецЕсли;	
	
КонецПроцедуры 

Процедура СдвинутьСрокиУведомлений(Срок, ПериодСобытия, Правило, День)
	
	Если Правило.Действие <> Перечисления.ВидыДействийКалендаряБухгалтера.Уведомление
		Или Правило.ИдентификаторЗадачи = "НДФЛ_Агент_Уведомление" Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачалаОбязательногоПримененияЕНП = НастройкиУчетаКлиентСервер.ДатаПереходаНаЕдиныйНалоговыйПлатеж();
	Если ПериодСобытия > ДатаНачалаОбязательногоПримененияЕНП
		Или Срок > ДатаНачалаОбязательногоПримененияЕНП Тогда
		// Начиная с 2023 года сроки подачи уведомлений фиксированные, и сдвигать их не требуется
		Возврат;
	КонецЕсли;
	
	// Уведомление подается за 5 рабочих дней до даты уплаты
	СдвигСрокаДней = - 5;
	
	// Попытаемся рассчитать срок в рабочих днях, если заполнен производственный календарь.
	ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
	
	РабочийДень = КалендарьБухгалтера.РабочаяДатаПоКалендарю(ПроизводственныйКалендарь, Срок, СдвигСрокаДней);
	Если РабочийДень <> Неопределено Тогда
		Срок = РабочийДень;
	Иначе
		// Возможно производственный календарь не заполнен, тогда рассчитаем срок в календарных днях.
		Срок = Срок + СдвигСрокаДней * День;
	КонецЕсли;
	
	ДатаНачалаПримененияЕНП = НастройкиУчетаВызовСервера.ДатаНачалаПримененияЕНП();
	Если Срок < ДатаНачалаПримененияЕНП Тогда
		Срок = ДатаНачалаПримененияЕНП;
	КонецЕсли;
	
КонецПроцедуры

Процедура СдвинутьСрокВыполнения(Срок, ПериодСобытия, ОснованиеПереносаСроковОтчетовНалогов)
	
	Если ОснованиеПереносаСроковОтчетовНалогов = 
		ОснованияПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвитияП1аАбз1() Тогда
		
		// а) продлить организациям и индивидуальным предпринимателям,
		// включенным по состоянию на 1 марта 2020 г. в соответствии
		// с Федеральным законом "О развитии малого и среднего
		// предпринимательства в Российской Федерации" в единый реестр
		// субъектов малого и среднего предпринимательства, установленные
		// законодательством о налогах и сборах сроки уплаты следующих налогов
		// (авансовых платежей):
		
		// налог на прибыль организаций, единый сельскохозяйственный налог,
		// налог, уплачиваемый в связи с применением упрощенной системы
		// налогообложения за 2019 год, - на 6 месяцев;
		
		Если КонецДня(ПериодСобытия) = КонецДня(Дата(2019, 12, 31)) Тогда
			Срок = ДобавитьМесяц(Срок, 6);
		КонецЕсли;
		
	ИначеЕсли ОснованиеПереносаСроковОтчетовНалогов = 
		ОснованияПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвитияП1аАбз2() Тогда
		
		// налог на доходы физических лиц за 2019 год, уплачиваемый
		// индивидуальными предпринимателями в соответствии с пунктом 6
		// статьи 227 Налогового кодекса Российской Федерации (далее - Кодекс), -
		// на 3 месяца;
		
		Если КонецДня(ПериодСобытия) = КонецДня(Дата(2019, 12, 31)) Тогда
			Срок = ДобавитьМесяц(Срок, 3);
		КонецЕсли;
		
	ИначеЕсли ОснованиеПереносаСроковОтчетовНалогов = 
		ОснованияПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвитияП1аАбз3() Тогда
		
		// налоги (за исключением налога на добавленную стоимость, налога на
		// профессиональный доход, налогов, уплачиваемых в качестве налогового
		// агента) и авансовые платежи по налогам за март и I квартал 2020 г. - на 
		// 6 месяцев, за апрель - июнь, за II квартал и первое полугодие 2020 г. -
		// на 4 месяца;
		
		ДатаПервогоКвартала = Дата(2020, 1, 1);
		ДатаВторогоКвартала = Дата(2020, 4, 1);
		
		Если КонецКвартала(ПериодСобытия) = КонецКвартала(ДатаПервогоКвартала) Тогда
			
			Срок = ДобавитьМесяц(Срок, 6);
			
		ИначеЕсли КонецКвартала(ПериодСобытия) = КонецКвартала(ДатаВторогоКвартала) Тогда
			
			Срок = ДобавитьМесяц(Срок, 4);
			
		КонецЕсли;
		
		
	ИначеЕсли ОснованиеПереносаСроковОтчетовНалогов = 
		ОснованияПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвитияП1аАбз5() Тогда
		
		// в случае если законами субъектов Российской Федерации,
		// нормативными правовыми актами представительных органов
		// муниципальных образований предусмотрена уплата авансовых платежей
		// по транспортному налогу, налогу на имущество организаций и земельному
		// налогу, установить, что указанные авансовые платежи за I квартал 2020 г.
		// подлежат уплате не позднее 30 октября 2020 г., за II квартал 2020 г. -
		// не позднее 30 декабря 2020 г.;
		
		ДатаПервогоКвартала = Дата(2020, 1, 1);
		ДатаВторогоКвартала = Дата(2020, 4, 1);
		
		// Местными правилами срок уплаты может быть продлен. В этом случае Срок уже учитывает местные настройки уплаты.
		// Устанавливаем срок по общему переносу, только если он приходится на более позднюю дату, чем местная настройка.
		Если КонецКвартала(ПериодСобытия) = КонецКвартала(ДатаПервогоКвартала) Тогда
			
			Срок = Макс(Срок, Дата(2020, 10, 30));
			
		ИначеЕсли КонецКвартала(ПериодСобытия) = КонецКвартала(ДатаВторогоКвартала) Тогда
			
			Срок = Макс(Срок, Дата(2020, 12, 30));
			
		КонецЕсли;
		
	ИначеЕсли ОснованиеПереносаСроковОтчетовНалогов = 
		ОснованияПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвитияП1б() Тогда
		
		// б) продлить организациям и индивидуальным предпринимателям,
		// указанным в подпункте "а" настоящего пункта и относящимся к категории
		// микропредприятий, установленные Кодексом сроки уплаты страховых
		// взносов:
		// исчисленных с выплат и иных вознаграждений в пользу физических
		// лиц за март - май 2020 г., - на 6 месяцев;
		// исчисленных с выплат и иных вознаграждений в пользу физических
		// лиц за июнь - июль 2020 г. - на 4 месяца;
		
		Если ПериодСобытия >= НачалоДня(Дата(2020, 3, 1))
			И ПериодСобытия <= КонецДня(Дата(2020, 5, 31)) Тогда
			
			Срок = ДобавитьМесяц(Срок, 6);
			
		ИначеЕсли ПериодСобытия >= НачалоДня(Дата(2020, 6, 1))
			И ПериодСобытия <= КонецДня(Дата(2020, 7, 31)) Тогда
			
			Срок = ДобавитьМесяц(Срок, 4);
			
		КонецЕсли;
		
	ИначеЕсли ОснованиеПереносаСроковОтчетовНалогов = 
		ОснованияПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвитияП1бИП() Тогда
		
		// а также исчисленных индивидуальным
		// предпринимателем за 2019 год с суммы дохода, превышающей
		// 300000 рублей, - на 4 месяца;
		Если КонецДня(ПериодСобытия) = КонецДня(Дата(2019, 12, 31)) Тогда
			Срок = ДобавитьМесяц(Срок, 4);
		КонецЕсли;
		
	ИначеЕсли ОснованиеПереносаСроковОтчетовНалогов = 
		ОснованияПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвитияП1в() Тогда
		
		// в) продлить организациям и индивидуальным предпринимателям,
		// указанным в подпункте "а" настоящего пункта и относящимся к категории
		// микропредприятий, установленные Федеральным законом
		// "Об обязательном социальном страховании от несчастных случаев на
		// производстве и профессиональных заболеваний" (далее - Федеральный
		// закон) сроки уплаты страховых взносов на обязательное социальное
		// страхование от несчастных случаев на производстве и профессиональных
		// заболеваний:
		// начисленных с выплат и иных вознаграждений в пользу физических
		// лиц за период март - май 2020 г., - на 6 месяцев;
		// начисленных с выплат и иных вознаграждений в пользу физических
		// лиц за период июнь - июль 2020 г., - на 4 месяца. 
		
		Если ПериодСобытия >= НачалоДня(Дата(2020, 3, 1))
			И ПериодСобытия <= КонецДня(Дата(2020, 5, 31)) Тогда
			
			Срок = ДобавитьМесяц(Срок, 6);
			
		ИначеЕсли ПериодСобытия >= НачалоДня(Дата(2020, 6, 1))
			И ПериодСобытия <= КонецДня(Дата(2020, 7, 31)) Тогда
			
			Срок = ДобавитьМесяц(Срок, 4);
			
		КонецЕсли;
		
		
	ИначеЕсли ОснованиеПереносаСроковОтчетовНалогов = 
		ОснованияПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвитияП3Абз1() Тогда
		
		// 3. Продлить:
		// на 3 месяца - установленный Кодексом срок представления
		// налогоплательщиками, налоговыми агентами налоговых деклараций
		// (за исключением налоговых деклараций по налогу на добавленную
		// стоимость), налоговых расчетов о суммах выплаченных иностранным
		// организациям доходов и удержанных налогов, расчетов сумм налога на
		// доходы физических лиц, исчисленных и удержанных налоговыми
		// агентами, расчетов по авансовым платежам, бухгалтерской (финансовой)
		// отчетности, срок подачи которых приходится на март - май 2020 г.;
		
		Если Срок >= НачалоДня(Дата(2020, 3, 1))
			И Срок <= КонецДня(Дата(2020, 5, 31)) Тогда
			
			Срок = ДобавитьМесяц(Срок, 3);
			
		КонецЕсли;
		
	ИначеЕсли ОснованиеПереносаСроковОтчетовНалогов = 
		ОснованияПродленияСроковНалоговОтчетов.МерыУстойчивогоРазвитияП3Абз2() Тогда
		
		// до 15 мая 2020 г. - срок представления налоговых деклараций по
		// налогу на добавленную стоимость и расчетов по страховым взносам
		// за I квартал 2020 г
		
		ДатаПервогоКвартала = Дата(2020, 1, 1);
		
		Если КонецКвартала(ПериодСобытия) = КонецКвартала(ДатаПервогоКвартала) Тогда
			
			Срок = Дата(2020, 5, 15);
			
		КонецЕсли;
		
	ИначеЕсли ОснованиеПереносаСроковОтчетовНалогов = 
		ОснованияПродленияСроковНалоговОтчетов.Постановление212ПП_П2() Тогда
		
		// Продлить срок уплаты торгового сбора за 1 квартал 2020 г. до 31 декабря 2020 г. (включительно).
		Если КонецДня(ПериодСобытия) = КонецКвартала(Дата(2020, 1, 1)) Тогда
			Срок = КонецДня(Дата(2020, 12, 31));
		КонецЕсли;
		
	ИначеЕсли ОснованиеПереносаСроковОтчетовНалогов = 
		ОснованияПродленияСроковНалоговОтчетов.РазъясненияФСС() Тогда
		
		// Срок представления 4-ФСС за 1 квартал 2020г. продлен до 15 мая 2020 г.
		
		ДатаПервогоКвартала = Дата(2020, 1, 1);
		
		Если КонецКвартала(ПериодСобытия) = КонецКвартала(ДатаПервогоКвартала) Тогда
			
			Срок = Дата(2020, 5, 15);
			
		КонецЕсли;
		
	ИначеЕсли ОснованиеПереносаСроковОтчетовНалогов = 
		ОснованияПродленияСроковНалоговОтчетов.РазъясненияМинюста() Тогда
		
		// Срок представления отчетности в Минюст за 2019 г. продлен до 1 июня 2020 г.
		
		Если КонецДня(ПериодСобытия) = КонецДня(Дата(2019, 12, 31)) Тогда
			
			Срок = Дата(2020, 6, 1);
			
		КонецЕсли;
		
	ИначеЕсли ОснованиеПереносаСроковОтчетовНалогов = 
		ОснованияПродленияСроковНалоговОтчетов.ПостановлениеПравительства470() Тогда
		
		// Срок уплаты ежемесячных авансовых платежей по налогу на прибыль, уплачиваемых до 28 марта 2022 г., продлен до 28 апреля 2022 г.
		
		Если КонецДня(Срок) = КонецДня(Дата(2022, 3, 28)) Тогда
			
			Срок = ДобавитьМесяц(Срок, 1);
			
		КонецЕсли;
		
	ИначеЕсли ОснованиеПереносаСроковОтчетовНалогов = 
		ОснованияПродленияСроковНалоговОтчетов.ПостановлениеПравительства512() Тогда
		
		Если КонецДня(ПериодСобытия) = КонецГода(Дата(2021, 1, 1)) Тогда
			// Продлить на 6 месяцев организациям и индивидуальным предпринимателям, осуществляющим отдельные виды экономической деятельности,
			// установленные Налоговым кодексом Российской Федерации сроки уплаты налога,
			// уплачиваемого в связи с применением упрощенной системы налогообложения за 2021 год
			
			// Письмо ФНС России от 31.03.2022 № СД-4-3/3868@:
			// 2. Уплата сумм налогов (авансовых платежей по налогу), указанных в пункте 1 настоящего постановления, 
			// производится равными частями в размере одной шестой подлежащей уплате суммы указанных налогов (авансовых платежей по налогу) ежемесячно, 
			// не позднее последнего числа месяца, начиная с месяца, следующего за месяцем, в котором наступает срок уплаты соответствующих налогов (авансовых платежей по налогу), 
			// продленный на основании пункта 1 настоящего постановления.
			Срок = КонецМесяца(ДобавитьМесяц(Срок, 7));
			
		ИначеЕсли КонецДня(ПериодСобытия) = КонецКвартала(Дата(2022, 1, 1)) Тогда
			// авансового платежа по налогу, уплачиваемому в связи с применением упрощенной системы налогообложения за I квартал 2022 г.
			
			// Письмо ФНС России от 31.03.2022 № СД-4-3/3868@:
			// 2. Уплата сумм налогов (авансовых платежей по налогу), указанных в пункте 1 настоящего постановления, 
			// производится равными частями в размере одной шестой подлежащей уплате суммы указанных налогов (авансовых платежей по налогу) ежемесячно, 
			// не позднее последнего числа месяца, начиная с месяца, следующего за месяцем, в котором наступает срок уплаты соответствующих налогов (авансовых платежей по налогу), 
			// продленный на основании пункта 1 настоящего постановления.
			Срок = КонецМесяца(ДобавитьМесяц(Срок, 7));
		КонецЕсли;
		
	ИначеЕсли ОснованиеПереносаСроковОтчетовНалогов = 
		ОснованияПродленияСроковНалоговОтчетов.ПостановлениеПравительства776П1() Тогда
		
		Если ПериодСобытия >= НачалоДня(Дата(2022, 4, 1))
			И ПериодСобытия <= КонецДня(Дата(2022, 6, 30)) Тогда
			// 1. Продлить на 12 месяцев организациям и индивидуальным
			// предпринимателям, осуществляющим отдельные виды экономической
			// деятельности по перечню согласно приложению № 1, установленные
			// Налоговым кодексом Российской Федерации сроки уплаты страховых
			// взносов, исчисленных с выплат и иных вознаграждений в пользу
			// физических лиц за апрель - июнь 2022 г.,
			
			Срок = ДобавитьМесяц(Срок, 12);
			
			// Постановление Правительства №28 от 17.01.2023 вносит изменения в постановление №776:
			// г) дополнить пунктом 2(1) следующего содержания:
			// 2(1). Уплата сумм страховых взносов, сроки уплаты которых продлены в соответствии с пунктами 1 
			// (за исключением сумм страховых взносов, исчисленных индивидуальными предпринимателями за 2021 год с суммы дохода, превышающей 300000 рублей) и 2 настоящего постановления, 
			// осуществляется не позднее 28-го числа месяца, на который перенесен срок их уплаты
			ГодУплаты = Год(Срок);
			МесяцУплаты = Месяц(Срок);
			Срок = Дата(ГодУплаты, МесяцУплаты, 28);
			
		ИначеЕсли КонецДня(ПериодСобытия) = КонецГода(Дата(2021, 1, 1)) 
			И КонецДня(Срок) = КонецДня(Дата(2022, 7, 1)) Тогда
			// а также исчисленных индивидуальными предпринимателями за 2021 год с суммы дохода,
			// превышающей 300000 рублей.
			Срок = ДобавитьМесяц(Срок, 12);
			
		КонецЕсли;
		
	ИначеЕсли ОснованиеПереносаСроковОтчетовНалогов = 
		ОснованияПродленияСроковНалоговОтчетов.ПостановлениеПравительства776П2() Тогда
		
		Если ПериодСобытия >= НачалоДня(Дата(2022, 7, 1))
			И ПериодСобытия <= КонецДня(Дата(2022, 9, 30)) Тогда
			
			// 2. Продлить на 12 месяцев организациям и индивидуальным
			// предпринимателям, осуществляющим отдельные виды экономической
			// деятельности по перечню согласно приложению № 2, установленные
			// Налоговым кодексом Российской Федерации сроки уплаты страховых
			// взносов, исчисленных с выплат и иных вознаграждений в пользу
			// физических лиц за июль - сентябрь 2022 г.
			Срок = ДобавитьМесяц(Срок, 12);
			
			// Постановление Правительства №28 от 17.01.2023 вносит изменения в постановление №776:
			// г) дополнить пунктом 2(1) следующего содержания:
			// 2(1). Уплата сумм страховых взносов, сроки уплаты которых продлены в соответствии с пунктами 1 
			// (за исключением сумм страховых взносов, исчисленных индивидуальными предпринимателями за 2021 год с суммы дохода, превышающей 300000 рублей) и 2 настоящего постановления, 
			// осуществляется не позднее 28-го числа месяца, на который перенесен срок их уплаты
			ГодУплаты = Год(Срок);
			МесяцУплаты = Месяц(Срок);
			Срок = Дата(ГодУплаты, МесяцУплаты, 28);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЗаписьРасписанияРегулярныеПлатежи(ЗаписьРасписания, Правило, ПериодВыполнения)

	ЗаполнитьЗначенияСвойств(ЗаписьРасписания, Правило);
	
	ЗаписьРасписания.Срок                   = Справочники.ПравилаРегулярныхПлатежей.ДатаПлатежаВПериоде(Правило, ПериодВыполнения);
	ЗаписьРасписания.ПериодСобытия          = ПериодВыполнения;
	ЗаписьРасписания.ПеренестиНаРабочийДень = -1;
	ЗаписьРасписания.Действие               = Перечисления.ВидыДействийКалендаряБухгалтера.РегулярныйПлатеж;
	
	ЗначенияЗаполнения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Правило.АктивныйШаблон, "СуммаДокумента, Контрагент.Наименование");
	ЗаписьРасписания.Наименование = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
		НСтр("ru ='Оплата [СуммаДокумента] руб [КонтрагентНаименование]'"), 
		ЗначенияЗаполнения);
	
	ЗаписьРасписания.НаименованиеСокращенное = СтрШаблон("%1 - %2",
		Формат(ЗначенияЗаполнения.СуммаДокумента, "ЧДЦ="),
		СокрЛП(ЗначенияЗаполнения.КонтрагентНаименование));
	
КонецПроцедуры

Процедура ЗаполнитьЗаписьРасписанияФинОтчетность(ЗаписьРасписания, Правило, ПериодВыполнения, ПредставлениеПериода, Срок, ПереносСрока)
	
	ЗаполнитьЗначенияСвойств(ЗаписьРасписания, Правило);
	
	ЗаписьРасписания.Срок                   = Срок;
	ЗаписьРасписания.ПериодСобытия          = ПериодВыполнения;
	ЗаписьРасписания.ПеренестиНаРабочийДень = ПереносСрока;
	ЗаписьРасписания.Действие               = Перечисления.ВидыДействийКалендаряБухгалтера.ФинОтчетность;
	
	ЗаписьРасписания.Наименование = СтрШаблон(НСтр("ru = '1С:ФинОтчетность для %1 за %2'"), Правило.Получатель, ПредставлениеПериода);
	ЗаписьРасписания.НаименованиеСокращенное = НСтр("ru = '1С:ФинОтчетность'");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли