
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УчетнаяПолитика(Команда)
	
	ОткрытьФормуСОжиданием("РегистрСведений.УчетнаяПолитика.ФормаЗаписи", ПараметрыФормыУчетнаяПолитика());
	
КонецПроцедуры

&НаКлиенте
Процедура ПланСчетов(Команда)
	
	ОткрытьФормуСОжиданием("ПланСчетов.Хозрасчетный.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуСОжиданием(ИмяФормы, ПараметрыФормы = Неопределено)
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием();
	ПараметрыОткрытия.ИмяФормы = ИмяФормы;

	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыФормы);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыФормыУчетнаяПолитика()
	
	Возврат РегистрыСведений.УчетнаяПолитика.ПараметрыОткрытияФормыДляКомандыУчетнаяПолитика();
	
КонецФункции

#КонецОбласти