
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЭтаФорма.Параметры.Отбор.Свойство("Владелец") Тогда
		ОбщегоНазначения.СообщитьПользователю("Форма доступна только из формы элемента справочника ""Номенклатура"""
											  + " и при использовании функциональности ""Упаковки номенклатуры""");
		Отказ = Истина;
	Иначе
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтаФорма.Параметры.Отбор.Владелец.ВидНоменклатуры, "Услуга") Тогда
			ОбщегоНазначения.СообщитьПользователю("Для номенклатуры с видом ""услуги"" упаковки не используются");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
