#Область ОписаниеПеременных

&НаКлиенте
Перем ОткрытыеФормы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.РегистрацияОплатыОсновныхСредствДляИП.Видимость = ПолучитьФункциональнуюОпцию("ИспользуетсяНДФЛИП");
	Элементы.РегистрацияОплатыОсновныхСредствДляУСН.Видимость = ПолучитьФункциональнуюОпцию("ИспользуетсяУСН");
	
	МобильныйКлиентАдаптацияФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоступлениеОсновныхСредств(Команда)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ОсновныеСредства");
	ЗаголовокФормы = НСтр("ru = 'Поступление основных средств'");
	ОткрытьПоступлениеТоваровУслугПоВиду(ВидОперации, ЗаголовокФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриобретениеЗемельныхУчастков(Команда)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ПриобретениеЗемельныхУчастков");
	ЗаголовокФормы = НСтр("ru = 'Приобретение земельных участков'");
	ОткрытьПоступлениеТоваровУслугПоВиду(ВидОперации, ЗаголовокФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПринятиеКУчетуОС(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПринятиеКУчетуОС.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура МодернизацияОС(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.МодернизацияОС.ФормаСписка", ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеРемонтаОС(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ЗавершениеРемонтаОС.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеОборудования(Команда)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Оборудование");
	ЗаголовокФормы = НСтр("ru = 'Поступление оборудования'");
	ОткрытьПоступлениеТоваровУслугПоВиду(ВидОперации, ЗаголовокФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеОбъектовСтроительства(Команда)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ОбъектыСтроительства");
	ЗаголовокФормы = НСтр("ru = 'Поступление объектов строительства'");
	ОткрытьПоступлениеТоваровУслугПоВиду(ВидОперации, ЗаголовокФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередачаОборудованияВМонтаж(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПередачаОборудованияВМонтаж.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияОплатыОсновныхСредствДляУСН(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.РегистрацияОплатыОсновныхСредствДляУСН.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияОплатыОсновныхСредствДляИП(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.РегистрацияОплатыОсновныхСредствДляИП.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеДопРасходов(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПоступлениеДопРасходов.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеВАренду(Команда)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВАренду.ПоступлениеВАренду");
	ЗаголовокФормы = НСтр("ru = 'Поступление в аренду'");
	ОткрытьПоступлениеВАрендуПоВиду(ВидОперации, ЗаголовокФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеВЛизинг(Команда)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВАренду.ПоступлениеВЛизинг");
	ЗаголовокФормы = НСтр("ru = 'Поступление в лизинг'");
	ОткрытьПоступлениеВАрендуПоВиду(ВидОперации, ЗаголовокФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Заявки1СЛизингОСиНМА(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("СервисОбменаСБанками", ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ЗаявкиНаЛизинг"));
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Заявки 1С:Лизинг'"));

	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("РегистрСведений.СостояниеЗаявокНаКредит.ФормаСписка",
		ЭтотОбъект, ПараметрыФормы, , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеНМА(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПоступлениеНМА.ФормаСписка", ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПринятиеКУчетуНМА(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПринятиеКУчетуНМА.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриобретениеПрав(Команда)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Права");
	ЗаголовокФормы = НСтр("ru = 'Приобретение прав'");
	ОткрытьПоступлениеТоваровУслугПоВиду(ВидОперации, ЗаголовокФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоСтадииРазработокНМА(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.НачалоСтадииРазработокНМА.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьПоступлениеТоваровУслугПоВиду(ВидОперации, ЗаголовокФормы)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидОперации", ВидОперации);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", ЗаголовокФормы);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("НеИзменятьОтборПоВидуОперации", Истина);
	
	КлючУникальности = Строка(ВидОперации);
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПоступлениеТоваровУслуг.ФормаСписка",
		ЭтотОбъект, ПараметрыФормы, КлючУникальности, ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПоступлениеВАрендуПоВиду(ВидОперации, ЗаголовокФормы)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидОперации", ВидОперации);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", ЗаголовокФормы);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	КлючУникальности = Строка(ВидОперации);
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПоступлениеВАренду.ФормаСписка",
		ЭтотОбъект, ПараметрыФормы, КлючУникальности, ОткрытыеФормы);
	
КонецПроцедуры

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаОсновныеСредства, "ПоступлениеОсновныхСредств,ПриобретениеЗемельныхУчастков");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаОборудованиеИОбъектыСтроительства, "ПоступлениеОборудования,ПоступлениеОбъектовСтроительства");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаОплатыРасходы, "ПоступлениеДопРасходов");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаАрендаЛизинг);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаНематериальныеАктивы, "ПриобретениеПрав");
	
КонецПроцедуры

#КонецОбласти
#КонецОбласти