#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоказатьНастройкиКакВПолномИнтерфейсе = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказатьНастройкиКакВПолномИнтерфейсеПриИзменении(Элемент)
	
	Если Не ПоказатьНастройкиКакВПолномИнтерфейсе Тогда
		Закрыть();
		ОткрытьФорму("Обработка.ПанелиПростойИнтерфейс.Форма.ПанельНастройки", , , , Окно);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти