
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Организация = Параметры.Организация;
	СоздатьНовоеЗаявление = Параметры.СоздатьНовоеЗаявление;
	ВидЗаявления = Параметры.ВидЗаявления;
	Патент = Параметры.Патент;
	
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Оповестить("ПолучениеПатента_ОткрытВыборВидаЗаявления", , ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ПродлениеПатента = ВыбраноПродлениеПатента(ВидЗаявления);
	ВнесениеИзмененийВПатент = ВыбраноВнесениеИзмененийВПатент(ВидЗаявления);
	
	Если Не ПродлениеПатента И Не ВнесениеИзмененийВПатент Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Патент");
	КонецЕсли;
	
	Если ВнесениеИзмененийВПатент И ЗначениеЗаполнено(Патент) Тогда
		Если Не УчетПСН.ДоступноВнесениеИзмененийВПатент(Патент) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Патент недействителен - внесение изменений недоступно'"),
				Патент, "Патент", , Отказ);
		КонецЕсли;
		
		ЗаявлениеНаПолучениеПатента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Патент, "ЗаявлениеНаПолучениеПатента");
		Если Не ЗначениеЗаполнено(ЗаявлениеНаПолучениеПатента) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Внесение изменений недоступно. Выберите заявление, по которому выдан патент.'"),
				Патент, "Патент", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если Источник = ЭтотОбъект Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПолучениеПатента_ОткрытПомощник" Тогда
		Закрыть();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидЗаявленияВнесениеИзмененийПриИзменении(Элемент)

	ВидЗаявленияПриИзменении();

КонецПроцедуры

&НаКлиенте
Процедура ВидЗаявленияПродлениеПатентаПриИзменении(Элемент)

	ВидЗаявленияПриИзменении();

КонецПроцедуры

&НаКлиенте
Процедура ВидЗаявленияПолучениеПатентаПриИзменении(Элемент)

	ВидЗаявленияПриИзменении();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаДалее(Команда)

	ПерейтиВПомощникПодготовкиЗаявления();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	ПродлениеПатента = ВыбраноПродлениеПатента(Форма.ВидЗаявления);
	ВнесениеИзмененийВПатент = ВыбраноВнесениеИзмененийВПатент(Форма.ВидЗаявления);
	
	Элементы.ПатентПродление.Видимость = ПродлениеПатента;
	Элементы.ПатентПродление.Доступность = ПродлениеПатента И ЗначениеЗаполнено(Форма.Организация);
	
	Элементы.ПатентВнесениеИзменений.Видимость = ВнесениеИзмененийВПатент;
	Элементы.ПатентВнесениеИзменений.Доступность = ВнесениеИзмененийВПатент И ЗначениеЗаполнено(Форма.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗаявленияПриИзменении()
	
	Патент = Неопределено;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВПомощникПодготовкиЗаявления()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПомощника = Новый Структура;
	ПараметрыПомощника.Вставить("Организация", Организация);
	ПараметрыПомощника.Вставить("ВызовИзПомощника", Истина);
	
	ИмяФормыПомощника = "Обработка.ПомощникЗаполненияЗаявленияНаПолучениеПатента.Форма";
	
	Если ВыбраноПолучениеНовогоПатента(ВидЗаявления) Тогда
		ПараметрыПомощника.Вставить("СоздатьНовоеЗаявление", Истина);
	ИначеЕсли ВыбраноПродлениеПатента(ВидЗаявления) Тогда
		ПараметрыПродления = ОписаниеПродленияПатента(Патент);
		
		ПараметрыПомощника.Вставить("Патент", Патент);
		ПараметрыПомощника.Вставить("ПериодСобытия", ПараметрыПродления.ПериодСобытия);
		ПараметрыПомощника.Вставить("Правило", ПараметрыПродления.Правило);
		ПараметрыПомощника.Вставить("РегистрацияВНалоговомОргане", ПараметрыПродления.РегистрацияВНалоговомОргане);
		ПараметрыПомощника.Вставить("СоздатьНовоеЗаявление", Истина);
	ИначеЕсли ВыбраноВнесениеИзмененийВПатент(ВидЗаявления) Тогда
		ПараметрыПомощника.Вставить("Патент", Патент);
		ИмяФормыПомощника = "Обработка.ПомощникЗаполненияЗаявленияНаПолучениеПатента.Форма.ВнесениеИзмененийВПатент";
	КонецЕсли;
	
	ОткрытьФорму(ИмяФормыПомощника, ПараметрыПомощника);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОписаниеПродленияПатента(Патент)
	
	РеквизитыПатента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Патент, "ДатаОкончания, Патент, НалоговыйОрган");
	
	ПараметрыПродления = Новый Структура;
	ПараметрыПродления.Вставить("ПериодСобытия", РеквизитыПатента.ДатаОкончания);
	ПараметрыПродления.Вставить("Правило", РеквизитыПатента.Патент);
	ПараметрыПродления.Вставить("РегистрацияВНалоговомОргане", РеквизитыПатента.НалоговыйОрган);
	
	Возврат ПараметрыПродления;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВыбраноПолучениеНовогоПатента(ВидЗаявления)
	
	Возврат ВидЗаявления = 0;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВыбраноПродлениеПатента(ВидЗаявления)
	
	Возврат ВидЗаявления = 1;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВыбраноВнесениеИзмененийВПатент(ВидЗаявления)
	
	Возврат ВидЗаявления = 2;
	
КонецФункции

#КонецОбласти
