#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытияФормыРеквизитовСчетаФактурыЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Новый Структура("ПредъявленСФ,
	|ДатаСФ, НомерСФ, Исправление, КодВидаОперации, Продавец, ДоговорКонтрагента,
	|НомерИсправления, ДатаИсправления, КорректировочныйСчетФактура,Продавец,
	|НомерИсходногоДокумента, ДатаИсходногоДокумента,
	|УчитыватьИсправлениеИсходногоДокумента, НомерИсправленияИсходногоДокумента,
	|ДатаИсправленияИсходногоДокумента, ПродавецДоступен, РеквизитыСчетаФактуры, РеквизитыСчетаФактурыЗаполнены");
	
	ЗаполнитьЗначенияСвойств(ДанныеСтроки, РезультатЗакрытия);
	
	ДанныеСтроки.КорректировочныйСчетФактура = Не РезультатЗакрытия.СтандартныйСчетФактура;
	ЗаполнитьРеквизитыСчетаФактуры(ДанныеСтроки);
	
	ТекущиеДанные = Объект.НДСУчтенныйВСтоимости.НайтиПоИдентификатору(Элементы.НДСУчтенныйВСтоимости.ТекущаяСтрока);
	СтрокиПоПартии = Объект.НДСУчтенныйВСтоимости.НайтиСтроки(Новый Структура("Партия",ТекущиеДанные.Партия));
	
	Для Каждого СтрокаПоПартии Из СтрокиПоПартии Цикл
		
		ЗаполнитьЗначенияСвойств(СтрокаПоПартии, ДанныеСтроки);
		
	КонецЦикла;
	
	
		Модифицированность = Истина;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;

	УстановитьУсловноеОформление();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	ОбщегоНазначенияБПКлиент.ОбработкаОповещенияФормыДокумента(ЭтаФорма, Объект.Ссылка, ИмяСобытия, Параметр, Источник);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;

	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	ПодготовитьФормуНаСервере();
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПроведениеСервер.УстановитьПризнакПроверкиРеквизитов(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	ЗаполнитьДобавленныеКолонкиТаблиц();

	Документы.ВводНачальныхОстатков.УстановитьЗаголовокФормы(ЭтаФорма);
	УстановитьСостояниеДокумента();
	УправлениеФормой();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	Оповестить("ОбновитьФормуПомощникаВводаОстатков", Объект.Организация, "ВводНачальныхОстатков");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	ОрганизацияПриИзмененииСервер();

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)

	Если НачалоДня(Объект.Дата) = НачалоДня(ТекущаяДатаДокумента) Тогда
		// Изменение времени не влияет на поведение документа.
		ТекущаяДатаДокумента = Объект.Дата;
		Возврат;
	КонецЕсли;

	// Общие проверки условий по датам.
	ТребуетсяВызовСервера = ОбщегоНазначенияБПКлиент.ТребуетсяВызовСервераПриИзмененииДатыДокумента(Объект.Дата, 
		ТекущаяДатаДокумента);

	// Если определили, что изменение даты может повлиять на какие-либо параметры, 
	// то передаем обработку на сервер.
	Если ТребуетсяВызовСервера Тогда
		ДатаПриИзмененииСервер();
	КонецЕсли;

	// Запомним новую дату документа.
	ТекущаяДатаДокумента = Объект.Дата;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНДСУчтенныйВСтоимости

&НаКлиенте
Процедура НДСУчтенныйВСтоимостиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.ВидУчетаНДС", ВидУчетаНДС);
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ПараметрВыбора);
	Элементы.НДСУчтенныйВСтоимостиВидЦенности.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекущиеДанные = Элементы.НДСУчтенныйВСтоимости.ТекущиеДанные;
		ТекущиеДанные.РеквизитыСчетаФактуры = ТекстВвестиРеквизиты;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НДСУчтенныйВСтоимостиПартияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ПартияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Элементы.НДСУчтенныйВСтоимости.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура НДСУчтенныйВСтоимостиКонтрагентПриИзменении(Элемент)

	КонтрагентПриИзменении(Элемент, Элементы.НДСУчтенныйВСтоимости.ТекущиеДанные, "НДСУчтенныйВСтоимости");

КонецПроцедуры

&НаКлиенте
Процедура НДСУчтенныйВСтоимостиКонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	КонтрагентОбработкаВыбора(Элемент, Элементы.НДСУчтенныйВСтоимости.ТекущиеДанные, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура НДСУчтенныйВСтоимостиДоговорКонтрагентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ДоговорКонтрагентаОбработкаВыбора(Элемент, Элементы.НДСУчтенныйВСтоимости.ТекущиеДанные, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура НДСУчтенныйВСтоимостиСуммаБезНДСПриИзменении(Элемент)

	ПересчитатьНДСПриИзмененииБазы("НДСУчтенныйВСтоимости");

КонецПроцедуры

&НаКлиенте
Процедура НДСУчтенныйВСтоимостиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "НДСУчтенныйВСтоимостиРеквизитыСчетаФактуры" Тогда
		ОткрытьФормуРеквизитовСчетаФактуры(ВыбраннаяСтрока);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура НДСУчтенныйВСтоимостиСчетУчетаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НДСУчтенныйВСтоимости.ТекущиеДанные;

	Если ТекущиеДанные.СчетУчета = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.НДСпоАвансамИПредоплатамВыданным") Тогда

		ТекущиеДанные.ВидЦенности = ПредопределенноеЗначение("Перечисление.ВидыЦенностей.АвансыВыданные");
		
	ИначеЕсли ТекущиеДанные.СчетУчета = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.НДСпоАвансамИПредоплатам") Тогда
		
		ТекущиеДанные.ВидЦенности = ПредопределенноеЗначение("Перечисление.ВидыЦенностей.АвансыПолученные");
		
	ИначеЕсли ТекущиеДанные.СчетУчета = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.НДСуплачиваемыйТаможеннымОрганам") Тогда
		
		ТекущиеДанные.ВидЦенности = ПредопределенноеЗначение("Перечисление.ВидыЦенностей.ТаможенныеПлатежи");
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НДСУчтенныйВСтоимостиСтавкаНДСПриИзменении(Элемент)
	
	ПересчитатьНДСПриИзмененииСтавки(Элементы.НДСУчтенныйВСтоимости.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура НДСУчтенныйВСтоимостиРеквизитыСчетаФактурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ВыбраннаяСтрока = Элементы.НДСУчтенныйВСтоимости.ТекущаяСтрока;
	ОткрытьФормуРеквизитовСчетаФактуры(ВыбраннаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	// НДСУчтенныйВСтоимостиНДС

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НДСУчтенныйВСтоимостиНДС");

	ГруппаОтбора1 = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(ЭлементУО.Отбор.Элементы, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);

		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора1,
			"Объект.НДСУчтенныйВСтоимости.СтавкаНДС", ВидСравненияКомпоновкиДанных.Равно, Перечисления.СтавкиНДС.НДС0);

		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора1,
			"Объект.НДСУчтенныйВСтоимости.СтавкаНДС", ВидСравненияКомпоновкиДанных.Равно, Перечисления.СтавкиНДС.БезНДС);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	// НДСУчтенныйВСтоимостиРеквизитыСчетаФактуры

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НДСУчтенныйВСтоимостиРеквизитыСчетаФактуры");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.НДСУчтенныйВСтоимости.РеквизитыСчетаФактурыЗаполнены", ВидСравненияКомпоновкиДанных.Равно, Ложь);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НезаполненныйРеквизит);

	// НДСУчтенныйВСтоимостиСчетУчета

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НДСУчтенныйВСтоимостиСчетУчета");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.РазделУчета", ВидСравненияКомпоновкиДанных.Равно, Перечисления.РазделыУчетаДляВводаОстатков.НДСНачисленный);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	// НДСУчтенныйВСтоимостиВидЦенности

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НДСУчтенныйВСтоимостиВидЦенности");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.РазделУчета", ВидСравненияКомпоновкиДанных.Равно, Перечисления.РазделыУчетаДляВводаОстатков.НДСПоАвансамПолученным);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ТекущаяДатаДокумента = Объект.Дата;
	
	ТекстВвестиРеквизиты = НСтр("ru = '<Ввести реквизиты>'");

	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();

	// Ограничение выбора счета учета  

	МассивСчетов = Обработки.ПодготовкаКВычетуНДСУчтенногоВСтоимости.СписокСчетовПоиска();

	УсловияОтбораСубсчетов = БухгалтерскийУчет.НовыеУсловияОтбораСубсчетов();
	УсловияОтбораСубсчетов.ИспользоватьВПроводках = Истина;
	СчетаНДС = БухгалтерскийУчет.СформироватьМассивСубсчетовПоОтбору(МассивСчетов, УсловияОтбораСубсчетов);
	БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораСчета(Элементы.НДСУчтенныйВСтоимостиСчетУчета, СчетаНДС); 
	
	// Ограничение выбора счета учета НДС  

	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.НДСпоПриобретеннымЦенностям);
	
	УсловияОтбораСубсчетов = БухгалтерскийУчет.НовыеУсловияОтбораСубсчетов();
	УсловияОтбораСубсчетов.ИспользоватьВПроводках = Истина;
	СчетаНДС = БухгалтерскийУчет.СформироватьМассивСубсчетовПоОтбору(МассивСчетов, УсловияОтбораСубсчетов);
	БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораСчета(Элементы.НДСУчтенныйВСтоимостиСчетУчетаНДС, СчетаНДС);


	// Массив числовых колонок, которые подлежат пересчету при измении ставки НДС
	ЧисловыеКолонки = Новый Структура();
	КолонкиТабличнойЧасти = Метаданные.Документы.ВводНачальныхОстатков.ТабличныеЧасти.НДСУчтенныйВСтоимости.Реквизиты;

	Для Каждого Колонка ИЗ КолонкиТабличнойЧасти Цикл
		Если СтрНайти(Колонка.Имя,"СуммаБезНДС") Тогда
			ЧисловыеКолонки.Вставить(Колонка.Имя);
			ЧисловыеКолонки.Вставить(СтрЗаменить(Колонка.Имя,"СуммаБезНДС","НДС"));
		КонецЕсли;
	КонецЦикла;

	ПрочитатьПараметрыУчетнойПолитики();
	Документы.ВводНачальныхОстатков.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);
	
	Элементы.ПодразделениеОрганизации.Видимость = БухгалтерскийУчетПереопределяемый.ВестиУчетПоПодразделениям();

	Если ТипЗнч(Параметры) = Тип("ДанныеФормыСтруктура") Тогда
		Параметры.Свойство("ОткрытиеИзОбработкиВводаНачальныхОстатков", ОткрытиеИзОбработкиВводаНачальныхОстатков);
	КонецЕсли;
	
	Если Объект.РазделУчета = Перечисления.РазделыУчетаДляВводаОстатков.НДСНачисленный Тогда
		ВидУчетаНДС = "НДСНачисленный";
	ИначеЕсли Объект.РазделУчета = Перечисления.РазделыУчетаДляВводаОстатков.НДСПоПриобретеннымЦенностям Тогда
		ВидУчетаНДС = "НДСПолученный";
	Иначе
		ВидУчетаНДС = "НДСАвансы";
	КонецЕсли;
	
	ЗаполнитьДобавленныеКолонкиТаблиц();

	Документы.ВводНачальныхОстатков.УстановитьЗаголовокФормы(ЭтаФорма);
	УстановитьСостояниеДокумента();
	УправлениеФормой();

КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц()

	Для каждого СтрокаТаблицы Из Объект.НДСУчтенныйВСтоимости Цикл
	
		ЗаполнитьРеквизитыСчетаФактуры(СтрокаТаблицы);
		
	КонецЦикла;

КонецПроцедуры 

&НаСервере
Процедура ПрочитатьПараметрыУчетнойПолитики()

	ДатаУчетнойПолитики = Объект.Дата + 86400;

	РаздельныйУчетНДС = УчетнаяПолитика.РаздельныйУчетНДС(Объект.Организация, ДатаУчетнойПолитики);
	РаздельныйУчетНДСНаСчете19 = УчетнаяПолитика.РаздельныйУчетНДСНаСчете19(Объект.Организация, ДатаУчетнойПолитики);

КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()

	// Установка режима "Только просмотр" для поля "Дата"
	Элементы.Дата.ТолькоПросмотр =
		ЗначениеЗаполнено(Документы.ВводНачальныхОстатков.ПолучитьДатуВводаОстатков(Объект.Организация))
		И Объект.ОтражатьВБухгалтерскомУчете
		И объект.ОтражатьВНалоговомУчете
		И Объект.ОтражатьПоСпециальнымРегистрам;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		ЭтаФорма.Элементы,
		"ФормаОткрытьФормуНастройкиРежима",
		"Видимость",
		НЕ ОткрытиеИзОбработкиВводаНачальныхОстатков);

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьНДСПриИзмененииБазы(ИмяТаблицыИсточника)

	СтрокаТаблицы 	   = Элементы[ИмяТаблицыИсточника].ТекущиеДанные;
	ИзменяемаяКолонка  = Элементы[ИмяТаблицыИсточника].ТекущийЭлемент.Имя;

	КолонкаСуммыБезНДС = СтрЗаменить(ИзменяемаяКолонка, ИмяТаблицыИсточника, "");

	ПересчитатьНДС(ИзменяемаяКолонка, КолонкаСуммыБезНДС, СтрокаТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьНДСПриИзмененииСтавки(СтрокаТаблицы)

	Для Каждого Колонка Из ЧисловыеКолонки Цикл
		ПересчитатьНДС(Колонка.Ключ, Колонка.Ключ, СтрокаТаблицы);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьНДС(ИзменяемаяКолонка, КолонкаСуммыБезНДС, СтрокаТаблицы)
	
	Если СтрНайти(ИзменяемаяКолонка,"СуммаБезНДС")>0 Тогда
		КолонкаНДС = СтрЗаменить(КолонкаСуммыБезНДС,"СуммаБезНДС","НДС");
		СтавкаНДС  = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС);
		СуммаНДС   = УчетНДСКлиентСервер.РассчитатьСуммуНДС(СтрокаТаблицы[КолонкаСуммыБезНДС], Ложь, СтавкаНДС);
		СтрокаТаблицы[КолонкаНДС] = СуммаНДС;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент, СтрокаТаблицы, ИмяТаблицыИсточника)

	ПараметрыСтроки = ПоляСтрокиТабличнойЧасти(ИмяТаблицыИсточника);
	ПараметрыОбъекта = Новый Структура("ВалютаРегламентированногоУчета, РазделУчета, Организация, Дата",
	ВалютаРегламентированногоУчета, Объект.РазделУчета, Объект.Организация, Объект.Дата);

	ПриИзмененииКонтрагентаСервер(ПараметрыСтроки, ПараметрыОбъекта);

	ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ПараметрыСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОбработкаВыбора(Элемент, СтрокаТаблицы, ВыбранноеЗначение)

	Если НЕ ВыбранноеЗначение = СтрокаТаблицы.Контрагент Тогда
		СтрокаТаблицы.Партия	= Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаОбработкаВыбора(Элемент, СтрокаТаблицы, ВыбранноеЗначение)
	
	Если НЕ ВыбранноеЗначение = СтрокаТаблицы.ДоговорКонтрагента Тогда
		СтрокаТаблицы.Партия	= Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПоляСтрокиТабличнойЧасти(ИмяТаблицыИсточника)

	СтрокаТаблицы = Элементы[ИмяТаблицыИсточника].ТекущиеДанные;

	ПараметрыСтроки = Новый Структура("Контрагент, ДоговорКонтрагента");
	ЗаполнитьЗначенияСвойств(ПараметрыСтроки, СтрокаТаблицы);

	Возврат ПараметрыСтроки;

КонецФункции

&НаСервереБезКонтекста
Процедура ПриИзмененииКонтрагентаСервер(ПараметрыСтроки, Знач ПараметрыДокумента)

	МассивВидовДоговоров = Новый Массив;
	МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	
	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ПараметрыСтроки.ДоговорКонтрагента,
		ПараметрыСтроки.Контрагент, ПараметрыДокумента.Организация, МассивВидовДоговоров);

КонецПроцедуры

&НаКлиенте
Процедура ПартияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, СтрокаТаблицы)

	СтандартнаяОбработка = Ложь;

	ПараметрыОбъекта = Новый Структура;
	ПараметрыОбъекта.Вставить("КонецПериода"         , КонецДня(Объект.Дата));
	ПараметрыОбъекта.Вставить("НачалоПериода"        , '00010101');
	ПараметрыОбъекта.Вставить("Организация"          , Объект.Организация);
	ПараметрыОбъекта.Вставить("Контрагент"           , СтрокаТаблицы.Контрагент);
	ПараметрыОбъекта.Вставить("ДоговорКонтрагента"   , СтрокаТаблицы.ДоговорКонтрагента);
	ПараметрыОбъекта.Вставить("ОстаткиОбороты"       , "Дт");
	ПараметрыОбъекта.Вставить("ТипыДокументов"       , "Метаданные.Документы.ВводНачальныхОстатков.ТабличныеЧасти.НДСУчтенныйВСтоимости.Реквизиты.Партия.Тип");
	ПараметрыОбъекта.Вставить("РежимОтбораДокументов", ПредопределенноеЗначение("Перечисление.РежимОтбораДокументов.ПоРеквизитам"));

	ПараметрыФормы = Новый Структура("ПараметрыОбъекта", ПараметрыОбъекта);
	ОткрытьФорму("Документ.ДокументРасчетовСКонтрагентом.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииСервер()

	ДатаВводаОстатков = Документы.ВводНачальныхОстатков.ПолучитьДатуВводаОстатков(Объект.Организация);
	Если ЗначениеЗаполнено(ДатаВводаОстатков) Тогда

		Объект.Дата = ДатаВводаОстатков;

	КонецЕсли;

	ДатаПриИзмененииСервер();

КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииСервер()

	ПрочитатьПараметрыУчетнойПолитики();
	Документы.ВводНачальныхОстатков.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);
	УправлениеФормой();

КонецПроцедуры

&НаКлиенте 
Процедура ОткрытьФормуРеквизитовСчетаФактуры(ВыбранноеЗначение)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДанныеСтроки = Объект.НДСУчтенныйВСтоимости.НайтиПоИдентификатору(ВыбранноеЗначение);

	ЗначенияЗаполнения = Новый Структура();
	
	ЗначенияЗаполнения.Вставить("ДатаДокумента",       Объект.Дата);
	ЗначенияЗаполнения.Вставить("ПредъявленСФ",        ДанныеСтроки.ПредъявленСФ);
	ЗначенияЗаполнения.Вставить("ДатаСФ",              ДанныеСтроки.ДатаСФ);
	ЗначенияЗаполнения.Вставить("НомерСФ",             ДанныеСтроки.НомерСФ);
	ЗначенияЗаполнения.Вставить("СчетФактураДокумент", ДанныеСтроки.СчетФактураДокумент);
	ЗначенияЗаполнения.Вставить("Исправление",         ДанныеСтроки.Исправление);
	ЗначенияЗаполнения.Вставить("НомерИсправления",    ДанныеСтроки.НомерИсправления);
	ЗначенияЗаполнения.Вставить("ДатаИсправления",     ДанныеСтроки.ДатаИсправления);
	ЗначенияЗаполнения.Вставить("КодВидаОперации",     ДанныеСтроки.КодВидаОперации);
	ЗначенияЗаполнения.Вставить("РазделУчета",         Объект.РазделУчета);
	ЗначенияЗаполнения.Вставить("КорректировочныйСчетФактура",            ДанныеСтроки.КорректировочныйСчетФактура);
	ЗначенияЗаполнения.Вставить("НомерИсходногоДокумента",                ДанныеСтроки.НомерИсходногоДокумента);
	ЗначенияЗаполнения.Вставить("ДатаИсходногоДокумента",                 ДанныеСтроки.ДатаИсходногоДокумента);
	ЗначенияЗаполнения.Вставить("УчитыватьИсправлениеИсходногоДокумента", ДанныеСтроки.УчитыватьИсправлениеИсходногоДокумента);
	ЗначенияЗаполнения.Вставить("НомерИсправленияИсходногоДокумента",     ДанныеСтроки.НомерИсправленияИсходногоДокумента);
	ЗначенияЗаполнения.Вставить("ДатаИсправленияИсходногоДокумента",      ДанныеСтроки.ДатаИсправленияИсходногоДокумента);
	ЗначенияЗаполнения.Вставить("ПродавецДоступен",                       Ложь);
	ЗначенияЗаполнения.Вставить("СчетУчета",                              ДанныеСтроки.СчетУчета);
	ЗначенияЗаполнения.Вставить("НомерСтрокиДокумента",                   ДанныеСтроки.НомерСтроки);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ТолькоПросмотр",     ТолькоПросмотр);
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОповещениеФормы = Новый ОписаниеОповещения("ОбработчикЗакрытияФормыРеквизитовСчетаФактурыЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Документ.ВводНачальныхОстатков.Форма.ФормаРеквизитыСчетаФактуры",
		ПараметрыФормы, ЭтаФорма,,,, ОповещениеФормы,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыСчетаФактуры(ДанныеСтроки)

	РеквизитыСчетаФактурыТекст = ТекстВвестиРеквизиты;
		
	Если ДанныеСтроки.ПредъявленСФ 
		ИЛИ ЗначениеЗаполнено(ДанныеСтроки.НомерСФ) Тогда
		
		//полученный СФ
		РеквизитыСчетаФактурыДляПредставления = Новый Структура("ВидСчетаФактуры, Исправление, НомерИсправления, ДатаИсправления, 
		|НомерВходящегоДокумента, ДатаВходящегоДокумента, БланкСтрогойОтчетности");
		ЗаполнитьЗначенияСвойств(РеквизитыСчетаФактурыДляПредставления, ДанныеСтроки);
		РеквизитыСчетаФактурыДляПредставления.ДатаВходящегоДокумента 	= ДанныеСтроки.ДатаСФ;
		РеквизитыСчетаФактурыДляПредставления.НомерВходящегоДокумента 	= ДанныеСтроки.НомерСФ;
		РеквизитыСчетаФактурыДляПредставления.БланкСтрогойОтчетности 	= Ложь;
		СтруктураПредставления = Документы.СчетФактураПолученный.ПолучитьПредставлениеПоРеквизитам(РеквизитыСчетаФактурыДляПредставления);
		РеквизитыСчетаФактурыТекст = СтруктураПредставления.ТекстПредставлениеКраткое;
		
		РеквизитыСчетаФактурыЗаполнены 	= Истина;
	Иначе
		РеквизитыСчетаФактурыЗаполнены = Ложь;
	КонецЕсли;
	
	ДанныеСтроки.РеквизитыСчетаФактуры 				= РеквизитыСчетаФактурыТекст;
	ДанныеСтроки.РеквизитыСчетаФактурыЗаполнены 	= РеквизитыСчетаФактурыЗаполнены;

КонецПроцедуры

#КонецОбласти
