
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ВариантыПриложений.ЭтоВерсияКОРП() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	РедактированиеРазрешено = ПравоДоступа("Редактирование", Метаданные.Документы.Бюджет);
	// Установим реквизиты шапки
	Если ЗначениеЗаполнено(Параметры.ДокументСсылка) Тогда
		ДокументСсылка = Параметры.ДокументСсылка;
		// Организацию берем из документа
		Объект.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Организация");
	Иначе
		// Берем организацию по умолчанию
		Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		// Ищем документ по организации
		ДокументСсылка = Документы.Бюджет.ПоследнийБюджет(Объект.Организация);
	КонецЕсли;
	
	Если ДокументСсылка.Пустая() Тогда
		Объект.Детализация = Перечисления.Периодичность.Квартал;
		Объект.Период      = НачалоГода(ТекущаяДатаСеанса());
	КонецЕсли;
	
	ТекущаяОрганизация = Объект.Организация;
	
	// Получим данные, по которым строим дерево бюджета
	ЗаполнитьДанныеОбработки();
	
	ПодготовитьФормуНаСервере();
	
	ПостроитьДеревоБюджета();
	
	УстановитьУсловноеОформление();
	
	БюджетДоходовРасходов.УстановитьТекущуюСтрокуИзПланФактногоАнализа(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазвернутьДерево();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьБюджетНаНезаполненныеЭлементы(Отказ);
	
	ШаблонСообщения = НСтр("ru='Статья ""%1"" указана в разделе Финансирование %2'");
	ПроверитьТаблицуНаДублирующиеЭлементы(Объект.Доходы, "СтатьяДохода", ШаблонСообщения, Отказ);
	
	ШаблонСообщения = НСтр("ru='Направление деятельности ""%1"" указано %2'");
	ПроверитьТаблицуНаДублирующиеЭлементы(
		Объект.РасходыПоНаправлениямДеятельности, "НаправлениеДеятельности", ШаблонСообщения, Отказ);
		
	ПроверитьРасходыНаДублирующиеЭлементы(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект, Новый Структура);
		ПоказатьВопросСохранитьИзменения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_КорректировкаБюджета" Тогда
		
		ЗаполнитьДанныеОбработки();
	
		ПодготовитьФормуНаСервере();
	
		ПостроитьДеревоБюджета();
		
		РазвернутьДерево();
		
		УправлениеФормой(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтображениеПериодаПриИзменении(Элемент)
	
	Отказ = Ложь;
	ПроверитьКорректностьГода(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтображениеПериодаПриИзмененииЗавершение", ЭтотОбъект, Новый Структура);
		ПоказатьВопросСохранитьИзменения(ОписаниеОповещения);
	Иначе
		ОтображениеПериодаПриИзмененииНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УтвержденПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПриИзменении(Элемент)
	
	ДетализацияПриИзмененииНаСервере();
	РазвернутьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяОрганизацияПриИзменении(Элемент)
	
	Если Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОрганизацияПриИзмененииЗавершение", ЭтотОбъект, Новый Структура);
		ПоказатьВопросСохранитьИзменения(ОписаниеОповещения);
	Иначе
		Объект.Организация = ТекущаяОрганизация;
		ПерезаполнитьБюджет();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКорректировкаНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Бюджет", ДокументСсылка);
	ПараметрыФормы.Вставить("ДокументСсылка", ПоследняяКорректировка);
	
	Если ПоследняяКорректировка.Пустая() Тогда
		ПараметрыФормы.Вставить("Период", ОбщегоНазначенияКлиент.ДатаСеанса());
	КонецЕсли;
	
	ОткрытьФорму("Обработка.КорректировкаБюджета.Форма", ПараметрыФормы, , Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВсеКорректировкиНажатие(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Бюджет", ДокументСсылка);
	
	ОткрытьФорму("Обработка.КорректировкаБюджета.Форма.ВсеКорректировки", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ДеревоБюджетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Если Объект.Утвержден Тогда
		Возврат;
	КонецЕсли;
	
	Строка = Элементы.ДеревоБюджета.ТекущиеДанные;
	
	Если Копирование Тогда
		СкопироватьСтрокуДерева(Строка);
	Иначе
		ДобавитьНовуюСтрокуДерева(Строка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоБюджетаПередУдалением(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные.ЭтоРаздел Или Объект.Утвержден Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоБюджетаПослеУдаления(Элемент)
	
	РассчитатьИтогиПоВсемРазделам();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоБюджетаНаправлениеДеятельностиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СоздатьНовоеНаправлениеДеятельности(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоБюджетаНаправлениеДеятельностиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(Текст) Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = НаправленияДеятельностиДанныеВыбораКомандаСоздать(ПараметрыПолученияДанных, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоБюджетаНаправлениеДеятельностиОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(Текст) Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = НаправленияДеятельностиДанныеВыбораКомандаСоздать(ПараметрыПолученияДанных, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоБюджетаСтатьяДДСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоБюджета.ТекущиеДанные;
	СтатьяДДС = ТекущиеДанные.СтатьяДДС;
	ТекущиеДанные.ЭтоГруппаСтатей = ЭтоГруппа(СтатьяДДС);
	Если ТекущиеДанные.ЭтоГруппаСтатей Тогда
		ТекущиеДанные.КартинкаСтроки = БиблиотекаКартинок.Папка;
	Иначе
		ТекущиеДанные.КартинкаСтроки = БиблиотекаКартинок.Реквизит;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоБюджетаСтатьяДДСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СоздатьНовуюСтатьюДДС(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоБюджетаСтатьяДДСАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(Текст) Тогда
		СтандартнаяОбработка = Ложь;
		Если Элементы.ДеревоБюджета.ТекущиеДанные.Раздел = ИмяРазделРасходы() Тогда
			ПараметрыПолученияДанных.Отбор.Вставить("ВидСтатьиДДС", ВидСтатьиДДСРасход());
		Иначе
			ПараметрыПолученияДанных.Отбор.Вставить("ВидСтатьиДДС", ВидСтатьиДДСДоход());
		КонецЕсли;
		
		ДанныеВыбора = СтатьяДДСДанныеВыбораКомандаСоздать(ПараметрыПолученияДанных, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоБюджетаСтатьяДДСОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(Текст) Тогда
		СтандартнаяОбработка = Ложь;
		Если Элементы.ДеревоБюджета.ТекущиеДанные.Раздел = ИмяРазделРасходы() Тогда
			ПараметрыПолученияДанных.Отбор.Вставить("ВидСтатьиДДС", ВидСтатьиДДСРасход());
		Иначе
			ПараметрыПолученияДанных.Отбор.Вставить("ВидСтатьиДДС", ВидСтатьиДДСДоход());
		КонецЕсли;
		ДанныеВыбора = СтатьяДДСДанныеВыбораКомандаСоздать(ПараметрыПолученияДанных, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоБюджетаСуммаПриИзменении(Элемент)
	
	РассчитатьИтоги(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Отказ = Ложь;
	ЗаписатьДанные(Отказ);
	Если Не Отказ Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПланом(Команда)
	
	Если БюджетЗаполнен() Тогда
		ДополнительныеПараметры = Новый Структура("ЗаполнитьФактом", Ложь);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросЗаполнитьБюджетЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Перед заполнением бюджет будет очищен. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьПоДаннымПрошлогоПериодаНаСервере(Ложь);
		РазвернутьДерево();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФактом(Команда)
	
	Если БюджетЗаполнен() Тогда
		ДополнительныеПараметры = Новый Структура("ЗаполнитьФактом", Истина);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросЗаполнитьБюджетЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Перед заполнением бюджет будет очищен. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьПоДаннымПрошлогоПериодаНаСервере(Истина);
		РазвернутьДерево();
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ПерезаполнитьБюджет();
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетДоходовИРасходов(Команда)
	
	Если Объект.Расходы.Итог("Сумма") = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru='Сначала заполните и запишите бюджет доходов и расходов'"));
	ИначеЕсли Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("БюджетДоходовИРасходовЗавершение", ЭтотОбъект, Новый Структура);
		ПоказатьВопросСохранитьПродолжить(ОписаниеОповещения, НСтр("ru='Для печати документа требуется его сохранить'"));
	Иначе
		ВывестиТабличныйДокументНаПечать(СформироватьПечатнуюФормуНаСервере());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланФактныйАнализ(Команда)
	
	Если Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьПланФактныйАнализЗавершение", ЭтотОбъект, Новый Структура);
		ПоказатьВопросСохранитьПродолжить(ОписаниеОповещения, НСтр("ru='Для формирования отчета требуется сохранить изменения'"));
	Иначе
		ОткрытьПланФактныйАнализ();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДоход(Команда)
	
	ТекущиеДанные = Элементы.ДеревоБюджета.ТекущиеДанные;
	Отбор = Новый Структура;
	
	Если ТекущиеДанные.ЭтоГруппаСтатей Тогда
		Родитель = ТекущиеДанные;
		Отбор.Вставить("Родитель", ТекущиеДанные.СтатьяДДС);
	ИначеЕсли ТекущиеДанные.ЭтоРаздел И ТекущиеДанные.Раздел = ИмяРазделДоходы() Тогда
		Родитель = ТекущиеДанные;
	ИначеЕсли ТекущиеДанные.ЭтоСтатьяДДС И ТекущиеДанные.Раздел = ИмяРазделДоходы() Тогда
		Родитель = ТекущиеДанные.ПолучитьРодителя();
		Если Родитель.ЭтоГруппаСтатей Тогда
			Отбор.Вставить("Родитель", Родитель.СтатьяДДС);
		КонецЕсли;
	Иначе
		Родитель = ДеревоБюджета.НайтиПоИдентификатору(ИдентификаторДоходы);
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Родитель", Родитель);
	ДополнительныеПараметры.Вставить("ВидСтатьиДДС", ВидСтатьиДДСДоход());
	ДополнительныеПараметры.Вставить("Раздел", ИмяРазделДоходы());
	Отбор.Вставить("ВидСтатьиДДС", ДополнительныеПараметры.ВидСтатьиДДС);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьСтатьюДДСЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Справочник.СтатьиДвиженияДенежныхСредств.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРасход(Команда)
	
	ТекущиеДанные = Элементы.ДеревоБюджета.ТекущиеДанные;
	Отбор = Новый Структура;
	Если ТекущиеДанные.ЭтоГруппаСтатей Тогда
		Родитель = ТекущиеДанные;
		Отбор.Вставить("Родитель", ТекущиеДанные.СтатьяДДС);
	ИначеЕсли ТекущиеДанные.ЭтоСтатьяДДС И ТекущиеДанные.Раздел = ИмяРазделРасходы() Тогда
		Родитель = ТекущиеДанные.ПолучитьРодителя();
		Если Родитель.ЭтоГруппаСтатей Тогда
			Отбор.Вставить("Родитель", Родитель.СтатьяДДС);
		КонецЕсли;
	ИначеЕсли ТекущиеДанные.ЭтоНаправлениеДеятельности Тогда 
		Родитель = ТекущиеДанные;
	Иначе
		РазделРасходы = ДеревоБюджета.НайтиПоИдентификатору(ИдентификаторРасходы);
		КоличествоЭлементов = РазделРасходы.ПолучитьЭлементы().Количество();
		Если КоличествоЭлементов = 0 Тогда
			ПоказатьПредупреждение(, НСтр("ru='Сначала добавьте направление деятельности'"));
			Возврат;
		Иначе
			Родитель = РазделРасходы.ПолучитьЭлементы()[КоличествоЭлементов - 1];
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Родитель", Родитель);
	ДополнительныеПараметры.Вставить("ВидСтатьиДДС", ВидСтатьиДДСРасход());
	ДополнительныеПараметры.Вставить("Раздел", ИмяРазделРасходы());
	Отбор.Вставить("ВидСтатьиДДС", ДополнительныеПараметры.ВидСтатьиДДС);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьСтатьюДДСЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Справочник.СтатьиДвиженияДенежныхСредств.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНаправлениеДеятельности(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Родитель", ДеревоБюджета.НайтиПоИдентификатору(ИдентификаторРасходы));
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьНаправлениеДеятельностиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Справочник.НаправленияДеятельности.ФормаВыбора", , ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьГод(Команда)
	
	ИзменитьГод(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГод(Команда)
	
	ИзменитьГод(1);
	
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьВниз(Команда)
	
	ТекущиеДанные = Элементы.ДеревоБюджета.ТекущиеДанные;
	Если ТекущиеДанные.ЭтоРаздел Тогда
		Возврат;
	КонецЕсли;
	
	Родитель = ТекущиеДанные.ПолучитьРодителя();
	Индекс = Родитель.ПолучитьЭлементы().Индекс(ТекущиеДанные);
	ВсегоЭлементов = Родитель.ПолучитьЭлементы().Количество() - 1;
	Если Индекс < ВсегоЭлементов Тогда
		Родитель.ПолучитьЭлементы().Сдвинуть(Индекс, 1);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьВверх(Команда)
	
	ТекущиеДанные = Элементы.ДеревоБюджета.ТекущиеДанные;
	Если ТекущиеДанные.ЭтоРаздел Тогда
		Возврат;
	КонецЕсли;
	
	Родитель = ТекущиеДанные.ПолучитьРодителя();
	Индекс = Родитель.ПолучитьЭлементы().Индекс(ТекущиеДанные);
	Если Индекс > 0 Тогда
		Родитель.ПолучитьЭлементы().Сдвинуть(Индекс, -1);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВExcel(Команда)
	
	Если Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередВыгрузкойИЗагрузкойИзФайлаЗавершение", ЭтотОбъект, Новый Структура("Команда", "Выгрузить"));
		ПоказатьВопросСохранитьИзменения(ОписаниеОповещения);
	Иначе
		Оповещение = Новый ОписаниеОповещения("ВыгрузитьВExcelПриПодключенииРасширения", ЭтотОбъект); 
		ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботы1СПредприятия(Оповещение);
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ЗагрузитьИзExcel(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда   
		ТекстСообщения = НСтр("ru='Организация не заполнена'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли; 
	
	Если Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередВыгрузкойИЗагрузкойИзФайлаЗавершение", ЭтотОбъект, Новый Структура("Команда", "Загрузить"));
		ПоказатьВопросСохранитьИзменения(ОписаниеОповещения);
	Иначе 
		Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзExcelПриПодключенииРасширения", ЭтотОбъект); 
		ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботы1СПредприятия(Оповещение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаписатьРазработчикам(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьПоЭлектроннойПочтеНастройкаУчетнойЗаписиПредложена", ЭтотОбъект);
	РаботаСПочтовымиСообщениямиКлиент.ПроверитьНаличиеУчетнойЗаписиДляОтправкиПочты(ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьКорректностьГода(Отказ)
	
	ГодЧислом = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ОтображениеПериода);
	
	Если ГодЧислом < 2000 Тогда
		ТекстОшибки = НСтр("ru = 'Дата бюджета должна быть не ранее 2000 года'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "ОтображениеПериода", , Отказ);
		
	ИначеЕсли ГодЧислом > 3999 Тогда
		ТекстОшибки = НСтр("ru = 'Дата бюджета должна быть не позднее 3999 года'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "ОтображениеПериода", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросСохранитьИзменения(ОписаниеОповещения)
	
	ТекстВопроса = НСтр("ru='Данные были изменены. Сохранить изменения?'");
	КнопкиОтвета = Новый СписокЗначений;
	КнопкиОтвета.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Да, сохранить'"));
	КнопкиОтвета.Добавить(КодВозвратаДиалога.Нет, НСтр("ru='Нет'"));
	КнопкиОтвета.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Отмена'"));
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, КнопкиОтвета);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросСохранитьПродолжить(ОписаниеОповещения, ТекстВопроса)
	
	КнопкиОтвета = Новый СписокЗначений;
	КнопкиОтвета.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Сохранить и продолжить'"));
	КнопкиОтвета.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Отмена'"));
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, КнопкиОтвета);
	
КонецПроцедуры

&НаКлиенте
Функция ВидСтатьиДДСДоход()
	
	Массив = Новый Массив;
	Массив.Добавить(ПредопределенноеЗначение("Перечисление.ВидСтатьиДвиженияДенег.Доход"));
	Массив.Добавить(ПредопределенноеЗначение("Перечисление.ВидСтатьиДвиженияДенег.ДоходРасход"));
	Возврат Новый ФиксированныйМассив(Массив);
	
КонецФункции

&НаКлиенте
Функция ВидСтатьиДДСРасход()
	
	Массив = Новый Массив;
	Массив.Добавить(ПредопределенноеЗначение("Перечисление.ВидСтатьиДвиженияДенег.Расход"));
	Массив.Добавить(ПредопределенноеЗначение("Перечисление.ВидСтатьиДвиженияДенег.ДоходРасход"));
	Возврат Новый ФиксированныйМассив(Массив);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьПланФактныйАнализ()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НачалоПериода", НачалоГода(Объект.Период));
	ПараметрыФормы.Вставить("КонецПериода",  КонецГода(Объект.Период));
	ПараметрыФормы.Вставить("Организация",   Объект.Организация);
	ПараметрыФормы.Вставить("КлючВарианта",  "ПланФактныйАнализБюджета");
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	
	ОткрытьФорму("Отчет.ПланФактныйАнализБюджета.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект, Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьБюджет()
	
	ПерезаполнитьБюджетНаСервере();
	РазвернутьДерево();
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьБюджетНаСервере()
	
	ДетализацияДо = Объект.Детализация;
	ДокументСсылка = Документы.Бюджет.БюджетНаПериод(Объект.Организация, Объект.Период);
	
	ЗаполнитьДанныеОбработки();
	Если ДетализацияДо = Объект.Детализация Тогда
		ОбновитьКолонкиДереваБюджета();
	Иначе
		СоздатьКолонкиДереваБюджета();
		УстановитьУсловноеОформление();
	КонецЕсли;
	
	ПостроитьДеревоБюджета();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаПриИзмененииНаКлиенте()
	
	Объект.Период = Дата(ОтображениеПериода, 1, 1);
	ВывестиОтображениеПериода(ЭтотОбъект);
	ПерезаполнитьБюджет();
	Если ПоказыватьВопросЗаполнитьБюджет(Объект.Организация, Объект.Период) Тогда
		ДополнительныеПараметры = Новый Структура("ЗаполнитьФактом", Истина);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросЗаполнитьБюджетЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(
			ОписаниеОповещения,
			СтрШаблон(НСтр("ru='Бюджет на %1 год еще не составлялся. Заполнить по фактическим данным прошлого года?'"), ОтображениеПериода), 
			РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьГод(Шаг)
	
	ОтображениеПериода = Формат(Год(ДобавитьМесяц(Объект.Период, Шаг * 12)), "ЧГ=0");
	Отказ = Ложь;
	ПроверитьКорректностьГода(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Модифицированность Тогда
		ОтображениеПериодаПриИзмененииНаКлиенте();
	Иначе
		ДополнительныеПараметры = Новый Структура("Шаг", Шаг);
		ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьГодЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопросСохранитьИзменения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьГодЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Отказ = Ложь;
		ЗаписатьДанные(Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда
		ВывестиОтображениеПериода(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	ОтображениеПериодаПриИзмененииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Отказ = Ложь;
		ЗаписатьДанные(Отказ);
		Если Не Отказ Тогда
			ОтображениеПериодаПриИзмененииНаКлиенте();
		КонецЕсли;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ОтображениеПериодаПриИзмененииНаКлиенте();
	Иначе
		ВывестиОтображениеПериода(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Отказ = Ложь;
		ЗаписатьДанные(Отказ);
		Если Не Отказ Тогда
			Закрыть();
		КонецЕсли;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Отказ = Ложь;
		ЗаписатьДанные(Отказ);
		Если Не Отказ Тогда
			Объект.Организация = ТекущаяОрганизация;
			ПерезаполнитьБюджет();
		КонецЕсли;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Объект.Организация = ТекущаяОрганизация;
		ПерезаполнитьБюджет();
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда
		ТекущаяОрганизация = Объект.Организация;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетДоходовИРасходовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Отказ = Ложь;
		ЗаписатьДанные(Отказ);
		Если Не Отказ Тогда
			ВывестиТабличныйДокументНаПечать(СформироватьПечатнуюФормуНаСервере());
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПланФактныйАнализЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Отказ = Ложь;
		ЗаписатьДанные(Отказ);
		Если Не Отказ Тогда
			ОткрытьПланФактныйАнализ();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьБюджетЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоДаннымПрошлогоПериодаНаСервере(ДополнительныеПараметры.ЗаполнитьФактом);
		РазвернутьДерево();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОбработки()
	
	Если Не ДокументСсылка.Пустая() Тогда
		
		ДанныеБюджета = Документы.Бюджет.ДанныеБюджета(ДокументСсылка);
		
		ПоследняяКорректировка = Документы.КорректировкаБюджета.ПоследняяКорректировка(ДокументСсылка);
		ВсеКорректировки.ЗагрузитьЗначения(Документы.КорректировкаБюджета.ВсеКорректировки(ДокументСсылка));
		
		Объект.СтруктураДоходов.Загрузить(ДанныеБюджета.СтруктураДоходов);
		Объект.Доходы.Загрузить(ДанныеБюджета.Доходы);
		Объект.СтруктураРасходов.Загрузить(ДанныеБюджета.СтруктураРасходов);
		Объект.РасходыПоНаправлениямДеятельности.Загрузить(ДанныеБюджета.РасходыПоНаправлениямДеятельности);
		Объект.Расходы.Загрузить(ДанныеБюджета.Расходы);
		ЗаполнитьЗначенияСвойств(Объект, ДанныеБюджета.Реквизиты[0]);
		ВывестиОтображениеПериода(ЭтотОбъект);
		
	Иначе
		
		ПоследняяКорректировка = Документы.КорректировкаБюджета.ПустаяСсылка();
		ВсеКорректировки.Очистить();
		
		Объект.СтруктураДоходов.Очистить();
		Объект.Доходы.Очистить();
		Объект.СтруктураРасходов.Очистить();
		Объект.РасходыПоНаправлениямДеятельности.Очистить();
		Объект.Расходы.Очистить();
		
		Объект.Утвержден = Ложь;
		Объект.Комментарий = "";
		Объект.ОстатокНаНачало = 0;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоказыватьВопросЗаполнитьБюджет(Организация, Период)
	
	Возврат Документы.Бюджет.ЕстьБюджетНаПериод(Организация, ДобавитьМесяц(Период, -12))
		И Не Документы.Бюджет.ЕстьБюджетНаПериод(Организация, Период);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоДаннымПрошлогоПериодаНаСервере(ЗаполнитьФактом)
	
	НачалоПериода = ДобавитьМесяц(НачалоГода(Объект.Период), -12);
	КонецПериода = КонецГода(НачалоПериода);
	
	ДетализацияДо = Объект.Детализация;
	
	БюджетПрошлогоГода = Документы.Бюджет.БюджетНаПериод(Объект.Организация, НачалоПериода);
	Если БюджетПрошлогоГода.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеБюджета = Документы.Бюджет.ДанныеБюджета(БюджетПрошлогоГода);
	РеквизитыБюджета = ДанныеБюджета.Реквизиты[0];
	Объект.Детализация = РеквизитыБюджета.Детализация;
	
	Если Объект.Детализация =  ДетализацияДо Тогда
		ОбновитьКолонкиДереваБюджета();
	Иначе
		СоздатьКолонкиДереваБюджета();
		УстановитьУсловноеОформление();
	КонецЕсли;
	
	Объект.Доходы.Очистить();
	Объект.СтруктураДоходов.Очистить();
	Объект.Расходы.Очистить();
	Объект.СтруктураРасходов.Очистить();
	Объект.РасходыПоНаправлениямДеятельности.Очистить();
	
	// Заполним начальный остаток
	Если Не ЗаполнитьФактом Тогда
		Объект.ОстатокНаНачало = РеквизитыБюджета.ОстатокНаНачало;
	Иначе
		ОстаткиДенежныхСредств = Отчеты.ОстаткиДенежныхСредств.ПолучитьОстаткиДенежныхСредствДляМонитораРуководителяСводно(
			Объект.Организация, КонецПериода);
		Объект.ОстатокНаНачало = ОстаткиДенежныхСредств.Итог("Сумма");
	КонецЕсли;
	
	// Заполним доходы
	ДоходыПрошлогоГода = БюджетДоходыЗаПериод(
		НачалоПериода, КонецПериода, Объект.Организация, ЗаполнитьФактом, Объект.Детализация = Перечисления.Периодичность.Месяц);
		
	Объект.Доходы.Загрузить(ДоходыПрошлогоГода.Доходы);
	Объект.СтруктураДоходов.Загрузить(ДоходыПрошлогоГода.СтруктураДоходов);
	
	// Заполним расходы
	РасходыПрошлогоГода = БюджетРасходыЗаПериод(
		НачалоПериода, КонецПериода, Объект.Организация, ЗаполнитьФактом, Объект.Детализация = Перечисления.Периодичность.Месяц);
	
	Объект.Расходы.Загрузить(РасходыПрошлогоГода.Расходы);
	Объект.СтруктураРасходов.Загрузить(РасходыПрошлогоГода.СтруктураРасходов);
	Объект.РасходыПоНаправлениямДеятельности.Загрузить(РасходыПрошлогоГода.РасходыПоНаправлениямДеятельности);
	
	ПостроитьДеревоБюджета();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция БюджетРасходыЗаПериод(НачалоПериода, КонецПериода, Организация, ЗаполнитьФактом, ПоМесяцам)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ПоМесяцам",       ПоМесяцам);
	Запрос.УстановитьПараметр("Организация",     Организация);
	Запрос.УстановитьПараметр("НачалоПериода",   НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",    КонецПериода);
	Запрос.УстановитьПараметр("ЗаполнитьФактом", ЗаполнитьФактом);
	
	// При поквартальном бюджете из регистра выбирается Период - начало квартала, 
	// а для корректного заполнения дерева бюджета требуется ДатаПланирования - конец квартала.
	// Поэтому к выбираемому периоду добавляем 14 месяцев - один год и еще два месяца.
	Запрос.УстановитьПараметр("МесяцевДоКонцаКварталаСледующегоГода", 14);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &ПоМесяцам
	|			ТОГДА ДОБАВИТЬКДАТЕ(БюджетРасходыОборотыПоПериодам.ПериодМесяц, МЕСЯЦ, 12)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(БюджетРасходыОборотыПоПериодам.ПериодКвартал, МЕСЯЦ, &МесяцевДоКонцаКварталаСледующегоГода)
	|	КОНЕЦ КАК Период,
	|	БюджетРасходыОборотыПоПериодам.СуммаПланОборот КАК СуммаПланОборот,
	|	БюджетРасходыОборотыПоПериодам.СуммаФактОборот КАК СуммаФактОборот,
	|	БюджетРасходыОборотыПоПериодам.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	БюджетРасходыОборотыПоПериодам.СтатьяРасхода КАК СтатьяРасхода,
	|	БюджетРасходыОборотыПоПериодам.СтатьяРасхода.Родитель КАК Родитель,
	|	БюджетРасходыОборотыПоПериодам.СтатьяРасхода.ЭтоГруппа КАК ЭтоГруппа
	|ПОМЕСТИТЬ Обороты
	|ИЗ
	|	РегистрНакопления.БюджетРасходы.Обороты(&НачалоПериода, &КонецПериода, Авто, Организация = &Организация) КАК БюджетРасходыОборотыПоПериодам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	БюджетРасходыОборотыИтоги.СуммаПланОборот,
	|	БюджетРасходыОборотыИтоги.СуммаФактОборот,
	|	БюджетРасходыОборотыИтоги.НаправлениеДеятельности,
	|	БюджетРасходыОборотыИтоги.СтатьяРасхода,
	|	БюджетРасходыОборотыИтоги.СтатьяРасхода.Родитель,
	|	БюджетРасходыОборотыИтоги.СтатьяРасхода.ЭтоГруппа
	|ИЗ
	|	РегистрНакопления.БюджетРасходы.Обороты(&НачалоПериода, &КонецПериода, , Организация = &Организация) КАК БюджетРасходыОборотыИтоги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтруктураБюджетаРасходы.НомерСтроки КАК НомерСтроки,
	|	СтруктураБюджетаРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СтруктураБюджетаРасходы.СтатьяРасхода КАК СтатьяРасхода
	|ПОМЕСТИТЬ НомераСтрок
	|ИЗ
	|	РегистрСведений.СтруктураБюджетаРасходы.СрезПоследних(&КонецПериода, Организация = &Организация) КАК СтруктураБюджетаРасходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &ЗаполнитьФактом
	|			ТОГДА СУММА(Обороты.СуммаФактОборот)
	|		ИНАЧЕ СУММА(Обороты.СуммаПланОборот)
	|	КОНЕЦ КАК Сумма,
	|	Обороты.Период КАК ДатаПланирования,
	|	Обороты.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Обороты.СтатьяРасхода КАК СтатьяРасхода,
	|	Обороты.Родитель КАК Родитель,
	|	Обороты.ЭтоГруппа КАК ЭтоГруппа,
	|	НомераСтрок.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Обороты КАК Обороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСтрок КАК НомераСтрок
	|		ПО Обороты.НаправлениеДеятельности = НомераСтрок.НаправлениеДеятельности
	|			И Обороты.СтатьяРасхода = НомераСтрок.СтатьяРасхода
	|
	|СГРУППИРОВАТЬ ПО
	|	Обороты.Период,
	|	Обороты.НаправлениеДеятельности,
	|	Обороты.СтатьяРасхода,
	|	Обороты.Родитель,
	|	Обороты.ЭтоГруппа,
	|	НомераСтрок.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &ЗаполнитьФактом
	|			ТОГДА СУММА(Обороты.СуммаФактОборот)
	|		ИНАЧЕ СУММА(Обороты.СуммаПланОборот)
	|	КОНЕЦ КАК Сумма,
	|	ДОБАВИТЬКДАТЕ(Обороты.Период, ГОД, 1) КАК ДатаПланирования,
	|	Обороты.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ИЗ
	|	Обороты КАК Обороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСтрок КАК НомераСтрок
	|		ПО Обороты.НаправлениеДеятельности = НомераСтрок.НаправлениеДеятельности
	|			И Обороты.СтатьяРасхода = НомераСтрок.СтатьяРасхода
	|
	|СГРУППИРОВАТЬ ПО
	|	Обороты.Период,
	|	Обороты.НаправлениеДеятельности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтруктураБюджетаРасходы.НомерСтроки КАК НомерСтроки,
	|	СтруктураБюджетаРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СтруктураБюджетаРасходы.СтатьяРасхода КАК СтатьяРасхода,
	|	СтруктураБюджетаРасходы.СтатьяРасхода.Родитель КАК Родитель,
	|	СтруктураБюджетаРасходы.СтатьяРасхода.ЭтоГруппа КАК ЭтоГруппа
	|ИЗ
	|	РегистрСведений.СтруктураБюджетаРасходы.СрезПоследних(&КонецПериода, Организация = &Организация) КАК СтруктураБюджетаРасходы
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаРасходы = РезультатЗапроса[2].Выгрузить();
	ТаблицаРасходыПоНаправлениямДеятельности = РезультатЗапроса[3].Выгрузить();
	ТаблицаСтруктураРасходов = РезультатЗапроса[4].Выгрузить();
	
	Возврат Новый Структура("Расходы,СтруктураРасходов,РасходыПоНаправлениямДеятельности", ТаблицаРасходы, ТаблицаСтруктураРасходов, ТаблицаРасходыПоНаправлениямДеятельности);
	
КонецФункции

&НаСервереБезКонтекста
Функция БюджетДоходыЗаПериод(НачалоПериода, КонецПериода, Организация, ЗаполнитьФактом, ПоМесяцам)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ПоМесяцам",       ПоМесяцам);
	Запрос.УстановитьПараметр("Организация",     Организация);
	Запрос.УстановитьПараметр("НачалоПериода",   НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",    КонецПериода);
	Запрос.УстановитьПараметр("ЗаполнитьФактом", ЗаполнитьФактом);
	
	// При поквартальном бюджете из регистра выбирается Период - начало квартала, 
	// а для корректного заполнения дерева бюджета требуется ДатаПланирования - конец квартала.
	// Поэтому к выбираемому периоду добавляем 14 месяцев - один год и еще два месяца.
	Запрос.УстановитьПараметр("МесяцевДоКонцаКварталаСледующегоГода", 14);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &ПоМесяцам
	|			ТОГДА ДОБАВИТЬКДАТЕ(БюджетДоходыОборотыПоПериодам.ПериодМесяц, МЕСЯЦ, 12)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(БюджетДоходыОборотыПоПериодам.ПериодКвартал, МЕСЯЦ, &МесяцевДоКонцаКварталаСледующегоГода)
	|	КОНЕЦ КАК Период,
	|	БюджетДоходыОборотыПоПериодам.СуммаПланОборот КАК СуммаПланОборот,
	|	БюджетДоходыОборотыПоПериодам.СуммаФактОборот КАК СуммаФактОборот,
	|	БюджетДоходыОборотыПоПериодам.СтатьяДохода КАК СтатьяДохода,
	|	БюджетДоходыОборотыПоПериодам.СтатьяДохода.Родитель КАК Родитель,
	|	БюджетДоходыОборотыПоПериодам.СтатьяДохода.ЭтоГруппа КАК ЭтоГруппа
	|ПОМЕСТИТЬ Обороты
	|ИЗ
	|	РегистрНакопления.БюджетДоходы.Обороты(&НачалоПериода, &КонецПериода, Авто, Организация = &Организация) КАК БюджетДоходыОборотыПоПериодам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	БюджетДоходыОборотыИтоги.СуммаПланОборот,
	|	БюджетДоходыОборотыИтоги.СуммаФактОборот,
	|	БюджетДоходыОборотыИтоги.СтатьяДохода,
	|	БюджетДоходыОборотыИтоги.СтатьяДохода.Родитель,
	|	БюджетДоходыОборотыИтоги.СтатьяДохода.ЭтоГруппа
	|ИЗ
	|	РегистрНакопления.БюджетДоходы.Обороты(&НачалоПериода, &КонецПериода, , Организация = &Организация) КАК БюджетДоходыОборотыИтоги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтруктураБюджетаДоходы.НомерСтроки КАК НомерСтроки,
	|	СтруктураБюджетаДоходы.СтатьяДохода КАК СтатьяДохода
	|ПОМЕСТИТЬ НомераСтрок
	|ИЗ
	|	РегистрСведений.СтруктураБюджетаДоходы.СрезПоследних(&КонецПериода, Организация = &Организация) КАК СтруктураБюджетаДоходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &ЗаполнитьФактом
	|			ТОГДА СУММА(Обороты.СуммаФактОборот)
	|		ИНАЧЕ СУММА(Обороты.СуммаПланОборот)
	|	КОНЕЦ КАК Сумма,
	|	Обороты.Период КАК ДатаПланирования,
	|	Обороты.СтатьяДохода КАК СтатьяДохода,
	|	Обороты.Родитель КАК Родитель,
	|	Обороты.ЭтоГруппа КАК ЭтоГруппа,
	|	НомераСтрок.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Обороты КАК Обороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСтрок КАК НомераСтрок
	|		ПО Обороты.СтатьяДохода = НомераСтрок.СтатьяДохода
	|
	|СГРУППИРОВАТЬ ПО
	|	Обороты.Период,
	|	Обороты.СтатьяДохода,
	|	Обороты.Родитель,
	|	Обороты.ЭтоГруппа,
	|	НомераСтрок.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтруктураБюджетаДоходы.НомерСтроки КАК НомерСтроки,
	|	СтруктураБюджетаДоходы.СтатьяДохода КАК СтатьяДохода,
	|	СтруктураБюджетаДоходы.СтатьяДохода.Родитель КАК Родитель,
	|	СтруктураБюджетаДоходы.СтатьяДохода.ЭтоГруппа КАК ЭтоГруппа
	|ИЗ
	|	РегистрСведений.СтруктураБюджетаДоходы.СрезПоследних(&КонецПериода, Организация = &Организация) КАК СтруктураБюджетаДоходы
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаДоходы = РезультатЗапроса[2].Выгрузить();
	ТаблицаСтруктураДоходов = РезультатЗапроса[3].Выгрузить();
	
	Возврат Новый Структура("Доходы,СтруктураДоходов", ТаблицаДоходы, ТаблицаСтруктураДоходов);
	
КонецФункции

&НаКлиенте
Функция БюджетЗаполнен()
	
	БюджетЗаполнен = Ложь;
	Для Каждого СтрокаДерева Из ДеревоБюджета.ПолучитьЭлементы() Цикл
		Если СтрокаДерева.СуммаГод <> 0 Тогда
			БюджетЗаполнен = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат БюджетЗаполнен;
	
КонецФункции

#Область УправлениеФормой

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	СоздатьКолонкиДереваБюджета();
	ВывестиОтображениеПериода(ЭтотОбъект);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиОтображениеПериода(Форма)
	
	Объект = Форма.Объект;
	Форма.ОтображениеПериода = Формат(Объект.Период, "ДФ=yyyy");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	НеТолькоПросмотр = Форма.РедактированиеРазрешено; 
	Если НеТолькоПросмотр Тогда
		РедактированиеРазрешено = Не Форма.Объект.Утвержден;
	Иначе
		РедактированиеРазрешено = Ложь;
	КонецЕсли;
	
	Элементы.ДеревоБюджетаДобавитьДоход.Доступность = РедактированиеРазрешено;
	Элементы.ДеревоБюджетаДобавитьРасход.Доступность = РедактированиеРазрешено;
	Элементы.ДеревоБюджетаДобавитьНаправлениеДеятельности.Доступность = РедактированиеРазрешено;

	Элементы.ДеревоБюджетаКонтекстноеМенюДобавитьДоход.Доступность = РедактированиеРазрешено;
	Элементы.ДеревоБюджетаКонтекстноеМенюДобавитьРасход.Доступность = РедактированиеРазрешено;
	Элементы.ДеревоБюджетаКонтекстноеМенюДобавитьНаправлениеДеятельности.Доступность = РедактированиеРазрешено;

	Элементы.ДеревоБюджетаСдвинутьВверх.Доступность = РедактированиеРазрешено;
	Элементы.ДеревоБюджетаСдвинутьВниз.Доступность = РедактированиеРазрешено;

	Элементы.Детализация.Доступность = РедактированиеРазрешено;
	Элементы.ДеревоБюджета.ТолькоПросмотр = Не РедактированиеРазрешено;
	
	Элементы.ДеревоБюджетаГруппаЗаполнить.Доступность = РедактированиеРазрешено;
	
	Элементы.Записать.Доступность = НеТолькоПросмотр;
	
	Если ЗначениеЗаполнено(Форма.ПоследняяКорректировка) Тогда
		ЗаголовокКорректировки = Строка(Форма.ПоследняяКорректировка);
	Иначе
		ЗаголовокКорректировки = НСтр("ru='Ввести корректировку'");
	КонецЕсли;
	
	Элементы.ДекорацияКорректировка.Заголовок = ЗаголовокКорректировки;
	
	// Видимость заголовка зависит от права на редактирование, утвержден и модифицированность
	// Если нет прав на редактирование или бюджет не утвержден или модифицированность, то надписи не будет
	Элементы.ДекорацияКорректировка.Видимость = НеТолькоПросмотр И Не Форма.Модифицированность И Форма.Объект.Утвержден;
	
	Элементы.ДекорацияВсеКорректировки.Видимость = Форма.ВсеКорректировки.Количество() > 1;
	
	Элементы.Утвержден.Доступность = Не ЗначениеЗаполнено(Форма.ПоследняяКорректировка);
	
	Элементы.ДеревоБюджетаВыгрузитьВExcel.Доступность = НеТолькоПросмотр;
	Элементы.ДеревоБюджетаЗагрузитьИзExcel.Доступность = НеТолькоПросмотр;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджетаРаздел");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.ЭтоРаздел", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджетаНаправлениеДеятельности");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджетаКартинкаСтрокиНаправлениеДеятельности");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.ЭтоНаправлениеДеятельности", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджетаСтатьяДДС");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджетаКартинкаСтрокиСтатьяДДС");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.ЭтоСтатьяДДС", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджета");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.ЭтоРаздел", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.Раздел", ВидСравненияКомпоновкиДанных.НеРавно, ИмяРазделОстатокНачало());
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Формат", "ЧЦ=15; ЧДЦ=2; ЧН=0,00");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтРазделБюджета);
	
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджетаРаздел");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджетаСуммаГод");
	ПерваяКолонка = Истина;
	Для Каждого Колонка Из КолонкиДетализации Цикл
		Если ПерваяКолонка Тогда
			ПерваяКолонка = Ложь;
			Продолжить;
		КонецЕсли;
		ИмяЭлемента = "ДеревоБюджета" + Колонка.ИмяКолонки;
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ИмяЭлемента);
	КонецЦикла;
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.ЭтоРаздел", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.Раздел", ВидСравненияКомпоновкиДанных.Равно, ИмяРазделОстатокНачало());
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Формат", "ЧЦ=15; ЧДЦ=2; ЧН=0,00");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтРазделБюджета);
	
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	Для Каждого Колонка Из КолонкиДетализации Цикл
		ИмяЭлемента = "ДеревоБюджета" + Колонка.ИмяКолонки;
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ИмяЭлемента);
	КонецЦикла;
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.ЭтоНаправлениеДеятельности", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджета");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.ЭтоНаправлениеДеятельности", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтНаправлениеДеятельностиБюджета);
	
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджета");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.ЭтоГруппаСтатей", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	
КонецПроцедуры

#КонецОбласти

#Область Детализация

&НаСервере
Процедура ДетализацияПриИзмененииНаСервере()
	
	СоздатьКолонкиДереваБюджета();
	УстановитьУсловноеОформление();
	ОчиститьИтогиПоВсемСтрокам();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьКолонкиДетализацииНаФорме()
	
	// Добавим элементы на форму
	ТекущийЭлементДляВставки = Элементы.Найти("ДеревоБюджетаСуммаГод");
	ЭлементРодитель          = Элементы.Найти("ДеревоБюджета");
	ТипНовогоЭлемента        = Тип("ПолеФормы");
	
	Для Каждого Колонка Из КолонкиДетализации Цикл
		ИмяЭлемента = "ДеревоБюджета" + Колонка.ИмяКолонки;
		
		Если Элементы.Найти(ИмяЭлемента) <> Неопределено Тогда
			// Колонки уже созданы, повторно создавать не требуется
			Продолжить;
		КонецЕсли;
		
		ЭлементДляВставки = Элементы.Вставить(ИмяЭлемента, ТипНовогоЭлемента, ЭлементРодитель, ТекущийЭлементДляВставки);
		ЭлементДляВставки.ПутьКДанным = "ДеревоБюджета." + Колонка.ИмяКолонки;
		ЭлементДляВставки.Заголовок = Колонка.Заголовок;
		ЭлементДляВставки.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементДляВставки.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Право;
		ЭлементДляВставки.Ширина = 10;
		ЭлементДляВставки.ВыделятьОтрицательные = Истина;
		ЭлементДляВставки.УстановитьДействие("ПриИзменении", "ДеревоБюджетаСуммаПриИзменении");
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьРеквизитыФормыКолонкиДетализации()
	
	НовыеРеквизитыФормы = Новый Массив;
	УдаляемыеРеквизиты = Новый Массив;
	
	// Удалим ранее добавленные колонки
	Для Каждого Колонка Из ЭтотОбъект.КолонкиДетализации Цикл
		УдаляемыеРеквизиты.Добавить("ДеревоБюджета." + Колонка.ИмяКолонки);
	КонецЦикла;
	
	БюджетДоходовРасходов.ЗаполнитьКолонкиДетализации(КолонкиДетализации, Объект);
	
	// Добавим новые реквизиты по колонкам
	Для Каждого Колонка Из КолонкиДетализации Цикл
		НовыйРеквизитФормы = Новый РеквизитФормы(
			Колонка.ИмяКолонки,
			ОбщегоНазначения.ОписаниеТипаЧисло(15, 2),
			"ДеревоБюджета",
			Колонка.Заголовок,
			Истина);
		НовыеРеквизитыФормы.Добавить(НовыйРеквизитФормы);
	КонецЦикла;
	
	ИзменитьРеквизиты(НовыеРеквизитыФормы, УдаляемыеРеквизиты);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКолонкиДереваБюджета()
	
	БюджетДоходовРасходов.ЗаполнитьКолонкиДетализации(КолонкиДетализации, Объект);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКолонкиДереваБюджета()
	
	ИзменитьРеквизитыФормыКолонкиДетализации();
	ИзменитьКолонкиДетализацииНаФорме();
	
КонецПроцедуры

#КонецОбласти

#Область Печать

&НаКлиенте
Процедура ВывестиТабличныйДокументНаПечать(ТабличныйДокумент)

	ТабличныйДокумент.ТолькоПросмотр       = Истина;
	ТабличныйДокумент.АвтоМасштаб          = Истина;
	ТабличныйДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ОтображатьЗаголовки  = Ложь;
	ТабличныйДокумент.ОтображатьСетку      = Ложь;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_БюджетДоходовРасходов";
	ИдентификаторПечатнойФормы = "ПечатнаяФорма";
	НазваниеПечатнойФормы = НСтр("ru = 'Бюджет доходов и расходов'");
	
	ПараметрыФормыПечати = УправлениеПечатьюКлиент.ПараметрыПечати();
	ПараметрыФормыПечати.ВладелецФормы  = ЭтотОбъект;
	ПараметрыФормыПечати.ЗаголовокФормы = СтрШаблон(НСтр("ru = 'Бюджет доходов и расходов на %1 г.'"), ОтображениеПериода);
	
	КоллекцияПечатныхФорм               = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	ПечатнаяФорма                       = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета         = НазваниеПечатнойФормы;
	ПечатнаяФорма.ТабличныйДокумент     = ТабличныйДокумент;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, , ПараметрыФормыПечати);

КонецПроцедуры

&НаСервере
Функция СформироватьПечатнуюФормуНаСервере()
	
	ПараметрыОбъекта = Новый Структура;
	ПараметрыОбъекта.Вставить("Ссылка", ДокументСсылка);
	ТабличныйДокумент = Документы.Бюджет.СформироватьПечатнуюФорму(ПараметрыОбъекта);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область ПостроениеДерева

&НаСервере
Процедура ПостроитьДеревоБюджета()
	
	// Очистим дерево
	ДеревоБюджета.ПолучитьЭлементы().Очистить();
	
	// Остаток на начало
	РазделОстатокНачало = ДобавитьРаздел(ДеревоБюджета, ИмяРазделОстатокНачало());
	ИдентификаторОстатокНачало = РазделОстатокНачало.ПолучитьИдентификатор();
	ВывестиОстатокНачало(РазделОстатокНачало);
	
	// Доходы
	РазделДоходы = ДобавитьРаздел(ДеревоБюджета, ИмяРазделДоходы());
	ИдентификаторДоходы = РазделДоходы.ПолучитьИдентификатор();
	ВывестиСтрокиДохода(РазделДоходы);
	
	// Расходы
	РазделаРасходы = ДобавитьРаздел(ДеревоБюджета, ИмяРазделРасходы());
	ИдентификаторРасходы = РазделаРасходы.ПолучитьИдентификатор();
	ВывестиСтрокаРасхода(РазделаРасходы);
	
	// Остатки
	РазделОстатки = ДобавитьРаздел(ДеревоБюджета, ИмяРазделОстатокКонец());
	ИдентификаторОстатокКонец = РазделОстатки.ПолучитьИдентификатор();
	
	// Выведем итоги
	РассчитатьИтогиПоВсемРазделам();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьРаздел(Дерево, ИмяРаздела)
	
	СтрокаРаздела           = Дерево.ПолучитьЭлементы().Добавить();
	СтрокаРаздела.Раздел    = ИмяРаздела;
	СтрокаРаздела.ЭтоРаздел = Истина;
	СтрокаРаздела.КартинкаСтроки = 2;
	Возврат СтрокаРаздела;
	
КонецФункции

&НаСервере
Процедура ВывестиОстатокНачало(РазделОстатки)
	
	ИмяПервойКолонки = КолонкиДетализации[0].ИмяКолонки;
	РазделОстатки[ИмяПервойКолонки] = Объект.ОстатокНаНачало;
	РазделОстатки.СуммаГод = Объект.ОстатокНаНачало;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСтрокиДоходовСИерархией(Строка, ТаблицаСтруктурыДоходов)
	
	Для Каждого СтрокаДоходов Из ТаблицаСтруктурыДоходов Цикл
		НоваяСтрока                 = Строка.ПолучитьЭлементы().Добавить();
		НоваяСтрока.Раздел          = ИмяРазделДоходы();
		НоваяСтрока.ЭтоСтатьяДДС    = Истина;
		НоваяСтрока.СтатьяДДС       = СтрокаДоходов.СтатьяДохода;
		НоваяСтрока.ВидСтатьиДДС    = Перечисления.ВидСтатьиДвиженияДенег.Доход;
		НоваяСтрока.ЭтоГруппаСтатей = СтрокаДоходов.ЭтоГруппа;
		
		СтрокиДоходовПоСтатье = Объект.Доходы.НайтиСтроки(
			Новый Структура("СтатьяДохода", СтрокаДоходов.СтатьяДохода));
		ВывестиСуммыВСтроку(НоваяСтрока, СтрокиДоходовПоСтатье);
		
		Если Не СтрокаДоходов.ЭтоГруппа Тогда
			НоваяСтрока.КартинкаСтроки = БиблиотекаКартинок.Реквизит;
		Иначе
			НоваяСтрока.КартинкаСтроки = БиблиотекаКартинок.Папка;
			НоваяТаблицаСтруктурыДоходов = Объект.СтруктураДоходов.Выгрузить(
				Новый Структура("Родитель", СтрокаДоходов.СтатьяДохода));
			ВывестиСтрокиДоходовСИерархией(НоваяСтрока, НоваяТаблицаСтруктурыДоходов);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСтрокиДохода(РазделДоходы)
	
	СтруктураПоиска = Новый Структура("Родитель", Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());
	ТаблицаСтруктурыДоходов = Объект.СтруктураДоходов.Выгрузить(СтруктураПоиска);
	ВывестиСтрокиДоходовСИерархией(РазделДоходы, ТаблицаСтруктурыДоходов);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСуммыВСтроку(СтрокаДерева, СтрокиССуммами)
	
	Для Каждого СтрокаССуммами Из СтрокиССуммами Цикл
		Если Не ЗначениеЗаполнено(СтрокаССуммами.ДатаПланирования) Тогда
			// У суммы за год нет даты планирования
			СтрокаДерева.СуммаГод = СтрокаССуммами.Сумма;
		Иначе
			Колонки = КолонкиДетализации.НайтиСтроки(Новый Структура("Дата", СтрокаССуммами.ДатаПланирования));
			Если Колонки.Количество() > 0 Тогда
				СтрокаДерева[Колонки[0].ИмяКолонки] = СтрокаССуммами.Сумма;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСтрокиРасходовПоНаправлениюДеятельности(Строка, Отбор)
	
	ТаблицаСтруктураРасходов = Объект.СтруктураРасходов.Выгрузить(Отбор);
	Для Каждого СтрокаРасходов Из ТаблицаСтруктураРасходов Цикл
		СтатьяРасхода = СтрокаРасходов.СтатьяРасхода;
		Если Не ЗначениеЗаполнено(СтатьяРасхода) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Строка.ПолучитьЭлементы().Добавить();
		НоваяСтрока.Раздел       = ИмяРазделРасходы();
		НоваяСтрока.ЭтоСтатьяДДС = Истина;
		НоваяСтрока.СтатьяДДС    = СтатьяРасхода;
		НоваяСтрока.ВидСтатьиДДС = Перечисления.ВидСтатьиДвиженияДенег.Расход;
		НоваяСтрока.ЭтоГруппаСтатей = СтрокаРасходов.ЭтоГруппа;
		
		СтрокиРасходов = Объект.Расходы.НайтиСтроки(
			Новый Структура("НаправлениеДеятельности, СтатьяРасхода", Отбор.НаправлениеДеятельности, СтатьяРасхода));
		ВывестиСуммыВСтроку(НоваяСтрока, СтрокиРасходов);
		
		Если Не СтрокаРасходов.ЭтоГруппа Тогда
			НоваяСтрока.КартинкаСтроки = БиблиотекаКартинок.Реквизит;
		Иначе
			НоваяСтрока.КартинкаСтроки = БиблиотекаКартинок.Папка;
			НовыйОтбор = ОбщегоНазначенияКлиентСервер.СкопироватьРекурсивно(Отбор);
			НовыйОтбор.Родитель = СтатьяРасхода;
			ВывестиСтрокиРасходовПоНаправлениюДеятельности(НоваяСтрока, НовыйОтбор);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСтрокаРасхода(РазделРасходы)
	
	ТаблицаПоНаправлениямДеятельности = Объект.СтруктураРасходов.Выгрузить();
	ТаблицаПоНаправлениямДеятельности.Свернуть("НаправлениеДеятельности");
	Для Каждого НаправлениеДеятельности Из ТаблицаПоНаправлениямДеятельности.ВыгрузитьКолонку("НаправлениеДеятельности") Цикл
		// Выводим направление деятельности
		НоваяСтрокаНаправлениеДеятельности = РазделРасходы.ПолучитьЭлементы().Добавить();
		НоваяСтрокаНаправлениеДеятельности.Раздел                     = ИмяРазделРасходы();
		НоваяСтрокаНаправлениеДеятельности.ЭтоНаправлениеДеятельности = Истина;
		НоваяСтрокаНаправлениеДеятельности.НаправлениеДеятельности    = НаправлениеДеятельности;
		НоваяСтрокаНаправлениеДеятельности.КартинкаСтроки = БиблиотекаКартинок.ПриложитьФайл;
		Отбор = Новый Структура("НаправлениеДеятельности", НаправлениеДеятельности);
		ВывестиСуммыВСтроку(НоваяСтрокаНаправлениеДеятельности, Объект.РасходыПоНаправлениямДеятельности.НайтиСтроки(Отбор));
		
		// Выводим подчиненные статьи расходов
		Отбор = Новый Структура(
			"НаправлениеДеятельности, Родитель",
			НаправлениеДеятельности, Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());
		ВывестиСтрокиРасходовПоНаправлениюДеятельности(НоваяСтрокаНаправлениеДеятельности, Отбор);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево()
	
	Элементы.ДеревоБюджета.Развернуть(ИдентификаторДоходы, Истина);
	Элементы.ДеревоБюджета.Развернуть(ИдентификаторРасходы, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ИнтерактивноеДобавлениеСтрокиВДерево

&НаКлиенте
Процедура СкопироватьСтрокуДерева(Строка)
	
	Если Строка.ЭтоРаздел Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаРодитель = Строка.ПолучитьРодителя();
	ТекущийИндекс = СтрокаРодитель.ПолучитьЭлементы().Индекс(Строка);
	НоваяСтрока = СтрокаРодитель.ПолучитьЭлементы().Вставить(ТекущийИндекс);
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	СтрокаРодитель.ПолучитьЭлементы().Сдвинуть(ТекущийИндекс, 1);
	Если Строка.ЭтоНаправлениеДеятельности Тогда
		Идентификатор = НоваяСтрока.ПолучитьИдентификатор();
		Элементы.ДеревоБюджета.Развернуть(Идентификатор);
	КонецЕсли;
	
	// Установим курсор и начнем редактирование строки
	Элементы.ДеревоБюджета.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	Элементы.ДеревоБюджета.ИзменитьСтроку();
	
КонецПроцедуры

&НаКлиенте
Функция ДобавитьНовуюСтрокуДереваДоход(Строка)
	
	// Есть два варианта добавления строки дохода, в зависимости от позиционирования курсора:
	// 1. Курсор на разделе - добавляем в конец
	// 2. Курсор на статье - добавляем сразу после строки
	Если Строка.ЭтоРаздел Или Строка.ЭтоГруппаСтатей Тогда
		НоваяСтрока = Строка.ПолучитьЭлементы().Добавить();
	Иначе
		СтрокаРодитель = Строка.ПолучитьРодителя();
		ТекущийИндекс  = СтрокаРодитель.ПолучитьЭлементы().Индекс(Строка);
		НоваяСтрока    = СтрокаРодитель.ПолучитьЭлементы().Вставить(ТекущийИндекс);
		СтрокаРодитель.ПолучитьЭлементы().Сдвинуть(ТекущийИндекс, 1);
	КонецЕсли;
	
	НоваяСтрока.ЭтоСтатьяДДС   = Истина;
	НоваяСтрока.Раздел         = ИмяРазделДоходы();
	НоваяСтрока.КартинкаСтроки = БиблиотекаКартинок.Реквизит;
	
	ВидыСтатейДДС = Новый Массив;
	ВидыСтатейДДС.Добавить(ПредопределенноеЗначение("Перечисление.ВидСтатьиДвиженияДенег.Доход"));
	ВидыСтатейДДС.Добавить(ПредопределенноеЗначение("Перечисление.ВидСтатьиДвиженияДенег.ДоходРасход"));
	
	НоваяСтрока.ВидСтатьиДДС = Новый ФиксированныйМассив(ВидыСтатейДДС);
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
Функция ДобавитьНовуюСтрокуДереваРасход(Строка)
	
	// Есть четыре варианта добавления строки расхода, в зависимости от позиционирования курсора:
	// 1. Курсор на разделе - добавляем направление деятельности в конец
	// 2. Курсор на направлении деятельности - добавляем статью в конец
	// 3. Курсор на группе статей - добавляем статью в конец группы
	// 4. Курсор на статье - добавляем сразу после строки
	
	// Добавление направление деятельности
	Если Строка.ЭтоРаздел Тогда
		НоваяСтрока = Строка.ПолучитьЭлементы().Добавить();
		ЗаполнитьСтрокуНаправленияДеятельности(НоваяСтрока);
	ИначеЕсли Строка.ЭтоНаправлениеДеятельности Или Строка.ЭтоГруппаСтатей Тогда
		НоваяСтрока = Строка.ПолучитьЭлементы().Добавить();
		ЗаполнитьСтатьюРасходов(НоваяСтрока);
	Иначе
		СтрокаРодитель = Строка.ПолучитьРодителя();
		ТекущийИндекс  = СтрокаРодитель.ПолучитьЭлементы().Индекс(Строка);
		НоваяСтрока    = СтрокаРодитель.ПолучитьЭлементы().Вставить(ТекущийИндекс);
		ЗаполнитьСтатьюРасходов(НоваяСтрока);
		СтрокаРодитель.ПолучитьЭлементы().Сдвинуть(ТекущийИндекс, 1);
	КонецЕсли;
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьНовуюСтрокуДерева(Строка)
	
	Элементы.ДеревоБюджета.ТекущийЭлемент = Элементы.ДеревоБюджетаРаздел;
	
	Если Строка.Раздел = ИмяРазделДоходы() Тогда
		НоваяСтрока = ДобавитьНовуюСтрокуДереваДоход(Строка);
	ИначеЕсли Строка.Раздел = ИмяРазделРасходы() Тогда
		НоваяСтрока = ДобавитьНовуюСтрокуДереваРасход(Строка);
	Иначе
		Возврат;
	КонецЕсли;
	
	// Установим курсор и начнем редактирование строки
	Элементы.ДеревоБюджета.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	Элементы.ДеревоБюджета.ИзменитьСтроку();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоГруппа(Знач СтатьяДДС)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяДДС, "ЭтоГруппа");
	
КонецФункции

&НаКлиенте
Процедура ДобавитьСтатьюДДСЗавершение(СтатьяДДС, ДополнительныеПараметры) Экспорт
	
	Если СтатьяДДС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Родитель            = ДополнительныеПараметры.Родитель;
	Строка              = Родитель.ПолучитьЭлементы().Добавить();
	Строка.Раздел       = ДополнительныеПараметры.Раздел;
	Строка.ЭтоСтатьяДДС = Истина;
	Строка.СтатьяДДС    = СтатьяДДС;
	Строка.ВидСтатьиДДС = ДополнительныеПараметры.ВидСтатьиДДС;
	
	Если Не ЭтоГруппа(СтатьяДДС) Тогда
		Строка.КартинкаСтроки = БиблиотекаКартинок.Реквизит;
	Иначе
		Строка.ЭтоГруппаСтатей = Истина;
		Строка.КартинкаСтроки = БиблиотекаКартинок.Папка;
		
		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
		ПараметрыЗаполнения = Новый Структура("Раздел, СтатьяДДС, ВидСтатьиДДС");
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
		ПараметрыЗаполнения.СтатьяДДС = СтатьяДДС;
		ЗаполнитьВсеЭлементыНаСервере(ИдентификаторСтроки, ПараметрыЗаполнения);
		Элементы.ДеревоБюджета.Развернуть(ИдентификаторСтроки, Истина);
	КонецЕсли;
	Элементы.ДеревоБюджета.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТаблицаСтатейЗатратПоГруппе(ГруппаСтатей)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Родитель", ГруппаСтатей);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатьиДвиженияДенежныхСредств.Ссылка КАК Ссылка,
	|	СтатьиДвиженияДенежныхСредств.Родитель КАК Родитель,
	|	СтатьиДвиженияДенежныхСредств.ЭтоГруппа КАК ЭтоГруппа,
	|	СтатьиДвиженияДенежныхСредств.ВидСтатьиДДС КАК ВидСтатьиДДС
	|ИЗ
	|	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
	|ГДЕ
	|	СтатьиДвиженияДенежныхСредств.Родитель В ИЕРАРХИИ(&Родитель)
	|	И НЕ СтатьиДвиженияДенежныхСредств.ПометкаУдаления
	|	И НЕ ЕСТЬNULL(СтатьиДвиженияДенежныхСредств.НеПоказыватьВСписках, ЛОЖЬ)";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

&НаСервере
Процедура ЗаполнитьВсеЭлементыНаСервере(ИдентификаторСтроки, ПараметрыЗаполнения)
	
	СтрокаДерева = ДеревоБюджета.НайтиПоИдентификатору(ИдентификаторСтроки);
	ГруппаСтатей = ПараметрыЗаполнения.СтатьяДДС;
	ТаблицаСтатейЗатратПоГруппе = ТаблицаСтатейЗатратПоГруппе(ГруппаСтатей);
	ДобавитьВДеревоЭлементыГруппы(ТаблицаСтатейЗатратПоГруппе, ГруппаСтатей, СтрокаДерева, ПараметрыЗаполнения);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВДеревоЭлементыГруппы(ТаблицаСтатейЗатратПоГруппе, ГруппаСтатей, СтрокаДерева, ПараметрыЗаполнения)
	
	ТаблицаПоГруппе = ТаблицаСтатейЗатратПоГруппе.Скопировать(Новый Структура("Родитель", ГруппаСтатей));
	Для Каждого Строка Из ТаблицаПоГруппе Цикл
		Если Не Строка.ЭтоГруппа И ПараметрыЗаполнения.ВидСтатьиДДС.Найти(Строка.ВидСтатьиДДС) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = СтрокаДерева.ПолучитьЭлементы().Добавить();
		НоваяСтрока.Раздел       = ПараметрыЗаполнения.Раздел;
		НоваяСтрока.ЭтоСтатьяДДС = Истина;
		НоваяСтрока.СтатьяДДС    = Строка.Ссылка;
		НоваяСтрока.ВидСтатьиДДС = ПараметрыЗаполнения.ВидСтатьиДДС;
		НоваяСтрока.ЭтоГруппаСтатей = Строка.ЭтоГруппа;
		Если Строка.ЭтоГруппа Тогда
			НоваяСтрока.КартинкаСтроки = БиблиотекаКартинок.Папка;
		Иначе
			НоваяСтрока.КартинкаСтроки = БиблиотекаКартинок.Реквизит;
		КонецЕсли;
		Если Строка.ЭтоГруппа Тогда
			ДобавитьВДеревоЭлементыГруппы(ТаблицаСтатейЗатратПоГруппе, Строка.Ссылка, НоваяСтрока, ПараметрыЗаполнения);
			Если НоваяСтрока.ПолучитьЭлементы().Количество() = 0 Тогда
				Индекс = СтрокаДерева.ПолучитьЭлементы().Индекс(НоваяСтрока);
				СтрокаДерева.ПолучитьЭлементы().Удалить(Индекс);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНаправлениеДеятельностиЗавершение(НаправлениеДеятельности, ДополнительныеПараметры) Экспорт
	
	Если НаправлениеДеятельности = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Родитель = ДополнительныеПараметры.Родитель;
	Строка   = Родитель.ПолучитьЭлементы().Добавить();
	Строка.НаправлениеДеятельности = НаправлениеДеятельности;
	
	ЗаполнитьСтрокуНаправленияДеятельности(Строка);
	
	Элементы.ДеревоБюджета.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтрокуНаправленияДеятельности(Строка)

	Строка.Раздел = ИмяРазделРасходы();
	Строка.ЭтоНаправлениеДеятельности = Истина;
	Строка.КартинкаСтроки = БиблиотекаКартинок.ПриложитьФайл;
	Идентификатор = Строка.ПолучитьИдентификатор();
	Элементы.ДеревоБюджета.Развернуть(Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтатьюРасходов(Строка)
	
	Строка.ЭтоСтатьяДДС = Истина;
	Строка.Раздел       = ИмяРазделРасходы();
	Строка.КартинкаСтроки = БиблиотекаКартинок.Реквизит;
	
	ВидыСтатейДДС = Новый Массив;
	ВидыСтатейДДС.Добавить(ПредопределенноеЗначение("Перечисление.ВидСтатьиДвиженияДенег.Расход"));
	ВидыСтатейДДС.Добавить(ПредопределенноеЗначение("Перечисление.ВидСтатьиДвиженияДенег.ДоходРасход"));
	
	Строка.ВидСтатьиДДС = Новый ФиксированныйМассив(ВидыСтатейДДС);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовуюСтатьюДДС(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	// Обрабатывает выполнение команды Создать, выбранной пользователем в списке выбора - см. СтатьяДДСДанныеВыбораКомандаСоздать()
	// Следует вызывать из обработчика ОбработкаВыбора
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Строка") Или ПустаяСтрока(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработка команды Создать списка выбора
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ДеревоБюджета.ТекущиеДанные;
	ТекущиеДанные.КартинкаСтроки = БиблиотекаКартинок.Реквизит;
	НоваяСтатьяДДС = СоздатьНоваяСтатьяДДСБыстро(ВыбранноеЗначение, ТекущиеДанные.Раздел);
	
	Если НоваяСтатьяДДС <> Неопределено Тогда
		
		ТекущиеДанные.СтатьяДДС = НоваяСтатьяДДС;
		
	Иначе
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора",     Истина);
		ПараметрыФормы.Вставить("ТекстЗаполнения", ВыбранноеЗначение);
		ОткрытьФорму("Справочник.СтатьиДвиженияДенежныхСредств.ФормаОбъекта", ПараметрыФормы, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьНоваяСтатьяДДСБыстро(Наименование, Раздел)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Наименование", Наименование);
	Если Раздел = ИмяРазделДоходы() Тогда
		ВидСтатьиДДС = Перечисления.ВидСтатьиДвиженияДенег.Доход;
	Иначе
		ВидСтатьиДДС = Перечисления.ВидСтатьиДвиженияДенег.Расход;
	КонецЕсли;
	ЗначенияЗаполнения.Вставить("ВидСтатьиДДС", ВидСтатьиДДС);
	НовыйОбъект = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
	НовыйОбъект.Заполнить(ЗначенияЗаполнения);
	
	Попытка
		НовыйОбъект.Записать();
	Исключение
		// Не является значимой проблемой, будет обработано интерактивно вызывающим кодом
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат НовыйОбъект.Ссылка;
	
КонецФункции

&НаСервереБезКонтекста
Функция СтатьяДДСДанныеВыбораКомандаСоздать(Знач ПараметрыПолученияДанных, Знач ОкончаниеВводаТекста)
	
	ДанныеВыбора = Справочники.СтатьиДвиженияДенежныхСредств.ПолучитьДанныеВыбора(ПараметрыПолученияДанных);
	
	Если Не ЗначениеЗаполнено(ДанныеВыбора) Тогда
		
		// Предложим создать - непосредственно в списке
		// Выбор пользователем этой опции обрабатывается в СоздатьНовуюСтатьюДДС
		СтрокаПоиска = СокрЛП(ПараметрыПолученияДанных.СтрокаПоиска);
		ПредставлениеНового = СтрШаблон(НСтр("ru='Создать: %1'"), СтрокаПоиска);
		ДанныеВыбора.Добавить(СтрокаПоиска, ПредставлениеНового);
		Если ОкончаниеВводаТекста Тогда
			// Добавляем вторую строку, чтобы в этом режиме не срабатывал автовыбор единственной строки.
			ДанныеВыбора.Добавить("");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеВыбора;
	
КонецФункции

&НаСервереБезКонтекста
Функция НаправленияДеятельностиДанныеВыбораКомандаСоздать(Знач ПараметрыПолученияДанных, Знач ОкончаниеВводаТекста)
	
	ДанныеВыбора = Справочники.НаправленияДеятельности.ПолучитьДанныеВыбора(ПараметрыПолученияДанных);
	
	Если Не ЗначениеЗаполнено(ДанныеВыбора) Тогда
		
		// Предложим создать - непосредственно в списке
		// Выбор пользователем этой опции обрабатывается в СоздатьНовоеНаправлениеДеятельности
		СтрокаПоиска = СокрЛП(ПараметрыПолученияДанных.СтрокаПоиска);
		ПредставлениеНового = СтрШаблон(НСтр("ru='Создать: %1'"), СтрокаПоиска);
		ДанныеВыбора.Добавить(СтрокаПоиска, ПредставлениеНового);
		Если ОкончаниеВводаТекста Тогда
			// Добавляем вторую строку, чтобы в этом режиме не срабатывал автовыбор единственной строки.
			ДанныеВыбора.Добавить("");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеВыбора;
	
КонецФункции

&НаКлиенте
Процедура СоздатьНовоеНаправлениеДеятельности(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	// Обрабатывает выполнение команды Создать, выбранной пользователем в списке выбора - см. НаправленияДеятельностиДанныеВыбораКомандаСоздать()
	// Следует вызывать из обработчика ОбработкаВыбора
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Строка") Или ПустаяСтрока(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработка команды Создать списка выбора
	СтандартнаяОбработка = Ложь;
	
	НовоеНаправлениеДеятельности = СоздатьНовоеНаправлениеДеятельностиБыстро(ВыбранноеЗначение);
	ТекущиеДанные = Элементы.ДеревоБюджета.ТекущиеДанные;
	Если НовоеНаправлениеДеятельности <> Неопределено Тогда
		
		ТекущиеДанные.НаправлениеДеятельности = НовоеНаправлениеДеятельности;
		ЗаполнитьСтрокуНаправленияДеятельности(ТекущиеДанные);
		
	Иначе
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора",     Истина);
		ПараметрыФормы.Вставить("ТекстЗаполнения", ВыбранноеЗначение);
		ОткрытьФорму("Справочник.НаправленияДеятельности.ФормаОбъекта", ПараметрыФормы, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьНовоеНаправлениеДеятельностиБыстро(Наименование)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Наименование", Наименование);
	
	НовыйОбъект = Справочники.НаправленияДеятельности.СоздатьЭлемент();
	НовыйОбъект.Заполнить(ЗначенияЗаполнения);
	
	Попытка
		НовыйОбъект.Записать();
	Исключение
		// Не является значимой проблемой, будет обработано интерактивно вызывающим кодом
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат НовыйОбъект.Ссылка;
	
КонецФункции

#КонецОбласти

#Область ЗаписатьДанные

&НаКлиенте
Процедура ЗаписатьДанные(Отказ = Ложь)

	ЗаписатьДанныеВОбработку();
	Если ПроверитьЗаполнение() Тогда
		ЗаписатьДанныеВДокументНаСервере();
		Модифицированность = Ложь;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанныеВОбработку()
	
	Для Каждого Строка Из ДеревоБюджета.ПолучитьЭлементы() Цикл
		Если Строка.Раздел = ИмяРазделОстатокНачало() Тогда
			ЗаписатьОстатокНаНачало(Строка);
		ИначеЕсли Строка.Раздел = ИмяРазделДоходы() Тогда
			ЗаписатьДоходы(Строка);
		ИначеЕсли Строка.Раздел = ИмяРазделРасходы() Тогда
			ЗаписатьРасходы(Строка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОстатокНаНачало(РазделОстатокНаНачало)
	
	Объект.ОстатокНаНачало = РазделОстатокНаНачало.СуммаГод;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДоходы(РазделДоходы)
	
	Объект.Доходы.Очистить();
	Объект.СтруктураДоходов.Очистить();
	
	ЗаписатьСтруктуруДоходов(РазделДоходы);
	ЗаписатьСтрокиДохода(РазделДоходы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСтрокиДохода(Строка)
	
	Для Каждого СтрокаДохода Из Строка.ПолучитьЭлементы() Цикл
		Если Не СтрокаДохода.ЭтоСтатьяДДС Тогда
			Продолжить;
		КонецЕсли;
		
		// Итоговая сумма
		НоваяСтрока              = Объект.Доходы.Добавить();
		НоваяСтрока.СтатьяДохода = СтрокаДохода.СтатьяДДС;
		НоваяСтрока.ЭтоГруппа    = СтрокаДохода.ЭтоГруппаСтатей;
		НоваяСтрока.Сумма        = СтрокаДохода.СуммаГод;
		
		// Сумма по детализации
		Для Каждого КолонкаДетализации Из КолонкиДетализации Цикл
			НоваяСтрока                  = Объект.Доходы.Добавить();
			НоваяСтрока.ДатаПланирования = КолонкаДетализации.Дата;
			НоваяСтрока.СтатьяДохода     = СтрокаДохода.СтатьяДДС;
			НоваяСтрока.ЭтоГруппа        = СтрокаДохода.ЭтоГруппаСтатей;
			НоваяСтрока.Сумма            = СтрокаДохода[КолонкаДетализации.ИмяКолонки];
		КонецЦикла;
		
		Если СтрокаДохода.ЭтоГруппаСтатей Тогда
			ЗаписатьСтрокиДохода(СтрокаДохода);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСтруктуруДоходов(Строка, Родитель = Неопределено)

	Для Каждого СтрокаДохода Из Строка.ПолучитьЭлементы() Цикл
		Если Не СтрокаДохода.ЭтоСтатьяДДС Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока              = Объект.СтруктураДоходов.Добавить();
		НоваяСтрока.СтатьяДохода = СтрокаДохода.СтатьяДДС;
		НоваяСтрока.Родитель     = Родитель;
		НоваяСтрока.ЭтоГруппа    = СтрокаДохода.ЭтоГруппаСтатей;
		
		Если СтрокаДохода.ЭтоГруппаСтатей Тогда
			НовыйРодитель = СтрокаДохода.СтатьяДДС;
			ЗаписатьСтруктуруДоходов(СтрокаДохода, НовыйРодитель);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСтруктуруРасходовПоНаправлениюДеятельности(НаправлениеДеятельности, Строка, Родитель = Неопределено)
	
	Если Строка.ПолучитьЭлементы().Количество() = 0 Тогда
		// Статей по направлению деятельности нет, но все равно запишем структуру
		НоваяСтрока = Объект.СтруктураРасходов.Добавить();
		НоваяСтрока.НаправлениеДеятельности = НаправлениеДеятельности;
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаРасхода Из Строка.ПолучитьЭлементы() Цикл
		Если Не СтрокаРасхода.ЭтоСтатьяДДС Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.СтруктураРасходов.Добавить();
		НоваяСтрока.НаправлениеДеятельности = НаправлениеДеятельности;
		НоваяСтрока.СтатьяРасхода           = СтрокаРасхода.СтатьяДДС;
		НоваяСтрока.Родитель                = Родитель;
		НоваяСтрока.ЭтоГруппа               = СтрокаРасхода.ЭтоГруппаСтатей;
		
		Если СтрокаРасхода.ЭтоГруппаСтатей Тогда
			НовыйРодитель = СтрокаРасхода.СтатьяДДС;
			ЗаписатьСтруктуруРасходовПоНаправлениюДеятельности(НаправлениеДеятельности, СтрокаРасхода, НовыйРодитель);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьРасходы(РазделРасходы)
	
	Объект.РасходыПоНаправлениямДеятельности.Очистить();
	Объект.Расходы.Очистить();
	Объект.СтруктураРасходов.Очистить();
	
	ЗаписатьСтруктуруРасходов(РазделРасходы);
	ЗаписатьСтрокиРасходов(РазделРасходы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСтруктуруРасходов(Строка)

	Для Каждого СтрокаНаправленияДеятельности Из Строка.ПолучитьЭлементы() Цикл
		Если Не СтрокаНаправленияДеятельности.ЭтоНаправлениеДеятельности Тогда
			Продолжить;
		КонецЕсли;
		НаправлениеДеятельности = СтрокаНаправленияДеятельности.НаправлениеДеятельности;
		ЗаписатьСтруктуруРасходовПоНаправлениюДеятельности(НаправлениеДеятельности, СтрокаНаправленияДеятельности);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСтрокиРасходов(Строка)
	
	Для Каждого СтрокаНаправленияДеятельности Из Строка.ПолучитьЭлементы() Цикл
		Если Не СтрокаНаправленияДеятельности.ЭтоНаправлениеДеятельности Тогда
			Продолжить;
		КонецЕсли;
		
		// Итоговая сумма
		НоваяСтрока = Объект.РасходыПоНаправлениямДеятельности.Добавить();
		НоваяСтрока.НаправлениеДеятельности = СтрокаНаправленияДеятельности.НаправлениеДеятельности;
		НоваяСтрока.Сумма                   = СтрокаНаправленияДеятельности.СуммаГод;
		
		// Сумма по детализации
		Для Каждого КолонкаДетализации Из КолонкиДетализации Цикл
			НоваяСтрока                         = Объект.РасходыПоНаправлениямДеятельности.Добавить();
			НоваяСтрока.ДатаПланирования        = КолонкаДетализации.Дата;
			НоваяСтрока.НаправлениеДеятельности = СтрокаНаправленияДеятельности.НаправлениеДеятельности;
			НоваяСтрока.Сумма                   = СтрокаНаправленияДеятельности[КолонкаДетализации.ИмяКолонки];
		КонецЦикла;
		
		НаправлениеДеятельности = СтрокаНаправленияДеятельности.НаправлениеДеятельности;
		ЗаписатьСтрокиРасходаПоНаправлениюДеятельности(СтрокаНаправленияДеятельности, НаправлениеДеятельности);
			
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСтрокиРасходаПоНаправлениюДеятельности(Строка, НаправлениеДеятельности)
	
	Для Каждого СтрокаРасхода Из Строка.ПолучитьЭлементы() Цикл
		Если Не СтрокаРасхода.ЭтоСтатьяДДС Тогда
			Продолжить;
		КонецЕсли;
		
		// Итоговая сумма
		НоваяСтрока                         = Объект.Расходы.Добавить();
		НоваяСтрока.НаправлениеДеятельности = НаправлениеДеятельности;
		НоваяСтрока.СтатьяРасхода           = СтрокаРасхода.СтатьяДДС;
		НоваяСтрока.ЭтоГруппа               = СтрокаРасхода.ЭтоГруппаСтатей;
		НоваяСтрока.Сумма                   = СтрокаРасхода.СуммаГод;
		
		// Сумма по детализации
		Для Каждого КолонкаДетализации Из КолонкиДетализации Цикл
			НоваяСтрока                         = Объект.Расходы.Добавить();
			НоваяСтрока.ДатаПланирования        = КолонкаДетализации.Дата;
			НоваяСтрока.НаправлениеДеятельности = НаправлениеДеятельности;
			НоваяСтрока.СтатьяРасхода           = СтрокаРасхода.СтатьяДДС;
			НоваяСтрока.ЭтоГруппа               = СтрокаРасхода.ЭтоГруппаСтатей;
			НоваяСтрока.Сумма                   = СтрокаРасхода[КолонкаДетализации.ИмяКолонки];
		КонецЦикла;
		
		Если СтрокаРасхода.ЭтоГруппаСтатей Тогда
			ЗаписатьСтрокиРасходаПоНаправлениюДеятельности(СтрокаРасхода, НаправлениеДеятельности);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеВДокументНаСервере()
	
	Если ДокументСсылка.Пустая() Тогда
		ДокументОбъект = Документы.Бюджет.СоздатьДокумент();
	Иначе
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Объект);
	ДокументОбъект.Доходы.Загрузить(Объект.Доходы.Выгрузить());
	ДокументОбъект.СтруктураДоходов.Загрузить(Объект.СтруктураДоходов.Выгрузить());
	ДокументОбъект.РасходыПоНаправлениямДеятельности.Загрузить(Объект.РасходыПоНаправлениямДеятельности.Выгрузить());
	ДокументОбъект.Расходы.Загрузить(Объект.Расходы.Выгрузить());
	ДокументОбъект.СтруктураРасходов.Загрузить(Объект.СтруктураРасходов.Выгрузить());
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ДокументСсылка = ДокументОбъект.Ссылка;
	
КонецПроцедуры

#КонецОбласти

#Область Итоги

&НаСервере
Процедура РассчитатьИтогиПоВсемРазделам()
	
	РазделДоходы        = ДеревоБюджета.НайтиПоИдентификатору(ИдентификаторДоходы);
	РазделРасходы       = ДеревоБюджета.НайтиПоИдентификатору(ИдентификаторРасходы);
	РазделОстатокНачало = ДеревоБюджета.НайтиПоИдентификатору(ИдентификаторОстатокНачало);
	РазделОстатокКонец  = ДеревоБюджета.НайтиПоИдентификатору(ИдентификаторОстатокКонец);
	
	РассчитатьИтогиПоРазделу(РазделДоходы, КолонкиДетализации);
	Для Каждого СтрокаНаправленияДеятельности Из РазделРасходы.ПолучитьЭлементы() Цикл
		РассчитатьИтогиПоРазделу(СтрокаНаправленияДеятельности, КолонкиДетализации);
	КонецЦикла;
	РассчитатьИтогиПоРазделу(РазделРасходы, КолонкиДетализации);
	
	РассчитатьОстатки(РазделОстатокНачало, РазделОстатокКонец, РазделДоходы, РазделРасходы, КолонкиДетализации);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСуммуЗаГодПоСтроке(Строка, КолонкиДетализации)
	
	СуммаГод = 0;
	Для Каждого Колонка Из КолонкиДетализации Цикл
		СуммаГод = СуммаГод + Строка[Колонка.ИмяКолонки];
	КонецЦикла;
	
	Строка.СуммаГод = СуммаГод;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтоги(Элемент)
	
	ТекущиеДанные       = Элементы.ДеревоБюджета.ТекущиеДанные;
	РазделДоходы        = ДеревоБюджета.НайтиПоИдентификатору(ИдентификаторДоходы);
	РазделРасходы       = ДеревоБюджета.НайтиПоИдентификатору(ИдентификаторРасходы);
	РазделОстатокКонец  = ДеревоБюджета.НайтиПоИдентификатору(ИдентификаторОстатокКонец);
	РазделОстатокНачало = ДеревоБюджета.НайтиПоИдентификатору(ИдентификаторОстатокНачало);
	
	Если ТекущиеДанные.Раздел = ИмяРазделДоходы() Тогда
		РассчитатьСуммуЗаГодПоСтроке(ТекущиеДанные, КолонкиДетализации);
		Родитель = ТекущиеДанные.ПолучитьРодителя();
		Пока Родитель <> РазделДоходы Цикл
			РассчитатьИтогиПоРазделу(Родитель, КолонкиДетализации);
			Родитель = Родитель.ПолучитьРодителя();
		КонецЦикла;
		РассчитатьИтогиПоРазделу(РазделДоходы, КолонкиДетализации);
	ИначеЕсли ТекущиеДанные.ЭтоНаправлениеДеятельности Тогда
		РассчитатьИтогиПоРазделу(РазделРасходы, КолонкиДетализации);
	ИначеЕсли ТекущиеДанные.ЭтоСтатьяДДС Тогда
		РассчитатьСуммуЗаГодПоСтроке(ТекущиеДанные, КолонкиДетализации);
		Родитель = ТекущиеДанные.ПолучитьРодителя();
		Пока Родитель <> РазделРасходы Цикл
			РассчитатьИтогиПоРазделу(Родитель, КолонкиДетализации);
			Родитель = Родитель.ПолучитьРодителя();
		КонецЦикла;
		РассчитатьИтогиПоРазделу(РазделРасходы, КолонкиДетализации);
	КонецЕсли;
	
	РассчитатьОстатки(РазделОстатокНачало, РазделОстатокКонец, РазделДоходы, РазделРасходы, КолонкиДетализации);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьОстатки(РазделОстатокНачало, РазделОстатокКонец, РазделДоходы, РазделРасходы, КолонкиДетализации)
	
	// Остатки по детализации считаются накопительным итогом
	ПредыдущийОстаток = 0;
	Остаток           = 0;
	
	ПерваяКолонка = Истина;
	Для Каждого Колонка Из КолонкиДетализации Цикл
		ИмяКолонки = Колонка.ИмяКолонки;
		Если ПерваяКолонка Тогда
			ПерваяКолонка = Ложь;
			ПредыдущийОстаток = РазделОстатокНачало[ИмяКолонки];
			РазделОстатокНачало.СуммаГод = ПредыдущийОстаток;
		Иначе
			РазделОстатокНачало[ИмяКолонки] = ПредыдущийОстаток;
		КонецЕсли;
		
		Остаток = ПредыдущийОстаток + РазделДоходы[ИмяКолонки] - РазделРасходы[ИмяКолонки];
		РазделОстатокКонец[ИмяКолонки] = Остаток;
		ПредыдущийОстаток = Остаток;
	КонецЦикла;
	
	РазделОстатокКонец.СуммаГод = РазделОстатокНачало.СуммаГод + РазделДоходы.СуммаГод - РазделРасходы.СуммаГод;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьИтогиПоРазделу(Раздел, КолонкиДетализации)
	
	// Очистим суммы
	Раздел.СуммаГод = 0;
	Для Каждого Колонка Из КолонкиДетализации Цикл
		Раздел[Колонка.ИмяКолонки] = 0;
	КонецЦикла;
	
	// Заполним суммы
	Для Каждого Строка Из Раздел.ПолучитьЭлементы() Цикл
		Раздел.СуммаГод = Раздел.СуммаГод + Строка.СуммаГод;
		СуммаДетализации = 0;
		Для Каждого Колонка Из КолонкиДетализации Цикл
			ИмяКолонки = Колонка.ИмяКолонки;
			Раздел[ИмяКолонки] = Раздел[ИмяКолонки] + Строка[ИмяКолонки];
			СуммаДетализации = СуммаДетализации + Раздел[ИмяКолонки];
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьИтогиПоВсемСтрокам()
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоБюджета");
	ДеревоЗначений.Колонки.Удалить(ДеревоЗначений.Колонки.Найти("СуммаГод"));
	ДеревоЗначений.Колонки.Добавить("СуммаГод", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2), "Год", 10);
	ЗначениеВРеквизитФормы(ДеревоЗначений, "ДеревоБюджета");
	
	РазделыБюджета  = ДеревоБюджета.ПолучитьЭлементы();
	Для Каждого СтрокаРазделБюджета Из РазделыБюджета Цикл
		Если СтрокаРазделБюджета.Раздел = ИмяРазделОстатокНачало() Тогда
			ИдентификаторОстатокНачало = СтрокаРазделБюджета.ПолучитьИдентификатор();
		ИначеЕсли СтрокаРазделБюджета.Раздел = ИмяРазделДоходы() Тогда
			ИдентификаторДоходы  = СтрокаРазделБюджета.ПолучитьИдентификатор();
		ИначеЕсли СтрокаРазделБюджета.Раздел = ИмяРазделРасходы() Тогда
			ИдентификаторРасходы  = СтрокаРазделБюджета.ПолучитьИдентификатор();
		ИначеЕсли СтрокаРазделБюджета.Раздел = ИмяРазделОстатокКонец() Тогда
			ИдентификаторОстатокКонец  = СтрокаРазделБюджета.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаЗаполнения

&НаСервере
Процедура ПроверитьБюджетНаНезаполненныеЭлементы(Отказ)
	
	// Доходы
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("СтатьяДохода", Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());
	ТаблицаДоходы = Объект.Доходы.Выгрузить(ПараметрыОтбора, "СтатьяДохода");
	
	Если ТаблицаДоходы.Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru='В разделе ""Финансирование"" есть незаполненные статьи'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ДеревоБюджета" , , Отказ);
	КонецЕсли;
	
	// Направления деятельности
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("НаправлениеДеятельности", Справочники.НаправленияДеятельности.ПустаяСсылка());
	ТаблицаНаправленияДеятельности = Объект.РасходыПоНаправлениямДеятельности.Выгрузить(
		ПараметрыОтбора, "НаправлениеДеятельности");
	
	Если ТаблицаНаправленияДеятельности.Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru='В разделе ""Расходы"" есть незаполненные направления деятельности'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ДеревоБюджета" , , Отказ);
	КонецЕсли;
	
	// Расходы
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("СтатьяРасхода", Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());
	ТаблицаРасходы = Объект.Расходы.Выгрузить(ПараметрыОтбора, "НаправлениеДеятельности, СтатьяРасхода");
	ТаблицаРасходы.Свернуть("НаправлениеДеятельности");
	
	Для Каждого СтрокаРасходы Из ТаблицаРасходы Цикл
		ШаблонСообщения = НСтр("ru='В разделе ""Расходы"" есть незаполненные статьи для направления деятельности ""%1""'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаРасходы["НаправлениеДеятельности"]);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ДеревоБюджета" , , Отказ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьТаблицуНаДублирующиеЭлементы(ТаблицаОбъекта, ИмяКолонки, ШаблонСообщения, Отказ)
	
	Таблица = ТаблицаОбъекта.Выгрузить(Новый Структура("ДатаПланирования", Дата(1, 1, 1)));
	Таблица.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	Таблица.ЗаполнитьЗначения(1, "Количество"); // Количество строк с этим элементом.
	Таблица.Свернуть(ИмяКолонки, "Количество");
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		// Если элемент встречается несколько раз, то расскажем об этом пользователю.
		Если СтрокаТаблицы.Количество > 1 Тогда
			ЧислоРаз = СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(
				СтрокаТаблицы.Количество, "раз, раза, раз");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаТаблицы[ИмяКолонки], ЧислоРаз);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ДеревоБюджета" , , Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьРасходыНаДублирующиеЭлементы(Отказ)
	
	Таблица = Объект.СтруктураРасходов.Выгрузить();
	Таблица.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	Таблица.ЗаполнитьЗначения(1, "Количество"); // Количество строк с этой статьей затрат.
	Таблица.Свернуть("НаправлениеДеятельности, СтатьяРасхода", "Количество");
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы["НаправлениеДеятельности"]) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы["СтатьяРасхода"]) Тогда
			Продолжить;
		КонецЕсли;
		
		// Если элемент встречается несколько раз, то расскажем об этом пользователю.
		Если СтрокаТаблицы.Количество > 1 Тогда
			ШаблонСообщения = НСтр("ru='Статья ""%1"" указана %2 для направления деятельности ""%3""'");
			ЧислоРаз = СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(
				СтрокаТаблицы.Количество, "раз, раза, раз");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаТаблицы["СтатьяРасхода"], ЧислоРаз, СтрокаТаблицы["НаправлениеДеятельности"]);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ДеревоБюджета" , , Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Идентификаторы

&НаКлиентеНаСервереБезКонтекста
Функция ИмяРазделОстатокНачало()
	
	Возврат НСтр("ru='Остаток на начало'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяРазделДоходы()
	
	Возврат НСтр("ru='Финансирование'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяРазделРасходы()
	
	Возврат НСтр("ru='Расходы'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяРазделОстатокКонец()

	Возврат НСтр("ru='Остаток на конец'");

КонецФункции

#КонецОбласти

#Область ВыгрузкаExcel  
&НаКлиенте
Процедура ПередВыгрузкойИЗагрузкойИзФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Отказ = Ложь;
		ЗаписатьДанные(Отказ); 
		Если ДополнительныеПараметры.Команда = "Выгрузить" Тогда 
			Оповещение = Новый ОписаниеОповещения("ВыгрузитьВExcelПриПодключенииРасширения", ЭтотОбъект);
		Иначе
			Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзExcelПриПодключенииРасширения", ЭтотОбъект);
		КонецЕсли;
		ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботы1СПредприятия(Оповещение);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВExcelПриПодключенииРасширения(РасширениеПодключено, ДополнительныеПараметры) Экспорт
	
	ИмяФайла = НСтр("ru = 'Бюджет.xls'");
	Если РасширениеПодключено Тогда
		// Вариант для установленного расширения для работы с файлами
		ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогСохраненияФайла.ПолноеИмяФайла = ИмяФайла;
		ДиалогСохраненияФайла.Фильтр = НСтр("ru = 'Лист Excel|*.xls; *.xlsx'");
		ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
		ДиалогСохраненияФайла.Заголовок = НСтр("ru = 'Укажите файл сохранения бюджета в Excel'"); 
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьВExcelПриПодключенииРасширенияПродолжение", ЭтотОбъект); 
		ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(ОписаниеОповещения, ДиалогСохраненияФайла);		
	Иначе
		// Веб клиент без расширения для работы с файлами 
		АдресВоВременномХранилище = УникальныйИдентификатор;
		СохранитьТабличныйДокументВоВременноеХранилище(АдресВоВременномХранилище);
		ПараметрыСохраненияФайла = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();  
		ФайловаяСистемаКлиент.СохранитьФайл(Неопределено, АдресВоВременномХранилище,
			ИмяФайла, ПараметрыСохраненияФайла);
	КонецЕсли;		
КонецПроцедуры  

&НаСервере
Процедура СохранитьТабличныйДокументВоВременноеХранилище(АдресВоВременномХранилище)
	
	ТабличныйДокумент = ТабличныйДокументДляВыгрузкиВExcel(Объект, КолонкиДетализации); 
		
	ИмяФайла = ПолучитьИмяВременногоФайла("xls");
	ТабличныйДокумент.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	ФайловаяСистема.УдалитьВременныйФайл(ИмяФайла);

КонецПроцедуры 

&НаКлиенте
Процедура ВыгрузитьВExcelПриПодключенииРасширенияПродолжение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайла = РезультатВыбора[0];
		
	ТабличныйДокумент = ТабличныйДокументДляВыгрузкиВExcel(Объект, КолонкиДетализации);
	
	ТабличныйДокумент.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.xls);  
	ДополнительныеПараметры  = Новый Структура("Файл", ИмяФайла);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьВExcelЗавершение", ЭтотОбъект, ДополнительныеПараметры); 
	ТекстСообщения = НСтр("ru='Выгрузка данных бюджета успешно завершена!'");
	ПоказатьОповещениеПользователя(ТекстСообщения, ОписаниеОповещения, НСтр("ru='Открыть файл'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзExcelПриПодключенииРасширения(РасширениеПодключено, ДополнительныеПараметры) Экспорт
	
	Если Не Объект.Утвержден Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьИзExcelЗавершение", ЭтотОбъект);
		
		ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
		ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
		ПараметрыЗагрузки.Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ПараметрыЗагрузки.Диалог.Фильтр = НСтр("ru = 'Лист Excel|*.xls; *.xlsx'");
		
		ФайловаяСистемаКлиент.ЗагрузитьФайл(ОписаниеОповещения, ПараметрыЗагрузки);	
	Иначе 
		ОписаниеОповещения = Новый ОписаниеОповещения("СозданиеКорректировкиБюджета", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Бюджет утвержден, хотите создать корректировку бюджета?'"); 
		КнопкиОтвета = Новый СписокЗначений;
		КнопкиОтвета.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Да, создать корректировку'"));
		КнопкиОтвета.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Нет'"));
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, КнопкиОтвета);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТабличныйДокументДляВыгрузкиВExcel(Знач Объект, Знач КолонкиДетализации)
	
	Возврат Документы.Бюджет.ТабличныйДокументДляВыгрузкиВExcel(Объект, КолонкиДетализации);
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВExcelЗавершение(ДополнительныеПараметры) Экспорт
	
	ФайловаяСистемаКлиент.ОткрытьФайл(ДополнительныеПараметры.Файл);

КонецПроцедуры   

&НаКлиенте
Процедура СозданиеКорректировкиБюджета(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьИзExcelЗавершение", ЭтотОбъект);	
		ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
		ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
		ПараметрыЗагрузки.Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ПараметрыЗагрузки.Диалог.Фильтр = НСтр("ru = 'Лист Excel|*.xls; *.xlsx'");
		
		ФайловаяСистемаКлиент.ЗагрузитьФайл(ОписаниеОповещения, ПараметрыЗагрузки);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияЗагрузкиФайлаНаСервере(Знач АдресФайла, Знач РасширениеФайла, Знач ИдентификаторФормы)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
	ХранилищеДанных = Новый ХранилищеЗначения(ДвоичныеДанные);
	УдалитьИзВременногоХранилища(АдресФайла); 
		
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("РасширениеФайла", РасширениеФайла);
	ПараметрыЗадания.Вставить("ХранилищеДанныхФайла", ХранилищеДанных); 
	ПараметрыЗадания.Вставить("ДокументБюджета", ДокументСсылка);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка данных файла в бюджет.'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.ЗагрузкаБюджетаИзФайла.ВыполнитьЗагрузкуФайлаВФоне",
		ПараметрыЗадания, ПараметрыВыполнения);
	
КонецФункции 
	
&НаКлиенте
Процедура ЗагрузитьИзExcelЗавершение(Результат, ДополнительныеПараметры) Экспорт

    Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	РасширениеФайла = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(Результат.Имя);
		
	ДлительнаяОперация = ДлительнаяОперацияЗагрузкиФайлаНаСервере(Результат.Хранение, РасширениеФайла, УникальныйИдентификатор);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ДополнительныеПараметры = Новый Структура("АдресФайла, РасширениеФайла", Результат.Хранение, РасширениеФайла); 
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыполнитьЗагрузкуФайлаСерверЗавершение", ЭтотОбъект, ДополнительныеПараметры);	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
        
КонецПроцедуры 

&НаКлиенте
Процедура ВыполнитьЗагрузкуФайлаСерверЗавершение(ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	
	ЗагруженныеДанные = ЗагруженныеДанныеХранилища(ДлительнаяОперация.АдресРезультата);	
	
	Если ЗначениеЗаполнено(ЗагруженныеДанные.Ошибки) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("АдресФайла", ДополнительныеПараметры.АдресФайла);
		ПараметрыФормы.Вставить("ТабличныйДокумент", ЗагруженныеДанные.ТабличныйДокумент);
		ПараметрыФормы.Вставить("Документ", ДокументСсылка); 
		ОткрытьФорму("Обработка.ЗагрузкаБюджетаИзФайла.Форма", ПараметрыФормы, ЭтотОбъект);
	Иначе
		Если Объект.Утвержден Тогда
			ПараметрыФормы = Новый Структура("ДокументСсылка", ЗагруженныеДанные.ДокументКорректировки); 
			ОткрытьФорму("Обработка.КорректировкаБюджета.Форма.Форма", ПараметрыФормы);
			Оповестить("Запись_КорректировкаБюджета", , ЗагруженныеДанные.ДокументКорректировки);	
		Иначе
			Оповестить("Запись_КорректировкаБюджета", , ДокументСсылка);
		КонецЕсли;

		ПоказатьОповещениеПользователя(НСтр("ru = 'Загрузка бюджета успешно произведена.'"), , , БиблиотекаКартинок.ВыполненоУспешно);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция  ЗагруженныеДанныеХранилища(АдресРезультата)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Возврат ЗагруженныеДанные; 

КонецФункции
#КонецОбласти

&НаКлиенте
Процедура ОтправитьПоЭлектроннойПочтеНастройкаУчетнойЗаписиПредложена(УчетнаяЗаписьНастроена, ДополнительныеПараметры) Экспорт
	
	Если УчетнаяЗаписьНастроена <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПисьма = РаботаСПочтовымиСообщениямиКлиент.ПараметрыОтправкиПисьма();
	ПараметрыПисьма.Получатель = "bp@1c.ru";
	ПараметрыПисьма.Тема = НСтр("ru = 'Отзыв о функциональности ""Бюджет денежных средств""'");
	
	РаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыПисьма);
	
КонецПроцедуры
#КонецОбласти