
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ВнесениеИзмененийВПатент = Истина;
	
	ПодготовитьДанныеПередОткрытием();
	
	УправлениеФормой(ЭтотОбъект);
	
	// ИнтернетПоддержкаПользователей.Новости.КонтекстныеНовости_ПриСозданииНаСервере
	ИдентификаторыСобытийПриОткрытии = "ПриОткрытии";
	ОбработкаНовостейПереопределяемый.КонтекстныеНовости_ПриСозданииНаСервере(
		ЭтотОбъект,
		"БП.Обработка.ПолучениеПатента",
		"ВнесениеИзмененийВПатент",
		НСтр("ru='Новости: Получение Патента'"),
		ИдентификаторыСобытийПриОткрытии);
	// Конец ИнтернетПоддержкаПользователей.Новости.КонтекстныеНовости_ПриСозданииНаСервере
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Оповестить("ПолучениеПатента_ОткрытПомощник", , ЭтотОбъект);
	
	// ИнтернетПоддержкаПользователей.Новости.ПриОткрытии
	ОбработкаНовостейКлиент.КонтекстныеНовости_ПриОткрытии(ЭтотОбъект);
	// Конец ИнтернетПоддержкаПользователей.Новости.ПриОткрытии

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ТипЗнч(ИсточникВыбора) = Тип("ФормаКлиентскогоПриложения") Тогда
		
		Если ИсточникВыбора.ИмяФормы = ИмяФормыИзмененияКоличестваСотрудников() Тогда
			ОбработатьИзмененияКоличестваСотрудников(ВыбранноеЗначение);
		ИначеЕсли ИсточникВыбора.ИмяФормы = ИмяФормыИзмененияФизическихПоказателей() Тогда
			ОбработатьИзмененияФизическихПоказателей(ВыбранноеЗначение);
		ИначеЕсли ИсточникВыбора.ИмяФормы = ИмяФормыВыбораПредставителя()
			И ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
			Модифицированность = Истина;
			ЗаполнитьЗначенияСвойств(РегистрацияВНалоговомОргане, ВыбранноеЗначение);
			ПредставлениеПредставителя = ВыбранноеЗначение.Представитель;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если Источник = ЭтотОбъект Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоСобытиеОтправкиЗаявленияВНалоговую(ИмяСобытия, Параметр) Тогда
		
		ОбработатьИзменениеСтатусаЗаявления();
		
	ИначеЕсли ИмяСобытия = "ПолучениеПатента_ОткрытВыборВидаЗаявления" Тогда
		
		Закрыть();
		
	КонецЕсли;
	
	// ИнтернетПоддержкаПользователей.Новости.ОбработкаОповещения
	ОбработкаНовостейКлиент.КонтекстныеНовости_ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец ИнтернетПоддержкаПользователей.Новости.ОбработкаОповещения
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	Если ДатаСоставления > СрокСдачиЗаявленияНаВнесениеИзменений(Объект.ДатаНачала) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Дата изменения должна быть не более чем за 10 рабочих дней до даты подачи заявления'"), ,
			"ДатаНачала", "Объект", Отказ);
	КонецЕсли;
		
	Если СпособПодачиДокументов = 1 И Не ЗначениеЗаполнено(РегистрацияВНалоговомОргане.Представитель) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Представитель не заполнен'"), , "ПредставлениеПредставителя", , Отказ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	Если НавигационнаяСсылкаФорматированнойСтроки = "АдресИРеквизитыИнспекции" Тогда
		
		СтандартнаяОбработка = Ложь;
		ОрганизацииФормыКлиент.ПерейтиКСервисуОпределитьРеквизитыИФНС();
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "СписокПатентов" Тогда
		
		СтандартнаяОбработка = Ложь;
		Отбор = Новый Структура("Организация", Организация);
		ПараметрыФормы = Новый Структура("Отбор, Период", Отбор, Объект.ДатаНачала);
		ОткрытьФорму("Документ.ОперацияСПатентом.ФормаСписка", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если ЗавершениеРаботы И Модифицированность Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Модифицированность И Не ВызовИзПомощника Тогда
		
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗакрытиемФормы", ЭтотОбъект);
		
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Данные изменены. Сохранить заявление?'"), Режим);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИзменитьКоличествоСотрудниковНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КоличествоСотрудников", Объект.КоличествоСотрудников);
	ПараметрыФормы.Вставить("КоличествоСотрудниковДоИзменения", КоличествоСотрудниковДоИзменения);
	
	ОткрытьФорму(ИмяФормыИзмененияКоличестваСотрудников(), ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАдресаНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = НовыеПараметрыИзмененияФизическихПоказателей("Адреса");
	ПараметрыФормы.Заголовок = НСтр("ru = 'Новый список адресов осуществления деятельности'");
	
	ОткрытьФорму(ИмяФормыИзмененияФизическихПоказателей(), ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОбъектыНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = НовыеПараметрыИзмененияФизическихПоказателей("Объекты");
	ПараметрыФормы.Заголовок = НСтр("ru = 'Новый список объектов'");
	
	ОткрытьФорму(ИмяФормыИзмененияФизическихПоказателей(), ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТранспортныеСредстваНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = НовыеПараметрыИзмененияФизическихПоказателей("ТранспортныеСредства");
	ПараметрыФормы.Заголовок = НСтр("ru = 'Новый список транспортных средств'");
	
	ОткрытьФорму(ИмяФормыИзмененияФизическихПоказателей(), ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура СпособПодачиДокументовПриИзменении(Элемент)

	ОбновитьСведенияОПредставителе();

КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПредставителяНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ЗначенияЗаполнения = Новый Структура(
		"Владелец, Представитель, УполномоченноеЛицоПредставителя, ДокументПредставителя, Доверенность");
	
	ЗаполнитьЗначенияСвойств(ЗначенияЗаполнения, РегистрацияВНалоговомОргане);
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму(ИмяФормыВыбораПредставителя(), ПараметрыФормы, ЭтотОбъект, КлючУникальности);

КонецПроцедуры

&НаКлиенте
Процедура СпособСдачиОтчетностиПриИзменении(Элемент)

	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура НалоговаяИнспекцияАдресНаКартеНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	УправлениеКонтактнойИнформациейКлиентБП.ПоказатьНаКартеНажатие(ЭтотОбъект, Элемент, НалоговаяИнспекцияАдрес);

КонецПроцедуры

&НаКлиенте
Процедура ЛичныйВизитКонтактыГосорганов_ФНС_АдресНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	УправлениеКонтактнойИнформациейКлиентБП.ПоказатьНаКартеНажатие(ЭтотОбъект, Элемент, НалоговаяИнспекцияАдрес);

КонецПроцедуры

&НаКлиенте
Процедура КартинкаЗаявлениеНаПолучениеПатентаНажатие(Элемент)

	ОткрытьЗаявлениеНаПолучениеПатента();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаДалее(Команда)

	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДополнительно;
	
	УправлениеФормой(ЭтотОбъект);
	СформироватьЗаявлениеНаПолучениеПатента();

КонецПроцедуры

&НаКлиенте
Процедура ЗаявлениеНаПолучениеПатента(Команда)

	ОткрытьЗаявлениеНаПолучениеПатента();

КонецПроцедуры

&НаКлиенте
Процедура Подключить1СОтчетность(Команда)

	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьФормуМастераЗаявленияНаПодключение(
		Организация, , , , , , Истина);

КонецПроцедуры

&НаКлиенте
Процедура Открыть1СОтчетность(Команда)

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("Раздел", ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Уведомления"));
	ПараметрыФормы.Вставить("ВидУведомления",
		ПредопределенноеЗначение("Перечисление.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеНаПолучениеПатентаРекомендованнаяФорма"));
	
	ОткрытьФорму("ОбщаяФорма.РегламентированнаяОтчетность", ПараметрыФормы, , "1С-Отчетность");

КонецПроцедуры

&НаКлиенте
Процедура КомандаНазадДополнительно(Команда)

	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОсновное;

КонецПроцедуры

&НаКлиенте
Процедура КомандаГотово(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда)

	ПерейтиНазадВПомощникВыбораВидаЗаявления();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьДанныеПередОткрытием()
	
	Организация = Параметры.Организация;
	СсылкаНаДокумент = Параметры.Ключ;
	Патент = Параметры.Патент;
	ВызовИзПомощника = Параметры.ВызовИзПомощника;
	
	ТекущаяДатаПользователя = ОбщегоНазначения.ТекущаяДатаПользователя();
	ДатаСоставления = ТекущаяДатаПользователя;
	Объект.ДатаНачала = ТекущаяДатаПользователя;
	
	Если Не ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "Организация");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(Патент) Тогда
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Патент, "Организация");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) И РегламентированнаяОтчетностьВызовСервера.ИспользуетсяОднаОрганизация() Тогда
		Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
	ВидКонтролирующегоОргана = Перечисления.ТипыКонтролирующихОрганов.ФНС;
	
	Используется1СОтчетность = РегламентированнаяОтчетностьБП.Используется1СОтчетность();
	ЭлектронныйДокументооборотДоступен = ИнтерфейсыВзаимодействияБРО.ПодключенДокументооборотСКонтролирующимОрганом(
		Организация, ВидКонтролирующегоОргана);
	
	ИспользуютсяНапоминанияПользователя = НапоминанияПользователя.ИспользуютсяНапоминанияПользователя();
	
	СпособСдачиОтчетности = "Интернет";
	
	Если Не ЗначениеЗаполнено(СсылкаНаДокумент) И ЗначениеЗаполнено(Патент) Тогда
		Заявление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Патент, "ЗаявлениеНаПолучениеПатента");
		Если ЗначениеЗаполнено(Заявление) Тогда
			ЗаполнитьЗаявлениеПоДаннымПредыдущегоЗаявления(Заявление);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		ДанныеДокументаВОбъект(СсылкаНаДокумент);
		СостояниеЗаявления = ИнтерфейсыВзаимодействияБРО.СостояниеДокумента(СсылкаНаДокумент);
		ЗаявлениеОтправленоВНалоговую = СостояниеЗаявления.Отправлено;
	Иначе
		РедакцияФормыОтчета = РегламентированнаяОтчетность.ПолучитьАктуальнуюФормуУведомления(
			Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеНаПолучениеПатентаРекомендованнаяФорма);
		ИмяФормыОтчета = СтрШаблон("Отчет.РегламентированноеУведомлениеПолучениеПатента.Форма.%1", РедакцияФормыОтчета);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.КодРегиона) Тогда
		НаименованиеРегиона = АдресныйКлассификатор.НаименованиеРегионаПоКоду(Объект.КодРегиона);
		Если ЗначениеЗаполнено(НаименованиеРегиона) Тогда
			ШаблонПредставления = НСтр("ru='%1 - %2'"); // например: "77 - Москва г".
			РегионРегистрацииПредставление = СтрШаблон(ШаблонПредставления, Объект.КодРегиона, НаименованиеРегиона);
		КонецЕсли;
	КонецЕсли;
	
	СтавкаНалогаПредставление = СтрШаблон(НСтр("ru='%1%%'"), Объект.СтавкаНалога);
	
	ШрифтИзмененныхРеквизитов = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, , , , , , Истина);
	ШрифтКнопкиПоУмолчанию = ШрифтыСтиля.ОбычныйШрифтТекста;
	ШрифтКнопкиЖирный = ШрифтыСтиля.ШрифтЖирныйБРО;
	
	ПрочитатьДанныеКлассификатора(АдресВоВременномХранилище, Объект.ДатаНачала, УникальныйИдентификатор);
	
	ОбновитьСведенияОПредставителе();
	ОбновитьЭлементыВидаДеятельности();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ЗаявлениеСформировано = Не Форма.Модифицированность И ЗначениеЗаполнено(Форма.СсылкаНаДокумент);
	ИзменитьСтатусПроцессаФормированияЗаявления(Форма, ЗаявлениеСформировано);
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОсновное Тогда
		
		Элементы.ДекорацияНаименованиеВидаДеятельности.Заголовок = Объект.НаименованиеВидаДеятельности;
		
		Если Форма.КоличествоСотрудниковДоИзменения > 0 Тогда
			Элементы.ГруппаКоличествоСотрудников.Видимость = Истина;
			
			Элементы.ДекорацияКоличествоСотрудников.Заголовок = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
				НСтр("ru = ';%1 человек;;%1 человека;%1 человек;'"), Форма.КоличествоСотрудниковДоИзменения, , "ЧДЦ=0");

			Если ИзмененоКоличествоСотрудников(Форма) Тогда
				Элементы.ДекорацияКоличествоСотрудников.Шрифт = Форма.ШрифтИзмененныхРеквизитов;
			Иначе
				Элементы.ДекорацияКоличествоСотрудников.Шрифт = Новый Шрифт;
			КонецЕсли;
			
			Форма.ИзменитьКоличествоСотрудников = ТекстГиперссылкиИзменитьКоличествоСотрудников(Форма);
		Иначе
			Элементы.ГруппаКоличествоСотрудников.Видимость = Ложь;
		КонецЕсли;
		
		Элементы.КомандаНазад.Видимость = Форма.ВызовИзПомощника;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДополнительно Тогда
		
		Элементы.ПредставлениеСрокаСдачиОтчетности.Заголовок =
			ПредставлениеСрокаСдачиОтчетности(Форма.ДатаСоставления, Объект.ДатаНачала);
		
		Элементы.СтраницыДействияСОтчетами.ТекущаяСтраница = Элементы[Форма.СпособСдачиОтчетности];
		
		Если Форма.Используется1СОтчетность Тогда
			Элементы.Группа1СОтчетность.Видимость = Истина;
			Элементы.ЗаголовокПодключить1СОтчетность.Видимость     = Не Форма.ЭлектронныйДокументооборотДоступен;
			Элементы.ОписаниеПодключить1СОтчетность.Видимость      = Не Форма.ЭлектронныйДокументооборотДоступен;
			Элементы.Подключить1СОтчетность.Видимость              = Не Форма.ЭлектронныйДокументооборотДоступен;
			Элементы.Открыть1СОтчетность.Видимость                 = Форма.ЭлектронныйДокументооборотДоступен
				И Не Форма.ЗаявлениеОтправленоВНалоговую;
			Элементы.ГруппаОтражениеВСистемеСОповещением.Видимость = Форма.ЭлектронныйДокументооборотДоступен
				И Форма.ЗаявлениеОтправленоВНалоговую;
		Иначе
			Элементы.Группа1СОтчетность.Видимость = Ложь;
		КонецЕсли;
		Элементы.Гиперссылка1СОтчетность.Видимость = Не Форма.Используется1СОтчетность;
		
		Элементы.ОтражениеВСистеме.Видимость = Форма.СпособСдачиОтчетности = "ЛичныйВизит"
			Или Не Форма.Используется1СОтчетность
			Или Не Форма.ЭлектронныйДокументооборотДоступен;
		
		Элементы.СпособСдачиОтчетности.Доступность = Не Форма.ЗаявлениеОтправленоВНалоговую;
		
		Если Форма.СпособСдачиОтчетности = "Интернет" И Форма.Используется1СОтчетность
			И Форма.ЭлектронныйДокументооборотДоступен И Не Форма.ЗаявлениеОтправленоВНалоговую Тогда
			Элементы.Открыть1СОтчетность.КнопкаПоУмолчанию = Истина;
			Элементы.Открыть1СОтчетность.Шрифт = Форма.ШрифтКнопкиЖирный;
			Элементы.КомандаГотово.КнопкаПоУмолчанию = Ложь;
			Элементы.КомандаГотово.Шрифт = Форма.ШрифтКнопкиПоУмолчанию;
		Иначе
			Элементы.Открыть1СОтчетность.КнопкаПоУмолчанию = Ложь;
			Элементы.Открыть1СОтчетность.Шрифт = Форма.ШрифтКнопкиПоУмолчанию;
			Элементы.КомандаГотово.КнопкаПоУмолчанию = Истина;
			Элементы.КомандаГотово.Шрифт = Форма.ШрифтКнопкиЖирный;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПрочитатьДанныеКлассификатора(АдресХранилища, ДатаНачала, Ключ)
	
	ОбновитьНастройкиКлассификатораНаСервере(АдресХранилища, ДатаНачала, Ключ);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьНастройкиКлассификатораНаСервере(АдресХранилища, ДатаНачала, Ключ)
	
	Если ЗначениеЗаполнено(АдресХранилища) Тогда
		УдалитьИзВременногоХранилища(АдресХранилища);
	КонецЕсли;
	
	АдресХранилища =
		Обработки.ПомощникЗаполненияЗаявленияНаПолучениеПатента.АдресНастроекКлассификатора(ДатаНачала, Ключ);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьСтатусПроцессаФормированияЗаявления(Форма, ЗаявлениеСформировано = Ложь)
	
	Элементы = Форма.Элементы;
	
	Элементы.КартинкаЗаявлениеНаПолучениеПатента.Видимость = ЗаявлениеСформировано;
	Элементы.КартинкаЗаявлениеФормируется.Видимость = Не ЗаявлениеСформировано;
	Элементы.ЗаявлениеФормируется.Видимость = Не ЗаявлениеСформировано;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСведенияОПредставителе()
	
	Если СпособПодачиДокументов = 0 Тогда
		ОчиститьРеквизитыПредставителя(РегистрацияВНалоговомОргане, СпособПодачиДокументов);
		ПредставлениеПредставителя = "";
	ИначеЕсли ЗначениеЗаполнено(РегистрацияВНалоговомОргане.Представитель) Тогда
		ПредставлениеПредставителя = РегистрацияВНалоговомОргане.Представитель;
	Иначе
		ПредставлениеПредставителя = НСтр("ru = 'Заполнить'");
	КонецЕсли;
	
	Элементы.ПредставлениеПредставителя.Видимость = СпособПодачиДокументов = 1;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьРеквизитыПредставителя(РегистрацияВНалоговомОргане, СпособПодачиДокументов)
	
	РеквизитыПредставителя = Новый Массив;
	РеквизитыПредставителя.Добавить("Представитель");
	РеквизитыПредставителя.Добавить("ДокументПредставителя");
	РеквизитыПредставителя.Добавить("УполномоченноеЛицоПредставителя");
	РеквизитыПредставителя.Добавить("Доверенность");

	Для Каждого ТекущийРеквизит Из РеквизитыПредставителя Цикл
		РегистрацияВНалоговомОргане[ТекущийРеквизит] = Неопределено;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыВидаДеятельности()
	
	ДополнительныеНастройки = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	УказатьОбъекты = ДополнительныеНастройки.КодыВидовДеятельностиОбъекты.Найти(Объект.КодВидаДеятельности) <> Неопределено;
	УказатьТС = ДополнительныеНастройки.КодыВидовДеятельностиТС.Найти(Объект.КодВидаДеятельности) <> Неопределено;
	
	ЗначенияКодовВидовОбъектов = ДополнительныеНастройки.КодыВидыОбъектов;
	ВидыОбъектовПоКоду = ЗначенияКодовВидовОбъектов.Получить(Объект.КодВидаДеятельности);
	КодыПеревозкаГрузов = ДополнительныеНастройки.КодыВидовДеятельностиГрузоперевозки;
	
	Элементы.ГруппаСписокАдресов.Видимость = Не (УказатьОбъекты Или УказатьТС);
	Элементы.ГруппаСписокОбъектов.Видимость = УказатьОбъекты;
	Элементы.ГруппаСписокТранспортныхСредств.Видимость = УказатьТС;
	
	Если УказатьТС Тогда
		КодыТиповТС = ДополнительныеНастройки.КодыТиповТС;
		Объект.КодТипаТС = КодыТиповТС[Объект.КодВидаДеятельности];
	Иначе
		Объект.КодТипаТС = "";
	КонецЕсли;
	
	ОтобразитьАдресаМестОсуществленияДеятельности();
	ОтобразитьСведенияОбОбъектах(ВидыОбъектовПоКоду);
	ОтобразитьТранспортныеСредства(КодыПеревозкаГрузов);
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьАдресаМестОсуществленияДеятельности()
	
	ТаблицаАдресов = АдресаДоИзменения.Выгрузить();
	ТаблицаАдресов.Колонки.Добавить("Удален", Новый ОписаниеТипов("Булево"));
	
	ТаблицаАдресовНовая = Объект.Адреса.Выгрузить();
	ТаблицаАдресовНовая.Индексы.Добавить("АдресСтрокой");
	
	УдаленоАдресов = 0;
	Для Каждого СтрокаАдреса Из ТаблицаАдресов Цикл
		
		НайденнаяСтрока = ТаблицаАдресовНовая.Найти(СтрокаАдреса.АдресСтрокой, "АдресСтрокой");
		Если НайденнаяСтрока = Неопределено Тогда
			СтрокаАдреса.Удален = Истина;
			УдаленоАдресов = УдаленоАдресов + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	ЕстьАдреса = ТаблицаАдресов.Количество() > 0;
	Если Не ЕстьАдреса Тогда
		ПредставлениеАдреса = ТаблицаАдресов.Добавить();
		ПредставлениеАдреса.АдресСтрокой = НСтр("ru = 'Адреса мест осуществления деятельности не указаны'");
	КонецЕсли;
	
	ШрифтПоУмолчанию = Новый Шрифт;
	
	КоличествоПредопределенных = КоличествоПредопределенныхЭлементов("Адрес");
	КоличествоАдресов = ТаблицаАдресов.Количество();
	
	Для Индекс = КоличествоПредопределенных По КоличествоАдресов - 1 Цикл
		ДобавитьПредставлениеАдреса(Индекс);
	КонецЦикла;
	
	Для Индекс = 0 По КоличествоАдресов - 1 Цикл
		
		Адрес = ТаблицаАдресов[Индекс];
		
		ЭлементФормы = Элементы[ИмяЭлементаПоИндексу(Индекс, "Адрес")];
		ЭлементФормы.Видимость = Истина;
		ЭлементФормы.Доступность = ЕстьАдреса;
		
		Если Адрес.Удален Тогда
			Шрифт = ШрифтИзмененныхРеквизитов;
		Иначе
			Шрифт = ШрифтПоУмолчанию;
		КонецЕсли;
		
		ЭлементФормы = Элементы[ИмяЭлементаПоИндексу(Индекс, "ПредставлениеАдреса")];
		ЭлементФормы.Заголовок = Адрес.АдресСтрокой;
		ЭлементФормы.Шрифт = Шрифт;
		
	КонецЦикла;
	
	Для Индекс = КоличествоАдресов По КоличествоПредопределенных - 1 Цикл
		ЭлементФормы = Элементы[ИмяЭлементаПоИндексу(Индекс, "Адрес")];
		ЭлементФормы.Видимость = Ложь;
	КонецЦикла;
	
	ИзменитьАдреса = ТекстГиперссылкиИзменитьАдреса(УдаленоАдресов);
	
	Элементы.ИзменитьАдреса.Видимость = ЕстьАдреса;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСведенияОбОбъектах(ВидыОбъектовПоКоду)
	
	ТаблицаОбъектов = ОбъектыДоИзменения.Выгрузить();
	ТаблицаОбъектов.Колонки.Добавить("Удален", Новый ОписаниеТипов("Булево"));
	
	ТаблицаОбъектовНовая = Объект.Объекты.Выгрузить();
	ТаблицаОбъектовНовая.Индексы.Добавить("АдресСтрокой, ВидОбъекта, ПризнакОбъекта");
	
	УдаленоОбъектов = 0;
	Для Каждого СтрокаОбъекта Из ТаблицаОбъектов Цикл
		
		ПараметрыПоиска = Новый Структура("АдресСтрокой, ВидОбъекта, ПризнакОбъекта",
			СтрокаОбъекта.АдресСтрокой, СтрокаОбъекта.ВидОбъекта, СтрокаОбъекта.ПризнакОбъекта);
		НайденныеСтроки = ТаблицаОбъектовНовая.НайтиСтроки(ПараметрыПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаОбъекта.Удален = Истина;
			УдаленоОбъектов = УдаленоОбъектов + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	ЕстьОбъекты = ТаблицаОбъектов.Количество() > 0;
	
	Если ЕстьОбъекты Тогда
		ШрифтПоУмолчанию = Новый Шрифт;
		
		КоличествоПредопределенных = КоличествоПредопределенныхЭлементов("Объект");
		КоличествоОбъектов = ТаблицаОбъектов.Количество();
		
		Для Индекс = КоличествоПредопределенных По КоличествоОбъектов - 1 Цикл
			ДобавитьПредставлениеОбъекта(Индекс);
		КонецЦикла;
		
		Для Индекс = 0 По КоличествоОбъектов - 1 Цикл
			
			ДанныеОбъекта = ТаблицаОбъектов[Индекс];
			
			ЭлементФормы = Элементы[ИмяЭлементаПоИндексу(Индекс, "Объект")];
			ЭлементФормы.Видимость = Истина;
			
			Если ДанныеОбъекта.Удален Тогда
				Шрифт = ШрифтИзмененныхРеквизитов;
			Иначе
				Шрифт = ШрифтПоУмолчанию;
			КонецЕсли;
			
			ПредставлениеВидаОбъекта = "";
			Если ЗначениеЗаполнено(ВидыОбъектовПоКоду) И ЗначениеЗаполнено(ДанныеОбъекта.ВидОбъекта) Тогда
				Для Каждого ДанныеВидаОбъектов Из ВидыОбъектовПоКоду Цикл
					Если ДанныеВидаОбъектов.ВидОбъекта = ДанныеОбъекта.ВидОбъекта Тогда
						ПредставлениеВидаОбъекта = ДанныеВидаОбъектов.Наименование;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			ЭлементФормы = Элементы[ИмяЭлементаПоИндексу(Индекс, "ВидОбъекта")];
			ЭлементФормы.Заголовок = ПредставлениеВидаОбъекта;
			ЭлементФормы.Шрифт = Шрифт;
			
			ЭлементФормы = Элементы[ИмяЭлементаПоИндексу(Индекс, "ПлощадьОбъекта")];
			ЭлементФормы.Заголовок = СтрШаблон(НСтр("ru = '%1 кв.м.'"), ДанныеОбъекта.Площадь);
			ЭлементФормы.Шрифт = Шрифт;
			
			ЭлементФормы = Элементы[ИмяЭлементаПоИндексу(Индекс, "АдресОбъекта")];
			ЭлементФормы.Заголовок = ДанныеОбъекта.АдресСтрокой;
			ЭлементФормы.Шрифт = Шрифт;
			
		КонецЦикла;
		
		Для Индекс = КоличествоОбъектов По КоличествоПредопределенных - 1 Цикл
			ЭлементФормы = Элементы[ИмяЭлементаПоИндексу(Индекс, "Объект")];
			ЭлементФормы.Видимость = Ложь;
		КонецЦикла;
		
		ИзменитьОбъекты = ТекстГиперссылкиИзменитьОбъекты(УдаленоОбъектов);
		
		Элементы.ИзменитьОбъекты.Видимость = Истина;
	Иначе
		Элементы.ГруппаСписокОбъектов.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьТранспортныеСредства(КодыПеревозкаГрузов)
	
	ТаблицаТранспортныхСредств = ТранспортныеСредстваДоИзменения.Выгрузить();
	ТаблицаТранспортныхСредств.Колонки.Добавить("Удален", Новый ОписаниеТипов("Булево"));
	
	ТаблицаТранспортныхСредствНовая = Объект.ТранспортныеСредства.Выгрузить();
	ТаблицаТранспортныхСредствНовая.Индексы.Добавить("Номер, Марка, РегистрационныйЗнак");
	
	УдаленоТранспортныхСредств = 0;
	Для Каждого СтрокаТранспортногоСредства Из ТаблицаТранспортныхСредств Цикл
		
		ПараметрыПоиска = Новый Структура("Номер, Марка, РегистрационныйЗнак",
			СтрокаТранспортногоСредства.Номер, СтрокаТранспортногоСредства.Марка, СтрокаТранспортногоСредства.РегистрационныйЗнак);
		НайденныеСтроки = ТаблицаТранспортныхСредствНовая.НайтиСтроки(ПараметрыПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаТранспортногоСредства.Удален = Истина;
			УдаленоТранспортныхСредств = УдаленоТранспортныхСредств + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	ЕстьТранспортныеСредства = ТаблицаТранспортныхСредств.Количество() > 0;
	
	Если ЕстьТранспортныеСредства Тогда
		ШрифтПоУмолчанию = Новый Шрифт;
		
		ЭтоПеревозкаГрузов = Ложь;
		Если ТипЗнч(КодыПеревозкаГрузов) = Тип("Массив") И ЗначениеЗаполнено(КодыПеревозкаГрузов) Тогда
			ЭтоПеревозкаГрузов = КодыПеревозкаГрузов.Найти(Объект.КодВидаДеятельности) <> Неопределено;
		КонецЕсли;
		
		КоличествоПредопределенных = КоличествоПредопределенныхЭлементов("ТранспортноеСредство");
		КоличествоТранспортныхСредств = ТаблицаТранспортныхСредств.Количество();
		
		Для Индекс = КоличествоПредопределенных По КоличествоТранспортныхСредств - 1 Цикл
			ДобавитьПредставлениеТранспортногоСредства(Индекс);
		КонецЦикла;
		
		Для Индекс = 0 По КоличествоТранспортныхСредств - 1 Цикл
			
			ТранспортноеСредство = ТаблицаТранспортныхСредств[Индекс];
			
			ЭлементФормы = Элементы[ИмяЭлементаПоИндексу(Индекс, "ТранспортноеСредство")];
			ЭлементФормы.Видимость = Истина;
			
			Если ТранспортноеСредство.Удален Тогда
				Шрифт = ШрифтИзмененныхРеквизитов;
			Иначе
				Шрифт = ШрифтПоУмолчанию;
			КонецЕсли;
			
			ЭлементФормы = Элементы[ИмяЭлементаПоИндексу(Индекс, "НомерТранспортногоСредства")];
			ЭлементФормы.Заголовок = ТранспортноеСредство.Номер;
			ЭлементФормы.Шрифт = Шрифт;
			
			ЭлементФормы = Элементы[ИмяЭлементаПоИндексу(Индекс, "МаркаТранспортногоСредства")];
			ЭлементФормы.Заголовок = ТранспортноеСредство.Марка;
			ЭлементФормы.Шрифт = Шрифт;
			
			ЭлементФормы = Элементы[ИмяЭлементаПоИндексу(Индекс, "РегистрационныйЗнакТранспортногоСредства")];
			ЭлементФормы.Заголовок = ТранспортноеСредство.РегистрационныйЗнак;
			ЭлементФормы.Шрифт = Шрифт;
			
			ПредставлениеПоказателя = "";
			Если ЭтоПеревозкаГрузов Тогда
				ПредставлениеПоказателя = СтрШаблон(НСтр("ru = '%1 (тонн)'"), ТранспортноеСредство.Грузоподъемность);
			Иначе
				ПредставлениеПоказателя = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
					НСтр("ru = ';%1 место;;%1 места;%1 мест;'"),
					ТранспортноеСредство.Количество, , "ЧДЦ=0");
			КонецЕсли;
			
			ЭлементФормы = Элементы[ИмяЭлементаПоИндексу(Индекс, "ПоказательТранспортногоСредства")];
			ЭлементФормы.Заголовок = ПредставлениеПоказателя;
			ЭлементФормы.Шрифт = Шрифт;
			
		КонецЦикла;
		
		Для Индекс = КоличествоТранспортныхСредств По КоличествоПредопределенных - 1 Цикл
			ЭлементФормы = Элементы[ИмяЭлементаПоИндексу(Индекс, "ТранспортноеСредство")];
			ЭлементФормы.Видимость = Ложь;
		КонецЦикла;
		
		ИзменитьТранспортныеСредства = ТекстГиперссылкиИзменитьТранспортныеСредства(УдаленоТранспортныхСредств);
		
		Элементы.ИзменитьТранспортныеСредства.Видимость = Истина;
	Иначе
		Элементы.ГруппаСписокТранспортныхСредств.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПредставлениеАдреса(Индекс)
	
	ГруппаАдрес = Элементы.Добавить(
		ИмяЭлементаПоИндексу(Индекс, "Адрес"),
		Тип("ГруппаФормы"),
		Элементы.АдресаПредставление);
	ГруппаАдрес.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаАдрес.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаАдрес.Заголовок = СтрШаблон("Адрес[%1]", Индекс);
	ГруппаАдрес.ОтображатьЗаголовок = Ложь;
	ГруппаАдрес.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	ГруппаАдрес.Объединенная = Ложь;
	
	ПредставлениеАдреса = Элементы.Добавить(
		ИмяЭлементаПоИндексу(Индекс, "ПредставлениеАдреса"),
		Тип("ДекорацияФормы"),
		ГруппаАдрес);
	ПредставлениеАдреса.АвтоМаксимальнаяШирина = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПредставлениеОбъекта(Индекс)
	
	ГруппаОбъект = Элементы.Добавить(
		ИмяЭлементаПоИндексу(Индекс, "Объект"),
		Тип("ГруппаФормы"),
		Элементы.ОбъектыПредставление);
	ГруппаОбъект.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОбъект.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаОбъект.Заголовок = СтрШаблон("Объект[%1]", Индекс);
	ГруппаОбъект.ОтображатьЗаголовок = Ложь;
	ГруппаОбъект.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	ГруппаОбъект.Объединенная = Ложь;
	
	Элементы.Добавить(ИмяЭлементаПоИндексу(Индекс, "ВидОбъекта"), Тип("ДекорацияФормы"), ГруппаОбъект);
	
	Элементы.Добавить(ИмяЭлементаПоИндексу(Индекс, "ПлощадьОбъекта"), Тип("ДекорацияФормы"), ГруппаОбъект);
	
	ПредставлениеАдреса = Элементы.Добавить(
		ИмяЭлементаПоИндексу(Индекс, "АдресОбъекта"),
		Тип("ДекорацияФормы"),
		ГруппаОбъект);
	ПредставлениеАдреса.АвтоМаксимальнаяШирина = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПредставлениеТранспортногоСредства(Индекс)
	
	ГруппаТранспортноеСредство = Элементы.Добавить(
		ИмяЭлементаПоИндексу(Индекс, "ТранспортноеСредство"),
		Тип("ГруппаФормы"),
		Элементы.ТранспортныеСредстваПредставление);
	ГруппаТранспортноеСредство.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаТранспортноеСредство.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаТранспортноеСредство.Заголовок = СтрШаблон("ТранспортноеСредство[%1]", Индекс);
	ГруппаТранспортноеСредство.ОтображатьЗаголовок = Ложь;
	ГруппаТранспортноеСредство.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	ГруппаТранспортноеСредство.Объединенная = Ложь;
	
	Элементы.Добавить(
		ИмяЭлементаПоИндексу(Индекс, "НомерТранспортногоСредства"),
		Тип("ДекорацияФормы"),
		ГруппаТранспортноеСредство);
	
	Элементы.Добавить(
		ИмяЭлементаПоИндексу(Индекс, "МаркаТранспортногоСредства"),
		Тип("ДекорацияФормы"),
		ГруппаТранспортноеСредство);
	
	Элементы.Добавить(
		ИмяЭлементаПоИндексу(Индекс, "РегистрационныйЗнакТранспортногоСредства"),
		Тип("ДекорацияФормы"),
		ГруппаТранспортноеСредство);
	
	Элементы.Добавить(
		ИмяЭлементаПоИндексу(Индекс, "ПоказательТранспортногоСредства"),
		Тип("ДекорацияФормы"),
		ГруппаТранспортноеСредство);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТекстГиперссылкиИзменитьКоличествоСотрудников(Форма)
	
	ТекстГиперссылки = НСтр("ru = 'Изменить'");
	
	Если ИзмененоКоличествоСотрудников(Форма) Тогда
		ТекстГиперссылки = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';%1 человек;;%1 человека;%1 человек;'"),
			Форма.Объект.КоличествоСотрудников, , "ЧДЦ=0");
	КонецЕсли;
	
	Возврат ТекстГиперссылки;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекстГиперссылкиИзменитьАдреса(УдаленоАдресов)
	
	ТекстГиперссылки = НСтр("ru = 'Изменить'");
	
	Если УдаленоАдресов <> 0 Тогда
		ТекстГиперссылки = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';%1 адрес удален;;%1 адреса удалено;%1 адресов удалено;'"),
			УдаленоАдресов, , "ЧДЦ=0");
		Возврат ТекстГиперссылки;
	КонецЕсли;
	
	Возврат ТекстГиперссылки;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекстГиперссылкиИзменитьОбъекты(УдаленоОбъектов)
	
	ТекстГиперссылки = НСтр("ru = 'Изменить'");
	
	Если УдаленоОбъектов <> 0 Тогда
		ТекстГиперссылки = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';%1 объект удален;;%1 объекта удалено;%1 объектов удалено;'"),
			УдаленоОбъектов, , "ЧДЦ=0");
		Возврат ТекстГиперссылки;
	КонецЕсли;
	
	Возврат ТекстГиперссылки;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекстГиперссылкиИзменитьТранспортныеСредства(УдаленоТранспортныхСредств)
	
	ТекстГиперссылки = НСтр("ru = 'Изменить'");
	
	Если УдаленоТранспортныхСредств <> 0 Тогда
		ТекстГиперссылки = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';%1 транспортное средство удалено;;%1 транспортных средства удалено;%1 транспортных средств удалено;'"),
			УдаленоТранспортныхСредств, , "ЧДЦ=0");
		Возврат ТекстГиперссылки;
	КонецЕсли;
	
	Возврат ТекстГиперссылки;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИзмененоКоличествоСотрудников(Форма)
	
	Возврат Форма.КоличествоСотрудниковДоИзменения <> Форма.Объект.КоличествоСотрудников;
	
КонецФункции

&НаСервере
Функция КоличествоПредопределенныхЭлементов(ПрефиксИмени)
	
	Перем Количество;
	
	Количество = 0;
	Пока Истина Цикл
		Если Элементы.Найти(ИмяЭлементаПоИндексу(Количество, ПрефиксИмени)) <> Неопределено Тогда
			Количество = Количество + 1;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Количество;
	
КонецФункции

&НаСервереБезКонтекста
Функция ИмяЭлементаПоИндексу(Индекс, ПрефиксИмени)
	
	Возврат СтрШаблон(ПрефиксИмени + "%1", Индекс);
	
КонецФункции

&НаКлиенте
Функция ИмяФормыИзмененияКоличестваСотрудников()
	
	Возврат "Обработка.ПомощникЗаполненияЗаявленияНаПолучениеПатента.Форма.ИзменениеКоличестваСотрудников";
	
КонецФункции

&НаКлиенте
Функция ИмяФормыИзмененияФизическихПоказателей()
	
	Возврат "Обработка.ПомощникЗаполненияЗаявленияНаПолучениеПатента.Форма.ИзменениеФизическихПоказателей";
	
КонецФункции

&НаКлиенте
Функция ИмяФормыВыбораПредставителя()
	
	Возврат "Справочник.РегистрацииВНалоговомОргане.Форма.ФормаПредставителя";
	
КонецФункции

&НаКлиенте
Процедура ОбработатьИзмененияКоличестваСотрудников(РезультатВыбора)
	
	Если ТипЗнч(РезультатВыбора) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	Если РезультатВыбора.Свойство("КоличествоСотрудников") Тогда
		Объект.КоличествоСотрудников = РезультатВыбора.КоличествоСотрудников;
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзмененияФизическихПоказателей(РезультатВыбора)
	
	Если ТипЗнч(РезультатВыбора) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ИмяТаблицы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатВыбора, "ИмяТаблицы");
	АдресХранилища = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатВыбора, "АдресХранилища");
	
	ЗагрузитьТаблицуИзВременногоХранилища(ИмяТаблицы, АдресХранилища);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеСтатусаЗаявления()
	
	Если Не ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		Возврат;
	КонецЕсли;
	
	СостояниеЗаявления = ИнтерфейсыВзаимодействияБРО.СостояниеДокумента(СсылкаНаДокумент);
	ЗаявлениеОтправленоВНалоговую = СостояниеЗаявления.Отправлено;
	
	Если Не ИспользуютсяНапоминанияПользователя Тогда
		ВключитьИспользованиеНапоминанийПользователя();
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаблицуИзВременногоХранилища(ИмяТаблицы, АдресТаблицы)
	
	Объект[ИмяТаблицы].Загрузить(ПолучитьИзВременногоХранилища(АдресТаблицы));
	
	ОбновитьЭлементыВидаДеятельности();
	
КонецПроцедуры

&НаСервере
Функция СохранитьТаблицуФормыВоВременноеХранилище(ИмяТаблицы)
	
	Возврат ПоместитьВоВременноеХранилище(ЭтотОбъект[ИмяТаблицы].Выгрузить(), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция СохранитьТаблицуОбъектаВоВременноеХранилище(ИмяТаблицы)
	
	Возврат ПоместитьВоВременноеХранилище(Объект[ИмяТаблицы].Выгрузить(), УникальныйИдентификатор);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеСрокаСдачиОтчетности(Знач ДатаСоставления, Знач ДатаНачалаДействия)
	
	ДатаПоКалендарю = СрокСдачиЗаявленияНаВнесениеИзменений(ДатаНачалаДействия);
	
	Представление = СтрШаблон(НСтр("ru = 'Подать заявление следует не позднее %1'"), Формат(ДатаПоКалендарю, "ДЛФ=DD"));
	
	Возврат Представление;
	
КонецФункции

&НаСервереБезКонтекста
Функция СрокСдачиЗаявленияНаВнесениеИзменений(Знач ДатаИзменения)
	
	ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
	КоличествоДней = УчетПСН.СрокПодачиЗаявленияНаПолучениеПатентаВзаменРанееВыданного();
	Сутки = 24 * 60 * 60;
	
	Если Не ЗначениеЗаполнено(ПроизводственныйКалендарь) Тогда
		// Если не задан производственный календарь, тогда рассчитываем по календарным дням
		Возврат ДатаИзменения + КоличествоДней * Сутки;
	КонецЕсли;
	
	Возврат КалендарныеГрафики.ДатаПоКалендарю(ПроизводственныйКалендарь, ДатаИзменения, КоличествоДней, Ложь);
	
КонецФункции

&НаКлиенте
Процедура ВопросПередЗакрытиемФормы(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ПроверитьЗаполнение() Тогда
			СсылкаНаДокумент = СформироватьЗаявлениеНаПолучениеПатентаНаСервере();
		КонецЕсли;
	КонецЕсли;
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыНалоговойИнспекцииНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.КодНалоговогоОргана) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыНалоговойИнспекции = ДанныеГосударственныхОрганов.РеквизитыНалоговогоОрганаПоКоду(
		Объект.КодНалоговогоОргана);
	
	Если РеквизитыНалоговойИнспекции <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(РеквизитыНалоговойИнспекции.Адрес) Тогда
			МассивПодстрок = СтрРазделить(РеквизитыНалоговойИнспекции.Адрес, ",", Ложь);
			РеквизитыНалоговойИнспекции.Адрес = СтрСоединить(МассивПодстрок, ",");
		КонецЕсли;
		
		НалоговаяИнспекцияНаименование = РеквизитыНалоговойИнспекции.Наименование;
		НалоговаяИнспекцияТелефон      = РеквизитыНалоговойИнспекции.Телефон;
		НалоговаяИнспекцияАдрес        = РеквизитыНалоговойИнспекции.Адрес;
		НалоговаяИнспекцияЭлектроннаяПочта = РеквизитыНалоговойИнспекции.ЭлектроннаяПочта;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаявлениеПоДаннымПредыдущегоЗаявления(Заявление)
	
	ДанныеЗаявления = УведомлениеОСпецрежимахНалогообложения.ДанныеУведомленияДляВыгрузки(Заявление);
	
	Объект.Объекты.Очистить();
	Объект.Адреса.Очистить();
	Объект.ТранспортныеСредства.Очистить();
	
	Если ДанныеЗаявления.Свойство("ДанныеПомощникаЗаполнения") Тогда
		ЗаполняемыеРеквизиты = ЗаполняемыеРеквизитыЗаявления();
		ДанныеДокументаВОбъект(Заявление, ЗаполняемыеРеквизиты);
	Иначе
		ИмяФормыЗаявления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заявление, "ИмяФормы");
		ЗаполнитьЗаявлениеПоСтруктуреРегламентированнойФормы(ДанныеЗаявления, ИмяФормыЗаявления);
	КонецЕсли;
	
	КоличествоСотрудниковДоИзменения = Объект.КоличествоСотрудников;
	
	АдресаДоИзменения.Загрузить(Объект.Адреса.Выгрузить());
	ОбъектыДоИзменения.Загрузить(Объект.Объекты.Выгрузить());
	ТранспортныеСредстваДоИзменения.Загрузить(Объект.ТранспортныеСредства.Выгрузить());
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ДанныеДокументаВОбъект(СсылкаНаДокумент, ЗаполняемыеРеквизиты = Неопределено)

	СтруктураОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент,
		"Организация, ДатаПодписи, ДанныеУведомления, ИмяФормы, ИмяОтчета");
	
	Если Не ЗначениеЗаполнено(ЗаполняемыеРеквизиты) Тогда
		Организация = СтруктураОбъекта.Организация;
		ДатаСоставления = СтруктураОбъекта.ДатаПодписи;
		ИмяФормыОтчета = СтрШаблон("Отчет.%1.Форма.%2", СтруктураОбъекта.ИмяОтчета, СтруктураОбъекта.ИмяФормы);
	КонецЕсли;
	
	ДанныеУведомления = СтруктураОбъекта.ДанныеУведомления.Получить();
	Если ДанныеУведомления = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПомощникаЗаполнения = Неопределено;
	Если ДанныеУведомления.Свойство("ДанныеПомощникаЗаполнения", ДанныеПомощникаЗаполнения) 
		И ДанныеПомощникаЗаполнения <> Неопределено Тогда
		
		Обработки.ПомощникЗаполненияЗаявленияНаПолучениеПатента.АктуализироватьФорматСохраняемыхДанных(ДанныеПомощникаЗаполнения);
		
		РеквизитыФормы = ПолучитьРеквизиты();
		СписокРеквизитов = Новый Массив;
		Для Каждого ТекущийРеквизит Из РеквизитыФормы Цикл
			СписокРеквизитов.Добавить(ТекущийРеквизит.Имя);
		КонецЦикла;
		
		Для Каждого ТекущееЗначение Из ДанныеПомощникаЗаполнения Цикл
			
			Если ЗначениеЗаполнено(ЗаполняемыеРеквизиты)
				И ЗаполняемыеРеквизиты.Найти(ТекущееЗначение.Ключ) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если Объект.Свойство(ТекущееЗначение.Ключ) Тогда
				
				Если ТипЗнч(ТекущееЗначение.Значение) = Тип("ТаблицаЗначений") Тогда
					Для Каждого ТекущаяСтрока Из ТекущееЗначение.Значение Цикл
						ЗаполнитьЗначенияСвойств(Объект[ТекущееЗначение.Ключ].Добавить(), ТекущаяСтрока);
					КонецЦикла;
				Иначе
					Объект[ТекущееЗначение.Ключ] = ТекущееЗначение.Значение;
				КонецЕсли;
				
			ИначеЕсли РегистрацияВНалоговомОргане.Свойство(ТекущееЗначение.Ключ) Тогда
				
				РегистрацияВНалоговомОргане[ТекущееЗначение.Ключ] = ТекущееЗначение.Значение;
				
			ИначеЕсли СписокРеквизитов.Найти(ТекущееЗначение.Ключ) <> Неопределено Тогда
				
				Если ТипЗнч(ТекущееЗначение.Значение) = Тип("ТаблицаЗначений") Тогда
					Для Каждого ТекущаяСтрока Из ТекущееЗначение.Значение Цикл
						ЗаполнитьЗначенияСвойств(ЭтотОбъект[ТекущееЗначение.Ключ].Добавить(), ТекущаяСтрока);
					КонецЦикла;
				Иначе
					ЭтотОбъект[ТекущееЗначение.Ключ] = ТекущееЗначение.Значение;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(РегистрацияВНалоговомОргане.Представитель) Тогда
			СпособПодачиДокументов = 1;
		КонецЕсли;
		
		ПолныйКодВидаДеятельности = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДанныеПомощникаЗаполнения, "ПолныйКодВидаДеятельности");
		Если Не ЗначениеЗаполнено(ПолныйКодВидаДеятельности) Тогда
			КодВидаДеятельностиСтрокой = СтрШаблон("%1%2%3",
				Объект.КодВидаДеятельности, Объект.КодРегиона, Объект.ПорядковыйНомерВидаДеятельности);
		Иначе
			КодВидаДеятельностиСтрокой = Лев(ПолныйКодВидаДеятельности, 6);
		КонецЕсли;
		
	КонецЕсли;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаявлениеПоСтруктуреРегламентированнойФормы(ДанныеЗаявления, ИмяФормыЗаявления)
	
	ФормаСВнесениемИзменений = ФормаСВозможностьюВнесенияИзмененийВПатент(ИмяФормыЗаявления);
	
	Если ФормаСВнесениемИзменений Тогда
		ИмяТитульногоЛиста = "Титульная";
		ИмяЛиста2 = "";
		ИмяЛистаА = "ЛистА";
		ИмяЛистаБ = "ЛистБ";
		ИмяЛистаВ = "ЛистВ";
	Иначе
		ИмяТитульногоЛиста = СтрШаблон("%1_Титульная", ИмяФормыЗаявления);
		ИмяЛиста2 = СтрШаблон("%1_Лист2", ИмяФормыЗаявления);
		ИмяЛистаА = СтрШаблон("%1_ЛистА", ИмяФормыЗаявления);
		ИмяЛистаБ = СтрШаблон("%1_ЛистБ", ИмяФормыЗаявления);
		ИмяЛистаВ = СтрШаблон("%1_ЛистВ", ИмяФормыЗаявления);
	КонецЕсли;
	
	ДанныеТитульногоЛиста = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаявления.ДанныеУведомления, ИмяТитульногоЛиста);
	Если ЗначениеЗаполнено(ИмяЛиста2) Тогда
		ДанныеЛиста2 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаявления.ДанныеУведомления, ИмяЛиста2);
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДанныеТитульногоЛиста, ДанныеЛиста2, Ложь);
	КонецЕсли;
	
	Если ДанныеТитульногоЛиста <> Неопределено Тогда
		КодВидаДеятельностиСтрокой = ДанныеТитульногоЛиста.КодВД;
		Объект.КодРегиона = Сред(КодВидаДеятельностиСтрокой, 3, 2);
		Объект.КодВидаДеятельности = Лев(КодВидаДеятельностиСтрокой, 2);
		Объект.ПорядковыйНомерВидаДеятельности = Сред(КодВидаДеятельностиСтрокой, 5, 2);
		Объект.КоличествоСотрудников = ДанныеТитульногоЛиста.ЧислНаемРаб;
		Объект.НаименованиеВидаДеятельности = ДанныеТитульногоЛиста.НаимВД;
		
		Объект.КодНалоговогоОргана = ДанныеТитульногоЛиста.КодНО;
		
		Если Не ЗначениеЗаполнено(ДанныеТитульногоЛиста.НалСтавка)
			И Не ЗначениеЗаполнено(ДанныеТитульногоЛиста.ЗакСубРФСтав) Тогда
			Объект.СтавкаНалога = УчетПСНКлиентСервер.НалоговаяСтавкаПоУмолчанию();
		Иначе
			Объект.СтавкаНалога = ДанныеТитульногоЛиста.НалСтавка;
		КонецЕсли;
	КонецЕсли;
	
	// Лист А - Адреса
	ДанныеЛистА = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаявления.ДанныеМногостраничныхРазделов, ИмяЛистаА);
	Если ДанныеЛистА <> Неопределено Тогда
		Для Каждого СтраницаЛистА Из ДанныеЛистА Цикл
			ЗначениеАдреса = СтраницаЛистА.Значение;
			Если ЗначениеЗаполнено(ЗначениеАдреса.АдресJSON) Тогда
				НоваяСтрокаАдреса = Объект.Адреса.Добавить();
				НоваяСтрокаАдреса.Адрес = ЗначениеАдреса.АдресJSON;
				НоваяСтрокаАдреса.АдресСтрокой = ЗначениеАдреса.Адрес9зпт;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Лист Б - Транспортные средства
	Если ФормаСВнесениемИзменений Тогда
		ТаблицаСДаннымиПоТС = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаявления.ДанныеДопСтрокБД, "МнгСтр1");
		Если ТипЗнч(ТаблицаСДаннымиПоТС) = Тип("ТаблицаЗначений") Тогда
			Для Каждого СтрокаТаблицыТС Из ТаблицаСДаннымиПоТС Цикл
				Если ЗначениеЗаполнено(СтрокаТаблицыТС.ГрузТС) Тогда
					НоваяСтрокаТС = Объект.ТранспортныеСредства.Добавить();
					НоваяСтрокаТС.Номер = СтрокаТаблицыТС.ИдНомТС;
					НоваяСтрокаТС.Марка = СтрокаТаблицыТС.МаркаТС;
					НоваяСтрокаТС.РегистрационныйЗнак = СтрокаТаблицыТС.РегЗнакТС;
					НоваяСтрокаТС.Грузоподъемность = СтрокаТаблицыТС.ГрузТС;
					НоваяСтрокаТС.Количество = СтрокаТаблицыТС.КолПосадМест;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Иначе
		ДанныеЛистБ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаявления.ДанныеМногостраничныхРазделов, ИмяЛистаБ);
		Если ДанныеЛистБ <> Неопределено Тогда
			Для Каждого СтраницаЛистБ Из ДанныеЛистБ Цикл
				ЗначениеТС = СтраницаЛистБ.Значение;
				Если ЗначениеЗаполнено(ЗначениеТС.ГрузТС) Тогда
					НоваяСтрокаТС = Объект.ТранспортныеСредства.Добавить();
					НоваяСтрокаТС.Номер = ЗначениеТС.ИдНомТС;
					НоваяСтрокаТС.Марка = ЗначениеТС.МаркаТС;
					НоваяСтрокаТС.РегистрационныйЗнак = ЗначениеТС.РегЗнакТС;
					НоваяСтрокаТС.Грузоподъемность = ЗначениеТС.ГрузТС;
					НоваяСтрокаТС.Количество = ЗначениеТС.КолПосадМест;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Лист В - Объекты
	ДанныеЛистВ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаявления.ДанныеМногостраничныхРазделов, ИмяЛистаВ);
	Если ДанныеЛистВ <> Неопределено  Тогда
		Для Каждого СтраницаЛистВ Из ДанныеЛистВ Цикл
			ЗначениеОбъекта = СтраницаЛистВ.Значение;
			Если ЗначениеЗаполнено(ЗначениеОбъекта.АдресJSON) Тогда
				НоваяСтрокаОбъекта = Объект.Объекты.Добавить();
				НоваяСтрокаОбъекта.ВидОбъекта = ЗначениеОбъекта.КодОбъект;
				НоваяСтрокаОбъекта.ПризнакОбъекта = ЗначениеОбъекта.ПризОбъект;
				НоваяСтрокаОбъекта.Площадь = ЗначениеОбъекта.ПлощОбъект;
				НоваяСтрокаОбъекта.Адрес = ЗначениеОбъекта.АдресJSON;
				НоваяСтрокаОбъекта.АдресСтрокой = ЗначениеОбъекта.Адрес9зпт;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаявлениеНаПолучениеПатента()
	
	Если Модифицированность Тогда
		СформироватьЗаявлениеПриПереходеНаСледующийШаг();
	ИначеЕсли Не ЗначениеЗаполнено(НалоговаяИнспекцияНаименование) Тогда
		ОбновитьРеквизитыНалоговойИнспекцииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаявлениеПриПереходеНаСледующийШаг()
	
	ОбновитьРеквизитыНалоговойИнспекцииНаСервере();
	ДлительнаяОперация = СформироватьЗаявлениеНаПолучениеПатентаНаСервере();
	
	Если ДлительнаяОперация.Статус = "Ошибка" Тогда
		
		ПоказатьОшибкуФормированияЗаявления(ДлительнаяОперация);
		УправлениеФормой(ЭтотОбъект);
		
	Иначе
		
		НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		НастройкиОжидания.ПолучатьРезультат = Истина;
		НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
		
		Обработчик = Новый ОписаниеОповещения("СформироватьЗаявлениеПослеЗавершенияФоновогоЗадания", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаявлениеПослеЗавершенияФоновогоЗадания(ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		СформироватьЗаявлениеЗаданиеВыполнено(ДлительнаяОперация.АдресРезультата);
		
	Иначе
		
		ПоказатьОшибкуФормированияЗаявления(ДлительнаяОперация);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаявлениеЗаданиеВыполнено(АдресРезультата)
	
	СсылкаНаДокумент = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Модифицированность = Ложь;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция СформироватьЗаявлениеНаПолучениеПатентаНаСервере()
	
	ПараметрыЗаявления = Новый Структура;
	
	Реквизиты = Метаданные.Обработки.ПомощникЗаполненияЗаявленияНаПолучениеПатента.Реквизиты;
	Для Каждого ТекущийРеквизит Из Реквизиты Цикл
		ПараметрыЗаявления.Вставить(ТекущийРеквизит.Имя, Объект[ТекущийРеквизит.Имя]);
	КонецЦикла;
	
	ТабличныеЧасти = Метаданные.Обработки.ПомощникЗаполненияЗаявленияНаПолучениеПатента.ТабличныеЧасти;
	Для Каждого ТекущаяТаблица Из ТабличныеЧасти Цикл
		ПараметрыЗаявления.Вставить(ТекущаяТаблица.Имя, Объект[ТекущаяТаблица.Имя].Выгрузить());
	КонецЦикла;
	
	ПараметрыЗаявления.Вставить("Организация",                  Организация);
	ПараметрыЗаявления.Вставить("ДатаСоставления",              ДатаСоставления);
	ПараметрыЗаявления.Вставить("Представитель",                РегистрацияВНалоговомОргане.Представитель);
	ПараметрыЗаявления.Вставить("ДокументПредставителя",        РегистрацияВНалоговомОргане.ДокументПредставителя);
	ПараметрыЗаявления.Вставить("СоздатьНовоеЗаявление",        Истина);
	
	Если ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		ПараметрыЗаявления.Вставить("СсылкаНаДокумент", СсылкаНаДокумент);
	КонецЕсли;
	
	ПараметрыЗаявления.Вставить("ИмяФормы", ИмяФормыОтчета);
	
	ПараметрыЗаявления.Вставить("Ответственный", Пользователи.ТекущийПользователь());
	
	ПараметрыЗаявления.Вставить("КоличествоСотрудниковДоИзменения", КоличествоСотрудниковДоИзменения);
	ПараметрыЗаявления.Вставить("АдресаДоИзменения", АдресаДоИзменения.Выгрузить());
	ПараметрыЗаявления.Вставить("ОбъектыДоИзменения", ОбъектыДоИзменения.Выгрузить());
	ПараметрыЗаявления.Вставить("ТранспортныеСредстваДоИзменения", ТранспортныеСредстваДоИзменения.Выгрузить());
	ПараметрыЗаявления.Вставить("Патент", Патент);
	
	НастройкиЗапуска = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	НастройкиЗапуска.НаименованиеФоновогоЗадания = НСтр("ru = 'Заполнение заявления на получение патента'");
	НастройкиЗапуска.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.ПомощникЗаполненияЗаявленияНаПолучениеПатента.СформироватьЗаявлениеНаПолучениеПатента",
		ПараметрыЗаявления,
		НастройкиЗапуска);
	
КонецФункции

&НаКлиенте
Процедура ПоказатьОшибкуФормированияЗаявления(ДлительнаяОперация)
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(НСтр("ru = 'Ошибка при формировании заявления на получение патента:'"));
	МассивСтрок.Добавить(ДлительнаяОперация.КраткоеПредставлениеОшибки);
	
	ВызватьИсключение СтрСоединить(МассивСтрок, Символы.ПС);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаявлениеНаПолучениеПатента()
	
	Если Не ЗначениеЗаполнено(СсылкаНаДокумент) Или Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Если ДоступнаПечатьPDF417(СсылкаНаДокумент) Тогда
		РегламентированнаяОтчетностьКлиент.ВывестиМашиночитаемуюФормуУведомленияОСпецрежимахПоСсылке(
			ЭтотОбъект, СсылкаНаДокумент);
	Иначе
		ПоказатьЗначение(, СсылкаНаДокумент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступнаПечатьPDF417(Заявление)
	
	ИмяФормыЗаявления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заявление, "ИмяФормы");
	
	Возврат Отчеты.РегламентированноеУведомлениеПолучениеПатента.ДоступнаПечатьPDF417(ИмяФормыЗаявления);
	
КонецФункции

&НаКлиенте
Процедура ПерейтиНазадВПомощникВыбораВидаЗаявления()
	
	ПараметрыПомощника = Новый Структура;
	ПараметрыПомощника.Вставить("Организация", Организация);
	ПараметрыПомощника.Вставить("ВидЗаявления", 2);
	ПараметрыПомощника.Вставить("Патент", Патент);
	
	ОткрытьФорму("Обработка.ПомощникЗаполненияЗаявленияНаПолучениеПатента.Форма.ВыборВидаЗаявления", ПараметрыПомощника);
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоСобытиеОтправкиЗаявленияВНалоговую(ИмяСобытия, Параметр)
	
	Если ИмяСобытия <> "Успешная отправка" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Параметр) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВыполняемоеОповещение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметр, "ВыполняемоеОповещение");
	
	Если ТипЗнч(ВыполняемоеОповещение) <> Тип("ОписаниеОповещения") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДополнительныеПараметрыОповещения = ВыполняемоеОповещение.ДополнительныеПараметры;
	
	Если ТипЗнч(ДополнительныеПараметрыОповещения) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОрганизацияОтчета = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметрыОповещения, "ОрганизацияОтчета");
	СсылкаНаОтчет = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметрыОповещения, "СсылкаНаОтчет");
	
	Если ОрганизацияОтчета <> Организация Или СсылкаНаОтчет <> СсылкаНаДокумент Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ВключитьИспользованиеНапоминанийПользователя()
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.ИспользоватьНапоминанияПользователя.Установить(Истина);
	ИспользуютсяНапоминанияПользователя = НапоминанияПользователя.ИспользуютсяНапоминанияПользователя();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполняемыеРеквизитыЗаявления()
	
	Возврат Обработки.ПомощникЗаполненияЗаявленияНаПолучениеПатента.РеквизитыЗаполняемыеПоДаннымПредыдущегоЗаявления();
	
КонецФункции

&НаСервереБезКонтекста
Функция ФормаСВозможностьюВнесенияИзмененийВПатент(ИмяФормы)
	
	Возврат Обработки.ПомощникЗаполненияЗаявленияНаПолучениеПатента.ВозможноПодатьЗаявлениеНаВнесениеИзменений(ИмяФормы);
	
КонецФункции

&НаСервере
Функция НовыеПараметрыИзмененияФизическихПоказателей(ИмяТаблицы)
	
	ИмяТаблицыДоИзменения = СтрШаблон("%1ДоИзменения", ИмяТаблицы);
	
	НовыеПараметры = Новый Структура;
	НовыеПараметры.Вставить("ИмяТаблицы", ИмяТаблицы);
	НовыеПараметры.Вставить("Заголовок", "");
	НовыеПараметры.Вставить("КодВидаДеятельности", Объект.КодВидаДеятельности);
	НовыеПараметры.Вставить("АдресХранилища", СохранитьТаблицуОбъектаВоВременноеХранилище(ИмяТаблицы));
	НовыеПараметры.Вставить("АдресХранилищаДоИзменения", СохранитьТаблицуФормыВоВременноеХранилище(ИмяТаблицыДоИзменения));
	НовыеПараметры.Вставить("АдресДополнительныхНастроек", АдресВоВременномХранилище);
	
	Возврат НовыеПараметры;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии()
	
	// ИнтернетПоддержкаПользователей.Новости.Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии
	ИдентификаторыСобытийПриОткрытии = "ПриОткрытии";
	// Конец ИнтернетПоддержкаПользователей.Новости.Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии
	
	ОбработкаНовостейКлиент.КонтекстныеНовости_ПоказатьНовостиТребующиеПрочтенияПриОткрытии(
		ЭтотОбъект, ИдентификаторыСобытийПриОткрытии);
	
КонецПроцедуры

#КонецОбласти