#Область СлужебныйПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("РассылкаPushУведомлений", Истина);
	
КонецПроцедуры

Процедура ЗапланироватьРассылкуPushУведомлений() Экспорт
	
	Если Константы.ЗапланированаРассылкаPushУведомлений.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	//Следующий день с 10:00 до 11:00
	ГенераторЧисел = Новый ГенераторСлучайныхЧисел;
	
	СдвигПоВремени = ГенераторЧисел.СлучайноеЧисло(0, 3600);
	
	МоментЗапуска = КонецДня(ТекущаяДатаСеанса())+1+(10*3600) + СдвигПоВремени;
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		ДобавитьНовоеЗаданиеВОчередь(МоментЗапуска);
	Иначе
		ДобавитьНовоеРегламентноеЗадание(МоментЗапуска);
	КонецЕсли;
	
	Константы.ЗапланированаРассылкаPushУведомлений.Установить(Истина);
	
КонецПроцедуры

Процедура РассылкаPushУведомлений() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.РассылкаPushУведомлений);
	
	Уведомления = Новый Массив;
	
	ПодготовитьУведомленияПоЗадачамОрганизаций(Уведомления);
	
	ОтправитьУведомления(Уведомления);
	
	Константы.ЗапланированаРассылкаPushУведомлений.Установить(Ложь);
	
	ЗапланироватьРассылкуPushУведомлений();
	
КонецПроцедуры

Функция ЗапланированаРассылкаУведомлений() Экспорт
	
	Возврат Константы.ЗапланированаРассылкаPushУведомлений.Получить();
	
КонецФункции

Процедура ОтправитьУведомления(Уведомления) Экспорт
	
	Если Уведомления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиОтправки = РегистрыСведений.НастройкиОтправкиPushУведомлений.ТекущиеНастройки();
	
	Если НастройкиОтправки.ВариантОтправкиPushУведомлений = Перечисления.ВариантыОтправкиPushУведомлений.НеОтправлять Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеАутентификации = РегистрыСведений.НастройкиОтправкиPushУведомлений.ДанныеАутентификации(НастройкиОтправки);
	
	Попытка
		ОтправкаДоставляемыхУведомлений.Отправить(Уведомления, ДанныеАутентификации,, Истина);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru='Отправка push'"), УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПодготовитьУведомленияПоЗадачамОрганизаций(Уведомления)
	
	ВыполнениеЗадачБухгалтераБП.ПодготовитьУведомленияПоЗадачамОрганизаций(Уведомления);
	
КонецПроцедуры

Процедура ДобавитьНовоеЗаданиеВОчередь(МоментЗапуска)
	
	МетаданныеРегламентногоЗадания = Метаданные.РегламентныеЗадания.РассылкаPushУведомлений;
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ИмяМетода",     МетаданныеРегламентногоЗадания.ИмяМетода);
	ПараметрыЗадания.Вставить("ОбластьДанных", РаботаВМоделиСервиса.ЗначениеРазделителяСеанса());
	ПараметрыЗадания.Вставить("ЗапланированныйМоментЗапуска", МоментЗапуска);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОчередьЗаданий.ДобавитьЗадание(ПараметрыЗадания);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ДобавитьНовоеРегламентноеЗадание(МоментЗапуска)
	
	МетаданныеРегламентногоЗадания = Метаданные.РегламентныеЗадания.РассылкаPushУведомлений;
	
	Расписание = Новый РасписаниеРегламентногоЗадания;
	
	Расписание.ДатаНачала = МоментЗапуска;
	Расписание.ВремяНачала = МоментЗапуска;
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Использование", Истина);
	ПараметрыЗадания.Вставить("Метаданные",    МетаданныеРегламентногоЗадания);
	ПараметрыЗадания.Вставить("Расписание",    Расписание);
	
	ПараметрыПоискаЗадания = Новый Структура;
	ПараметрыПоискаЗадания.Вставить("Метаданные",    МетаданныеРегламентногоЗадания);
	ПараметрыПоискаЗадания.Вставить("Использование", Истина);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Задания = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыПоискаЗадания);
	
	Если Не ЗначениеЗаполнено(Задания) Тогда
		РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
	Иначе
		РегламентныеЗаданияСервер.ИзменитьЗадание(Задания[0], ПараметрыЗадания);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти
