#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием(ПараметрыВыполненияКоманды);
	ПараметрыОткрытия.ИмяФормы = "ОбщаяФорма.НастройкиСинхронизацииДанных";
	ПараметрыОткрытия.Заголовок = НСтр("ru ='Синхронизация'"); 
	ПараметрыФормы = Новый Структура;

	ОтборПоВариантамНастроек = Новый СписокЗначений;
	ОтборПоВариантамНастроек.Добавить("ОбменЗУПБП");
	ОтборПоВариантамНастроек.Добавить("Двухсторонний");
	ПараметрыФормы.Вставить("ОтборПоВариантамНастроек", ОтборПоВариантамНастроек);
		
	ПараметрыОткрытия.ЗамерПроизводительности = "ПростойИнтерфейсЗарплатаСинхронизация";

	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти