#Область ОбработчикСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Организация, НачалоПериода, КонецПериода, НачалоПериодаПоУмолчанию");
	КонецПериода = КонецПериода - 1;
	ИспользоватьПериодПоУмолчанию = НачалоПериода = НачалоПериодаПоУмолчанию;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПоУмолчаниюПриИзменении(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "НалогиИОтчеты" Тогда 
		ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием();
		ПараметрыОткрытия.ИмяФормы = "ОбщаяФорма.НалогиИОтчеты";
		ПараметрыОткрытия.Владелец = ЭтотОбъект;
		ПараметрыОткрытия.Заголовок = НСтр("ru = 'Настройки налогов и отчетов'");
		ПараметрыОткрытия.Уникальность = УникальныйИдентификатор;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Организация", ЭтотОбъект.Организация);
		ПараметрыФормы.Вставить("РежимНастройки", Истина);
		ПараметрыФормы.Вставить("КонтекстныйВызов", Истина);
		ПараметрыФормы.Вставить("ОсвобождениеОтУплатыНДС", Истина);
		ПараметрыФормы.Вставить("ДатаОсвобожденияОтУплатыНДС", КонецДня(КонецПериода)+1);
		
		ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикКомандФормы

&НаКлиенте
Процедура ПоУмолчаниюПриИзменении(Элемент)
	
	Если ИспользоватьПериодПоУмолчанию Тогда 
		НачалоПериода = НачалоПериодаПоУмолчанию;
		Элементы.НачалоПериода.Доступность = Ложь;
		ЭтотОбъект.ТекущийЭлемент = Элементы.ФормаСохранитьИзменение;
	Иначе 
		Элементы.НачалоПериода.Доступность = Истина;
		ЭтотОбъект.ТекущийЭлемент = Элементы.НачалоПериода;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	ЭтотОбъект.ТекущийЭлемент = Элементы.ФормаСохранитьИзменение;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменение(Команда)
	
	ИмяСобытия = "ПодготовкаКВычетуНДСИзменениеПериода";
	Оповестить(ИмяСобытия, НачалоПериода);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
