
//Заполняет единицу измерения номенклатуры при изменении
//Параметры: 
//			Форма Тип("ФормаКлиентскогоПриложения")
//          ТекущиеДанные Тип("СтрокаТабличнойЧасти") 
//
//Возвращаемое значение: нет
//
Процедура ЗаполнитьЕдиницуПоУмолчанию(Форма, ТекущиеДанные) Экспорт
	
	Если НЕ Форма.ИспользуютсяУпаковки Или Не ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеЕдиницы 					= "";
	ТекущиеДанные.Упаковка 					= УпаковкиВызовСервера.ЕдиницаПоУмолчанию(ТекущиеДанные.Номенклатура, НаименованиеЕдиницы);
	ТекущиеДанные.УпаковкаЕдиницаИзмерения 	= НаименованиеЕдиницы;
	ТекущиеДанные.ЦенаЗаУпаковку 			= ТекущиеДанные.Цена;
	
	ТоварыУпаковкаПриИзменении(Форма);
	
КонецПроцедуры

//Изменяет данные упаковки при изменении упаковки в табличной части
//Параметры: Форма Тип("ФормаКлиентскогоПриложения")
//
//Возвращаемое значение: нет
//
Процедура ТоварыУпаковкаПриИзменении(Форма, ИмяТабчасти = "Товары") Экспорт
	
	ТекущаяСтрока 						= Форма.Элементы[ИмяТабчасти].ТекущиеДанные;
	
    ТекущаяСтрока.КоэффициентУпаковки 	= УпаковкиВызовСервера.КоэффициентУпаковки(ТекущаяСтрока.Упаковка);
	
	ТекущаяСтрока.КоличествоУпаковок 	= Окр(ТекущаяСтрока.Количество / ТекущаяСтрока.КоэффициентУпаковки, 3);
	ТекущаяСтрока.ЦенаЗаУпаковку 		= Окр(ТекущаяСтрока.Цена * ТекущаяСтрока.КоэффициентУпаковки, 2);
	
	Если Форма.ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаОбщая" Или 
			Форма.ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаТовары" Тогда
		ТекущаяСтрока.КоличествоУпаковокПоДокументу = Окр(ТекущаяСтрока.КоличествоПоДокументу / ТекущаяСтрока.КоэффициентУпаковки, 3);
		ТекущаяСтрока.КоличествоУпаковокОтклонение 	= ТекущаяСтрока.КоличествоУпаковок - ТекущаяСтрока.КоличествоУпаковокПоДокументу;
		ТекущаяСтрока.ЦенаЗаУпаковкуПоДокументу 	= Окр(ТекущаяСтрока.ЦенаПоДокументу * ТекущаяСтрока.КоэффициентУпаковки, 2);
		ТекущаяСтрока.ЦенаЗаУпаковкуОтклонение 		= ТекущаяСтрока.ЦенаЗаУпаковку - ТекущаяСтрока.ЦенаЗаУпаковкуПоДокументу;
	КонецЕсли;
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры 

//Изменяет количество в строке табличной части при изменеии количества упаковок
//Параметры: 
//			ТекущаяСтрока Тип("трокаТабличнойЧасти")
//			Объект Тип("ОбъектФормы")
//
//Возвращаемое значение: нет
//
Процедура ТоварыКоличествоУпаковокПриИзменении(ТекущаяСтрока, Объект, Суффикс = "") Экспорт
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.Упаковка) Тогда
		Возврат;
	КонецЕсли;	
	ПолеКоличество = "Количество" + Суффикс;
	ПолеКоличествоУпаковок = "КоличествоУпаковок" + Суффикс;
	
	ТекущаяСтрока[ПолеКоличество] = Окр(ТекущаяСтрока[ПолеКоличествоУпаковок] * ТекущаяСтрока.КоэффициентУпаковки, 3);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Ссылка")
		И ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		Если НЕ Объект.ЕстьРасхождения Тогда
			ТекущаяСтрока.КоличествоУпаковокПоДокументу = ТекущаяСтрока.КоличествоУпаковок;
		КонецЕсли; 
		ТекущаяСтрока.КоличествоУпаковокОтклонение = ТекущаяСтрока.КоличествоУпаковок - ТекущаяСтрока.КоличествоУпаковокПоДокументу;
	КонецЕсли;
		
КонецПроцедуры

//Изменяет цену в табличной части при изменении цены за упаковку
//Параметры:
//			ТекущаяСтрока Тип("СтрокаТабличнойЧасти")
//			Объект Тип(ОбъектФормы")
//			Суффикс Тип("Строка") -необяз.
//
//Возвращаемое значение: нет
//
Процедура ТоварыЦенаЗаУпаковкуПриИзменении(ТекущаяСтрока, Объект, Суффикс = "") Экспорт
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.Упаковка) Тогда
		Возврат;
	КонецЕсли;	
	
	ИмяПоляЦена = "Цена" + Суффикс;
	ИмяПоляЦенаЗаУпаковку = "ЦенаЗаУпаковку" + Суффикс;
	
	ТекущаяСтрока[ИмяПоляЦена] = Окр(ТекущаяСтрока[ИмяПоляЦенаЗаУпаковку] / ТекущаяСтрока.КоэффициентУпаковки, 2);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Ссылка") 
		И ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		Если НЕ Объект.ЕстьРасхождения Тогда
			ТекущаяСтрока.ЦенаЗаУпаковкуПоДокументу = ТекущаяСтрока.ЦенаЗаУпаковку;
		КонецЕсли; 
		ТекущаяСтрока.ЦенаЗаУпаковкуОтклонение = ТекущаяСтрока.ЦенаЗаУпаковку - ТекущаяСтрока.ЦенаЗаУпаковкуПоДокументу;
	КонецЕсли;
		
КонецПроцедуры

//Изменяет параметры упаковки при изменении упаковки в табличной части
//Параметры: 
//			ВыбранныйЭлемент Тип("ЭлементСписокаЗначений")
//			ДополнительныеПараметры Тип("Структура")
//
//Возвращаемое значение: нет
//
Процедура ПослеВыбораУпаковкиЕдиницыИзмерения(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма 								= ДополнительныеПараметры.Форма;
	ТекСтрока 							= Форма.Элементы.Товары.ТекущиеДанные;
	ТекСтрока.УпаковкаЕдиницаИзмерения 	= ВыбранныйЭлемент.Представление;
	ТекСтрока.Упаковка 					= ВыбранныйЭлемент.Значение;
	
	ТоварыУпаковкаПриИзменении(Форма);
	
КонецПроцедуры 

//Изменяет цену за упаковку при изменении Суммы в табличной части
//Параметры: 
//			ТекущаяСтрока ТИп("СтрокаТабличнойЧасти")
//			Объект Тип("ОбъектФормы")
//			Постфикс ТИп("Строка") -необяз.
//
//Возвращаемое значение: нет
//
Процедура ТоварыСуммаПриИзменении(ТекущаяСтрока, Объект, Постфикс = "") Экспорт
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.Упаковка) Тогда
		Возврат;
	КонецЕсли;	

	ИмяРеквизитаЦенаЗаУпаковку 	= "ЦенаЗаУпаковку" + Постфикс;
	ИмяРеквизитаЦена 			= "Цена" + Постфикс;
	
	ТекущаяСтрока[ИмяРеквизитаЦенаЗаУпаковку] = Окр(ТекущаяСтрока[ИмяРеквизитаЦена] * ТекущаяСтрока.КоэффициентУпаковки, 2);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Ссылка")
		И ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") И Объект.ЕстьРасхождения Тогда
		ТекущаяСтрока.ЦенаЗаУпаковкуПоДокументу = Окр(ТекущаяСтрока.ЦенаПоДокументу * ТекущаяСтрока.КоэффициентУпаковки, 2);
		ТекущаяСтрока.ЦенаЗаУпаковкуОтклонение = ТекущаяСтрока.ЦенаЗаУпаковку - ТекущаяСтрока.ЦенаЗаУпаковкуПоДокументу;	
	КонецЕсли;
	
КонецПроцедуры

//Возвращает признак что на форме используются упковки
//Параметры: Форма Тип("ФормаКлиентскогоПриложения")
//
//Возвращаемое значение: Результат Тип("Булево")
//
Функция ФормаИспользуетУпаковки(Форма) Экспорт
	
	Результат = Ложь;
	
	ИмяФормыВладельца = Форма.ВладелецФормы.ИмяФормы;
	
	ИменаФорм = 
	"Документ.РеализацияТоваровУслуг.Форма.ФормаДокументаОбщая,
	|Документ.РеализацияТоваровУслуг.Форма.ФормаДокументаТовары,
	|Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаОбщая,
	|Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаТовары,
	|Документ.ВозвратТоваровПоставщику.Форма.ФормаДокументаОбщая,
	|Документ.ВозвратТоваровОтПокупателя.Форма.ФормаДокументаОбщая";
	
	
	Если СтрНайти(ИменаФорм, ИмяФормыВладельца) > 0 И Форма.ВладелецФормы.ИспользуютсяУпаковки Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
