#Область ПрограммныйИнтерфейс

#Область ОтчетыОРасхождениях

//Формирует текст запроса по составу продукции ГосИС оформленных прикладных документов.
//
// Параметры:
//   ТекстЗапроса  - Строка - заполняемый текст запроса.
//   ОтчетОбъект - ОтчетОбъект - отчет ГосИС, использующий переопределение
//
Процедура ПриПереопределенииТекстаЗапроса(ТекстЗапроса, ОтчетОбъект) Экспорт
	
	ИнтеграцияИСМПБП.ПриОпределенииТекстаЗапросаОформленныхДокументов(ТекстЗапроса, ОтчетОбъект);
	
КонецПроцедуры

// Заполняет параметры в настройках СКД отчетов о расхождениях ГосИС
// 
// Параметры:
//  ОтчетОбъект - ОтчетОбъект - отчет ГосИС, использующий переопределение
Процедура ПриУстановкеПараметровЗапроса(ОтчетОбъект) Экспорт
	
	ПриУстановкеПараметровОтчета(ОтчетОбъект);
	//Возврат;
	
КонецПроцедуры

Процедура ПриУстановкеПараметровОтчета(ОтчетОбъект) Экспорт
	
	Отчет = ОтчетОбъект.Метаданные();
	
	Если Отчет = Метаданные.Отчеты.АнализРасхожденийПриДвиженииСАТУРН Тогда
		УстановитьПараметрыОтчетаСАТУРН(ОтчетОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьПараметрыОтчетаСАТУРН(ОтчетОбъект)
	
	ТипыДокументаОснованияВходящейНакладной = Новый Массив;
	ТипыДокументаОснованияВходящейНакладной.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
	//ТипыДокументаОснованияВходящейНакладной.Добавить(Тип("Неопределено"));
	
	ТипыДокументаОснованияИсходящейНакладной = Новый Массив;
	ТипыДокументаОснованияИсходящейНакладной.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	//ТипыДокументаОснованияИсходящейНакладной.Добавить(Тип("Неопределено"));
	
	Настройки = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТипыДокументаОснованияВходящейНакладной",  ТипыДокументаОснованияВходящейНакладной);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТипыДокументаОснованияИсходящейНакладной", ТипыДокументаОснованияИсходящейНакладной);
	
	ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
