#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ВедетсяУчетНМА = ПолучитьФункциональнуюОпцию("ВедетсяУчетНМА"); 
	УстановитьЗаголовок();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьЗаголовок();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗаголовок()
	
	Если ВедетсяУчетНМА Тогда
		Возврат;
	КонецЕсли;
	
	АвтоЗаголовок = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда
		Заголовок = НСтр("ru = 'Объекты права (создание группы)'");
	Иначе
		Заголовок = СтрШаблон(НСтр("ru = '%1 (Объекты права)'"), Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти