#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РазделениеВключено = ОбщегоНазначения.РазделениеВключено();
	ИмяПрограммы = ОбщегоНазначенияБП.ПредставлениеПрограммыВинительныйПадеж();
	
	Элементы.ДекорацияОписание2.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		Элементы.ДекорацияОписание2.Заголовок,
		ИмяПрограммы);
		
	КодДоступа = РегистрыСведений.МобильноеПриложениеСканированиеЧеков.КодДоступа();
	
	Если КодДоступа = Неопределено Тогда
		Элементы.ГруппаИнструкцияПодключение.Видимость = Ложь;
		Возврат
	КонецЕсли;
	Элементы.ГруппаОшибкаПодключения.Видимость = Ложь;
	
	Элементы.ПодключениеСотрудниковОписание.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		Элементы.ПодключениеСотрудниковОписание.Заголовок,
		ИмяПрограммы);
		
	ПараметрыТекста = Новый Структура;
	ПараметрыТекста.Вставить("КодДоступа", "");
	ПараметрыТекста.Вставить("Логин",      "");
	
	ИспользоватьЛогин = РегистрыСведений.МобильноеПриложениеСканированиеЧеков.ДоступноПодключениеПоЛогинуИПаролю();
	ШаблонТекста = "";
	ПараметрыТекста.КодДоступа = КодДоступа.Представление;
	
	Если ИспользоватьЛогин Тогда
		ПараметрыТекста.Логин = ?(Пользователи.ТекущийПользователь() = Пользователи.СсылкаНеуказанногоПользователя(),
			НСтр("ru = 'адрес электронной почты'"),
			СтрШаблон(НСтр("ru = 'логин <b>%1</b> и пароль'"), ИмяПользователя()));
		ШаблонТекста = НСтр(
			"ru = 'Для входа в мобильное приложение используйте
			|- код доступа <a href=''КодДоступа''>[КодДоступа]</a>
			|или
			|- свой [Логин]'");
	Иначе
		ШаблонТекста = НСтр(
			"ru = 'Для входа в мобильное приложение используйте
			|код доступа <a href=''КодДоступа''>[КодДоступа]</a>'");
	КонецЕсли;
		
	СтрокаСТегами = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонТекста, ПараметрыТекста);
	Элементы.ДекорацияШаг2Заголовок.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(СтрокаСТегами);
	
	// Сразу при открытии формы направим запрос на подготовку баланса.
	РегистрыСведений.МобильноеПриложениеСканированиеЧеков.ЗапроситьБаланс();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Сразу запустим обновление содержимого блока "Условия использования".
	НачатьОбновлениеУсловийИспользования();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияAndroidНажатие(Элемент)
	
	АдресСтраницы = "https://play.google.com/store/apps/details?id=com.e1c.ReceiptScanner";
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияiOSНажатие(Элемент)
	
	АдресСтраницы = "https://apps.apple.com/ru/app/id1513613578";
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияШаг2ЗаголовокОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "КодДоступа" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОткрытьФорму("РегистрСведений.МобильноеПриложениеСканированиеЧеков.Форма.КодДоступа", , ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключениеСотрудниковНастройкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "Пользователи" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СкрыватьКомандуПереходаВПомощник", Истина);
		
		ОткрытьФорму("РегистрСведений.МобильноеПриложениеСканированиеЧеков.Форма.Пользователи", ПараметрыФормы, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияУсловияИспользованияГиперссылкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если РазделениеВключено Тогда
		СтандартнаяОбработка = Ложь;
		Элементы.ГруппаОбслуживающаяОрганизация.Видимость = Не Элементы.ГруппаОбслуживающаяОрганизация.Видимость;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Запускает фоновый процесс заполнения блока "Условия использования" формы Помощника подключения мобильного приложения.
// После получения данных о тарификации и обслуживающей организации форма обновится.
//
&НаКлиенте
Процедура НачатьОбновлениеУсловийИспользования()
	
	Элементы.ГруппаУсловияИспользованияОжиданиеБаланса.Видимость = Истина;
	Элементы.ГруппаУсловияИспользованияСостояниеБаланса.Видимость = Ложь;
	
	// Подключим обработчик ожидания, запускающий получение сообщений с Шины. Ожидается, что времени
	// таймаута будет достаточно для подготовки сведений на стороне Шины.
	ИнтервалОпроса = 3;
	ПодключитьОбработчикОжидания("Подключаемый_НачатьПроверкуСообщений", ИнтервалОпроса, Истина);
	
	// Подключим обработчик ожидания, который выведет полученные сведения о балансе на форму.
	ИнтервалОпроса = 5;
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьУсловияИспользования", ИнтервалОпроса, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НачатьПроверкуСообщений()
	
	НачатьПроверкуСообщений();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура НачатьПроверкуСообщений()
	
	ВыполнитьАсинхронно = Истина;
	ПроверятьТаймаут = Ложь;
	РегистрыСведений.МобильноеПриложениеСканированиеЧеков.НачатьПроверкуСообщений(
		ВыполнитьАсинхронно,
		ПроверятьТаймаут);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьУсловияИспользования()
	
	Результат = НачатьОбновлениеУсловийИспользованияСервер(ЭтотОбъект.УникальныйИдентификатор);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьОбновлениеУсловийИспользования",
		УчетКассовыхЧековПодотчетныхЛицКлиент,
		Новый Структура("Форма", ЭтотОбъект));
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(Результат, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НачатьОбновлениеУсловийИспользованияСервер(Знач ИдентификаторФормы)
	
	Возврат УчетКассовыхЧековПодотчетныхЛиц.НачатьОбновлениеУсловийИспользования(ИдентификаторФормы);
	
КонецФункции

#КонецОбласти