
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ВидТовара) Тогда
		
		Список.Параметры.УстановитьЗначениеПараметра("ОтбиратьПоВидуТовара", Истина);
		Список.Параметры.УстановитьЗначениеПараметра("ВидТовара", Параметры.ВидТовара);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ОтбиратьПоВидуТовара", Ложь);
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.ОтбиратьПоДате) Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ОтбиратьПоДате", Истина);
		Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ОтбиратьПоДате", Ложь);
	КонецЕсли;
	
КонецПроцедуры
